; ModuleID = '../bcout/drivers/soc/qcom/qmi_encdec.llvm.bc'
source_filename = "drivers/soc/qcom/qmi_encdec.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.qmi_elem_info = type { i32, i32, i32, i32, i8, i32, %struct.qmi_elem_info* }
%struct.kmem_cache = type opaque
%struct.qmi_header = type <{ i8, i16, i16, i16 }>

@.str = private unnamed_addr constant [44 x i8] c"\013%s: Calc. len %d != 0, but NULL c_struct\0A\00", align 1
@__func__.qmi_encode_message = private unnamed_addr constant [19 x i8] c"qmi_encode_message\00", align 1
@qmi_response_type_v01_ei = dso_local global [3 x %struct.qmi_elem_info] [%struct.qmi_elem_info { i32 7, i32 1, i32 2, i32 0, i8 0, i32 0, %struct.qmi_elem_info* null }, %struct.qmi_elem_info { i32 7, i32 1, i32 2, i32 0, i8 0, i32 2, %struct.qmi_elem_info* null }, %struct.qmi_elem_info zeroinitializer], align 16, !dbg !0
@__UNIQUE_ID_description166 = internal constant [51 x i8] c"qmi_helpers.description=QMI encoder/decoder helper\00", section ".modinfo", align 1, !dbg !45
@__UNIQUE_ID_file167 = internal constant [46 x i8] c"qmi_helpers.file=drivers/soc/qcom/qmi_helpers\00", section ".modinfo", align 1, !dbg !51
@__UNIQUE_ID_license168 = internal constant [27 x i8] c"qmi_helpers.license=GPL v2\00", section ".modinfo", align 1, !dbg !56
@kmalloc_caches = external dso_local global [3 x [14 x %struct.kmem_cache*]], align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "qmi_response_type_v01_ei", scope: !2, file: !3, line: 784, type: !61, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !32, globals: !44, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/soc/qcom/qmi_encdec.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !20, !25}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "qmi_elem_type", file: !6, line: 38, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/soc/qcom/qmi.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "QMI_EOTI", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "QMI_OPT_FLAG", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "QMI_DATA_LEN", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "QMI_UNSIGNED_1_BYTE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "QMI_UNSIGNED_2_BYTE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "QMI_UNSIGNED_4_BYTE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "QMI_UNSIGNED_8_BYTE", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "QMI_SIGNED_2_BYTE_ENUM", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "QMI_SIGNED_4_BYTE_ENUM", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "QMI_STRUCT", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "QMI_STRING", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "qmi_array_type", file: !6, line: 52, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIEnumerator(name: "NO_ARRAY", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "STATIC_ARRAY", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "VAR_LEN_ARRAY", value: 2, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !26, line: 305, baseType: !7, size: 32, elements: !27)
!26 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!32 = !{!33, !35, !40, !41, !42}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !34, line: 148, baseType: !7)
!34 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !36, line: 17, baseType: !37)
!36 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !38, line: 21, baseType: !39)
!38 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = !{!0, !45, !51, !56}
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description166", scope: !2, file: !3, line: 815, type: !47, isLocal: true, isDefinition: true, align: 8)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 408, elements: !49)
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!49 = !{!50}
!50 = !DISubrange(count: 51)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file167", scope: !2, file: !3, line: 816, type: !53, isLocal: true, isDefinition: true, align: 8)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 368, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 46)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license168", scope: !2, file: !3, line: 816, type: !58, isLocal: true, isDefinition: true, align: 8)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 216, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 27)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 768, elements: !74)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qmi_elem_info", file: !6, line: 71, size: 256, elements: !63)
!63 = !{!64, !65, !68, !69, !70, !71, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !62, file: !6, line: 72, baseType: !5, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "elem_len", scope: !62, file: !6, line: 73, baseType: !66, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !36, line: 21, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !38, line: 27, baseType: !7)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !62, file: !6, line: 74, baseType: !66, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "array_type", scope: !62, file: !6, line: 75, baseType: !20, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tlv_type", scope: !62, file: !6, line: 76, baseType: !35, size: 8, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !62, file: !6, line: 77, baseType: !66, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ei_array", scope: !62, file: !6, line: 78, baseType: !73, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!74 = !{!75}
!75 = !DISubrange(count: 3)
!76 = !{i32 7, !"Dwarf Version", i32 4}
!77 = !{i32 2, !"Debug Info Version", i32 3}
!78 = !{i32 1, !"wchar_size", i32 2}
!79 = !{i32 1, !"Code Model", i32 2}
!80 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!81 = distinct !DISubprogram(name: "qmi_encode_message", scope: !3, file: !3, line: 715, type: !82, scopeLine: 718, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !93)
!82 = !DISubroutineType(types: !83)
!83 = !{!40, !84, !7, !85, !7, !73, !91}
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 55, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !88, line: 72, baseType: !89)
!88 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !88, line: 16, baseType: !90)
!90 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!93 = !{}
!94 = !DILocalVariable(name: "type", arg: 1, scope: !81, file: !3, line: 715, type: !84)
!95 = !DILocation(line: 715, column: 30, scope: !81)
!96 = !DILocalVariable(name: "msg_id", arg: 2, scope: !81, file: !3, line: 715, type: !7)
!97 = !DILocation(line: 715, column: 49, scope: !81)
!98 = !DILocalVariable(name: "len", arg: 3, scope: !81, file: !3, line: 715, type: !85)
!99 = !DILocation(line: 715, column: 65, scope: !81)
!100 = !DILocalVariable(name: "txn_id", arg: 4, scope: !81, file: !3, line: 716, type: !7)
!101 = !DILocation(line: 716, column: 18, scope: !81)
!102 = !DILocalVariable(name: "ei", arg: 5, scope: !81, file: !3, line: 716, type: !73)
!103 = !DILocation(line: 716, column: 48, scope: !81)
!104 = !DILocalVariable(name: "c_struct", arg: 6, scope: !81, file: !3, line: 717, type: !91)
!105 = !DILocation(line: 717, column: 17, scope: !81)
!106 = !DILocalVariable(name: "hdr", scope: !81, file: !3, line: 719, type: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qmi_header", file: !6, line: 25, size: 56, elements: !109)
!109 = !{!110, !111, !115, !116}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !6, line: 26, baseType: !35, size: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "txn_id", scope: !108, file: !6, line: 27, baseType: !112, size: 16, offset: 8)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !36, line: 19, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !38, line: 24, baseType: !114)
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "msg_id", scope: !108, file: !6, line: 28, baseType: !112, size: 16, offset: 24)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !108, file: !6, line: 29, baseType: !112, size: 16, offset: 40)
!117 = !DILocation(line: 719, column: 21, scope: !81)
!118 = !DILocalVariable(name: "msglen", scope: !81, file: !3, line: 720, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !34, line: 60, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !88, line: 73, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !88, line: 15, baseType: !122)
!122 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!123 = !DILocation(line: 720, column: 10, scope: !81)
!124 = !DILocalVariable(name: "msg", scope: !81, file: !3, line: 721, type: !40)
!125 = !DILocation(line: 721, column: 8, scope: !81)
!126 = !DILocalVariable(name: "ret", scope: !81, file: !3, line: 722, type: !84)
!127 = !DILocation(line: 722, column: 6, scope: !81)
!128 = !DILocation(line: 725, column: 7, scope: !129)
!129 = distinct !DILexicalBlock(scope: !81, file: !3, line: 725, column: 6)
!130 = !DILocation(line: 725, column: 6, scope: !81)
!131 = !DILocation(line: 726, column: 30, scope: !132)
!132 = distinct !DILexicalBlock(scope: !129, file: !3, line: 725, column: 17)
!133 = !DILocation(line: 726, column: 9, scope: !132)
!134 = !DILocation(line: 726, column: 7, scope: !132)
!135 = !DILocation(line: 727, column: 7, scope: !136)
!136 = distinct !DILexicalBlock(scope: !132, file: !3, line: 727, column: 7)
!137 = !DILocation(line: 727, column: 7, scope: !132)
!138 = !DILocation(line: 728, column: 4, scope: !139)
!139 = distinct !DILexicalBlock(scope: !136, file: !3, line: 727, column: 12)
!140 = !DILocation(line: 730, column: 11, scope: !139)
!141 = !DILocation(line: 730, column: 4, scope: !139)
!142 = !DILocation(line: 732, column: 2, scope: !132)
!143 = !DILocation(line: 734, column: 32, scope: !81)
!144 = !DILocation(line: 734, column: 31, scope: !81)
!145 = !DILocation(line: 734, column: 29, scope: !81)
!146 = !DILocation(line: 734, column: 8, scope: !81)
!147 = !DILocation(line: 734, column: 6, scope: !81)
!148 = !DILocation(line: 735, column: 7, scope: !149)
!149 = distinct !DILexicalBlock(scope: !81, file: !3, line: 735, column: 6)
!150 = !DILocation(line: 735, column: 6, scope: !81)
!151 = !DILocation(line: 736, column: 10, scope: !149)
!152 = !DILocation(line: 736, column: 3, scope: !149)
!153 = !DILocation(line: 739, column: 6, scope: !154)
!154 = distinct !DILexicalBlock(scope: !81, file: !3, line: 739, column: 6)
!155 = !DILocation(line: 739, column: 6, scope: !81)
!156 = !DILocation(line: 740, column: 23, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !3, line: 739, column: 16)
!158 = !DILocation(line: 740, column: 27, scope: !157)
!159 = !DILocation(line: 740, column: 31, scope: !157)
!160 = !DILocation(line: 740, column: 47, scope: !157)
!161 = !DILocation(line: 740, column: 58, scope: !157)
!162 = !DILocation(line: 740, column: 57, scope: !157)
!163 = !DILocation(line: 740, column: 12, scope: !157)
!164 = !DILocation(line: 740, column: 10, scope: !157)
!165 = !DILocation(line: 741, column: 7, scope: !166)
!166 = distinct !DILexicalBlock(scope: !157, file: !3, line: 741, column: 7)
!167 = !DILocation(line: 741, column: 14, scope: !166)
!168 = !DILocation(line: 741, column: 7, scope: !157)
!169 = !DILocation(line: 742, column: 10, scope: !170)
!170 = distinct !DILexicalBlock(scope: !166, file: !3, line: 741, column: 19)
!171 = !DILocation(line: 742, column: 4, scope: !170)
!172 = !DILocation(line: 743, column: 19, scope: !170)
!173 = !DILocation(line: 743, column: 11, scope: !170)
!174 = !DILocation(line: 743, column: 4, scope: !170)
!175 = !DILocation(line: 745, column: 2, scope: !157)
!176 = !DILocation(line: 747, column: 8, scope: !81)
!177 = !DILocation(line: 747, column: 6, scope: !81)
!178 = !DILocation(line: 748, column: 14, scope: !81)
!179 = !DILocation(line: 748, column: 2, scope: !81)
