; ModuleID = '../bcout/drivers/power/supply/power_supply_sysfs.llvm.bc'
source_filename = "drivers/power/supply/power_supply_sysfs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.attribute_group = type { i8*, i16 (%struct.kobject*, %struct.attribute*, i32)*, i16 (%struct.kobject*, %struct.bin_attribute*, i32)*, %struct.attribute**, %struct.bin_attribute** }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.kset_uevent_ops = type { i32 (%struct.kset*, %struct.kobject*)*, i8* (%struct.kset*, %struct.kobject*)*, i32 (%struct.kset*, %struct.kobject*, %struct.kobj_uevent_env*)* }
%struct.kobj_uevent_env = type { [3 x i8*], [64 x i8*], i32, [2048 x i8], i32 }
%struct.kobj_type = type { void (%struct.kobject*)*, %struct.sysfs_ops*, %struct.attribute**, %struct.attribute_group**, %struct.kobj_ns_type_operations* (%struct.kobject*)*, i8* (%struct.kobject*)*, void (%struct.kobject*, %struct.kuid_t*, %struct.kgid_t*)* }

!113 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CHARGE_CONTROL_LIMIT", value: 33, isUnsigned: true)
!114 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CHARGE_CONTROL_LIMIT_MAX", value: 34, isUnsigned: true)
!115 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CHARGE_CONTROL_START_THRESHOLD", value: 35, isUnsigned: true)
!116 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CHARGE_CONTROL_END_THRESHOLD", value: 36, isUnsigned: true)
!117 = !DIEnumerator(name: "POWER_SUPPLY_PROP_INPUT_CURRENT_LIMIT", value: 37, isUnsigned: true)
!118 = !DIEnumerator(name: "POWER_SUPPLY_PROP_INPUT_VOLTAGE_LIMIT", value: 38, isUnsigned: true)
!119 = !DIEnumerator(name: "POWER_SUPPLY_PROP_INPUT_POWER_LIMIT", value: 39, isUnsigned: true)
!120 = !DIEnumerator(name: "POWER_SUPPLY_PROP_ENERGY_FULL_DESIGN", value: 40, isUnsigned: true)
!121 = !DIEnumerator(name: "POWER_SUPPLY_PROP_ENERGY_EMPTY_DESIGN", value: 41, isUnsigned: true)
!122 = !DIEnumerator(name: "POWER_SUPPLY_PROP_ENERGY_FULL", value: 42, isUnsigned: true)
!123 = !DIEnumerator(name: "POWER_SUPPLY_PROP_ENERGY_EMPTY", value: 43, isUnsigned: true)
!124 = !DIEnumerator(name: "POWER_SUPPLY_PROP_ENERGY_NOW", value: 44, isUnsigned: true)
!125 = !DIEnumerator(name: "POWER_SUPPLY_PROP_ENERGY_AVG", value: 45, isUnsigned: true)
!126 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CAPACITY", value: 46, isUnsigned: true)
!127 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CAPACITY_ALERT_MIN", value: 47, isUnsigned: true)
!128 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CAPACITY_ALERT_MAX", value: 48, isUnsigned: true)
!129 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CAPACITY_ERROR_MARGIN", value: 49, isUnsigned: true)
!130 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CAPACITY_LEVEL", value: 50, isUnsigned: true)
!131 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP", value: 51, isUnsigned: true)
!132 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_MAX", value: 52, isUnsigned: true)
!133 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_MIN", value: 53, isUnsigned: true)
!134 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_ALERT_MIN", value: 54, isUnsigned: true)
!135 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_ALERT_MAX", value: 55, isUnsigned: true)
!136 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_AMBIENT", value: 56, isUnsigned: true)
!137 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_AMBIENT_ALERT_MIN", value: 57, isUnsigned: true)
!138 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_AMBIENT_ALERT_MAX", value: 58, isUnsigned: true)
!139 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_EMPTY_NOW", value: 59, isUnsigned: true)
!140 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_EMPTY_AVG", value: 60, isUnsigned: true)
!141 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_FULL_NOW", value: 61, isUnsigned: true)
!142 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_FULL_AVG", value: 62, isUnsigned: true)
!143 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TYPE", value: 63, isUnsigned: true)
!144 = !DIEnumerator(name: "POWER_SUPPLY_PROP_USB_TYPE", value: 64, isUnsigned: true)
!145 = !DIEnumerator(name: "POWER_SUPPLY_PROP_SCOPE", value: 65, isUnsigned: true)
!146 = !DIEnumerator(name: "POWER_SUPPLY_PROP_PRECHARGE_CURRENT", value: 66, isUnsigned: true)
!147 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CHARGE_TERM_CURRENT", value: 67, isUnsigned: true)
!148 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CALIBRATE", value: 68, isUnsigned: true)
!149 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURE_YEAR", value: 69, isUnsigned: true)
!150 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURE_MONTH", value: 70, isUnsigned: true)
!151 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURE_DAY", value: 71, isUnsigned: true)
!152 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MODEL_NAME", value: 72, isUnsigned: true)
!153 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURER", value: 73, isUnsigned: true)
!154 = !DIEnumerator(name: "POWER_SUPPLY_PROP_SERIAL_NUMBER", value: 74, isUnsigned: true)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !156, line: 10, baseType: !7, size: 32, elements: !157)
!156 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!157 = !{!158, !159}
!158 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!159 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!160 = !{!161, !162, !164, !166, !167, !168, !627, !1993, !2018}
!161 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !165, line: 148, baseType: !7)
!165 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!166 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !170)
!170 = !{!171, !1645, !1646, !1649, !1650, !1701, !1779, !1780, !1781, !1782, !1783, !1792, !1897, !1910, !1913, !1914, !1918, !1920, !1921, !1922, !1926, !1932, !1933, !1936, !1940, !1943, !1946, !1947, !1948, !1949, !1981, !1982, !1983, !1986, !1989, !1990, !1991, !1992}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !169, file: !30, line: 462, baseType: !172, size: 512)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !173, line: 64, size: 512, elements: !174)
!173 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!174 = !{!175, !178, !184, !186, !245, !1482, !1635, !1640, !1641, !1642, !1643, !1644}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 65, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !172, file: !173, line: 66, baseType: !179, size: 128, offset: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !165, line: 178, size: 128, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !179, file: !165, line: 179, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !165, line: 179, baseType: !182, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !172, file: !173, line: 67, baseType: !185, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !172, file: !173, line: 68, baseType: !187, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !173, line: 192, size: 704, elements: !189)
!189 = !{!190, !191, !207, !208}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !188, file: !173, line: 193, baseType: !179, size: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !188, file: !173, line: 194, baseType: !192, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !193, line: 83, baseType: !194)
!193 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !193, line: 71, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !193, line: 72, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !194, file: !193, line: 72, elements: !198)
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !197, file: !193, line: 73, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !193, line: 20, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !200, file: !193, line: 21, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !204, line: 25, baseType: !205)
!204 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 25, elements: !206)
!206 = !{}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !188, file: !173, line: 195, baseType: !172, size: 512, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !188, file: !173, line: 196, baseType: !209, size: 64, offset: 640)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !173, line: 156, size: 192, elements: !212)
!212 = !{!213, !218, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !211, file: !173, line: 157, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!161, !187, !185}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !173, line: 158, baseType: !219, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DISubroutineType(types: !222)
!222 = !{!176, !187, !185}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !211, file: !173, line: 159, baseType: !224, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!161, !187, !185, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !173, line: 148, size: 20736, elements: !230)
!230 = !{!231, !235, !239, !240, !244}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !229, file: !173, line: 149, baseType: !232, size: 192)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 192, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 3)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !229, file: !173, line: 150, baseType: !236, size: 4096, offset: 192)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 4096, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !229, file: !173, line: 151, baseType: !161, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !229, file: !173, line: 152, baseType: !241, size: 16384, offset: 4320)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 16384, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2048)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !229, file: !173, line: 153, baseType: !161, size: 32, offset: 20704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !172, file: !173, line: 69, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !173, line: 138, size: 448, elements: !248)
!248 = !{!249, !253, !282, !284, !1428, !1461, !1465}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !247, file: !173, line: 139, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !185}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !247, file: !173, line: 140, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !257, line: 230, size: 128, elements: !258)
!257 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!258 = !{!259, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !256, file: !257, line: 231, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !185, !268, !162}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !165, line: 60, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !265, line: 73, baseType: !266)
!265 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !265, line: 15, baseType: !267)
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !257, line: 30, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !257, line: 31, baseType: !176, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !269, file: !257, line: 32, baseType: !273, size: 16, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !165, line: 19, baseType: !274)
!274 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !256, file: !257, line: 232, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!263, !185, !268, !176, !279}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !165, line: 55, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !265, line: 72, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !265, line: 16, baseType: !166)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !247, file: !173, line: 141, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !247, file: !173, line: 142, baseType: !285, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !257, line: 84, size: 320, elements: !289)
!289 = !{!290, !291, !295, !1425, !1426}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !257, line: 85, baseType: !176, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !288, file: !257, line: 86, baseType: !292, size: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!273, !185, !268, !161}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !288, file: !257, line: 88, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!273, !185, !299, !161}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !257, line: 168, size: 448, elements: !301)
!301 = !{!302, !303, !304, !305, !315, !316}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !300, file: !257, line: 169, baseType: !269, size: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !300, file: !257, line: 170, baseType: !279, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !300, file: !257, line: 171, baseType: !167, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !300, file: !257, line: 172, baseType: !306, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!263, !309, !185, !299, !162, !312, !279}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !311, line: 526, flags: DIFlagFwdDecl)
!311 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !165, line: 46, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !265, line: 88, baseType: !314)
!314 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !300, file: !257, line: 174, baseType: !306, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !300, file: !257, line: 176, baseType: !317, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{!161, !309, !185, !299, !320}
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !322, line: 305, size: 1472, elements: !323)
!322 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!323 = !{!324, !325, !326, !327, !328, !336, !337, !1399, !1405, !1406, !1411, !1412, !1415, !1419, !1420, !1421, !1422, !1423}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !321, file: !322, line: 308, baseType: !166, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !321, file: !322, line: 309, baseType: !166, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !321, file: !322, line: 313, baseType: !320, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !321, file: !322, line: 313, baseType: !320, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !321, file: !322, line: 315, baseType: !329, size: 192, align: 64, offset: 256)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !330, line: 24, size: 192, align: 64, elements: !331)
!330 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!331 = !{!332, !333, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !329, file: !330, line: 25, baseType: !166, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !329, file: !330, line: 26, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !329, file: !330, line: 27, baseType: !334, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !321, file: !322, line: 323, baseType: !166, size: 64, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !321, file: !322, line: 327, baseType: !338, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !322, line: 388, size: 7296, elements: !340)
!340 = !{!341, !1395}
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !322, line: 389, baseType: !342, size: 7296)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !339, file: !322, line: 389, size: 7296, elements: !343)
!343 = !{!344, !345, !349, !355, !359, !360, !361, !362, !363, !371, !376, !377, !378, !379, !388, !389, !390, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !425, !433, !436, !468, !469, !1365, !1366, !1369, !1373, !1374, !1377, !1378, !1379, !1382, !1394}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !342, file: !322, line: 390, baseType: !320, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !342, file: !322, line: 391, baseType: !346, size: 64, offset: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !330, line: 31, size: 64, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !346, file: !330, line: 32, baseType: !334, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !342, file: !322, line: 392, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !351, line: 23, baseType: !352)
!351 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !353, line: 31, baseType: !354)
!353 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!354 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !342, file: !322, line: 394, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!166, !309, !166, !166, !166, !166}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !342, file: !322, line: 398, baseType: !166, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !342, file: !322, line: 399, baseType: !166, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !342, file: !322, line: 405, baseType: !166, size: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !342, file: !322, line: 406, baseType: !166, size: 64, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !342, file: !322, line: 407, baseType: !364, size: 64, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !311, line: 286, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !311, line: 286, size: 64, elements: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !366, file: !311, line: 286, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !370, line: 18, baseType: !166)
!370 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !342, file: !322, line: 416, baseType: !372, size: 32, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !165, line: 168, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 166, size: 32, elements: !374)
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !373, file: !165, line: 167, baseType: !161, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !342, file: !322, line: 428, baseType: !372, size: 32, offset: 608)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !342, file: !322, line: 437, baseType: !372, size: 32, offset: 640)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !342, file: !322, line: 447, baseType: !372, size: 32, offset: 672)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !342, file: !322, line: 450, baseType: !380, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !381, line: 13, baseType: !382)
!381 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !165, line: 175, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !165, line: 173, size: 64, elements: !384)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !383, file: !165, line: 174, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !351, line: 22, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !353, line: 30, baseType: !314)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !342, file: !322, line: 452, baseType: !161, size: 32, offset: 768)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !342, file: !322, line: 454, baseType: !192, offset: 800)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !342, file: !322, line: 457, baseType: !391, size: 256, offset: 832)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !392, line: 35, size: 256, elements: !393)
!392 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!393 = !{!394, !395, !396, !398}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !391, file: !392, line: 36, baseType: !380, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !391, file: !392, line: 42, baseType: !380, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !391, file: !392, line: 46, baseType: !397, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !193, line: 29, baseType: !200)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !391, file: !392, line: 47, baseType: !179, size: 128, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !342, file: !322, line: 459, baseType: !179, size: 128, offset: 1088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !342, file: !322, line: 466, baseType: !166, size: 64, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !342, file: !322, line: 467, baseType: !166, size: 64, offset: 1280)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !342, file: !322, line: 469, baseType: !166, size: 64, offset: 1344)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !342, file: !322, line: 470, baseType: !166, size: 64, offset: 1408)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !342, file: !322, line: 471, baseType: !382, size: 64, offset: 1472)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !342, file: !322, line: 472, baseType: !166, size: 64, offset: 1536)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !342, file: !322, line: 473, baseType: !166, size: 64, offset: 1600)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !342, file: !322, line: 474, baseType: !166, size: 64, offset: 1664)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !342, file: !322, line: 475, baseType: !166, size: 64, offset: 1728)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !342, file: !322, line: 477, baseType: !192, offset: 1792)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !342, file: !322, line: 478, baseType: !166, size: 64, offset: 1792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !342, file: !322, line: 478, baseType: !166, size: 64, offset: 1856)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !342, file: !322, line: 478, baseType: !166, size: 64, offset: 1920)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !342, file: !322, line: 478, baseType: !166, size: 64, offset: 1984)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !342, file: !322, line: 479, baseType: !166, size: 64, offset: 2048)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !342, file: !322, line: 479, baseType: !166, size: 64, offset: 2112)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !342, file: !322, line: 479, baseType: !166, size: 64, offset: 2176)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !342, file: !322, line: 480, baseType: !166, size: 64, offset: 2240)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !342, file: !322, line: 480, baseType: !166, size: 64, offset: 2304)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !342, file: !322, line: 480, baseType: !166, size: 64, offset: 2368)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !342, file: !322, line: 480, baseType: !166, size: 64, offset: 2432)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !342, file: !322, line: 482, baseType: !422, size: 2816, offset: 2496)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 2816, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 44)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !342, file: !322, line: 488, baseType: !426, size: 256, offset: 5312)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !427, line: 60, size: 256, elements: !428)
!427 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !426, file: !427, line: 61, baseType: !430, size: 256)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 256, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 4)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !342, file: !322, line: 490, baseType: !434, size: 64, offset: 5568)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !322, line: 490, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !342, file: !322, line: 493, baseType: !437, size: 896, offset: 5632)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !438, line: 53, baseType: !439)
!438 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !438, line: 13, size: 896, elements: !440)
!440 = !{!441, !442, !443, !444, !447, !448, !455, !456, !460, !461, !464}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !439, file: !438, line: 18, baseType: !350, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !439, file: !438, line: 28, baseType: !382, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !439, file: !438, line: 31, baseType: !391, size: 256, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !439, file: !438, line: 32, baseType: !445, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !438, line: 32, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !439, file: !438, line: 37, baseType: !274, size: 16, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !439, file: !438, line: 40, baseType: !449, size: 192, offset: 512)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !450, line: 53, size: 192, elements: !451)
!450 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !449, file: !450, line: 54, baseType: !380, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !449, file: !450, line: 55, baseType: !192, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !449, file: !450, line: 59, baseType: !179, size: 128, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !439, file: !438, line: 41, baseType: !167, size: 64, offset: 704)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !439, file: !438, line: 42, baseType: !457, size: 64, offset: 768)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !438, line: 42, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !439, file: !438, line: 44, baseType: !372, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !439, file: !438, line: 50, baseType: !462, size: 16, offset: 864)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !351, line: 19, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !353, line: 24, baseType: !274)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !439, file: !438, line: 51, baseType: !465, size: 16, offset: 880)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !351, line: 18, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !353, line: 23, baseType: !467)
!467 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !342, file: !322, line: 495, baseType: !166, size: 64, offset: 6528)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !342, file: !322, line: 497, baseType: !470, size: 64, offset: 6592)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !322, line: 381, size: 384, elements: !472)
!472 = !{!473, !474, !1364}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !471, file: !322, line: 382, baseType: !372, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !471, file: !322, line: 383, baseType: !475, size: 128, offset: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !322, line: 376, size: 128, elements: !476)
!476 = !{!477, !1362}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !475, file: !322, line: 377, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !480, line: 640, size: 48640, elements: !481)
!480 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!481 = !{!482, !490, !492, !493, !499, !500, !501, !502, !503, !504, !505, !506, !510, !528, !539, !634, !635, !636, !647, !648, !650, !651, !652, !653, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !732, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !788, !790, !791, !792, !804, !806, !807, !808, !809, !810, !816, !817, !818, !819, !820, !821, !822, !834, !839, !843, !844, !845, !848, !852, !855, !858, !861, !864, !867, !870, !873, !879, !880, !881, !887, !888, !889, !890, !891, !900, !901, !902, !903, !904, !909, !910, !911, !914, !915, !918, !921, !924, !927, !930, !933, !934, !1014, !1017, !1020, !1021, !1024, !1025, !1026, !1032, !1033, !1034, !1047, !1048, !1049, !1061, !1066, !1069, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !479, file: !480, line: 646, baseType: !483, size: 128)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !484, line: 56, size: 128, elements: !485)
!484 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !484, line: 57, baseType: !166, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !483, file: !484, line: 58, baseType: !488, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !351, line: 21, baseType: !489)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !353, line: 27, baseType: !7)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !479, file: !480, line: 649, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !479, file: !480, line: 657, baseType: !167, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !479, file: !480, line: 658, baseType: !494, size: 32, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !495, line: 113, baseType: !496)
!495 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !495, line: 111, size: 32, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !496, file: !495, line: 112, baseType: !372, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !479, file: !480, line: 660, baseType: !7, size: 32, offset: 288)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !479, file: !480, line: 661, baseType: !7, size: 32, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !479, file: !480, line: 684, baseType: !161, size: 32, offset: 352)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !479, file: !480, line: 686, baseType: !161, size: 32, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !479, file: !480, line: 687, baseType: !161, size: 32, offset: 416)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !479, file: !480, line: 688, baseType: !161, size: 32, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !479, file: !480, line: 689, baseType: !7, size: 32, offset: 480)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !479, file: !480, line: 691, baseType: !507, size: 64, offset: 512)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !480, line: 691, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !479, file: !480, line: 692, baseType: !511, size: 832, offset: 576)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !480, line: 451, size: 832, elements: !512)
!512 = !{!513, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !511, file: !480, line: 453, baseType: !514, size: 128)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !480, line: 325, size: 128, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !514, file: !480, line: 326, baseType: !166, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !514, file: !480, line: 327, baseType: !488, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !511, file: !480, line: 454, baseType: !329, size: 192, align: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !511, file: !480, line: 455, baseType: !179, size: 128, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !511, file: !480, line: 456, baseType: !7, size: 32, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !511, file: !480, line: 458, baseType: !350, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !511, file: !480, line: 459, baseType: !350, size: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !511, file: !480, line: 460, baseType: !350, size: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !511, file: !480, line: 461, baseType: !350, size: 64, offset: 704)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !511, file: !480, line: 463, baseType: !350, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !511, file: !480, line: 465, baseType: !527, offset: 832)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !480, line: 415, elements: !206)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !479, file: !480, line: 693, baseType: !529, size: 384, offset: 1408)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !480, line: 489, size: 384, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !529, file: !480, line: 490, baseType: !179, size: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !529, file: !480, line: 491, baseType: !166, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !529, file: !480, line: 492, baseType: !166, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !529, file: !480, line: 493, baseType: !7, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !529, file: !480, line: 494, baseType: !274, size: 16, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !529, file: !480, line: 495, baseType: !274, size: 16, offset: 304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !529, file: !480, line: 497, baseType: !538, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !479, file: !480, line: 697, baseType: !540, size: 1792, offset: 1792)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !480, line: 507, size: 1792, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !631, !632}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !540, file: !480, line: 508, baseType: !329, size: 192, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !540, file: !480, line: 515, baseType: !350, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !540, file: !480, line: 516, baseType: !350, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !540, file: !480, line: 517, baseType: !350, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !540, file: !480, line: 518, baseType: !350, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !540, file: !480, line: 519, baseType: !350, size: 64, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !540, file: !480, line: 526, baseType: !386, size: 64, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !540, file: !480, line: 527, baseType: !350, size: 64, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !480, line: 528, baseType: !7, size: 32, offset: 640)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !540, file: !480, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !540, file: !480, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !540, file: !480, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !540, file: !480, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !540, file: !480, line: 563, baseType: !556, size: 512, offset: 704)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !13, line: 118, size: 512, elements: !557)
!557 = !{!558, !566, !567, !572, !624, !628, !629, !630}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !556, file: !13, line: 119, baseType: !559, size: 256)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !560, line: 9, size: 256, elements: !561)
!560 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !559, file: !560, line: 10, baseType: !329, size: 192, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !559, file: !560, line: 11, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !565, line: 29, baseType: !386)
!565 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !556, file: !13, line: 120, baseType: !564, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !556, file: !13, line: 121, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!12, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !556, file: !13, line: 122, baseType: !573, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !13, line: 159, size: 512, align: 512, elements: !575)
!575 = !{!576, !596, !597, !600, !610, !611, !619, !623}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !574, file: !13, line: 160, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !13, line: 214, size: 4608, align: 512, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !578, file: !13, line: 215, baseType: !397)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !578, file: !13, line: 216, baseType: !7, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !578, file: !13, line: 217, baseType: !7, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !578, file: !13, line: 218, baseType: !7, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !578, file: !13, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !578, file: !13, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !578, file: !13, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !578, file: !13, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !578, file: !13, line: 233, baseType: !564, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !578, file: !13, line: 234, baseType: !571, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !578, file: !13, line: 235, baseType: !564, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !578, file: !13, line: 236, baseType: !571, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !578, file: !13, line: 237, baseType: !593, size: 4096, offset: 512)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 4096, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !574, file: !13, line: 161, baseType: !7, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !574, file: !13, line: 162, baseType: !598, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !165, line: 27, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !265, line: 96, baseType: !161)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !574, file: !13, line: 163, baseType: !601, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !602, line: 276, baseType: !603)
!602 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !602, line: 276, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !603, file: !602, line: 276, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !602, line: 70, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !602, line: 65, size: 32, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !607, file: !602, line: 66, baseType: !7, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !574, file: !13, line: 164, baseType: !571, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !574, file: !13, line: 165, baseType: !612, size: 128, offset: 256)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !560, line: 14, size: 128, elements: !613)
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !612, file: !560, line: 15, baseType: !615, size: 128)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !330, line: 125, size: 128, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !615, file: !330, line: 126, baseType: !346, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !615, file: !330, line: 127, baseType: !334, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !574, file: !13, line: 166, baseType: !620, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!564}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !574, file: !13, line: 167, baseType: !564, size: 64, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !556, file: !13, line: 123, baseType: !625, size: 8, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !351, line: 17, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !353, line: 21, baseType: !627)
!627 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !556, file: !13, line: 124, baseType: !625, size: 8, offset: 456)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !556, file: !13, line: 125, baseType: !625, size: 8, offset: 464)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !556, file: !13, line: 126, baseType: !625, size: 8, offset: 472)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !540, file: !480, line: 572, baseType: !556, size: 512, offset: 1216)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !540, file: !480, line: 580, baseType: !633, size: 64, offset: 1728)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !479, file: !480, line: 721, baseType: !7, size: 32, offset: 3584)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !479, file: !480, line: 722, baseType: !161, size: 32, offset: 3616)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !479, file: !480, line: 723, baseType: !637, size: 64, offset: 3648)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !640, line: 17, baseType: !641)
!640 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !640, line: 17, size: 64, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !641, file: !640, line: 17, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 1)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !479, file: !480, line: 724, baseType: !639, size: 64, offset: 3712)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !479, file: !480, line: 749, baseType: !649, offset: 3776)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !480, line: 290, elements: !206)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !479, file: !480, line: 751, baseType: !179, size: 128, offset: 3776)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !479, file: !480, line: 757, baseType: !338, size: 64, offset: 3904)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !479, file: !480, line: 758, baseType: !338, size: 64, offset: 3968)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !479, file: !480, line: 761, baseType: !654, size: 320, offset: 4032)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !427, line: 34, size: 320, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !654, file: !427, line: 35, baseType: !350, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !654, file: !427, line: 36, baseType: !658, size: 256, offset: 64)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 256, elements: !431)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !479, file: !480, line: 766, baseType: !161, size: 32, offset: 4352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !479, file: !480, line: 767, baseType: !161, size: 32, offset: 4384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !479, file: !480, line: 768, baseType: !161, size: 32, offset: 4416)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !479, file: !480, line: 770, baseType: !161, size: 32, offset: 4448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !479, file: !480, line: 772, baseType: !166, size: 64, offset: 4480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !479, file: !480, line: 775, baseType: !7, size: 32, offset: 4544)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !479, file: !480, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !479, file: !480, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !479, file: !480, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !479, file: !480, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !479, file: !480, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !479, file: !480, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !479, file: !480, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !479, file: !480, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !479, file: !480, line: 831, baseType: !166, size: 64, offset: 4672)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !479, file: !480, line: 833, baseType: !675, size: 384, offset: 4736)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !18, line: 25, size: 384, elements: !676)
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !675, file: !18, line: 26, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!267, !681}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !675, file: !18, line: 27, baseType: !683, size: 320, offset: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !675, file: !18, line: 27, size: 320, elements: !684)
!684 = !{!685, !695, !722}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !683, file: !18, line: 36, baseType: !686, size: 320)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !18, line: 29, size: 320, elements: !687)
!687 = !{!688, !690, !691, !692, !693, !694}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !686, file: !18, line: 30, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !686, file: !18, line: 31, baseType: !488, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !686, file: !18, line: 32, baseType: !488, size: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !686, file: !18, line: 33, baseType: !488, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !686, file: !18, line: 34, baseType: !350, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !686, file: !18, line: 35, baseType: !689, size: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !683, file: !18, line: 46, baseType: !696, size: 192)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !18, line: 38, size: 192, elements: !697)
!697 = !{!698, !699, !700, !721}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !696, file: !18, line: 39, baseType: !598, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !18, line: 40, baseType: !17, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, scope: !696, file: !18, line: 41, baseType: !701, size: 64, offset: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !696, file: !18, line: 41, size: 64, elements: !702)
!702 = !{!703, !711}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !701, file: !18, line: 42, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !706, line: 7, size: 128, elements: !707)
!706 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !705, file: !706, line: 8, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !265, line: 93, baseType: !314)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !705, file: !706, line: 9, baseType: !314, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !701, file: !18, line: 43, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !714, line: 7, size: 64, elements: !715)
!714 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!715 = !{!716, !720}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !713, file: !714, line: 8, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !714, line: 5, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !351, line: 20, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !353, line: 26, baseType: !161)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !713, file: !714, line: 9, baseType: !718, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !696, file: !18, line: 45, baseType: !350, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !683, file: !18, line: 54, baseType: !723, size: 256)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !18, line: 48, size: 256, elements: !724)
!724 = !{!725, !728, !729, !730, !731}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !723, file: !18, line: 49, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !18, line: 14, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !723, file: !18, line: 50, baseType: !161, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !723, file: !18, line: 51, baseType: !161, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !723, file: !18, line: 52, baseType: !166, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !723, file: !18, line: 53, baseType: !166, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !479, file: !480, line: 835, baseType: !733, size: 32, offset: 5120)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !165, line: 22, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !265, line: 28, baseType: !161)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !479, file: !480, line: 836, baseType: !733, size: 32, offset: 5152)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !479, file: !480, line: 840, baseType: !166, size: 64, offset: 5184)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !479, file: !480, line: 849, baseType: !478, size: 64, offset: 5248)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !479, file: !480, line: 852, baseType: !478, size: 64, offset: 5312)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !479, file: !480, line: 857, baseType: !179, size: 128, offset: 5376)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !479, file: !480, line: 858, baseType: !179, size: 128, offset: 5504)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !479, file: !480, line: 859, baseType: !478, size: 64, offset: 5632)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !479, file: !480, line: 867, baseType: !179, size: 128, offset: 5696)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !479, file: !480, line: 868, baseType: !179, size: 128, offset: 5824)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !479, file: !480, line: 871, baseType: !745, size: 64, offset: 5952)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !747, line: 59, size: 768, elements: !748)
!747 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!748 = !{!749, !750, !751, !752, !763, !764, !771, !780}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !746, file: !747, line: 61, baseType: !494, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !746, file: !747, line: 62, baseType: !7, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !746, file: !747, line: 63, baseType: !192, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !746, file: !747, line: 65, baseType: !753, size: 256, offset: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 256, elements: !431)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !165, line: 182, size: 64, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !754, file: !165, line: 183, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !165, line: 186, size: 128, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !165, line: 187, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !758, file: !165, line: 187, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !746, file: !747, line: 66, baseType: !754, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !746, file: !747, line: 68, baseType: !765, size: 128, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !766, line: 40, baseType: !767)
!766 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !766, line: 36, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !767, file: !766, line: 37, baseType: !192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !767, file: !766, line: 38, baseType: !179, size: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !746, file: !747, line: 69, baseType: !772, size: 128, align: 64, offset: 512)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !165, line: 216, size: 128, align: 64, elements: !773)
!773 = !{!774, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !772, file: !165, line: 217, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !772, file: !165, line: 218, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !775}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !746, file: !747, line: 70, baseType: !781, size: 128, offset: 640)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 128, elements: !645)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !747, line: 54, size: 128, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !782, file: !747, line: 55, baseType: !161, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !782, file: !747, line: 56, baseType: !786, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !747, line: 56, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !479, file: !480, line: 872, baseType: !789, size: 512, offset: 6016)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 512, elements: !431)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !479, file: !480, line: 873, baseType: !179, size: 128, offset: 6528)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !479, file: !480, line: 874, baseType: !179, size: 128, offset: 6656)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !479, file: !480, line: 876, baseType: !793, size: 64, offset: 6784)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !795, line: 26, size: 192, elements: !796)
!795 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !794, file: !795, line: 27, baseType: !7, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !794, file: !795, line: 28, baseType: !799, size: 128, offset: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !800, line: 43, size: 128, elements: !801)
!800 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !799, file: !800, line: 44, baseType: !397)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !799, file: !800, line: 45, baseType: !179, size: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !479, file: !480, line: 879, baseType: !805, size: 64, offset: 6848)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !479, file: !480, line: 882, baseType: !805, size: 64, offset: 6912)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !479, file: !480, line: 884, baseType: !350, size: 64, offset: 6976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !479, file: !480, line: 885, baseType: !350, size: 64, offset: 7040)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !479, file: !480, line: 890, baseType: !350, size: 64, offset: 7104)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !479, file: !480, line: 891, baseType: !811, size: 128, offset: 7168)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !480, line: 242, size: 128, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !811, file: !480, line: 244, baseType: !350, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !811, file: !480, line: 245, baseType: !350, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !811, file: !480, line: 246, baseType: !397, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !479, file: !480, line: 900, baseType: !166, size: 64, offset: 7296)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !479, file: !480, line: 901, baseType: !166, size: 64, offset: 7360)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !479, file: !480, line: 904, baseType: !350, size: 64, offset: 7424)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !479, file: !480, line: 907, baseType: !350, size: 64, offset: 7488)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !479, file: !480, line: 910, baseType: !166, size: 64, offset: 7552)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !479, file: !480, line: 911, baseType: !166, size: 64, offset: 7616)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !479, file: !480, line: 914, baseType: !823, size: 640, offset: 7680)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !824, line: 123, size: 640, elements: !825)
!824 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!825 = !{!826, !832, !833}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !823, file: !824, line: 124, baseType: !827, size: 576)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 576, elements: !233)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !824, line: 108, size: 192, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !828, file: !824, line: 109, baseType: !350, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !828, file: !824, line: 110, baseType: !612, size: 128, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !823, file: !824, line: 125, baseType: !7, size: 32, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !823, file: !824, line: 126, baseType: !7, size: 32, offset: 608)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !479, file: !480, line: 917, baseType: !835, size: 192, offset: 8320)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !824, line: 134, size: 192, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !835, file: !824, line: 135, baseType: !772, size: 128, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !835, file: !824, line: 136, baseType: !7, size: 32, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !479, file: !480, line: 923, baseType: !840, size: 64, offset: 8512)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !480, line: 923, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !479, file: !480, line: 926, baseType: !840, size: 64, offset: 8576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !479, file: !480, line: 929, baseType: !840, size: 64, offset: 8640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !479, file: !480, line: 933, baseType: !846, size: 64, offset: 8704)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !480, line: 933, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !479, file: !480, line: 943, baseType: !849, size: 128, offset: 8768)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 16)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !479, file: !480, line: 945, baseType: !853, size: 64, offset: 8896)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !480, line: 49, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !479, file: !480, line: 956, baseType: !856, size: 64, offset: 8960)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !480, line: 45, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !479, file: !480, line: 959, baseType: !859, size: 64, offset: 9024)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !480, line: 959, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !479, file: !480, line: 962, baseType: !862, size: 64, offset: 9088)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !480, line: 66, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !479, file: !480, line: 966, baseType: !865, size: 64, offset: 9152)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !480, line: 50, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !479, file: !480, line: 969, baseType: !868, size: 64, offset: 9216)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !824, line: 223, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !479, file: !480, line: 970, baseType: !871, size: 64, offset: 9280)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !480, line: 62, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !479, file: !480, line: 971, baseType: !874, size: 64, offset: 9344)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !875, line: 25, baseType: !876)
!875 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !875, line: 23, size: 64, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !876, file: !875, line: 24, baseType: !644, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !479, file: !480, line: 972, baseType: !874, size: 64, offset: 9408)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !479, file: !480, line: 974, baseType: !874, size: 64, offset: 9472)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !479, file: !480, line: 975, baseType: !882, size: 192, offset: 9536)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !883, line: 30, size: 192, elements: !884)
!883 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !882, file: !883, line: 31, baseType: !179, size: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !882, file: !883, line: 32, baseType: !874, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !479, file: !480, line: 976, baseType: !166, size: 64, offset: 9728)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !479, file: !480, line: 977, baseType: !279, size: 64, offset: 9792)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !479, file: !480, line: 978, baseType: !7, size: 32, offset: 9856)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !479, file: !480, line: 980, baseType: !775, size: 64, offset: 9920)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !479, file: !480, line: 989, baseType: !892, size: 128, offset: 9984)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !893, line: 35, size: 128, elements: !894)
!893 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !892, file: !893, line: 36, baseType: !161, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !892, file: !893, line: 37, baseType: !372, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !892, file: !893, line: 38, baseType: !898, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !893, line: 23, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !479, file: !480, line: 992, baseType: !350, size: 64, offset: 10112)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !479, file: !480, line: 993, baseType: !350, size: 64, offset: 10176)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !479, file: !480, line: 996, baseType: !192, offset: 10240)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !479, file: !480, line: 999, baseType: !397, offset: 10240)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !479, file: !480, line: 1001, baseType: !905, size: 64, offset: 10240)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !480, line: 636, size: 64, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !480, line: 637, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !479, file: !480, line: 1005, baseType: !615, size: 128, offset: 10304)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !479, file: !480, line: 1007, baseType: !478, size: 64, offset: 10432)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !479, file: !480, line: 1009, baseType: !912, size: 64, offset: 10496)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !480, line: 1009, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !479, file: !480, line: 1043, baseType: !167, size: 64, offset: 10560)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !479, file: !480, line: 1046, baseType: !916, size: 64, offset: 10624)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !480, line: 41, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !479, file: !480, line: 1050, baseType: !919, size: 64, offset: 10688)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !480, line: 42, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !479, file: !480, line: 1054, baseType: !922, size: 64, offset: 10752)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !480, line: 55, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !479, file: !480, line: 1056, baseType: !925, size: 64, offset: 10816)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !480, line: 40, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !479, file: !480, line: 1058, baseType: !928, size: 64, offset: 10880)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !480, line: 47, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !479, file: !480, line: 1061, baseType: !931, size: 64, offset: 10944)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !480, line: 43, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !479, file: !480, line: 1064, baseType: !166, size: 64, offset: 11008)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !479, file: !480, line: 1065, baseType: !935, size: 64, offset: 11072)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !883, line: 14, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !883, line: 12, size: 384, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, scope: !937, file: !883, line: 13, baseType: !940, size: 384)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !937, file: !883, line: 13, size: 384, elements: !941)
!941 = !{!942, !943, !944, !945}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !940, file: !883, line: 13, baseType: !161, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !940, file: !883, line: 13, baseType: !161, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !940, file: !883, line: 13, baseType: !161, size: 32, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !940, file: !883, line: 13, baseType: !946, size: 256, offset: 128)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !947, line: 32, size: 256, elements: !948)
!947 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!948 = !{!949, !955, !968, !974, !983, !1003, !1008}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !946, file: !947, line: 37, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 34, size: 64, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !950, file: !947, line: 35, baseType: !734, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !950, file: !947, line: 36, baseType: !954, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !265, line: 49, baseType: !7)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !946, file: !947, line: 45, baseType: !956, size: 192)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 40, size: 192, elements: !957)
!957 = !{!958, !960, !961, !967}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !956, file: !947, line: 41, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !265, line: 95, baseType: !161)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !956, file: !947, line: 42, baseType: !161, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !956, file: !947, line: 43, baseType: !962, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !947, line: 11, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !947, line: 8, size: 64, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !963, file: !947, line: 9, baseType: !161, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !963, file: !947, line: 10, baseType: !167, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !956, file: !947, line: 44, baseType: !161, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !946, file: !947, line: 52, baseType: !969, size: 128)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 48, size: 128, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !969, file: !947, line: 49, baseType: !734, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !969, file: !947, line: 50, baseType: !954, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !969, file: !947, line: 51, baseType: !962, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !946, file: !947, line: 61, baseType: !975, size: 256)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 55, size: 256, elements: !976)
!976 = !{!977, !978, !979, !980, !982}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !975, file: !947, line: 56, baseType: !734, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !975, file: !947, line: 57, baseType: !954, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !975, file: !947, line: 58, baseType: !161, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !975, file: !947, line: 59, baseType: !981, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !265, line: 94, baseType: !266)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !975, file: !947, line: 60, baseType: !981, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !946, file: !947, line: 95, baseType: !984, size: 256)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 64, size: 256, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !984, file: !947, line: 65, baseType: !167, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, scope: !984, file: !947, line: 77, baseType: !988, size: 192, offset: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !984, file: !947, line: 77, size: 192, elements: !989)
!989 = !{!990, !991, !998}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !988, file: !947, line: 82, baseType: !467, size: 16)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !988, file: !947, line: 88, baseType: !992, size: 192)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !988, file: !947, line: 84, size: 192, elements: !993)
!993 = !{!994, !996, !997}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !992, file: !947, line: 85, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 64, elements: !594)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !992, file: !947, line: 86, baseType: !167, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !992, file: !947, line: 87, baseType: !167, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !988, file: !947, line: 93, baseType: !999, size: 96)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !988, file: !947, line: 90, size: 96, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !999, file: !947, line: 91, baseType: !995, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !999, file: !947, line: 92, baseType: !489, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !946, file: !947, line: 101, baseType: !1004, size: 128)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 98, size: 128, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !1004, file: !947, line: 99, baseType: !267, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !1004, file: !947, line: 100, baseType: !161, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !946, file: !947, line: 108, baseType: !1009, size: 128)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !946, file: !947, line: 104, size: 128, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !1009, file: !947, line: 105, baseType: !167, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !1009, file: !947, line: 106, baseType: !161, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !1009, file: !947, line: 107, baseType: !7, size: 32, offset: 96)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "ioac", scope: !479, file: !480, line: 1067, baseType: !1015, offset: 11136)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_io_accounting", file: !1016, line: 12, elements: !206)
!1016 = !DIFile(filename: "./include/linux/task_io_accounting.h", directory: "/home/lizy2001/genbc/linux")
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "robust_list", scope: !479, file: !480, line: 1099, baseType: !1018, size: 64, offset: 11136)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "robust_list_head", file: !480, line: 56, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_list", scope: !479, file: !480, line: 1103, baseType: !179, size: 128, offset: 11200)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_cache", scope: !479, file: !480, line: 1104, baseType: !1022, size: 64, offset: 11328)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "futex_pi_state", file: !480, line: 46, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "futex_exit_mutex", scope: !479, file: !480, line: 1105, baseType: !449, size: 192, offset: 11392)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "futex_state", scope: !479, file: !480, line: 1106, baseType: !7, size: 32, offset: 11584)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_ctxp", scope: !479, file: !480, line: 1109, baseType: !1027, size: 128, offset: 11648)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, elements: !1030)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_context", file: !480, line: 51, flags: DIFlagFwdDecl)
!1030 = !{!1031}
!1031 = !DISubrange(count: 2)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_mutex", scope: !479, file: !480, line: 1110, baseType: !449, size: 192, offset: 11776)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_list", scope: !479, file: !480, line: 1111, baseType: !179, size: 128, offset: 11968)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rseq", scope: !479, file: !480, line: 1173, baseType: !1035, size: 64, offset: 12096)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rseq", file: !1037, line: 62, size: 256, align: 256, elements: !1038)
!1037 = !DIFile(filename: "./include/uapi/linux/rseq.h", directory: "/home/lizy2001/genbc/linux")
!1038 = !{!1039, !1040, !1041, !1046}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id_start", scope: !1036, file: !1037, line: 75, baseType: !489, size: 32)
