; ModuleID = '../bcout/drivers/power/supply/power_supply_core.llvm.bc'
source_filename = "drivers/power/supply/power_supply_core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall4.init\22, \22a\22\09"
module asm "__initcall_power_supply_class_init4:\09\09\09"
module asm ".long\09power_supply_class_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.atomic_notifier_head = type { %struct.spinlock, %struct.notifier_block* }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.notifier_block = type { i32 (%struct.notifier_block*, i64, i8*)*, %struct.notifier_block*, i32 }
%struct.class = type { i8*, %struct.module*, %struct.attribute_group**, %struct.attribute_group**, %struct.kobject*, i32 (%struct.device*, %struct.kobj_uevent_env*)*, i8* (%struct.device*, i16*)*, void (%struct.class*)*, void (%struct.device*)*, i32 (%struct.device*)*, %struct.kobj_ns_type_operations*, i8* (%struct.device*)*, void (%struct.device*, %struct.kuid_t*, %struct.kgid_t*)*, %struct.dev_pm_ops*, %struct.subsys_private* }
%struct.module = type opaque
%struct.attribute_group = type { i8*, i16 (%struct.kobject*, %struct.attribute*, i32)*, i16 (%struct.kobject*, %struct.bin_attribute*, i32)*, %struct.attribute**, %struct.bin_attribute** }

!185 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !186, line: 10, baseType: !7, size: 32, elements: !187)
!186 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!187 = !{!188, !189}
!188 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!189 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!190 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !191, line: 30, baseType: !192, size: 64, elements: !193)
!191 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!192 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!194 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!195 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!196 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!197 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!198 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!199 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!200 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!201 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!202 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!203 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!204 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!205 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!206 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!207 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!208 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!209 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!210 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!211 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!212 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!213 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!214 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!215 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!216 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!217 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!218 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!219 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!220 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!221 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!222 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !224, line: 305, baseType: !7, size: 32, elements: !225)
!224 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!225 = !{!226, !227, !228, !229}
!226 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "power_supply_notifier_events", file: !6, line: 205, baseType: !7, size: 32, elements: !231)
!231 = !{!232}
!232 = !DIEnumerator(name: "PSY_EVENT_PROP_CHANGED", value: 0, isUnsigned: true)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobject_action", file: !234, line: 53, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243}
!236 = !DIEnumerator(name: "KOBJ_ADD", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "KOBJ_REMOVE", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "KOBJ_CHANGE", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "KOBJ_MOVE", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "KOBJ_ONLINE", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "KOBJ_OFFLINE", value: 5, isUnsigned: true)
!242 = !DIEnumerator(name: "KOBJ_BIND", value: 6, isUnsigned: true)
!243 = !DIEnumerator(name: "KOBJ_UNBIND", value: 7, isUnsigned: true)
!244 = !{!245, !247, !248, !250, !252, !253, !256, !257, !2225, !2457, !366, !192, !1865}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !246, line: 148, baseType: !7)
!246 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!247 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !249, line: 27, baseType: !7)
!249 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !251, line: 32, baseType: !248)
!251 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!252 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !247)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !259, line: 51, size: 1344, elements: !260)
!259 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!260 = !{!261, !265, !269, !270, !2209, !2218, !2219, !2220, !2221, !2222, !2223, !2224}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !259, line: 52, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !258, file: !259, line: 53, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !259, line: 28, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !268, line: 21, baseType: !248)
!268 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !258, file: !259, line: 54, baseType: !262, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !258, file: !259, line: 55, baseType: !271, size: 192, offset: 192)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !272, line: 17, size: 192, elements: !273)
!272 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !276, !2208}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !271, file: !272, line: 18, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !271, file: !272, line: 19, baseType: !277, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !272, line: 110, size: 1152, elements: !280)
!280 = !{!281, !285, !289, !297, !2150, !2154, !2158, !2163, !2167, !2168, !2172, !2176, !2180, !2191, !2192, !2193, !2194, !2204}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !279, file: !272, line: 111, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!275, !275}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !279, file: !272, line: 112, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !275}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !279, file: !272, line: 113, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !295}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !246, line: 30, baseType: !294)
!294 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !279, file: !272, line: 114, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !295, !303}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !135, line: 461, size: 5568, elements: !306)
!306 = !{!307, !1787, !1789, !1792, !1793, !1844, !1941, !1942, !1943, !1944, !1945, !1954, !2059, !2072, !2075, !2076, !2080, !2082, !2083, !2084, !2088, !2094, !2095, !2098, !2099, !2100, !2103, !2104, !2105, !2106, !2138, !2139, !2140, !2143, !2146, !2147, !2148, !2149}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !305, file: !135, line: 462, baseType: !308, size: 512)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !234, line: 64, size: 512, elements: !309)
!309 = !{!310, !311, !317, !319, !379, !1625, !1777, !1782, !1783, !1784, !1785, !1786}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !234, line: 65, baseType: !262, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !308, file: !234, line: 66, baseType: !312, size: 128, offset: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !246, line: 178, size: 128, elements: !313)
!313 = !{!314, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !246, line: 179, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !246, line: 179, baseType: !315, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !234, line: 67, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !308, file: !234, line: 68, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !234, line: 192, size: 704, elements: !322)
!322 = !{!323, !324, !340, !341}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !321, file: !234, line: 193, baseType: !312, size: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !321, file: !234, line: 194, baseType: !325, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !326, line: 83, baseType: !327)
!326 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !326, line: 71, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !326, line: 72, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !327, file: !326, line: 72, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !330, file: !326, line: 73, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !326, line: 20, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !333, file: !326, line: 21, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !337, line: 25, baseType: !338)
!337 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 25, elements: !339)
!339 = !{}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !321, file: !234, line: 195, baseType: !308, size: 512, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !321, file: !234, line: 196, baseType: !342, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !234, line: 156, size: 192, elements: !345)
!345 = !{!346, !351, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !344, file: !234, line: 157, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!247, !320, !318}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !234, line: 158, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!262, !320, !318}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !344, file: !234, line: 159, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!247, !320, !318, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !234, line: 148, size: 20736, elements: !363)
!363 = !{!364, !369, !373, !374, !378}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !362, file: !234, line: 149, baseType: !365, size: 192)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 192, elements: !367)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!367 = !{!368}
!368 = !DISubrange(count: 3)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !362, file: !234, line: 150, baseType: !370, size: 4096, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 4096, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !362, file: !234, line: 151, baseType: !247, size: 32, offset: 4288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !362, file: !234, line: 152, baseType: !375, size: 16384, offset: 4320)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 16384, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 2048)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !362, file: !234, line: 153, baseType: !247, size: 32, offset: 20704)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !308, file: !234, line: 69, baseType: !380, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !234, line: 138, size: 448, elements: !382)
!382 = !{!383, !387, !415, !417, !1573, !1604, !1608}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !381, file: !234, line: 139, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !318}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !381, file: !234, line: 140, baseType: !388, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !391, line: 230, size: 128, elements: !392)
!391 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!392 = !{!393, !408}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !390, file: !391, line: 231, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!397, !318, !401, !366}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !246, line: 60, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !399, line: 73, baseType: !400)
!399 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !399, line: 15, baseType: !192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !391, line: 30, size: 128, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !402, file: !391, line: 31, baseType: !262, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !402, file: !391, line: 32, baseType: !406, size: 16, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !246, line: 19, baseType: !407)
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !390, file: !391, line: 232, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!397, !318, !401, !262, !412}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !246, line: 55, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !399, line: 72, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !399, line: 16, baseType: !252)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !381, file: !234, line: 141, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !381, file: !234, line: 142, baseType: !418, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !391, line: 84, size: 320, elements: !422)
!422 = !{!423, !424, !428, !1570, !1571}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !421, file: !391, line: 85, baseType: !262, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !421, file: !391, line: 86, baseType: !425, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!406, !318, !401, !247}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !421, file: !391, line: 88, baseType: !429, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!406, !318, !432, !247}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !391, line: 168, size: 448, elements: !434)
!434 = !{!435, !436, !437, !438, !448, !449}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !433, file: !391, line: 169, baseType: !402, size: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !391, line: 170, baseType: !412, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !433, file: !391, line: 171, baseType: !256, size: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !433, file: !391, line: 172, baseType: !439, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!397, !442, !318, !432, !366, !445, !412}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !444, line: 526, flags: DIFlagFwdDecl)
!444 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !246, line: 46, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !399, line: 88, baseType: !447)
!447 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !433, file: !391, line: 174, baseType: !439, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !433, file: !391, line: 176, baseType: !450, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DISubroutineType(types: !452)
!452 = !{!247, !442, !318, !432, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !455, line: 305, size: 1472, elements: !456)
!455 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!456 = !{!457, !458, !459, !460, !461, !469, !470, !1544, !1550, !1551, !1556, !1557, !1560, !1564, !1565, !1566, !1567, !1568}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !454, file: !455, line: 308, baseType: !252, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !454, file: !455, line: 309, baseType: !252, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !454, file: !455, line: 313, baseType: !453, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !454, file: !455, line: 313, baseType: !453, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !454, file: !455, line: 315, baseType: !462, size: 192, align: 64, offset: 256)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !463, line: 24, size: 192, align: 64, elements: !464)
!463 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!464 = !{!465, !466, !468}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !462, file: !463, line: 25, baseType: !252, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !462, file: !463, line: 26, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !462, file: !463, line: 27, baseType: !467, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !454, file: !455, line: 323, baseType: !252, size: 64, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !454, file: !455, line: 327, baseType: !471, size: 64, offset: 512)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !455, line: 388, size: 7296, elements: !473)
!473 = !{!474, !1540}
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !472, file: !455, line: 389, baseType: !475, size: 7296)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !455, line: 389, size: 7296, elements: !476)
!476 = !{!477, !478, !482, !486, !490, !491, !492, !493, !494, !502, !507, !508, !509, !510, !519, !520, !521, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !556, !564, !567, !615, !616, !1511, !1512, !1515, !1519, !1520, !1523, !1524, !1525, !1528, !1539}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !475, file: !455, line: 390, baseType: !453, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !475, file: !455, line: 391, baseType: !479, size: 64, offset: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !463, line: 31, size: 64, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !479, file: !463, line: 32, baseType: !467, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !475, file: !455, line: 392, baseType: !483, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !268, line: 23, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !249, line: 31, baseType: !485)
!485 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !475, file: !455, line: 394, baseType: !487, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!252, !442, !252, !252, !252, !252}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !475, file: !455, line: 398, baseType: !252, size: 64, offset: 256)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !475, file: !455, line: 399, baseType: !252, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !475, file: !455, line: 405, baseType: !252, size: 64, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !475, file: !455, line: 406, baseType: !252, size: 64, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !475, file: !455, line: 407, baseType: !495, size: 64, offset: 512)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !444, line: 286, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 286, size: 64, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !497, file: !444, line: 286, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !501, line: 18, baseType: !252)
!501 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!502 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !475, file: !455, line: 416, baseType: !503, size: 32, offset: 576)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !246, line: 168, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 166, size: 32, elements: !505)
!505 = !{!506}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !504, file: !246, line: 167, baseType: !247, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !475, file: !455, line: 428, baseType: !503, size: 32, offset: 608)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !475, file: !455, line: 437, baseType: !503, size: 32, offset: 640)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !475, file: !455, line: 447, baseType: !503, size: 32, offset: 672)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !475, file: !455, line: 450, baseType: !511, size: 64, offset: 704)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !512, line: 13, baseType: !513)
!512 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !246, line: 175, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !246, line: 173, size: 64, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !514, file: !246, line: 174, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !268, line: 22, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !249, line: 30, baseType: !447)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !475, file: !455, line: 452, baseType: !247, size: 32, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !475, file: !455, line: 454, baseType: !325, offset: 800)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !475, file: !455, line: 457, baseType: !522, size: 256, offset: 832)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !523, line: 35, size: 256, elements: !524)
!523 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!524 = !{!525, !526, !527, !529}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !522, file: !523, line: 36, baseType: !511, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !522, file: !523, line: 42, baseType: !511, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !522, file: !523, line: 46, baseType: !528, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !326, line: 29, baseType: !333)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !522, file: !523, line: 47, baseType: !312, size: 128, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !475, file: !455, line: 459, baseType: !312, size: 128, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !475, file: !455, line: 466, baseType: !252, size: 64, offset: 1216)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !475, file: !455, line: 467, baseType: !252, size: 64, offset: 1280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !475, file: !455, line: 469, baseType: !252, size: 64, offset: 1344)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !475, file: !455, line: 470, baseType: !252, size: 64, offset: 1408)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !475, file: !455, line: 471, baseType: !513, size: 64, offset: 1472)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !475, file: !455, line: 472, baseType: !252, size: 64, offset: 1536)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !475, file: !455, line: 473, baseType: !252, size: 64, offset: 1600)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !475, file: !455, line: 474, baseType: !252, size: 64, offset: 1664)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !475, file: !455, line: 475, baseType: !252, size: 64, offset: 1728)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !475, file: !455, line: 477, baseType: !325, offset: 1792)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !475, file: !455, line: 478, baseType: !252, size: 64, offset: 1792)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !475, file: !455, line: 478, baseType: !252, size: 64, offset: 1856)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !475, file: !455, line: 478, baseType: !252, size: 64, offset: 1920)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !475, file: !455, line: 478, baseType: !252, size: 64, offset: 1984)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !475, file: !455, line: 479, baseType: !252, size: 64, offset: 2048)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !475, file: !455, line: 479, baseType: !252, size: 64, offset: 2112)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !475, file: !455, line: 479, baseType: !252, size: 64, offset: 2176)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !475, file: !455, line: 480, baseType: !252, size: 64, offset: 2240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !475, file: !455, line: 480, baseType: !252, size: 64, offset: 2304)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !475, file: !455, line: 480, baseType: !252, size: 64, offset: 2368)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !475, file: !455, line: 480, baseType: !252, size: 64, offset: 2432)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !475, file: !455, line: 482, baseType: !553, size: 2816, offset: 2496)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 2816, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 44)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !475, file: !455, line: 488, baseType: !557, size: 256, offset: 5312)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !558, line: 60, size: 256, elements: !559)
!558 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !557, file: !558, line: 61, baseType: !561, size: 256)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 256, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 4)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !475, file: !455, line: 490, baseType: !565, size: 64, offset: 5568)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !455, line: 490, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !475, file: !455, line: 493, baseType: !568, size: 896, offset: 5632)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !569, line: 53, baseType: !570)
!569 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 13, size: 896, elements: !571)
!571 = !{!572, !573, !574, !575, !578, !579, !586, !587, !607, !608, !611}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !570, file: !569, line: 18, baseType: !483, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !570, file: !569, line: 28, baseType: !513, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !570, file: !569, line: 31, baseType: !522, size: 256, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !570, file: !569, line: 32, baseType: !576, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !569, line: 32, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !570, file: !569, line: 37, baseType: !407, size: 16, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !570, file: !569, line: 40, baseType: !580, size: 192, offset: 512)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !581, line: 53, size: 192, elements: !582)
!581 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!582 = !{!583, !584, !585}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !580, file: !581, line: 54, baseType: !511, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !580, file: !581, line: 55, baseType: !325, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !580, file: !581, line: 59, baseType: !312, size: 128, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !570, file: !569, line: 41, baseType: !256, size: 64, offset: 704)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !570, file: !569, line: 42, baseType: !588, size: 64, offset: 768)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !591, line: 13, size: 896, elements: !592)
!591 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !590, file: !591, line: 14, baseType: !256, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !591, line: 15, baseType: !252, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !590, file: !591, line: 17, baseType: !252, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !590, file: !591, line: 17, baseType: !252, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !590, file: !591, line: 19, baseType: !192, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !590, file: !591, line: 21, baseType: !192, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !590, file: !591, line: 22, baseType: !192, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !590, file: !591, line: 23, baseType: !192, size: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !590, file: !591, line: 24, baseType: !192, size: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !590, file: !591, line: 25, baseType: !192, size: 64, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !590, file: !591, line: 26, baseType: !192, size: 64, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !590, file: !591, line: 27, baseType: !192, size: 64, offset: 704)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !590, file: !591, line: 28, baseType: !192, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !590, file: !591, line: 29, baseType: !192, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !570, file: !569, line: 44, baseType: !503, size: 32, offset: 832)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !570, file: !569, line: 50, baseType: !609, size: 16, offset: 864)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !268, line: 19, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !249, line: 24, baseType: !407)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !570, file: !569, line: 51, baseType: !612, size: 16, offset: 880)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !268, line: 18, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !249, line: 23, baseType: !614)
!614 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !475, file: !455, line: 495, baseType: !252, size: 64, offset: 6528)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !475, file: !455, line: 497, baseType: !617, size: 64, offset: 6592)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !455, line: 381, size: 384, elements: !619)
!619 = !{!620, !621, !1510}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !618, file: !455, line: 382, baseType: !503, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !618, file: !455, line: 383, baseType: !622, size: 128, offset: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !455, line: 376, size: 128, elements: !623)
!623 = !{!624, !1508}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !622, file: !455, line: 377, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !627, line: 640, size: 48640, elements: !628)
!627 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!628 = !{!629, !635, !637, !638, !644, !645, !646, !647, !648, !649, !650, !651, !655, !673, !684, !779, !780, !781, !792, !793, !795, !796, !797, !798, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !877, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !933, !935, !936, !937, !949, !951, !952, !953, !954, !955, !961, !962, !963, !964, !965, !966, !967, !979, !984, !989, !990, !991, !994, !998, !1001, !1004, !1007, !1010, !1014, !1017, !1020, !1026, !1027, !1028, !1034, !1035, !1036, !1037, !1038, !1047, !1048, !1049, !1050, !1051, !1056, !1057, !1058, !1061, !1062, !1065, !1068, !1071, !1074, !1077, !1080, !1081, !1161, !1164, !1167, !1168, !1171, !1172, !1173, !1179, !1180, !1181, !1194, !1195, !1196, !1206, !1211, !1214, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !626, file: !627, line: 646, baseType: !630, size: 128)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !631, line: 56, size: 128, elements: !632)
!631 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !631, line: 57, baseType: !252, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !630, file: !631, line: 58, baseType: !267, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !626, file: !627, line: 649, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !626, file: !627, line: 657, baseType: !256, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !626, file: !627, line: 658, baseType: !639, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !640, line: 113, baseType: !641)
!640 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !640, line: 111, size: 32, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !641, file: !640, line: 112, baseType: !503, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !627, line: 660, baseType: !7, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !626, file: !627, line: 661, baseType: !7, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !626, file: !627, line: 684, baseType: !247, size: 32, offset: 352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !626, file: !627, line: 686, baseType: !247, size: 32, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !626, file: !627, line: 687, baseType: !247, size: 32, offset: 416)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !626, file: !627, line: 688, baseType: !247, size: 32, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !626, file: !627, line: 689, baseType: !7, size: 32, offset: 480)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !626, file: !627, line: 691, baseType: !652, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !627, line: 691, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !626, file: !627, line: 692, baseType: !656, size: 832, offset: 576)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !627, line: 451, size: 832, elements: !657)
!657 = !{!658, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !656, file: !627, line: 453, baseType: !659, size: 128)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !627, line: 325, size: 128, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !659, file: !627, line: 326, baseType: !252, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !659, file: !627, line: 327, baseType: !267, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !656, file: !627, line: 454, baseType: !462, size: 192, align: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !656, file: !627, line: 455, baseType: !312, size: 128, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !656, file: !627, line: 456, baseType: !7, size: 32, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !656, file: !627, line: 458, baseType: !483, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !656, file: !627, line: 459, baseType: !483, size: 64, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !656, file: !627, line: 460, baseType: !483, size: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !656, file: !627, line: 461, baseType: !483, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !656, file: !627, line: 463, baseType: !483, size: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !656, file: !627, line: 465, baseType: !672, offset: 832)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !627, line: 415, elements: !339)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !626, file: !627, line: 693, baseType: !674, size: 384, offset: 1408)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !627, line: 489, size: 384, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !674, file: !627, line: 490, baseType: !312, size: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !674, file: !627, line: 491, baseType: !252, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !674, file: !627, line: 492, baseType: !252, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !674, file: !627, line: 493, baseType: !7, size: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !674, file: !627, line: 494, baseType: !407, size: 16, offset: 288)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !674, file: !627, line: 495, baseType: !407, size: 16, offset: 304)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !674, file: !627, line: 497, baseType: !683, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !626, file: !627, line: 697, baseType: !685, size: 1792, offset: 1792)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !627, line: 507, size: 1792, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !776, !777}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !685, file: !627, line: 508, baseType: !462, size: 192, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !685, file: !627, line: 515, baseType: !483, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !685, file: !627, line: 516, baseType: !483, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !685, file: !627, line: 517, baseType: !483, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !685, file: !627, line: 518, baseType: !483, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !685, file: !627, line: 519, baseType: !483, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !685, file: !627, line: 526, baseType: !517, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !685, file: !627, line: 527, baseType: !483, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !685, file: !627, line: 528, baseType: !7, size: 32, offset: 640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !685, file: !627, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !685, file: !627, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !685, file: !627, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !685, file: !627, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !685, file: !627, line: 563, baseType: !701, size: 512, offset: 704)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !112, line: 118, size: 512, elements: !702)
!702 = !{!703, !711, !712, !717, !769, !773, !774, !775}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !701, file: !112, line: 119, baseType: !704, size: 256)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !705, line: 9, size: 256, elements: !706)
!705 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !704, file: !705, line: 10, baseType: !462, size: 192, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !704, file: !705, line: 11, baseType: !709, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !710, line: 29, baseType: !517)
!710 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!711 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !701, file: !112, line: 120, baseType: !709, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !701, file: !112, line: 121, baseType: !713, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!111, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !701, file: !112, line: 122, baseType: !718, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !112, line: 159, size: 512, align: 512, elements: !720)
!720 = !{!721, !741, !742, !745, !755, !756, !764, !768}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !719, file: !112, line: 160, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !112, line: 214, size: 4608, align: 512, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !723, file: !112, line: 215, baseType: !528)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !723, file: !112, line: 216, baseType: !7, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !723, file: !112, line: 217, baseType: !7, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !723, file: !112, line: 218, baseType: !7, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !723, file: !112, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !723, file: !112, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !723, file: !112, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !723, file: !112, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !723, file: !112, line: 233, baseType: !709, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !723, file: !112, line: 234, baseType: !716, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !723, file: !112, line: 235, baseType: !709, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !723, file: !112, line: 236, baseType: !716, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !723, file: !112, line: 237, baseType: !738, size: 4096, offset: 512)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 4096, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !719, file: !112, line: 161, baseType: !7, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !719, file: !112, line: 162, baseType: !743, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !246, line: 27, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !399, line: 96, baseType: !247)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !719, file: !112, line: 163, baseType: !746, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !747, line: 276, baseType: !748)
!747 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !747, line: 276, size: 32, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !748, file: !747, line: 276, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !747, line: 70, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !747, line: 65, size: 32, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !752, file: !747, line: 66, baseType: !7, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !719, file: !112, line: 164, baseType: !716, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !719, file: !112, line: 165, baseType: !757, size: 128, offset: 256)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !705, line: 14, size: 128, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !757, file: !705, line: 15, baseType: !760, size: 128)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !463, line: 125, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !760, file: !463, line: 126, baseType: !479, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !760, file: !463, line: 127, baseType: !467, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !719, file: !112, line: 166, baseType: !765, size: 64, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!709}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !719, file: !112, line: 167, baseType: !709, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !701, file: !112, line: 123, baseType: !770, size: 8, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !268, line: 17, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !249, line: 21, baseType: !772)
!772 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !701, file: !112, line: 124, baseType: !770, size: 8, offset: 456)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !701, file: !112, line: 125, baseType: !770, size: 8, offset: 464)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !701, file: !112, line: 126, baseType: !770, size: 8, offset: 472)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !685, file: !627, line: 572, baseType: !701, size: 512, offset: 1216)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !685, file: !627, line: 580, baseType: !778, size: 64, offset: 1728)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !626, file: !627, line: 721, baseType: !7, size: 32, offset: 3584)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !626, file: !627, line: 722, baseType: !247, size: 32, offset: 3616)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !626, file: !627, line: 723, baseType: !782, size: 64, offset: 3648)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !785, line: 17, baseType: !786)
!785 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !785, line: 17, size: 64, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !786, file: !785, line: 17, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 1)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !626, file: !627, line: 724, baseType: !784, size: 64, offset: 3712)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !626, file: !627, line: 749, baseType: !794, offset: 3776)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !627, line: 290, elements: !339)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !626, file: !627, line: 751, baseType: !312, size: 128, offset: 3776)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !626, file: !627, line: 757, baseType: !471, size: 64, offset: 3904)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !626, file: !627, line: 758, baseType: !471, size: 64, offset: 3968)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !626, file: !627, line: 761, baseType: !799, size: 320, offset: 4032)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !558, line: 34, size: 320, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !799, file: !558, line: 35, baseType: !483, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !799, file: !558, line: 36, baseType: !803, size: 256, offset: 64)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 256, elements: !562)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !626, file: !627, line: 766, baseType: !247, size: 32, offset: 4352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !626, file: !627, line: 767, baseType: !247, size: 32, offset: 4384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !626, file: !627, line: 768, baseType: !247, size: 32, offset: 4416)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !626, file: !627, line: 770, baseType: !247, size: 32, offset: 4448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !626, file: !627, line: 772, baseType: !252, size: 64, offset: 4480)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !626, file: !627, line: 775, baseType: !7, size: 32, offset: 4544)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !626, file: !627, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !626, file: !627, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !626, file: !627, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !626, file: !627, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !626, file: !627, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !626, file: !627, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !626, file: !627, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !626, file: !627, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !626, file: !627, line: 831, baseType: !252, size: 64, offset: 4672)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !626, file: !627, line: 833, baseType: !820, size: 384, offset: 4736)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !117, line: 25, size: 384, elements: !821)
!821 = !{!822, !827}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !820, file: !117, line: 26, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!192, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, scope: !820, file: !117, line: 27, baseType: !828, size: 320, offset: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !820, file: !117, line: 27, size: 320, elements: !829)
!829 = !{!830, !840, !867}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !828, file: !117, line: 36, baseType: !831, size: 320)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !828, file: !117, line: 29, size: 320, elements: !832)
!832 = !{!833, !835, !836, !837, !838, !839}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !831, file: !117, line: 30, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !831, file: !117, line: 31, baseType: !267, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !831, file: !117, line: 32, baseType: !267, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !831, file: !117, line: 33, baseType: !267, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !831, file: !117, line: 34, baseType: !483, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !831, file: !117, line: 35, baseType: !834, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !828, file: !117, line: 46, baseType: !841, size: 192)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !828, file: !117, line: 38, size: 192, elements: !842)
!842 = !{!843, !844, !845, !866}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !841, file: !117, line: 39, baseType: !743, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !841, file: !117, line: 40, baseType: !116, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, scope: !841, file: !117, line: 41, baseType: !846, size: 64, offset: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !117, line: 41, size: 64, elements: !847)
!847 = !{!848, !856}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !846, file: !117, line: 42, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !851, line: 7, size: 128, elements: !852)
!851 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!852 = !{!853, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !850, file: !851, line: 8, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !399, line: 93, baseType: !447)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !850, file: !851, line: 9, baseType: !447, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !846, file: !117, line: 43, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !859, line: 7, size: 64, elements: !860)
!859 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !858, file: !859, line: 8, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !859, line: 5, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !268, line: 20, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !249, line: 26, baseType: !247)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !858, file: !859, line: 9, baseType: !863, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !841, file: !117, line: 45, baseType: !483, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !828, file: !117, line: 54, baseType: !868, size: 256)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !828, file: !117, line: 48, size: 256, elements: !869)
!869 = !{!870, !873, !874, !875, !876}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !868, file: !117, line: 49, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !117, line: 14, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !868, file: !117, line: 50, baseType: !247, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !868, file: !117, line: 51, baseType: !247, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !868, file: !117, line: 52, baseType: !252, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !868, file: !117, line: 53, baseType: !252, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !626, file: !627, line: 835, baseType: !878, size: 32, offset: 5120)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !246, line: 22, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !399, line: 28, baseType: !247)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !626, file: !627, line: 836, baseType: !878, size: 32, offset: 5152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !626, file: !627, line: 840, baseType: !252, size: 64, offset: 5184)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !626, file: !627, line: 849, baseType: !625, size: 64, offset: 5248)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !626, file: !627, line: 852, baseType: !625, size: 64, offset: 5312)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !626, file: !627, line: 857, baseType: !312, size: 128, offset: 5376)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !626, file: !627, line: 858, baseType: !312, size: 128, offset: 5504)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !626, file: !627, line: 859, baseType: !625, size: 64, offset: 5632)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !626, file: !627, line: 867, baseType: !312, size: 128, offset: 5696)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !626, file: !627, line: 868, baseType: !312, size: 128, offset: 5824)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !626, file: !627, line: 871, baseType: !890, size: 64, offset: 5952)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !892, line: 59, size: 768, elements: !893)
!892 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!893 = !{!894, !895, !896, !897, !908, !909, !916, !925}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !891, file: !892, line: 61, baseType: !639, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !891, file: !892, line: 62, baseType: !7, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !891, file: !892, line: 63, baseType: !325, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !891, file: !892, line: 65, baseType: !898, size: 256, offset: 64)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 256, elements: !562)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !246, line: 182, size: 64, elements: !900)
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !899, file: !246, line: 183, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !246, line: 186, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !246, line: 187, baseType: !902, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !903, file: !246, line: 187, baseType: !907, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !891, file: !892, line: 66, baseType: !899, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !891, file: !892, line: 68, baseType: !910, size: 128, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !911, line: 40, baseType: !912)
!911 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !911, line: 36, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !912, file: !911, line: 37, baseType: !325)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !912, file: !911, line: 38, baseType: !312, size: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !891, file: !892, line: 69, baseType: !917, size: 128, align: 64, offset: 512)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !246, line: 216, size: 128, align: 64, elements: !918)
!918 = !{!919, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !917, file: !246, line: 217, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !917, file: !246, line: 218, baseType: !922, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !920}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !891, file: !892, line: 70, baseType: !926, size: 128, offset: 640)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 128, elements: !790)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !892, line: 54, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !927, file: !892, line: 55, baseType: !247, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !927, file: !892, line: 56, baseType: !931, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !892, line: 56, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !626, file: !627, line: 872, baseType: !934, size: 512, offset: 6016)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 512, elements: !562)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !626, file: !627, line: 873, baseType: !312, size: 128, offset: 6528)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !626, file: !627, line: 874, baseType: !312, size: 128, offset: 6656)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !626, file: !627, line: 876, baseType: !938, size: 64, offset: 6784)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !940, line: 26, size: 192, elements: !941)
!940 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !939, file: !940, line: 27, baseType: !7, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !939, file: !940, line: 28, baseType: !944, size: 128, offset: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !945, line: 43, size: 128, elements: !946)
!945 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !944, file: !945, line: 44, baseType: !528)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !944, file: !945, line: 45, baseType: !312, size: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !626, file: !627, line: 879, baseType: !950, size: 64, offset: 6848)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !626, file: !627, line: 882, baseType: !950, size: 64, offset: 6912)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !626, file: !627, line: 884, baseType: !483, size: 64, offset: 6976)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !626, file: !627, line: 885, baseType: !483, size: 64, offset: 7040)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !626, file: !627, line: 890, baseType: !483, size: 64, offset: 7104)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !626, file: !627, line: 891, baseType: !956, size: 128, offset: 7168)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !627, line: 242, size: 128, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !956, file: !627, line: 244, baseType: !483, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !956, file: !627, line: 245, baseType: !483, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !956, file: !627, line: 246, baseType: !528, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !626, file: !627, line: 900, baseType: !252, size: 64, offset: 7296)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !626, file: !627, line: 901, baseType: !252, size: 64, offset: 7360)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !626, file: !627, line: 904, baseType: !483, size: 64, offset: 7424)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !626, file: !627, line: 907, baseType: !483, size: 64, offset: 7488)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !626, file: !627, line: 910, baseType: !252, size: 64, offset: 7552)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !626, file: !627, line: 911, baseType: !252, size: 64, offset: 7616)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !626, file: !627, line: 914, baseType: !968, size: 640, offset: 7680)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !969, line: 123, size: 640, elements: !970)
!969 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!970 = !{!971, !977, !978}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !968, file: !969, line: 124, baseType: !972, size: 576)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 576, elements: !367)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !969, line: 108, size: 192, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !973, file: !969, line: 109, baseType: !483, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !973, file: !969, line: 110, baseType: !757, size: 128, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !968, file: !969, line: 125, baseType: !7, size: 32, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !968, file: !969, line: 126, baseType: !7, size: 32, offset: 608)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !626, file: !627, line: 917, baseType: !980, size: 192, offset: 8320)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !969, line: 134, size: 192, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !980, file: !969, line: 135, baseType: !917, size: 128, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !980, file: !969, line: 136, baseType: !7, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !626, file: !627, line: 923, baseType: !985, size: 64, offset: 8512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !988, line: 11, flags: DIFlagFwdDecl)
!988 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!989 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !626, file: !627, line: 926, baseType: !985, size: 64, offset: 8576)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !626, file: !627, line: 929, baseType: !985, size: 64, offset: 8640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !626, file: !627, line: 933, baseType: !992, size: 64, offset: 8704)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !627, line: 933, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !626, file: !627, line: 943, baseType: !995, size: 128, offset: 8768)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 128, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 16)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !626, file: !627, line: 945, baseType: !999, size: 64, offset: 8896)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !627, line: 49, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !626, file: !627, line: 956, baseType: !1002, size: 64, offset: 8960)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !627, line: 45, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !626, file: !627, line: 959, baseType: !1005, size: 64, offset: 9024)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !627, line: 959, flags: DIFlagFwdDecl)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !626, file: !627, line: 962, baseType: !1008, size: 64, offset: 9088)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !627, line: 66, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !626, file: !627, line: 966, baseType: !1011, size: 64, offset: 9152)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !1013, line: 35, flags: DIFlagFwdDecl)
!1013 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !626, file: !627, line: 969, baseType: !1015, size: 64, offset: 9216)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !969, line: 223, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !626, file: !627, line: 970, baseType: !1018, size: 64, offset: 9280)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !627, line: 62, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !626, file: !627, line: 971, baseType: !1021, size: 64, offset: 9344)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !1022, line: 25, baseType: !1023)
!1022 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1022, line: 23, size: 64, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1023, file: !1022, line: 24, baseType: !789, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !626, file: !627, line: 972, baseType: !1021, size: 64, offset: 9408)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !626, file: !627, line: 974, baseType: !1021, size: 64, offset: 9472)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !626, file: !627, line: 975, baseType: !1029, size: 192, offset: 9536)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !1030, line: 30, size: 192, elements: !1031)
!1030 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1029, file: !1030, line: 31, baseType: !312, size: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1029, file: !1030, line: 32, baseType: !1021, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !626, file: !627, line: 976, baseType: !252, size: 64, offset: 9728)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !626, file: !627, line: 977, baseType: !412, size: 64, offset: 9792)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !626, file: !627, line: 978, baseType: !7, size: 32, offset: 9856)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !626, file: !627, line: 980, baseType: !920, size: 64, offset: 9920)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !626, file: !627, line: 989, baseType: !1039, size: 128, offset: 9984)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !1040, line: 35, size: 128, elements: !1041)
!1040 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1039, file: !1040, line: 36, baseType: !247, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !1039, file: !1040, line: 37, baseType: !503, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1039, file: !1040, line: 38, baseType: !1045, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !1040, line: 23, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !626, file: !627, line: 992, baseType: !483, size: 64, offset: 10112)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !626, file: !627, line: 993, baseType: !483, size: 64, offset: 10176)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !626, file: !627, line: 996, baseType: !325, offset: 10240)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !626, file: !627, line: 999, baseType: !528, offset: 10240)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !626, file: !627, line: 1001, baseType: !1052, size: 64, offset: 10240)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !627, line: 636, size: 64, elements: !1053)
!1053 = !{!1054}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !627, line: 637, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !626, file: !627, line: 1005, baseType: !760, size: 128, offset: 10304)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !626, file: !627, line: 1007, baseType: !625, size: 64, offset: 10432)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !626, file: !627, line: 1009, baseType: !1059, size: 64, offset: 10496)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !627, line: 1009, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !626, file: !627, line: 1043, baseType: !256, size: 64, offset: 10560)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !626, file: !627, line: 1046, baseType: !1063, size: 64, offset: 10624)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !627, line: 41, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !626, file: !627, line: 1050, baseType: !1066, size: 64, offset: 10688)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !627, line: 42, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !626, file: !627, line: 1054, baseType: !1069, size: 64, offset: 10752)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !627, line: 55, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !626, file: !627, line: 1056, baseType: !1072, size: 64, offset: 10816)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !627, line: 40, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !626, file: !627, line: 1058, baseType: !1075, size: 64, offset: 10880)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !627, line: 47, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !626, file: !627, line: 1061, baseType: !1078, size: 64, offset: 10944)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !627, line: 43, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !626, file: !627, line: 1064, baseType: !252, size: 64, offset: 11008)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !626, file: !627, line: 1065, baseType: !1082, size: 64, offset: 11072)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !1030, line: 14, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !1030, line: 12, size: 384, elements: !1085)
!1085 = !{!1086}
!1086 = !DIDerivedType(tag: DW_TAG_member, scope: !1084, file: !1030, line: 13, baseType: !1087, size: 384)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1084, file: !1030, line: 13, size: 384, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1087, file: !1030, line: 13, baseType: !247, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1087, file: !1030, line: 13, baseType: !247, size: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1087, file: !1030, line: 13, baseType: !247, size: 32, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1087, file: !1030, line: 13, baseType: !1093, size: 256, offset: 128)
!1093 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !1094, line: 32, size: 256, elements: !1095)
!1094 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!1095 = !{!1096, !1102, !1115, !1121, !1130, !1150, !1155}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1093, file: !1094, line: 37, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1093, file: !1094, line: 34, size: 64, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1097, file: !1094, line: 35, baseType: !879, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1097, file: !1094, line: 36, baseType: !1101, size: 32, offset: 32)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !399, line: 49, baseType: !7)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1093, file: !1094, line: 45, baseType: !1103, size: 192)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1093, file: !1094, line: 40, size: 192, elements: !1104)
!1104 = !{!1105, !1107, !1108, !1114}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !1103, file: !1094, line: 41, baseType: !1106, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !399, line: 95, baseType: !247)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !1103, file: !1094, line: 42, baseType: !247, size: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !1103, file: !1094, line: 43, baseType: !1109, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1094, line: 11, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1094, line: 8, size: 64, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1110, file: !1094, line: 9, baseType: !247, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1110, file: !1094, line: 10, baseType: !256, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !1103, file: !1094, line: 44, baseType: !247, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1093, file: !1094, line: 52, baseType: !1116, size: 128)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1093, file: !1094, line: 48, size: 128, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1116, file: !1094, line: 49, baseType: !879, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1116, file: !1094, line: 50, baseType: !1101, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !1116, file: !1094, line: 51, baseType: !1109, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1093, file: !1094, line: 61, baseType: !1122, size: 256)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1093, file: !1094, line: 55, size: 256, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1129}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1122, file: !1094, line: 56, baseType: !879, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1122, file: !1094, line: 57, baseType: !1101, size: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !1122, file: !1094, line: 58, baseType: !247, size: 32, offset: 64)
