; ModuleID = '../bcout/drivers/watchdog/sirfsoc_wdt.llvm.bc'
source_filename = "drivers/watchdog/sirfsoc_wdt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_sirfsoc_wdt_driver_init6:\09\09\09"
module asm ".long\09sirfsoc_wdt_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!3 = !DIFile(filename: "drivers/watchdog/sirfsoc_wdt.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 10, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!55 = !{!56, !59, !60, !61, !62, !64, !67}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !58, line: 76, flags: DIFlagFwdDecl)
!58 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!69 = !{!70, !138, !143, !145, !150, !155, !160, !162, !169, !174, !179, !184, !189, !194, !0, !196, !201, !206, !2230, !2309, !2311, !2313, !2316}
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "__param_timeout", scope: !2, file: !3, line: 34, type: !72, isLocal: true, isDefinition: true, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !74, line: 69, size: 320, elements: !75)
!74 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76, !79, !80, !101, !108, !112, !116}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !73, file: !74, line: 70, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !73, file: !74, line: 71, baseType: !56, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !73, file: !74, line: 72, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !74, line: 47, size: 256, elements: !84)
!84 = !{!85, !86, !92, !97}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !83, file: !74, line: 49, baseType: !7, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !83, file: !74, line: 51, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !77, !91}
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !83, file: !74, line: 53, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!90, !96, !91}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !83, file: !74, line: 55, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !59}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !73, file: !74, line: 73, baseType: !102, size: 16, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !104, line: 19, baseType: !105)
!104 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !106, line: 24, baseType: !107)
!106 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!107 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !73, file: !74, line: 74, baseType: !109, size: 8, offset: 208)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !104, line: 16, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !106, line: 20, baseType: !111)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !74, line: 75, baseType: !113, size: 8, offset: 216)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !104, line: 17, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !106, line: 21, baseType: !115)
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, scope: !73, file: !74, line: 76, baseType: !117, size: 64, offset: 256)
!117 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !73, file: !74, line: 76, size: 64, elements: !118)
!118 = !{!119, !120, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !117, file: !74, line: 77, baseType: !59, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !117, file: !74, line: 78, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !74, line: 86, size: 128, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !123, file: !74, line: 87, baseType: !7, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !123, file: !74, line: 88, baseType: !96, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !117, file: !74, line: 79, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !74, line: 92, size: 256, elements: !131)
!131 = !{!132, !133, !134, !136, !137}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !130, file: !74, line: 94, baseType: !7, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !130, file: !74, line: 95, baseType: !7, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !130, file: !74, line: 96, baseType: !135, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !130, file: !74, line: 97, baseType: !81, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !130, file: !74, line: 98, baseType: !59, size: 64, offset: 192)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_timeouttype163", scope: !2, file: !3, line: 34, type: !140, isLocal: true, isDefinition: true, align: 8)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 272, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 34)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__param_nowayout", scope: !2, file: !3, line: 35, type: !72, isLocal: true, isDefinition: true, align: 64)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_nowayouttype164", scope: !2, file: !3, line: 35, type: !147, isLocal: true, isDefinition: true, align: 8)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 280, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 35)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_timeout165", scope: !2, file: !3, line: 37, type: !152, isLocal: true, isDefinition: true, align: 8)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 504, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 63)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_nowayout166", scope: !2, file: !3, line: 38, type: !157, isLocal: true, isDefinition: true, align: 8)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 624, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 78)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_sirfsoc_wdt_driver_init167", scope: !2, file: !3, line: 211, type: !59, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "__exitcall_sirfsoc_wdt_driver_exit", scope: !2, file: !3, line: 211, type: !164, isLocal: true, isDefinition: true)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !165, line: 117, baseType: !166)
!165 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null}
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description168", scope: !2, file: !3, line: 213, type: !171, isLocal: true, isDefinition: true, align: 8)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 392, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 49)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author169", scope: !2, file: !3, line: 214, type: !176, isLocal: true, isDefinition: true, align: 8)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 440, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 55)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file170", scope: !2, file: !3, line: 215, type: !181, isLocal: true, isDefinition: true, align: 8)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 368, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 46)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license171", scope: !2, file: !3, line: 215, type: !186, isLocal: true, isDefinition: true, align: 8)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 216, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 27)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_alias172", scope: !2, file: !3, line: 216, type: !191, isLocal: true, isDefinition: true, align: 8)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 312, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 39)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "timeout", scope: !2, file: !3, line: 31, type: !7, isLocal: true, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "__param_str_nowayout", scope: !2, file: !3, line: 35, type: !198, isLocal: true, isDefinition: true)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 168, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 21)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "nowayout", scope: !2, file: !3, line: 32, type: !203, isLocal: true, isDefinition: true)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !204, line: 30, baseType: !205)
!204 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "sirfsoc_wdt_driver", scope: !2, file: !3, line: 203, type: !208, isLocal: true, isDefinition: true)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "platform_driver", file: !209, line: 200, size: 1600, elements: !210)
!209 = !DIFile(filename: "./include/linux/platform_device.h", directory: "/home/lizy2001/genbc/linux")
!210 = !{!211, !2217, !2218, !2222, !2226, !2227, !2228, !2229}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !208, file: !209, line: 201, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!90, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "platform_device", file: !209, line: 22, size: 6208, elements: !217)
!217 = !{!218, !219, !220, !221, !2186, !2187, !2188, !2189, !2203, !2211, !2212, !2215}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !209, line: 23, baseType: !77, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !209, line: 24, baseType: !90, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id_auto", scope: !216, file: !209, line: 25, baseType: !203, size: 8, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !216, file: !209, line: 26, baseType: !222, size: 5568, offset: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !223)
!223 = !{!224, !1712, !1714, !1717, !1718, !1769, !1863, !1864, !1865, !1866, !1867, !1876, !1981, !1994, !1997, !1998, !2002, !2004, !2005, !2006, !2010, !2016, !2017, !2020, !2135, !2136, !2139, !2140, !2141, !2142, !2174, !2175, !2176, !2179, !2182, !2183, !2184, !2185}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !222, file: !30, line: 462, baseType: !225, size: 512)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !226, line: 64, size: 512, elements: !227)
!226 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!227 = !{!228, !229, !235, !237, !296, !1548, !1702, !1707, !1708, !1709, !1710, !1711}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !226, line: 65, baseType: !77, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !225, file: !226, line: 66, baseType: !230, size: 128, offset: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !204, line: 178, size: 128, elements: !231)
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !204, line: 179, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !230, file: !204, line: 179, baseType: !233, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !225, file: !226, line: 67, baseType: !236, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !225, file: !226, line: 68, baseType: !238, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !226, line: 192, size: 704, elements: !240)
!240 = !{!241, !242, !258, !259}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !239, file: !226, line: 193, baseType: !230, size: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !239, file: !226, line: 194, baseType: !243, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !244, line: 83, baseType: !245)
!244 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !244, line: 71, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !244, line: 72, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !245, file: !244, line: 72, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !248, file: !244, line: 73, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !244, line: 20, elements: !252)
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !251, file: !244, line: 21, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !255, line: 25, baseType: !256)
!255 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !255, line: 25, elements: !257)
!257 = !{}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !239, file: !226, line: 195, baseType: !225, size: 512, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !239, file: !226, line: 196, baseType: !260, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !226, line: 156, size: 192, elements: !263)
!263 = !{!264, !269, !274}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !262, file: !226, line: 157, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!90, !238, !236}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !226, line: 158, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!77, !238, !236}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !262, file: !226, line: 159, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!90, !238, !236, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !226, line: 148, size: 20736, elements: !281)
!281 = !{!282, !286, !290, !291, !295}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !280, file: !226, line: 149, baseType: !283, size: 192)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 192, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 3)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !280, file: !226, line: 150, baseType: !287, size: 4096, offset: 192)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 4096, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !280, file: !226, line: 151, baseType: !90, size: 32, offset: 4288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !280, file: !226, line: 152, baseType: !292, size: 16384, offset: 4320)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 16384, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 2048)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !280, file: !226, line: 153, baseType: !90, size: 32, offset: 20704)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !225, file: !226, line: 69, baseType: !297, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !226, line: 138, size: 448, elements: !299)
!299 = !{!300, !304, !331, !333, !1499, !1527, !1531}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !298, file: !226, line: 139, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !236}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !298, file: !226, line: 140, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !308, line: 230, size: 128, elements: !309)
!308 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!309 = !{!310, !324}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !307, file: !308, line: 231, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!314, !236, !318, !96}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !204, line: 60, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !316, line: 73, baseType: !317)
!316 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !316, line: 15, baseType: !61)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !308, line: 30, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !319, file: !308, line: 31, baseType: !77, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !319, file: !308, line: 32, baseType: !323, size: 16, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !204, line: 19, baseType: !107)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !307, file: !308, line: 232, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!314, !236, !318, !77, !328}
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !204, line: 55, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !316, line: 72, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !316, line: 16, baseType: !60)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !298, file: !226, line: 141, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !298, file: !226, line: 142, baseType: !334, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !308, line: 84, size: 320, elements: !338)
!338 = !{!339, !340, !344, !1496, !1497}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !308, line: 85, baseType: !77, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !337, file: !308, line: 86, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!323, !236, !318, !90}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !337, file: !308, line: 88, baseType: !345, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!323, !236, !348, !90}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !308, line: 168, size: 448, elements: !350)
!350 = !{!351, !352, !353, !354, !364, !365}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !349, file: !308, line: 169, baseType: !319, size: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !308, line: 170, baseType: !328, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !349, file: !308, line: 171, baseType: !59, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !349, file: !308, line: 172, baseType: !355, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!314, !358, !236, !348, !96, !361, !328}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !360, line: 526, flags: DIFlagFwdDecl)
!360 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !204, line: 46, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !316, line: 88, baseType: !363)
!363 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !349, file: !308, line: 174, baseType: !355, size: 64, offset: 320)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !349, file: !308, line: 176, baseType: !366, size: 64, offset: 384)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!90, !358, !236, !348, !369}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !371, line: 305, size: 1472, elements: !372)
!371 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!372 = !{!373, !374, !375, !376, !377, !385, !386, !1470, !1476, !1477, !1482, !1483, !1486, !1490, !1491, !1492, !1493, !1494}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !370, file: !371, line: 308, baseType: !60, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !370, file: !371, line: 309, baseType: !60, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !370, file: !371, line: 313, baseType: !369, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !370, file: !371, line: 313, baseType: !369, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !370, file: !371, line: 315, baseType: !378, size: 192, align: 64, offset: 256)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !379, line: 24, size: 192, align: 64, elements: !380)
!379 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!380 = !{!381, !382, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !378, file: !379, line: 25, baseType: !60, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !378, file: !379, line: 26, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !378, file: !379, line: 27, baseType: !383, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !370, file: !371, line: 323, baseType: !60, size: 64, offset: 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !370, file: !371, line: 327, baseType: !387, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !371, line: 388, size: 7296, elements: !389)
!389 = !{!390, !1466}
!390 = !DIDerivedType(tag: DW_TAG_member, scope: !388, file: !371, line: 389, baseType: !391, size: 7296)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !371, line: 389, size: 7296, elements: !392)
!392 = !{!393, !394, !398, !402, !406, !407, !408, !409, !410, !418, !423, !424, !425, !426, !435, !436, !437, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !472, !480, !483, !529, !530, !1436, !1437, !1440, !1444, !1445, !1448, !1449, !1450, !1453, !1465}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !391, file: !371, line: 390, baseType: !369, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !391, file: !371, line: 391, baseType: !395, size: 64, offset: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !379, line: 31, size: 64, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !395, file: !379, line: 32, baseType: !383, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !391, file: !371, line: 392, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !104, line: 23, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !106, line: 31, baseType: !401)
!401 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !391, file: !371, line: 394, baseType: !403, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{!60, !358, !60, !60, !60, !60}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !391, file: !371, line: 398, baseType: !60, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !391, file: !371, line: 399, baseType: !60, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !391, file: !371, line: 405, baseType: !60, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !391, file: !371, line: 406, baseType: !60, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !391, file: !371, line: 407, baseType: !411, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !360, line: 286, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 286, size: 64, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !413, file: !360, line: 286, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !417, line: 18, baseType: !60)
!417 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!418 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !391, file: !371, line: 416, baseType: !419, size: 32, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !204, line: 168, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 166, size: 32, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !420, file: !204, line: 167, baseType: !90, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !391, file: !371, line: 428, baseType: !419, size: 32, offset: 608)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !391, file: !371, line: 437, baseType: !419, size: 32, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !391, file: !371, line: 447, baseType: !419, size: 32, offset: 672)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !391, file: !371, line: 450, baseType: !427, size: 64, offset: 704)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !428, line: 13, baseType: !429)
!428 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !204, line: 175, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !204, line: 173, size: 64, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !430, file: !204, line: 174, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !104, line: 22, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !106, line: 30, baseType: !363)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !391, file: !371, line: 452, baseType: !90, size: 32, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !391, file: !371, line: 454, baseType: !243, offset: 800)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !391, file: !371, line: 457, baseType: !438, size: 256, offset: 832)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !439, line: 35, size: 256, elements: !440)
!439 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!440 = !{!441, !442, !443, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !438, file: !439, line: 36, baseType: !427, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !438, file: !439, line: 42, baseType: !427, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !438, file: !439, line: 46, baseType: !444, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !244, line: 29, baseType: !251)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !438, file: !439, line: 47, baseType: !230, size: 128, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !391, file: !371, line: 459, baseType: !230, size: 128, offset: 1088)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !391, file: !371, line: 466, baseType: !60, size: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !391, file: !371, line: 467, baseType: !60, size: 64, offset: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !391, file: !371, line: 469, baseType: !60, size: 64, offset: 1344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !391, file: !371, line: 470, baseType: !60, size: 64, offset: 1408)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !391, file: !371, line: 471, baseType: !429, size: 64, offset: 1472)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !391, file: !371, line: 472, baseType: !60, size: 64, offset: 1536)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !391, file: !371, line: 473, baseType: !60, size: 64, offset: 1600)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !391, file: !371, line: 474, baseType: !60, size: 64, offset: 1664)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !391, file: !371, line: 475, baseType: !60, size: 64, offset: 1728)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !391, file: !371, line: 477, baseType: !243, offset: 1792)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !391, file: !371, line: 478, baseType: !60, size: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !391, file: !371, line: 478, baseType: !60, size: 64, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !391, file: !371, line: 478, baseType: !60, size: 64, offset: 1920)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !391, file: !371, line: 478, baseType: !60, size: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !391, file: !371, line: 479, baseType: !60, size: 64, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !391, file: !371, line: 479, baseType: !60, size: 64, offset: 2112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !391, file: !371, line: 479, baseType: !60, size: 64, offset: 2176)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !391, file: !371, line: 480, baseType: !60, size: 64, offset: 2240)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !391, file: !371, line: 480, baseType: !60, size: 64, offset: 2304)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !391, file: !371, line: 480, baseType: !60, size: 64, offset: 2368)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !391, file: !371, line: 480, baseType: !60, size: 64, offset: 2432)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !391, file: !371, line: 482, baseType: !469, size: 2816, offset: 2496)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2816, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 44)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !391, file: !371, line: 488, baseType: !473, size: 256, offset: 5312)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !474, line: 60, size: 256, elements: !475)
!474 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !473, file: !474, line: 61, baseType: !477, size: 256)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 256, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 4)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !391, file: !371, line: 490, baseType: !481, size: 64, offset: 5568)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !371, line: 490, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !391, file: !371, line: 493, baseType: !484, size: 896, offset: 5632)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !485, line: 53, baseType: !486)
!485 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 13, size: 896, elements: !487)
!487 = !{!488, !489, !490, !491, !494, !495, !502, !503, !523, !524, !525}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !486, file: !485, line: 18, baseType: !399, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !486, file: !485, line: 28, baseType: !429, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !486, file: !485, line: 31, baseType: !438, size: 256, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !486, file: !485, line: 32, baseType: !492, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !485, line: 32, flags: DIFlagFwdDecl)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !486, file: !485, line: 37, baseType: !107, size: 16, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !486, file: !485, line: 40, baseType: !496, size: 192, offset: 512)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !497, line: 53, size: 192, elements: !498)
!497 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !496, file: !497, line: 54, baseType: !427, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !496, file: !497, line: 55, baseType: !243, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !496, file: !497, line: 59, baseType: !230, size: 128, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !486, file: !485, line: 41, baseType: !59, size: 64, offset: 704)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !486, file: !485, line: 42, baseType: !504, size: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !507, line: 13, size: 896, elements: !508)
!507 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !506, file: !507, line: 14, baseType: !59, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !507, line: 15, baseType: !60, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !506, file: !507, line: 17, baseType: !60, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !506, file: !507, line: 17, baseType: !60, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !506, file: !507, line: 19, baseType: !61, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !506, file: !507, line: 21, baseType: !61, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !506, file: !507, line: 22, baseType: !61, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !506, file: !507, line: 23, baseType: !61, size: 64, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !506, file: !507, line: 24, baseType: !61, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !506, file: !507, line: 25, baseType: !61, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !506, file: !507, line: 26, baseType: !61, size: 64, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !506, file: !507, line: 27, baseType: !61, size: 64, offset: 704)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !506, file: !507, line: 28, baseType: !61, size: 64, offset: 768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !506, file: !507, line: 29, baseType: !61, size: 64, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !486, file: !485, line: 44, baseType: !419, size: 32, offset: 832)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !486, file: !485, line: 50, baseType: !103, size: 16, offset: 864)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !486, file: !485, line: 51, baseType: !526, size: 16, offset: 880)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !104, line: 18, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !106, line: 23, baseType: !528)
!528 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !371, line: 495, baseType: !60, size: 64, offset: 6528)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !391, file: !371, line: 497, baseType: !531, size: 64, offset: 6592)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !371, line: 381, size: 384, elements: !533)
!533 = !{!534, !535, !1435}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !532, file: !371, line: 382, baseType: !419, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !532, file: !371, line: 383, baseType: !536, size: 128, offset: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !371, line: 376, size: 128, elements: !537)
!537 = !{!538, !1433}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !536, file: !371, line: 377, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !541, line: 640, size: 48640, elements: !542)
!541 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!542 = !{!543, !551, !552, !553, !559, !560, !561, !562, !563, !564, !565, !566, !570, !588, !599, !691, !692, !693, !704, !705, !707, !708, !709, !710, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !789, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !845, !847, !848, !849, !861, !863, !864, !865, !866, !867, !873, !874, !875, !876, !877, !878, !879, !891, !896, !901, !902, !903, !906, !910, !913, !916, !919, !922, !926, !929, !932, !938, !939, !940, !946, !947, !948, !949, !950, !959, !960, !961, !962, !963, !968, !969, !970, !973, !974, !977, !980, !983, !986, !989, !992, !993, !1073, !1076, !1079, !1080, !1083, !1084, !1085, !1091, !1092, !1093, !1106, !1107, !1108, !1118, !1123, !1126, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !540, file: !541, line: 646, baseType: !544, size: 128)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !545, line: 56, size: 128, elements: !546)
!545 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !545, line: 57, baseType: !60, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !544, file: !545, line: 58, baseType: !549, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !104, line: 21, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !106, line: 27, baseType: !7)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !540, file: !541, line: 649, baseType: !68, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !540, file: !541, line: 657, baseType: !59, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !540, file: !541, line: 658, baseType: !554, size: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !555, line: 113, baseType: !556)
!555 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !555, line: 111, size: 32, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !556, file: !555, line: 112, baseType: !419, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !541, line: 660, baseType: !7, size: 32, offset: 288)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !540, file: !541, line: 661, baseType: !7, size: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !540, file: !541, line: 684, baseType: !90, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !540, file: !541, line: 686, baseType: !90, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !540, file: !541, line: 687, baseType: !90, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !540, file: !541, line: 688, baseType: !90, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !540, file: !541, line: 689, baseType: !7, size: 32, offset: 480)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !540, file: !541, line: 691, baseType: !567, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !541, line: 691, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !540, file: !541, line: 692, baseType: !571, size: 832, offset: 576)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !541, line: 451, size: 832, elements: !572)
!572 = !{!573, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !571, file: !541, line: 453, baseType: !574, size: 128)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !541, line: 325, size: 128, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !574, file: !541, line: 326, baseType: !60, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !574, file: !541, line: 327, baseType: !549, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !571, file: !541, line: 454, baseType: !378, size: 192, align: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !571, file: !541, line: 455, baseType: !230, size: 128, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !571, file: !541, line: 456, baseType: !7, size: 32, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !571, file: !541, line: 458, baseType: !399, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !571, file: !541, line: 459, baseType: !399, size: 64, offset: 576)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !571, file: !541, line: 460, baseType: !399, size: 64, offset: 640)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !571, file: !541, line: 461, baseType: !399, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !571, file: !541, line: 463, baseType: !399, size: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !571, file: !541, line: 465, baseType: !587, offset: 832)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !541, line: 415, elements: !257)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !540, file: !541, line: 693, baseType: !589, size: 384, offset: 1408)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !541, line: 489, size: 384, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !589, file: !541, line: 490, baseType: !230, size: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !589, file: !541, line: 491, baseType: !60, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !589, file: !541, line: 492, baseType: !60, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !589, file: !541, line: 493, baseType: !7, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !589, file: !541, line: 494, baseType: !107, size: 16, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !589, file: !541, line: 495, baseType: !107, size: 16, offset: 304)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !589, file: !541, line: 497, baseType: !598, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !540, file: !541, line: 697, baseType: !600, size: 1792, offset: 1792)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !541, line: 507, size: 1792, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !688, !689}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !600, file: !541, line: 508, baseType: !378, size: 192, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !600, file: !541, line: 515, baseType: !399, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !600, file: !541, line: 516, baseType: !399, size: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !600, file: !541, line: 517, baseType: !399, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !600, file: !541, line: 518, baseType: !399, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !600, file: !541, line: 519, baseType: !399, size: 64, offset: 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !600, file: !541, line: 526, baseType: !433, size: 64, offset: 512)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !600, file: !541, line: 527, baseType: !399, size: 64, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !600, file: !541, line: 528, baseType: !7, size: 32, offset: 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !600, file: !541, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !600, file: !541, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !600, file: !541, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !600, file: !541, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !600, file: !541, line: 563, baseType: !616, size: 512, offset: 704)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !617)
!617 = !{!618, !626, !627, !632, !684, !685, !686, !687}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !616, file: !6, line: 119, baseType: !619, size: 256)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !620, line: 9, size: 256, elements: !621)
!620 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !619, file: !620, line: 10, baseType: !378, size: 192, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !619, file: !620, line: 11, baseType: !624, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !625, line: 29, baseType: !433)
!625 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !616, file: !6, line: 120, baseType: !624, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !616, file: !6, line: 121, baseType: !628, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!5, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !616, file: !6, line: 122, baseType: !633, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !635)
!635 = !{!636, !656, !657, !660, !670, !671, !679, !683}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !634, file: !6, line: 160, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !638, file: !6, line: 215, baseType: !444)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !638, file: !6, line: 216, baseType: !7, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !638, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !638, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !638, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !638, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !638, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !638, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !638, file: !6, line: 233, baseType: !624, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !638, file: !6, line: 234, baseType: !631, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !638, file: !6, line: 235, baseType: !624, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !638, file: !6, line: 236, baseType: !631, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !638, file: !6, line: 237, baseType: !653, size: 4096, offset: 512)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 4096, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 8)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !634, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !634, file: !6, line: 162, baseType: !658, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !204, line: 27, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !316, line: 96, baseType: !90)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !634, file: !6, line: 163, baseType: !661, size: 32, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !662, line: 276, baseType: !663)
!662 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !662, line: 276, size: 32, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !663, file: !662, line: 276, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !662, line: 70, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !662, line: 65, size: 32, elements: !668)
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !667, file: !662, line: 66, baseType: !7, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !634, file: !6, line: 164, baseType: !631, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !634, file: !6, line: 165, baseType: !672, size: 128, offset: 256)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !620, line: 14, size: 128, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !672, file: !620, line: 15, baseType: !675, size: 128)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !379, line: 125, size: 128, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !675, file: !379, line: 126, baseType: !395, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !675, file: !379, line: 127, baseType: !383, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !634, file: !6, line: 166, baseType: !680, size: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!624}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !634, file: !6, line: 167, baseType: !624, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !616, file: !6, line: 123, baseType: !113, size: 8, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !616, file: !6, line: 124, baseType: !113, size: 8, offset: 456)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !616, file: !6, line: 125, baseType: !113, size: 8, offset: 464)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !616, file: !6, line: 126, baseType: !113, size: 8, offset: 472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !600, file: !541, line: 572, baseType: !616, size: 512, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !600, file: !541, line: 580, baseType: !690, size: 64, offset: 1728)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !540, file: !541, line: 721, baseType: !7, size: 32, offset: 3584)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !540, file: !541, line: 722, baseType: !90, size: 32, offset: 3616)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !540, file: !541, line: 723, baseType: !694, size: 64, offset: 3648)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !697, line: 17, baseType: !698)
!697 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !697, line: 17, size: 64, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !698, file: !697, line: 17, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 64, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 1)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !540, file: !541, line: 724, baseType: !696, size: 64, offset: 3712)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !540, file: !541, line: 749, baseType: !706, offset: 3776)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !541, line: 290, elements: !257)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !540, file: !541, line: 751, baseType: !230, size: 128, offset: 3776)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !540, file: !541, line: 757, baseType: !387, size: 64, offset: 3904)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !540, file: !541, line: 758, baseType: !387, size: 64, offset: 3968)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !540, file: !541, line: 761, baseType: !711, size: 320, offset: 4032)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !474, line: 34, size: 320, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !711, file: !474, line: 35, baseType: !399, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !711, file: !474, line: 36, baseType: !715, size: 256, offset: 64)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 256, elements: !478)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !540, file: !541, line: 766, baseType: !90, size: 32, offset: 4352)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !540, file: !541, line: 767, baseType: !90, size: 32, offset: 4384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !540, file: !541, line: 768, baseType: !90, size: 32, offset: 4416)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !540, file: !541, line: 770, baseType: !90, size: 32, offset: 4448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !540, file: !541, line: 772, baseType: !60, size: 64, offset: 4480)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !540, file: !541, line: 775, baseType: !7, size: 32, offset: 4544)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !540, file: !541, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !540, file: !541, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !540, file: !541, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !540, file: !541, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !540, file: !541, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !540, file: !541, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !540, file: !541, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !540, file: !541, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !540, file: !541, line: 831, baseType: !60, size: 64, offset: 4672)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !540, file: !541, line: 833, baseType: !732, size: 384, offset: 4736)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !733)
!733 = !{!734, !739}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !732, file: !12, line: 26, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!61, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, scope: !732, file: !12, line: 27, baseType: !740, size: 320, offset: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !732, file: !12, line: 27, size: 320, elements: !741)
!741 = !{!742, !752, !779}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !740, file: !12, line: 36, baseType: !743, size: 320)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !12, line: 29, size: 320, elements: !744)
!744 = !{!745, !747, !748, !749, !750, !751}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !743, file: !12, line: 30, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !743, file: !12, line: 31, baseType: !549, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !743, file: !12, line: 32, baseType: !549, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !743, file: !12, line: 33, baseType: !549, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !743, file: !12, line: 34, baseType: !399, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !743, file: !12, line: 35, baseType: !746, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !740, file: !12, line: 46, baseType: !753, size: 192)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !12, line: 38, size: 192, elements: !754)
!754 = !{!755, !756, !757, !778}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !753, file: !12, line: 39, baseType: !658, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, scope: !753, file: !12, line: 41, baseType: !758, size: 64, offset: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !753, file: !12, line: 41, size: 64, elements: !759)
!759 = !{!760, !768}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !758, file: !12, line: 42, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !763, line: 7, size: 128, elements: !764)
!763 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!764 = !{!765, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !762, file: !763, line: 8, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !316, line: 93, baseType: !363)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !762, file: !763, line: 9, baseType: !363, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !758, file: !12, line: 43, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !771, line: 7, size: 64, elements: !772)
!771 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!772 = !{!773, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !770, file: !771, line: 8, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !771, line: 5, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !104, line: 20, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !106, line: 26, baseType: !90)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !770, file: !771, line: 9, baseType: !775, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !753, file: !12, line: 45, baseType: !399, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !740, file: !12, line: 54, baseType: !780, size: 256)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !12, line: 48, size: 256, elements: !781)
!781 = !{!782, !785, !786, !787, !788}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !780, file: !12, line: 49, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !780, file: !12, line: 50, baseType: !90, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !780, file: !12, line: 51, baseType: !90, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !780, file: !12, line: 52, baseType: !60, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !780, file: !12, line: 53, baseType: !60, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !540, file: !541, line: 835, baseType: !790, size: 32, offset: 5120)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !204, line: 22, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !316, line: 28, baseType: !90)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !540, file: !541, line: 836, baseType: !790, size: 32, offset: 5152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !540, file: !541, line: 840, baseType: !60, size: 64, offset: 5184)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !540, file: !541, line: 849, baseType: !539, size: 64, offset: 5248)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !540, file: !541, line: 852, baseType: !539, size: 64, offset: 5312)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !540, file: !541, line: 857, baseType: !230, size: 128, offset: 5376)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !540, file: !541, line: 858, baseType: !230, size: 128, offset: 5504)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !540, file: !541, line: 859, baseType: !539, size: 64, offset: 5632)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !540, file: !541, line: 867, baseType: !230, size: 128, offset: 5696)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !540, file: !541, line: 868, baseType: !230, size: 128, offset: 5824)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !540, file: !541, line: 871, baseType: !802, size: 64, offset: 5952)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !804, line: 59, size: 768, elements: !805)
!804 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!805 = !{!806, !807, !808, !809, !820, !821, !828, !837}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !803, file: !804, line: 61, baseType: !554, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !803, file: !804, line: 62, baseType: !7, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !803, file: !804, line: 63, baseType: !243, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !803, file: !804, line: 65, baseType: !810, size: 256, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 256, elements: !478)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !204, line: 182, size: 64, elements: !812)
!812 = !{!813}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !811, file: !204, line: 183, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !204, line: 186, size: 128, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !815, file: !204, line: 187, baseType: !814, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !815, file: !204, line: 187, baseType: !819, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !803, file: !804, line: 66, baseType: !811, size: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !803, file: !804, line: 68, baseType: !822, size: 128, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !823, line: 40, baseType: !824)
!823 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !823, line: 36, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !824, file: !823, line: 37, baseType: !243)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !824, file: !823, line: 38, baseType: !230, size: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !803, file: !804, line: 69, baseType: !829, size: 128, align: 64, offset: 512)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !204, line: 216, size: 128, align: 64, elements: !830)
!830 = !{!831, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !204, line: 217, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !829, file: !204, line: 218, baseType: !834, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !832}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !803, file: !804, line: 70, baseType: !838, size: 128, offset: 640)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 128, elements: !702)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !804, line: 54, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !839, file: !804, line: 55, baseType: !90, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !839, file: !804, line: 56, baseType: !843, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !804, line: 56, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !540, file: !541, line: 872, baseType: !846, size: 512, offset: 6016)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 512, elements: !478)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !540, file: !541, line: 873, baseType: !230, size: 128, offset: 6528)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !540, file: !541, line: 874, baseType: !230, size: 128, offset: 6656)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !540, file: !541, line: 876, baseType: !850, size: 64, offset: 6784)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !852, line: 26, size: 192, elements: !853)
!852 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !851, file: !852, line: 27, baseType: !7, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !851, file: !852, line: 28, baseType: !856, size: 128, offset: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !857, line: 43, size: 128, elements: !858)
!857 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !856, file: !857, line: 44, baseType: !444)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !856, file: !857, line: 45, baseType: !230, size: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !540, file: !541, line: 879, baseType: !862, size: 64, offset: 6848)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !540, file: !541, line: 882, baseType: !862, size: 64, offset: 6912)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !540, file: !541, line: 884, baseType: !399, size: 64, offset: 6976)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !540, file: !541, line: 885, baseType: !399, size: 64, offset: 7040)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !540, file: !541, line: 890, baseType: !399, size: 64, offset: 7104)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !540, file: !541, line: 891, baseType: !868, size: 128, offset: 7168)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !541, line: 242, size: 128, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !868, file: !541, line: 244, baseType: !399, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !868, file: !541, line: 245, baseType: !399, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !868, file: !541, line: 246, baseType: !444, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !540, file: !541, line: 900, baseType: !60, size: 64, offset: 7296)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !540, file: !541, line: 901, baseType: !60, size: 64, offset: 7360)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !540, file: !541, line: 904, baseType: !399, size: 64, offset: 7424)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !540, file: !541, line: 907, baseType: !399, size: 64, offset: 7488)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !540, file: !541, line: 910, baseType: !60, size: 64, offset: 7552)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !540, file: !541, line: 911, baseType: !60, size: 64, offset: 7616)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !540, file: !541, line: 914, baseType: !880, size: 640, offset: 7680)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !881, line: 123, size: 640, elements: !882)
!881 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!882 = !{!883, !889, !890}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !880, file: !881, line: 124, baseType: !884, size: 576)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !885, size: 576, elements: !284)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !881, line: 108, size: 192, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !885, file: !881, line: 109, baseType: !399, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !885, file: !881, line: 110, baseType: !672, size: 128, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !880, file: !881, line: 125, baseType: !7, size: 32, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !880, file: !881, line: 126, baseType: !7, size: 32, offset: 608)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !540, file: !541, line: 917, baseType: !892, size: 192, offset: 8320)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !881, line: 134, size: 192, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !892, file: !881, line: 135, baseType: !829, size: 128, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !892, file: !881, line: 136, baseType: !7, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !540, file: !541, line: 923, baseType: !897, size: 64, offset: 8512)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !900, line: 11, flags: DIFlagFwdDecl)
!900 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!901 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !540, file: !541, line: 926, baseType: !897, size: 64, offset: 8576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !540, file: !541, line: 929, baseType: !897, size: 64, offset: 8640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !540, file: !541, line: 933, baseType: !904, size: 64, offset: 8704)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !541, line: 933, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !540, file: !541, line: 943, baseType: !907, size: 128, offset: 8768)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 16)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !540, file: !541, line: 945, baseType: !911, size: 64, offset: 8896)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !541, line: 49, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !540, file: !541, line: 956, baseType: !914, size: 64, offset: 8960)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !541, line: 45, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !540, file: !541, line: 959, baseType: !917, size: 64, offset: 9024)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !541, line: 959, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !540, file: !541, line: 962, baseType: !920, size: 64, offset: 9088)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !541, line: 66, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !540, file: !541, line: 966, baseType: !923, size: 64, offset: 9152)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !925, line: 35, flags: DIFlagFwdDecl)
!925 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!926 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !540, file: !541, line: 969, baseType: !927, size: 64, offset: 9216)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !881, line: 223, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !540, file: !541, line: 970, baseType: !930, size: 64, offset: 9280)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !541, line: 62, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !540, file: !541, line: 971, baseType: !933, size: 64, offset: 9344)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !934, line: 25, baseType: !935)
!934 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !934, line: 23, size: 64, elements: !936)
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !935, file: !934, line: 24, baseType: !701, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !540, file: !541, line: 972, baseType: !933, size: 64, offset: 9408)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !540, file: !541, line: 974, baseType: !933, size: 64, offset: 9472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !540, file: !541, line: 975, baseType: !941, size: 192, offset: 9536)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !942, line: 30, size: 192, elements: !943)
!942 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !941, file: !942, line: 31, baseType: !230, size: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !941, file: !942, line: 32, baseType: !933, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !540, file: !541, line: 976, baseType: !60, size: 64, offset: 9728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !540, file: !541, line: 977, baseType: !328, size: 64, offset: 9792)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !540, file: !541, line: 978, baseType: !7, size: 32, offset: 9856)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !540, file: !541, line: 980, baseType: !832, size: 64, offset: 9920)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !540, file: !541, line: 989, baseType: !951, size: 128, offset: 9984)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !952, line: 35, size: 128, elements: !953)
!952 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!953 = !{!954, !955, !956}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !951, file: !952, line: 36, baseType: !90, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !951, file: !952, line: 37, baseType: !419, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !951, file: !952, line: 38, baseType: !957, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !952, line: 23, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !540, file: !541, line: 992, baseType: !399, size: 64, offset: 10112)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !540, file: !541, line: 993, baseType: !399, size: 64, offset: 10176)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !540, file: !541, line: 996, baseType: !243, offset: 10240)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !540, file: !541, line: 999, baseType: !444, offset: 10240)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !540, file: !541, line: 1001, baseType: !964, size: 64, offset: 10240)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !541, line: 636, size: 64, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !964, file: !541, line: 637, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !540, file: !541, line: 1005, baseType: !675, size: 128, offset: 10304)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !540, file: !541, line: 1007, baseType: !539, size: 64, offset: 10432)
