; ModuleID = '../bcout/drivers/watchdog/watchdog_core.llvm.bc'
source_filename = "drivers/watchdog/watchdog_core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall4s.init\22, \22a\22\09"
module asm "__initcall_watchdog_init4s:\09\09\09"
module asm ".long\09watchdog_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.ida = type { %struct.xarray }
%struct.xarray = type { %struct.spinlock, i32, i8* }
%struct.watchdog_device = type { i32, %struct.device*, %struct.attribute_group**, %struct.watchdog_info*, %struct.watchdog_ops*, %struct.watchdog_governor*, i32, i32, i32, i32, i32, i32, i32, %struct.notifier_block, %struct.notifier_block, i8*, %struct.watchdog_core_data*, i64, %struct.list_head }

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !55, globals: !2120, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/watchdog/watchdog_core.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 10, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!55 = !{!56, !59, !61, !62, !64, !67, !69, !2115, !2117, !2118}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !60, line: 148, baseType: !7)
!60 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !66)
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "watchdog_device", file: !71, line: 94, size: 1344, elements: !72)
!71 = !DIFile(filename: "./include/linux/watchdog.h", directory: "/home/lizy2001/genbc/linux")
!72 = !{!73, !75, !2044, !2045, !2055, !2085, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2108, !2109, !2110, !2113, !2114}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !71, line: 95, baseType: !74, size: 32)
!74 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !70, file: !71, line: 96, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !78)
!78 = !{!79, !1568, !1569, !1572, !1573, !1624, !1721, !1722, !1723, !1724, !1725, !1734, !1839, !1852, !1855, !1856, !1860, !1862, !1863, !1864, !1868, !1874, !1875, !1878, !1993, !1994, !1997, !1998, !1999, !2000, !2032, !2033, !2034, !2037, !2040, !2041, !2042, !2043}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !77, file: !30, line: 462, baseType: !80, size: 512)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !81, line: 64, size: 512, elements: !82)
!81 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!82 = !{!83, !84, !90, !92, !152, !1405, !1558, !1563, !1564, !1565, !1566, !1567}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !81, line: 65, baseType: !56, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !80, file: !81, line: 66, baseType: !85, size: 128, offset: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !60, line: 178, size: 128, elements: !86)
!86 = !{!87, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !85, file: !60, line: 179, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !85, file: !60, line: 179, baseType: !88, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !80, file: !81, line: 67, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !80, file: !81, line: 68, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !81, line: 192, size: 704, elements: !95)
!95 = !{!96, !97, !113, !114}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !94, file: !81, line: 193, baseType: !85, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !94, file: !81, line: 194, baseType: !98, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !99, line: 83, baseType: !100)
!99 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !99, line: 71, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 72, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 72, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !103, file: !99, line: 73, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !99, line: 20, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !106, file: !99, line: 21, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !110, line: 25, baseType: !111)
!110 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 25, elements: !112)
!112 = !{}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !94, file: !81, line: 195, baseType: !80, size: 512, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !94, file: !81, line: 196, baseType: !115, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !81, line: 156, size: 192, elements: !118)
!118 = !{!119, !124, !129}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !117, file: !81, line: 157, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!74, !93, !91}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !81, line: 158, baseType: !125, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!56, !93, !91}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !117, file: !81, line: 159, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!74, !93, !91, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !81, line: 148, size: 20736, elements: !136)
!136 = !{!137, !142, !146, !147, !151}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !135, file: !81, line: 149, baseType: !138, size: 192)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 192, elements: !140)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !135, file: !81, line: 150, baseType: !143, size: 4096, offset: 192)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 4096, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !135, file: !81, line: 151, baseType: !74, size: 32, offset: 4288)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !135, file: !81, line: 152, baseType: !148, size: 16384, offset: 4320)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16384, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 2048)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !135, file: !81, line: 153, baseType: !74, size: 32, offset: 20704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !80, file: !81, line: 69, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !81, line: 138, size: 448, elements: !155)
!155 = !{!156, !160, !188, !190, !1351, !1384, !1388}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !154, file: !81, line: 139, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !91}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !154, file: !81, line: 140, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !164, line: 230, size: 128, elements: !165)
!164 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!165 = !{!166, !181}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !163, file: !164, line: 231, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !91, !174, !139}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !60, line: 60, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !172, line: 73, baseType: !173)
!172 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !172, line: 15, baseType: !66)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !164, line: 30, size: 128, elements: !176)
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !164, line: 31, baseType: !56, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !175, file: !164, line: 32, baseType: !179, size: 16, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !60, line: 19, baseType: !180)
!180 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !163, file: !164, line: 232, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!170, !91, !174, !56, !185}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 55, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !172, line: 72, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !172, line: 16, baseType: !68)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !154, file: !81, line: 141, baseType: !189, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !154, file: !81, line: 142, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !164, line: 84, size: 320, elements: !195)
!195 = !{!196, !197, !201, !1348, !1349}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !164, line: 85, baseType: !56, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !194, file: !164, line: 86, baseType: !198, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!179, !91, !174, !74}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !194, file: !164, line: 88, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!179, !91, !205, !74}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !164, line: 168, size: 448, elements: !207)
!207 = !{!208, !209, !210, !211, !221, !222}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !206, file: !164, line: 169, baseType: !175, size: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !164, line: 170, baseType: !185, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !206, file: !164, line: 171, baseType: !61, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !206, file: !164, line: 172, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!170, !215, !91, !205, !139, !218, !185}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !217, line: 526, flags: DIFlagFwdDecl)
!217 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !60, line: 46, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !172, line: 88, baseType: !220)
!220 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !206, file: !164, line: 174, baseType: !212, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !206, file: !164, line: 176, baseType: !223, size: 64, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!74, !215, !91, !205, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !228, line: 305, size: 1472, elements: !229)
!228 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!229 = !{!230, !231, !232, !233, !234, !242, !243, !1322, !1328, !1329, !1334, !1335, !1338, !1342, !1343, !1344, !1345, !1346}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !227, file: !228, line: 308, baseType: !68, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !227, file: !228, line: 309, baseType: !68, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !227, file: !228, line: 313, baseType: !226, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !227, file: !228, line: 313, baseType: !226, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !227, file: !228, line: 315, baseType: !235, size: 192, align: 64, offset: 256)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !236, line: 24, size: 192, align: 64, elements: !237)
!236 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!237 = !{!238, !239, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !235, file: !236, line: 25, baseType: !68, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !235, file: !236, line: 26, baseType: !240, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !235, file: !236, line: 27, baseType: !240, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !227, file: !228, line: 323, baseType: !68, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !227, file: !228, line: 327, baseType: !244, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !228, line: 388, size: 7296, elements: !246)
!246 = !{!247, !1318}
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !245, file: !228, line: 389, baseType: !248, size: 7296)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !245, file: !228, line: 389, size: 7296, elements: !249)
!249 = !{!250, !251, !255, !261, !265, !266, !267, !268, !269, !277, !282, !283, !284, !285, !294, !295, !296, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !331, !339, !342, !390, !391, !1288, !1289, !1292, !1296, !1297, !1300, !1301, !1302, !1305, !1317}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !248, file: !228, line: 390, baseType: !226, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !248, file: !228, line: 391, baseType: !252, size: 64, offset: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !236, line: 31, size: 64, elements: !253)
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !252, file: !236, line: 32, baseType: !240, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !248, file: !228, line: 392, baseType: !256, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !257, line: 23, baseType: !258)
!257 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !259, line: 31, baseType: !260)
!259 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!260 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !248, file: !228, line: 394, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!68, !215, !68, !68, !68, !68}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !248, file: !228, line: 398, baseType: !68, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !248, file: !228, line: 399, baseType: !68, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !248, file: !228, line: 405, baseType: !68, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !248, file: !228, line: 406, baseType: !68, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !248, file: !228, line: 407, baseType: !270, size: 64, offset: 512)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !217, line: 286, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 286, size: 64, elements: !273)
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !272, file: !217, line: 286, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !276, line: 18, baseType: !68)
!276 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!277 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !248, file: !228, line: 416, baseType: !278, size: 32, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !60, line: 168, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 166, size: 32, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !279, file: !60, line: 167, baseType: !74, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !248, file: !228, line: 428, baseType: !278, size: 32, offset: 608)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !248, file: !228, line: 437, baseType: !278, size: 32, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !248, file: !228, line: 447, baseType: !278, size: 32, offset: 672)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !248, file: !228, line: 450, baseType: !286, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !287, line: 13, baseType: !288)
!287 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !60, line: 175, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !60, line: 173, size: 64, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !289, file: !60, line: 174, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !257, line: 22, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !259, line: 30, baseType: !220)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !248, file: !228, line: 452, baseType: !74, size: 32, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !248, file: !228, line: 454, baseType: !98, offset: 800)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !248, file: !228, line: 457, baseType: !297, size: 256, offset: 832)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !298, line: 35, size: 256, elements: !299)
!298 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!299 = !{!300, !301, !302, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !297, file: !298, line: 36, baseType: !286, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !297, file: !298, line: 42, baseType: !286, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !297, file: !298, line: 46, baseType: !303, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !99, line: 29, baseType: !106)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !297, file: !298, line: 47, baseType: !85, size: 128, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !248, file: !228, line: 459, baseType: !85, size: 128, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !248, file: !228, line: 466, baseType: !68, size: 64, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !248, file: !228, line: 467, baseType: !68, size: 64, offset: 1280)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !248, file: !228, line: 469, baseType: !68, size: 64, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !248, file: !228, line: 470, baseType: !68, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !248, file: !228, line: 471, baseType: !288, size: 64, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !248, file: !228, line: 472, baseType: !68, size: 64, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !248, file: !228, line: 473, baseType: !68, size: 64, offset: 1600)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !248, file: !228, line: 474, baseType: !68, size: 64, offset: 1664)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !248, file: !228, line: 475, baseType: !68, size: 64, offset: 1728)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !248, file: !228, line: 477, baseType: !98, offset: 1792)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !248, file: !228, line: 478, baseType: !68, size: 64, offset: 1792)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !248, file: !228, line: 478, baseType: !68, size: 64, offset: 1856)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !248, file: !228, line: 478, baseType: !68, size: 64, offset: 1920)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !248, file: !228, line: 478, baseType: !68, size: 64, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !248, file: !228, line: 479, baseType: !68, size: 64, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !248, file: !228, line: 479, baseType: !68, size: 64, offset: 2112)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !248, file: !228, line: 479, baseType: !68, size: 64, offset: 2176)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !248, file: !228, line: 480, baseType: !68, size: 64, offset: 2240)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !248, file: !228, line: 480, baseType: !68, size: 64, offset: 2304)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !248, file: !228, line: 480, baseType: !68, size: 64, offset: 2368)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !248, file: !228, line: 480, baseType: !68, size: 64, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !248, file: !228, line: 482, baseType: !328, size: 2816, offset: 2496)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 2816, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 44)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !248, file: !228, line: 488, baseType: !332, size: 256, offset: 5312)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !333, line: 60, size: 256, elements: !334)
!333 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !332, file: !333, line: 61, baseType: !336, size: 256)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 256, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 4)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !248, file: !228, line: 490, baseType: !340, size: 64, offset: 5568)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !228, line: 490, flags: DIFlagFwdDecl)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !248, file: !228, line: 493, baseType: !343, size: 896, offset: 5632)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !344, line: 53, baseType: !345)
!344 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 13, size: 896, elements: !346)
!346 = !{!347, !348, !349, !350, !353, !354, !361, !362, !382, !383, !386}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !345, file: !344, line: 18, baseType: !256, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !345, file: !344, line: 28, baseType: !288, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !345, file: !344, line: 31, baseType: !297, size: 256, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !345, file: !344, line: 32, baseType: !351, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !344, line: 32, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !345, file: !344, line: 37, baseType: !180, size: 16, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !344, line: 40, baseType: !355, size: 192, offset: 512)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !356, line: 53, size: 192, elements: !357)
!356 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!357 = !{!358, !359, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !355, file: !356, line: 54, baseType: !286, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !355, file: !356, line: 55, baseType: !98, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !355, file: !356, line: 59, baseType: !85, size: 128, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !345, file: !344, line: 41, baseType: !61, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !345, file: !344, line: 42, baseType: !363, size: 64, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !366, line: 13, size: 896, elements: !367)
!366 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !366, line: 14, baseType: !61, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !366, line: 15, baseType: !68, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !365, file: !366, line: 17, baseType: !68, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !365, file: !366, line: 17, baseType: !68, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !365, file: !366, line: 19, baseType: !66, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !365, file: !366, line: 21, baseType: !66, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !365, file: !366, line: 22, baseType: !66, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !365, file: !366, line: 23, baseType: !66, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !365, file: !366, line: 24, baseType: !66, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !365, file: !366, line: 25, baseType: !66, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !365, file: !366, line: 26, baseType: !66, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !365, file: !366, line: 27, baseType: !66, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !365, file: !366, line: 28, baseType: !66, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !365, file: !366, line: 29, baseType: !66, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !345, file: !344, line: 44, baseType: !278, size: 32, offset: 832)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !345, file: !344, line: 50, baseType: !384, size: 16, offset: 864)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !257, line: 19, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !259, line: 24, baseType: !180)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !345, file: !344, line: 51, baseType: !387, size: 16, offset: 880)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !257, line: 18, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !259, line: 23, baseType: !389)
!389 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !228, line: 495, baseType: !68, size: 64, offset: 6528)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !248, file: !228, line: 497, baseType: !392, size: 64, offset: 6592)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !228, line: 381, size: 384, elements: !394)
!394 = !{!395, !396, !1287}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !393, file: !228, line: 382, baseType: !278, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !393, file: !228, line: 383, baseType: !397, size: 128, offset: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !228, line: 376, size: 128, elements: !398)
!398 = !{!399, !1285}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !397, file: !228, line: 377, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !402, line: 640, size: 48640, elements: !403)
!402 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!403 = !{!404, !412, !413, !414, !420, !421, !422, !423, !424, !425, !426, !427, !431, !449, !460, !555, !556, !557, !568, !569, !571, !572, !573, !574, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !653, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !709, !711, !712, !713, !725, !727, !728, !729, !730, !731, !737, !738, !739, !740, !741, !742, !743, !755, !760, !765, !766, !767, !770, !774, !777, !780, !783, !786, !790, !793, !796, !802, !803, !804, !810, !811, !812, !813, !814, !823, !824, !825, !826, !827, !832, !833, !834, !837, !838, !841, !844, !847, !850, !853, !856, !857, !937, !940, !943, !944, !947, !948, !949, !955, !956, !957, !970, !971, !972, !984, !989, !992, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !401, file: !402, line: 646, baseType: !405, size: 128)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !406, line: 56, size: 128, elements: !407)
!406 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !406, line: 57, baseType: !68, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !405, file: !406, line: 58, baseType: !410, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !257, line: 21, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !259, line: 27, baseType: !7)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !401, file: !402, line: 649, baseType: !65, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !401, file: !402, line: 657, baseType: !61, size: 64, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !401, file: !402, line: 658, baseType: !415, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !416, line: 113, baseType: !417)
!416 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !416, line: 111, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !417, file: !416, line: 112, baseType: !278, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !401, file: !402, line: 660, baseType: !7, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !401, file: !402, line: 661, baseType: !7, size: 32, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !401, file: !402, line: 684, baseType: !74, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !401, file: !402, line: 686, baseType: !74, size: 32, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !401, file: !402, line: 687, baseType: !74, size: 32, offset: 416)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !401, file: !402, line: 688, baseType: !74, size: 32, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !401, file: !402, line: 689, baseType: !7, size: 32, offset: 480)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !401, file: !402, line: 691, baseType: !428, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !402, line: 691, flags: DIFlagFwdDecl)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !401, file: !402, line: 692, baseType: !432, size: 832, offset: 576)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !402, line: 451, size: 832, elements: !433)
!433 = !{!434, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !432, file: !402, line: 453, baseType: !435, size: 128)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !402, line: 325, size: 128, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !435, file: !402, line: 326, baseType: !68, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !435, file: !402, line: 327, baseType: !410, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !432, file: !402, line: 454, baseType: !235, size: 192, align: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !432, file: !402, line: 455, baseType: !85, size: 128, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !432, file: !402, line: 456, baseType: !7, size: 32, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !432, file: !402, line: 458, baseType: !256, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !432, file: !402, line: 459, baseType: !256, size: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !432, file: !402, line: 460, baseType: !256, size: 64, offset: 640)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !432, file: !402, line: 461, baseType: !256, size: 64, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !432, file: !402, line: 463, baseType: !256, size: 64, offset: 768)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !432, file: !402, line: 465, baseType: !448, offset: 832)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !402, line: 415, elements: !112)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !401, file: !402, line: 693, baseType: !450, size: 384, offset: 1408)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !402, line: 489, size: 384, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !450, file: !402, line: 490, baseType: !85, size: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !450, file: !402, line: 491, baseType: !68, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !450, file: !402, line: 492, baseType: !68, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !450, file: !402, line: 493, baseType: !7, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !450, file: !402, line: 494, baseType: !180, size: 16, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !450, file: !402, line: 495, baseType: !180, size: 16, offset: 304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !450, file: !402, line: 497, baseType: !459, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !401, file: !402, line: 697, baseType: !461, size: 1792, offset: 1792)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !402, line: 507, size: 1792, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !552, !553}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !461, file: !402, line: 508, baseType: !235, size: 192, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !461, file: !402, line: 515, baseType: !256, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !461, file: !402, line: 516, baseType: !256, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !461, file: !402, line: 517, baseType: !256, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !461, file: !402, line: 518, baseType: !256, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !461, file: !402, line: 519, baseType: !256, size: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !461, file: !402, line: 526, baseType: !292, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !461, file: !402, line: 527, baseType: !256, size: 64, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !402, line: 528, baseType: !7, size: 32, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !461, file: !402, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !461, file: !402, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !461, file: !402, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !461, file: !402, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !461, file: !402, line: 563, baseType: !477, size: 512, offset: 704)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !478)
!478 = !{!479, !487, !488, !493, !545, !549, !550, !551}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !477, file: !6, line: 119, baseType: !480, size: 256)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !481, line: 9, size: 256, elements: !482)
!481 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !480, file: !481, line: 10, baseType: !235, size: 192, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !480, file: !481, line: 11, baseType: !485, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !486, line: 29, baseType: !292)
!486 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !477, file: !6, line: 120, baseType: !485, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !477, file: !6, line: 121, baseType: !489, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{!5, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !477, file: !6, line: 122, baseType: !494, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !496)
!496 = !{!497, !517, !518, !521, !531, !532, !540, !544}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !495, file: !6, line: 160, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !499, file: !6, line: 215, baseType: !303)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !499, file: !6, line: 216, baseType: !7, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !499, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !499, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !499, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !499, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !499, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !499, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !499, file: !6, line: 233, baseType: !485, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !499, file: !6, line: 234, baseType: !492, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !499, file: !6, line: 235, baseType: !485, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !499, file: !6, line: 236, baseType: !492, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !499, file: !6, line: 237, baseType: !514, size: 4096, offset: 512)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 4096, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 8)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !495, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !495, file: !6, line: 162, baseType: !519, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !60, line: 27, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !172, line: 96, baseType: !74)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !495, file: !6, line: 163, baseType: !522, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !523, line: 276, baseType: !524)
!523 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !523, line: 276, size: 32, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !524, file: !523, line: 276, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !523, line: 70, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !523, line: 65, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !528, file: !523, line: 66, baseType: !7, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !495, file: !6, line: 164, baseType: !492, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !495, file: !6, line: 165, baseType: !533, size: 128, offset: 256)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !481, line: 14, size: 128, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !533, file: !481, line: 15, baseType: !536, size: 128)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !236, line: 125, size: 128, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !536, file: !236, line: 126, baseType: !252, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !536, file: !236, line: 127, baseType: !240, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !495, file: !6, line: 166, baseType: !541, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!485}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !495, file: !6, line: 167, baseType: !485, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !477, file: !6, line: 123, baseType: !546, size: 8, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !257, line: 17, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !259, line: 21, baseType: !548)
!548 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !477, file: !6, line: 124, baseType: !546, size: 8, offset: 456)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !477, file: !6, line: 125, baseType: !546, size: 8, offset: 464)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !477, file: !6, line: 126, baseType: !546, size: 8, offset: 472)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !461, file: !402, line: 572, baseType: !477, size: 512, offset: 1216)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !461, file: !402, line: 580, baseType: !554, size: 64, offset: 1728)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !401, file: !402, line: 721, baseType: !7, size: 32, offset: 3584)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !401, file: !402, line: 722, baseType: !74, size: 32, offset: 3616)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !401, file: !402, line: 723, baseType: !558, size: 64, offset: 3648)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !561, line: 17, baseType: !562)
!561 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !561, line: 17, size: 64, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !562, file: !561, line: 17, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 1)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !401, file: !402, line: 724, baseType: !560, size: 64, offset: 3712)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !401, file: !402, line: 749, baseType: !570, offset: 3776)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !402, line: 290, elements: !112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !401, file: !402, line: 751, baseType: !85, size: 128, offset: 3776)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !401, file: !402, line: 757, baseType: !244, size: 64, offset: 3904)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !401, file: !402, line: 758, baseType: !244, size: 64, offset: 3968)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !401, file: !402, line: 761, baseType: !575, size: 320, offset: 4032)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !333, line: 34, size: 320, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !575, file: !333, line: 35, baseType: !256, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !575, file: !333, line: 36, baseType: !579, size: 256, offset: 64)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !337)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !401, file: !402, line: 766, baseType: !74, size: 32, offset: 4352)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !401, file: !402, line: 767, baseType: !74, size: 32, offset: 4384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !401, file: !402, line: 768, baseType: !74, size: 32, offset: 4416)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !401, file: !402, line: 770, baseType: !74, size: 32, offset: 4448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !401, file: !402, line: 772, baseType: !68, size: 64, offset: 4480)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !401, file: !402, line: 775, baseType: !7, size: 32, offset: 4544)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !401, file: !402, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !401, file: !402, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !401, file: !402, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !401, file: !402, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !401, file: !402, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !401, file: !402, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !401, file: !402, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !401, file: !402, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !401, file: !402, line: 831, baseType: !68, size: 64, offset: 4672)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !401, file: !402, line: 833, baseType: !596, size: 384, offset: 4736)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !597)
!597 = !{!598, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !596, file: !12, line: 26, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!66, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, scope: !596, file: !12, line: 27, baseType: !604, size: 320, offset: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !596, file: !12, line: 27, size: 320, elements: !605)
!605 = !{!606, !616, !643}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !604, file: !12, line: 36, baseType: !607, size: 320)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !12, line: 29, size: 320, elements: !608)
!608 = !{!609, !611, !612, !613, !614, !615}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !607, file: !12, line: 30, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !607, file: !12, line: 31, baseType: !410, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !607, file: !12, line: 32, baseType: !410, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !607, file: !12, line: 33, baseType: !410, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !607, file: !12, line: 34, baseType: !256, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !607, file: !12, line: 35, baseType: !610, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !604, file: !12, line: 46, baseType: !617, size: 192)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !12, line: 38, size: 192, elements: !618)
!618 = !{!619, !620, !621, !642}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !617, file: !12, line: 39, baseType: !519, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !617, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, scope: !617, file: !12, line: 41, baseType: !622, size: 64, offset: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !12, line: 41, size: 64, elements: !623)
!623 = !{!624, !632}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !622, file: !12, line: 42, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !627, line: 7, size: 128, elements: !628)
!627 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!628 = !{!629, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !626, file: !627, line: 8, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !172, line: 93, baseType: !220)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !626, file: !627, line: 9, baseType: !220, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !622, file: !12, line: 43, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !635, line: 7, size: 64, elements: !636)
!635 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!636 = !{!637, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !634, file: !635, line: 8, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !635, line: 5, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !257, line: 20, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !259, line: 26, baseType: !74)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !634, file: !635, line: 9, baseType: !639, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !617, file: !12, line: 45, baseType: !256, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !604, file: !12, line: 54, baseType: !644, size: 256)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !12, line: 48, size: 256, elements: !645)
!645 = !{!646, !649, !650, !651, !652}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !644, file: !12, line: 49, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !644, file: !12, line: 50, baseType: !74, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !644, file: !12, line: 51, baseType: !74, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !644, file: !12, line: 52, baseType: !68, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !644, file: !12, line: 53, baseType: !68, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !401, file: !402, line: 835, baseType: !654, size: 32, offset: 5120)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !60, line: 22, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !172, line: 28, baseType: !74)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !401, file: !402, line: 836, baseType: !654, size: 32, offset: 5152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !401, file: !402, line: 840, baseType: !68, size: 64, offset: 5184)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !401, file: !402, line: 849, baseType: !400, size: 64, offset: 5248)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !401, file: !402, line: 852, baseType: !400, size: 64, offset: 5312)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !401, file: !402, line: 857, baseType: !85, size: 128, offset: 5376)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !401, file: !402, line: 858, baseType: !85, size: 128, offset: 5504)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !401, file: !402, line: 859, baseType: !400, size: 64, offset: 5632)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !401, file: !402, line: 867, baseType: !85, size: 128, offset: 5696)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !401, file: !402, line: 868, baseType: !85, size: 128, offset: 5824)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !401, file: !402, line: 871, baseType: !666, size: 64, offset: 5952)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !668, line: 59, size: 768, elements: !669)
!668 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!669 = !{!670, !671, !672, !673, !684, !685, !692, !701}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !667, file: !668, line: 61, baseType: !415, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !667, file: !668, line: 62, baseType: !7, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !667, file: !668, line: 63, baseType: !98, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !667, file: !668, line: 65, baseType: !674, size: 256, offset: 64)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 256, elements: !337)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !60, line: 182, size: 64, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !675, file: !60, line: 183, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !60, line: 186, size: 128, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !679, file: !60, line: 187, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !679, file: !60, line: 187, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !667, file: !668, line: 66, baseType: !675, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !667, file: !668, line: 68, baseType: !686, size: 128, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !687, line: 40, baseType: !688)
!687 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !687, line: 36, size: 128, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !688, file: !687, line: 37, baseType: !98)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !688, file: !687, line: 38, baseType: !85, size: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !667, file: !668, line: 69, baseType: !693, size: 128, align: 64, offset: 512)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !60, line: 216, size: 128, align: 64, elements: !694)
!694 = !{!695, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !60, line: 217, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !693, file: !60, line: 218, baseType: !698, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !696}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !667, file: !668, line: 70, baseType: !702, size: 128, offset: 640)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 128, elements: !566)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !668, line: 54, size: 128, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !703, file: !668, line: 55, baseType: !74, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !703, file: !668, line: 56, baseType: !707, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !668, line: 56, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !401, file: !402, line: 872, baseType: !710, size: 512, offset: 6016)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 512, elements: !337)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !401, file: !402, line: 873, baseType: !85, size: 128, offset: 6528)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !401, file: !402, line: 874, baseType: !85, size: 128, offset: 6656)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !401, file: !402, line: 876, baseType: !714, size: 64, offset: 6784)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !716, line: 26, size: 192, elements: !717)
!716 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !715, file: !716, line: 27, baseType: !7, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !715, file: !716, line: 28, baseType: !720, size: 128, offset: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !721, line: 43, size: 128, elements: !722)
!721 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !720, file: !721, line: 44, baseType: !303)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !720, file: !721, line: 45, baseType: !85, size: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !401, file: !402, line: 879, baseType: !726, size: 64, offset: 6848)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !401, file: !402, line: 882, baseType: !726, size: 64, offset: 6912)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !401, file: !402, line: 884, baseType: !256, size: 64, offset: 6976)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !401, file: !402, line: 885, baseType: !256, size: 64, offset: 7040)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !401, file: !402, line: 890, baseType: !256, size: 64, offset: 7104)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !401, file: !402, line: 891, baseType: !732, size: 128, offset: 7168)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !402, line: 242, size: 128, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !732, file: !402, line: 244, baseType: !256, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !732, file: !402, line: 245, baseType: !256, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !732, file: !402, line: 246, baseType: !303, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !401, file: !402, line: 900, baseType: !68, size: 64, offset: 7296)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !401, file: !402, line: 901, baseType: !68, size: 64, offset: 7360)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !401, file: !402, line: 904, baseType: !256, size: 64, offset: 7424)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !401, file: !402, line: 907, baseType: !256, size: 64, offset: 7488)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !401, file: !402, line: 910, baseType: !68, size: 64, offset: 7552)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !401, file: !402, line: 911, baseType: !68, size: 64, offset: 7616)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !401, file: !402, line: 914, baseType: !744, size: 640, offset: 7680)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !745, line: 123, size: 640, elements: !746)
!745 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!746 = !{!747, !753, !754}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !744, file: !745, line: 124, baseType: !748, size: 576)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 576, elements: !140)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !745, line: 108, size: 192, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !749, file: !745, line: 109, baseType: !256, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !749, file: !745, line: 110, baseType: !533, size: 128, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !744, file: !745, line: 125, baseType: !7, size: 32, offset: 576)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !744, file: !745, line: 126, baseType: !7, size: 32, offset: 608)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !401, file: !402, line: 917, baseType: !756, size: 192, offset: 8320)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !745, line: 134, size: 192, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !756, file: !745, line: 135, baseType: !693, size: 128, align: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !756, file: !745, line: 136, baseType: !7, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !401, file: !402, line: 923, baseType: !761, size: 64, offset: 8512)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !764, line: 11, flags: DIFlagFwdDecl)
!764 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!765 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !401, file: !402, line: 926, baseType: !761, size: 64, offset: 8576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !401, file: !402, line: 929, baseType: !761, size: 64, offset: 8640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !401, file: !402, line: 933, baseType: !768, size: 64, offset: 8704)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !402, line: 933, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !401, file: !402, line: 943, baseType: !771, size: 128, offset: 8768)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !401, file: !402, line: 945, baseType: !775, size: 64, offset: 8896)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !402, line: 49, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !401, file: !402, line: 956, baseType: !778, size: 64, offset: 8960)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !402, line: 45, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !401, file: !402, line: 959, baseType: !781, size: 64, offset: 9024)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !402, line: 959, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !401, file: !402, line: 962, baseType: !784, size: 64, offset: 9088)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !402, line: 66, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !401, file: !402, line: 966, baseType: !787, size: 64, offset: 9152)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !789, line: 35, flags: DIFlagFwdDecl)
!789 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!790 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !401, file: !402, line: 969, baseType: !791, size: 64, offset: 9216)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !745, line: 223, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !401, file: !402, line: 970, baseType: !794, size: 64, offset: 9280)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !402, line: 62, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !401, file: !402, line: 971, baseType: !797, size: 64, offset: 9344)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !798, line: 25, baseType: !799)
!798 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !798, line: 23, size: 64, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !799, file: !798, line: 24, baseType: !565, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !401, file: !402, line: 972, baseType: !797, size: 64, offset: 9408)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !401, file: !402, line: 974, baseType: !797, size: 64, offset: 9472)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !401, file: !402, line: 975, baseType: !805, size: 192, offset: 9536)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !806, line: 30, size: 192, elements: !807)
!806 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !805, file: !806, line: 31, baseType: !85, size: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !805, file: !806, line: 32, baseType: !797, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !401, file: !402, line: 976, baseType: !68, size: 64, offset: 9728)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !401, file: !402, line: 977, baseType: !185, size: 64, offset: 9792)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !401, file: !402, line: 978, baseType: !7, size: 32, offset: 9856)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !401, file: !402, line: 980, baseType: !696, size: 64, offset: 9920)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !401, file: !402, line: 989, baseType: !815, size: 128, offset: 9984)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !816, line: 35, size: 128, elements: !817)
!816 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !815, file: !816, line: 36, baseType: !74, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !815, file: !816, line: 37, baseType: !278, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !815, file: !816, line: 38, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !816, line: 23, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !401, file: !402, line: 992, baseType: !256, size: 64, offset: 10112)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !401, file: !402, line: 993, baseType: !256, size: 64, offset: 10176)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !401, file: !402, line: 996, baseType: !98, offset: 10240)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !401, file: !402, line: 999, baseType: !303, offset: 10240)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !401, file: !402, line: 1001, baseType: !828, size: 64, offset: 10240)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !402, line: 636, size: 64, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !828, file: !402, line: 637, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !401, file: !402, line: 1005, baseType: !536, size: 128, offset: 10304)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !401, file: !402, line: 1007, baseType: !400, size: 64, offset: 10432)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !401, file: !402, line: 1009, baseType: !835, size: 64, offset: 10496)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !402, line: 1009, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !401, file: !402, line: 1043, baseType: !61, size: 64, offset: 10560)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !401, file: !402, line: 1046, baseType: !839, size: 64, offset: 10624)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !402, line: 41, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !401, file: !402, line: 1050, baseType: !842, size: 64, offset: 10688)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !402, line: 42, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !401, file: !402, line: 1054, baseType: !845, size: 64, offset: 10752)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !402, line: 55, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !401, file: !402, line: 1056, baseType: !848, size: 64, offset: 10816)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !402, line: 40, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !401, file: !402, line: 1058, baseType: !851, size: 64, offset: 10880)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !402, line: 47, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !401, file: !402, line: 1061, baseType: !854, size: 64, offset: 10944)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !402, line: 43, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !401, file: !402, line: 1064, baseType: !68, size: 64, offset: 11008)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !401, file: !402, line: 1065, baseType: !858, size: 64, offset: 11072)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !806, line: 14, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !806, line: 12, size: 384, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, scope: !860, file: !806, line: 13, baseType: !863, size: 384)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !806, line: 13, size: 384, elements: !864)
!864 = !{!865, !866, !867, !868}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !863, file: !806, line: 13, baseType: !74, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !863, file: !806, line: 13, baseType: !74, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !863, file: !806, line: 13, baseType: !74, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !863, file: !806, line: 13, baseType: !869, size: 256, offset: 128)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !870, line: 32, size: 256, elements: !871)
!870 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!871 = !{!872, !878, !891, !897, !906, !926, !931}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !869, file: !870, line: 37, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 34, size: 64, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !873, file: !870, line: 35, baseType: !655, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !873, file: !870, line: 36, baseType: !877, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !172, line: 49, baseType: !7)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !869, file: !870, line: 45, baseType: !879, size: 192)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 40, size: 192, elements: !880)
!880 = !{!881, !883, !884, !890}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !879, file: !870, line: 41, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !172, line: 95, baseType: !74)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !879, file: !870, line: 42, baseType: !74, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !879, file: !870, line: 43, baseType: !885, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !870, line: 11, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !870, line: 8, size: 64, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !886, file: !870, line: 9, baseType: !74, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !886, file: !870, line: 10, baseType: !61, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !879, file: !870, line: 44, baseType: !74, size: 32, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !869, file: !870, line: 52, baseType: !892, size: 128)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 48, size: 128, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !892, file: !870, line: 49, baseType: !655, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !892, file: !870, line: 50, baseType: !877, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !892, file: !870, line: 51, baseType: !885, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !869, file: !870, line: 61, baseType: !898, size: 256)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 55, size: 256, elements: !899)
!899 = !{!900, !901, !902, !903, !905}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !898, file: !870, line: 56, baseType: !655, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !898, file: !870, line: 57, baseType: !877, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !898, file: !870, line: 58, baseType: !74, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !898, file: !870, line: 59, baseType: !904, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !172, line: 94, baseType: !173)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !898, file: !870, line: 60, baseType: !904, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !869, file: !870, line: 95, baseType: !907, size: 256)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 64, size: 256, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !907, file: !870, line: 65, baseType: !61, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, scope: !907, file: !870, line: 77, baseType: !911, size: 192, offset: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !907, file: !870, line: 77, size: 192, elements: !912)
!912 = !{!913, !914, !921}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !911, file: !870, line: 82, baseType: !389, size: 16)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !911, file: !870, line: 88, baseType: !915, size: 192)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !870, line: 84, size: 192, elements: !916)
!916 = !{!917, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !915, file: !870, line: 85, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64, elements: !515)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !915, file: !870, line: 86, baseType: !61, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !915, file: !870, line: 87, baseType: !61, size: 64, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !911, file: !870, line: 93, baseType: !922, size: 96)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !911, file: !870, line: 90, size: 96, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !922, file: !870, line: 91, baseType: !918, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !922, file: !870, line: 92, baseType: !411, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !869, file: !870, line: 101, baseType: !927, size: 128)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 98, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !927, file: !870, line: 99, baseType: !66, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !927, file: !870, line: 100, baseType: !74, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !869, file: !870, line: 108, baseType: !932, size: 128)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !870, line: 104, size: 128, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !932, file: !870, line: 105, baseType: !61, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !932, file: !870, line: 106, baseType: !74, size: 32, offset: 64)
