; ModuleID = '../bcout/drivers/hwmon/hwmon-vid.llvm.bc'
source_filename = "drivers/hwmon/hwmon-vid.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.cpuinfo_x86 = type { i8, i8, i8, i8, i32, [3 x i32], i8, i8, i8, i8, i32, i32, %union.anon, [16 x i8], [64 x i8], i32, i32, i32, i32, i32, i32, i64, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i32, i8, i8 }
%union.anon = type { i64, [72 x i8] }
%struct.vrm_model = type { i8, i8, i8, i8, i8, i8 }
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author104", scope: !2, file: !3, line: 301, type: !56, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/hwmon/hwmon-vid.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !7, !8, !12, !13}
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !6)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !15)
!15 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !{!0, !17, !24, !26, !31, !47}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description105", scope: !2, file: !3, line: 303, type: !19, isLocal: true, isDefinition: true, align: 8)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 312, elements: !22)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !{!23}
!23 = !DISubrange(count: 39)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file106", scope: !2, file: !3, line: 304, type: !19, isLocal: true, isDefinition: true, align: 8)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license107", scope: !2, file: !3, line: 304, type: !28, isLocal: true, isDefinition: true, align: 8)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 176, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 22)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "vrm_models", scope: !2, file: !3, line: 179, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 1392, elements: !45)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vrm_model", file: !3, line: 160, size: 48, elements: !35)
!35 = !{!36, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !34, file: !3, line: 161, baseType: !37, size: 8)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !34, file: !3, line: 162, baseType: !37, size: 8, offset: 8)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "model_from", scope: !34, file: !3, line: 163, baseType: !37, size: 8, offset: 16)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "model_to", scope: !34, file: !3, line: 164, baseType: !37, size: 8, offset: 24)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "stepping_to", scope: !34, file: !3, line: 165, baseType: !37, size: 8, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "vrm_type", scope: !34, file: !3, line: 166, baseType: !37, size: 8, offset: 40)
!45 = !{!46}
!46 = !DISubrange(count: 29)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "brands", scope: !49, file: !3, line: 237, type: !52, isLocal: true, isDefinition: true)
!49 = distinct !DISubprogram(name: "get_via_model_d_vrm", scope: !3, file: !3, line: 234, type: !50, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!50 = !DISubroutineType(types: !51)
!51 = !{!37}
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !54)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!54 = !{!55}
!55 = !DISubrange(count: 4)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 424, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 53)
!59 = !{!"rsp"}
!60 = !{i32 7, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 2}
!63 = !{i32 1, !"Code Model", i32 2}
!64 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!65 = distinct !DISubprogram(name: "vid_from_reg", scope: !3, file: !3, line: 69, type: !66, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!66 = !DISubroutineType(types: !67)
!67 = !{!7, !7, !37}
!68 = !DILocalVariable(name: "val", arg: 1, scope: !65, file: !3, line: 69, type: !7)
!69 = !DILocation(line: 69, column: 22, scope: !65)
!70 = !DILocalVariable(name: "vrm", arg: 2, scope: !65, file: !3, line: 69, type: !37)
!71 = !DILocation(line: 69, column: 30, scope: !65)
!72 = !DILocalVariable(name: "vid", scope: !65, file: !3, line: 71, type: !7)
!73 = !DILocation(line: 71, column: 6, scope: !65)
!74 = !DILocation(line: 73, column: 10, scope: !65)
!75 = !DILocation(line: 73, column: 2, scope: !65)
!76 = !DILocation(line: 77, column: 7, scope: !77)
!77 = distinct !DILexicalBlock(scope: !65, file: !3, line: 73, column: 15)
!78 = !DILocation(line: 78, column: 8, scope: !79)
!79 = distinct !DILexicalBlock(scope: !77, file: !3, line: 78, column: 7)
!80 = !DILocation(line: 78, column: 12, scope: !79)
!81 = !DILocation(line: 78, column: 20, scope: !79)
!82 = !DILocation(line: 78, column: 7, scope: !77)
!83 = !DILocation(line: 79, column: 4, scope: !79)
!84 = !DILocation(line: 80, column: 8, scope: !85)
!85 = distinct !DILexicalBlock(scope: !77, file: !3, line: 80, column: 7)
!86 = !DILocation(line: 80, column: 12, scope: !85)
!87 = !DILocation(line: 80, column: 20, scope: !85)
!88 = !DILocation(line: 80, column: 28, scope: !85)
!89 = !DILocation(line: 80, column: 31, scope: !85)
!90 = !DILocation(line: 80, column: 35, scope: !85)
!91 = !DILocation(line: 80, column: 7, scope: !77)
!92 = !DILocation(line: 81, column: 21, scope: !85)
!93 = !DILocation(line: 81, column: 25, scope: !85)
!94 = !DILocation(line: 81, column: 33, scope: !85)
!95 = !DILocation(line: 81, column: 18, scope: !85)
!96 = !DILocation(line: 81, column: 8, scope: !85)
!97 = !DILocation(line: 81, column: 4, scope: !85)
!98 = !DILocation(line: 83, column: 21, scope: !85)
!99 = !DILocation(line: 83, column: 25, scope: !85)
!100 = !DILocation(line: 83, column: 33, scope: !85)
!101 = !DILocation(line: 83, column: 18, scope: !85)
!102 = !DILocation(line: 83, column: 8, scope: !85)
!103 = !DILocation(line: 84, column: 7, scope: !104)
!104 = distinct !DILexicalBlock(scope: !77, file: !3, line: 84, column: 7)
!105 = !DILocation(line: 84, column: 11, scope: !104)
!106 = !DILocation(line: 84, column: 7, scope: !77)
!107 = !DILocation(line: 85, column: 8, scope: !104)
!108 = !DILocation(line: 85, column: 4, scope: !104)
!109 = !DILocation(line: 86, column: 11, scope: !77)
!110 = !DILocation(line: 86, column: 15, scope: !77)
!111 = !DILocation(line: 86, column: 22, scope: !77)
!112 = !DILocation(line: 86, column: 3, scope: !77)
!113 = !DILocation(line: 90, column: 7, scope: !77)
!114 = !DILocation(line: 91, column: 7, scope: !115)
!115 = distinct !DILexicalBlock(scope: !77, file: !3, line: 91, column: 7)
!116 = !DILocation(line: 91, column: 11, scope: !115)
!117 = !DILocation(line: 91, column: 18, scope: !115)
!118 = !DILocation(line: 91, column: 21, scope: !115)
!119 = !DILocation(line: 91, column: 25, scope: !115)
!120 = !DILocation(line: 91, column: 7, scope: !77)
!121 = !DILocation(line: 92, column: 4, scope: !115)
!122 = !DILocation(line: 93, column: 22, scope: !77)
!123 = !DILocation(line: 93, column: 26, scope: !77)
!124 = !DILocation(line: 93, column: 31, scope: !77)
!125 = !DILocation(line: 93, column: 19, scope: !77)
!126 = !DILocation(line: 93, column: 38, scope: !77)
!127 = !DILocation(line: 93, column: 45, scope: !77)
!128 = !DILocation(line: 93, column: 3, scope: !77)
!129 = !DILocation(line: 96, column: 7, scope: !77)
!130 = !DILocation(line: 97, column: 7, scope: !131)
!131 = distinct !DILexicalBlock(scope: !77, file: !3, line: 97, column: 7)
!132 = !DILocation(line: 97, column: 11, scope: !131)
!133 = !DILocation(line: 97, column: 7, scope: !77)
!134 = !DILocation(line: 98, column: 4, scope: !131)
!135 = !DILocation(line: 97, column: 14, scope: !131)
!136 = !DILocation(line: 101, column: 7, scope: !77)
!137 = !DILocation(line: 102, column: 11, scope: !77)
!138 = !DILocation(line: 102, column: 15, scope: !77)
!139 = !DILocation(line: 102, column: 10, scope: !77)
!140 = !DILocation(line: 102, column: 35, scope: !77)
!141 = !DILocation(line: 102, column: 33, scope: !77)
!142 = !DILocation(line: 102, column: 28, scope: !77)
!143 = !DILocation(line: 103, column: 19, scope: !77)
!144 = !DILocation(line: 103, column: 23, scope: !77)
!145 = !DILocation(line: 103, column: 16, scope: !77)
!146 = !DILocation(line: 103, column: 30, scope: !77)
!147 = !DILocation(line: 103, column: 10, scope: !77)
!148 = !DILocation(line: 102, column: 3, scope: !77)
!149 = !DILocation(line: 106, column: 7, scope: !77)
!150 = !DILocation(line: 107, column: 7, scope: !151)
!151 = distinct !DILexicalBlock(scope: !77, file: !3, line: 107, column: 7)
!152 = !DILocation(line: 107, column: 11, scope: !151)
!153 = !DILocation(line: 107, column: 7, scope: !77)
!154 = !DILocation(line: 108, column: 4, scope: !151)
!155 = !DILocalVariable(name: "__x", scope: !156, file: !3, line: 109, type: !7)
!156 = distinct !DILexicalBlock(scope: !77, file: !3, line: 109, column: 10)
!157 = !DILocation(line: 109, column: 10, scope: !156)
!158 = !DILocalVariable(name: "__d", scope: !156, file: !3, line: 109, type: !7)
!159 = !DILocation(line: 109, column: 3, scope: !77)
!160 = !DILocation(line: 113, column: 7, scope: !77)
!161 = !DILocation(line: 114, column: 10, scope: !77)
!162 = !DILocation(line: 114, column: 14, scope: !77)
!163 = !DILocation(line: 115, column: 17, scope: !77)
!164 = !DILocation(line: 115, column: 21, scope: !77)
!165 = !DILocation(line: 115, column: 15, scope: !77)
!166 = !DILocation(line: 114, column: 3, scope: !77)
!167 = !DILocation(line: 118, column: 7, scope: !77)
!168 = !DILocation(line: 119, column: 11, scope: !77)
!169 = !DILocation(line: 119, column: 15, scope: !77)
!170 = !DILocation(line: 120, column: 12, scope: !77)
!171 = !DILocation(line: 120, column: 16, scope: !77)
!172 = !DILocation(line: 120, column: 24, scope: !77)
!173 = !DILocation(line: 120, column: 11, scope: !77)
!174 = !DILocation(line: 119, column: 33, scope: !77)
!175 = !DILocation(line: 121, column: 12, scope: !77)
!176 = !DILocation(line: 121, column: 16, scope: !77)
!177 = !DILocation(line: 121, column: 24, scope: !77)
!178 = !DILocation(line: 120, column: 46, scope: !77)
!179 = !DILocation(line: 119, column: 3, scope: !77)
!180 = !DILocation(line: 124, column: 7, scope: !77)
!181 = !DILocation(line: 124, column: 3, scope: !77)
!182 = !DILocation(line: 127, column: 7, scope: !77)
!183 = !DILocation(line: 128, column: 10, scope: !77)
!184 = !DILocation(line: 128, column: 14, scope: !77)
!185 = !DILocation(line: 129, column: 10, scope: !77)
!186 = !DILocation(line: 129, column: 14, scope: !77)
!187 = !DILocation(line: 129, column: 32, scope: !77)
!188 = !DILocation(line: 129, column: 37, scope: !77)
!189 = !DILocation(line: 129, column: 29, scope: !77)
!190 = !DILocation(line: 130, column: 18, scope: !77)
!191 = !DILocation(line: 130, column: 23, scope: !77)
!192 = !DILocation(line: 130, column: 15, scope: !77)
!193 = !DILocation(line: 128, column: 3, scope: !77)
!194 = !DILocation(line: 132, column: 7, scope: !77)
!195 = !DILocation(line: 133, column: 10, scope: !77)
!196 = !DILocation(line: 133, column: 14, scope: !77)
!197 = !DILocation(line: 133, column: 30, scope: !77)
!198 = !DILocation(line: 133, column: 34, scope: !77)
!199 = !DILocation(line: 133, column: 41, scope: !77)
!200 = !DILocation(line: 133, column: 27, scope: !77)
!201 = !DILocation(line: 134, column: 16, scope: !77)
!202 = !DILocation(line: 134, column: 20, scope: !77)
!203 = !DILocation(line: 134, column: 14, scope: !77)
!204 = !DILocation(line: 133, column: 3, scope: !77)
!205 = !DILocation(line: 137, column: 7, scope: !77)
!206 = !DILocation(line: 139, column: 7, scope: !207)
!207 = distinct !DILexicalBlock(scope: !77, file: !3, line: 139, column: 7)
!208 = !DILocation(line: 139, column: 11, scope: !207)
!209 = !DILocation(line: 139, column: 18, scope: !207)
!210 = !DILocation(line: 139, column: 21, scope: !207)
!211 = !DILocation(line: 139, column: 25, scope: !207)
!212 = !DILocation(line: 139, column: 7, scope: !77)
!213 = !DILocation(line: 140, column: 7, scope: !207)
!214 = !DILocation(line: 140, column: 4, scope: !207)
!215 = !DILocation(line: 141, column: 17, scope: !77)
!216 = !DILocation(line: 141, column: 21, scope: !77)
!217 = !DILocation(line: 141, column: 15, scope: !77)
!218 = !DILocation(line: 141, column: 3, scope: !77)
!219 = !DILocation(line: 144, column: 7, scope: !77)
!220 = !DILocation(line: 145, column: 10, scope: !77)
!221 = !DILocation(line: 145, column: 14, scope: !77)
!222 = !DILocation(line: 145, column: 39, scope: !77)
!223 = !DILocation(line: 145, column: 43, scope: !77)
!224 = !DILocation(line: 145, column: 36, scope: !77)
!225 = !DILocation(line: 145, column: 52, scope: !77)
!226 = !DILocation(line: 145, column: 59, scope: !77)
!227 = !DILocation(line: 145, column: 3, scope: !77)
!228 = !DILocation(line: 147, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !77, file: !3, line: 147, column: 7)
!230 = !DILocation(line: 147, column: 7, scope: !77)
!231 = !DILocation(line: 148, column: 4, scope: !229)
!232 = !DILocation(line: 150, column: 3, scope: !77)
!233 = !DILocation(line: 152, column: 1, scope: !65)
!234 = distinct !DISubprogram(name: "vid_which_vrm", scope: !3, file: !3, line: 275, type: !50, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!235 = !DILocalVariable(name: "c", scope: !234, file: !3, line: 277, type: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuinfo_x86", file: !238, line: 81, size: 2048, elements: !239)
!238 = !DIFile(filename: "./arch/x86/include/asm/processor.h", directory: "/home/lizy2001/genbc/linux")
!239 = !{!240, !241, !242, !243, !244, !245, !249, !250, !251, !252, !253, !254, !255, !263, !267, !271, !272, !273, !274, !275, !276, !277, !278, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "x86", scope: !237, file: !238, line: 82, baseType: !38, size: 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vendor", scope: !237, file: !238, line: 83, baseType: !38, size: 8, offset: 8)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "x86_model", scope: !237, file: !238, line: 84, baseType: !38, size: 8, offset: 16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "x86_stepping", scope: !237, file: !238, line: 85, baseType: !38, size: 8, offset: 24)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "x86_tlbsize", scope: !237, file: !238, line: 88, baseType: !7, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vmx_capability", scope: !237, file: !238, line: 91, baseType: !246, size: 96, offset: 64)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 96, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 3)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "x86_virt_bits", scope: !237, file: !238, line: 93, baseType: !38, size: 8, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "x86_phys_bits", scope: !237, file: !238, line: 94, baseType: !38, size: 8, offset: 168)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "x86_coreid_bits", scope: !237, file: !238, line: 96, baseType: !38, size: 8, offset: 176)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cu_id", scope: !237, file: !238, line: 97, baseType: !38, size: 8, offset: 184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "extended_cpuid_level", scope: !237, file: !238, line: 99, baseType: !10, size: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cpuid_level", scope: !237, file: !238, line: 101, baseType: !7, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !238, line: 107, baseType: !256, size: 640, offset: 256)
!256 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !237, file: !238, line: 107, size: 640, elements: !257)
!257 = !{!258, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "x86_capability", scope: !256, file: !238, line: 108, baseType: !259, size: 640)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 640, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 20)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "x86_capability_alignment", scope: !256, file: !238, line: 109, baseType: !12, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vendor_id", scope: !237, file: !238, line: 111, baseType: !264, size: 128, offset: 896)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 16)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "x86_model_id", scope: !237, file: !238, line: 112, baseType: !268, size: 512, offset: 1024)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_size", scope: !237, file: !238, line: 114, baseType: !6, size: 32, offset: 1536)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_alignment", scope: !237, file: !238, line: 115, baseType: !7, size: 32, offset: 1568)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_max_rmid", scope: !237, file: !238, line: 117, baseType: !7, size: 32, offset: 1600)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_occ_scale", scope: !237, file: !238, line: 118, baseType: !7, size: 32, offset: 1632)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_mbm_width_offset", scope: !237, file: !238, line: 119, baseType: !7, size: 32, offset: 1664)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "x86_power", scope: !237, file: !238, line: 120, baseType: !7, size: 32, offset: 1696)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "loops_per_jiffy", scope: !237, file: !238, line: 121, baseType: !12, size: 64, offset: 1728)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "x86_max_cores", scope: !237, file: !238, line: 123, baseType: !279, size: 16, offset: 1792)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !281)
!281 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "apicid", scope: !237, file: !238, line: 124, baseType: !279, size: 16, offset: 1808)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "initial_apicid", scope: !237, file: !238, line: 125, baseType: !279, size: 16, offset: 1824)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "x86_clflush_size", scope: !237, file: !238, line: 126, baseType: !279, size: 16, offset: 1840)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "booted_cores", scope: !237, file: !238, line: 128, baseType: !279, size: 16, offset: 1856)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "phys_proc_id", scope: !237, file: !238, line: 130, baseType: !279, size: 16, offset: 1872)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "logical_proc_id", scope: !237, file: !238, line: 132, baseType: !279, size: 16, offset: 1888)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_core_id", scope: !237, file: !238, line: 134, baseType: !279, size: 16, offset: 1904)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_die_id", scope: !237, file: !238, line: 135, baseType: !279, size: 16, offset: 1920)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "logical_die_id", scope: !237, file: !238, line: 136, baseType: !279, size: 16, offset: 1936)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_index", scope: !237, file: !238, line: 138, baseType: !279, size: 16, offset: 1952)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "microcode", scope: !237, file: !238, line: 139, baseType: !8, size: 32, offset: 1984)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "x86_cache_bits", scope: !237, file: !238, line: 141, baseType: !37, size: 8, offset: 2016)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !237, file: !238, line: 142, baseType: !6, size: 1, offset: 2024, flags: DIFlagBitField, extraData: i64 2024)
!295 = !DILocation(line: 277, column: 22, scope: !234)
!296 = !DILocalVariable(name: "vrm_ret", scope: !234, file: !3, line: 278, type: !37)
!297 = !DILocation(line: 278, column: 5, scope: !234)
!298 = !DILocation(line: 280, column: 6, scope: !299)
!299 = distinct !DILexicalBlock(scope: !234, file: !3, line: 280, column: 6)
!300 = !DILocation(line: 280, column: 9, scope: !299)
!301 = !DILocation(line: 280, column: 13, scope: !299)
!302 = !DILocation(line: 280, column: 6, scope: !234)
!303 = !DILocation(line: 281, column: 3, scope: !299)
!304 = !DILocation(line: 283, column: 21, scope: !234)
!305 = !DILocation(line: 283, column: 24, scope: !234)
!306 = !DILocation(line: 283, column: 29, scope: !234)
!307 = !DILocation(line: 283, column: 32, scope: !234)
!308 = !DILocation(line: 283, column: 43, scope: !234)
!309 = !DILocation(line: 283, column: 46, scope: !234)
!310 = !DILocation(line: 283, column: 60, scope: !234)
!311 = !DILocation(line: 283, column: 63, scope: !234)
!312 = !DILocation(line: 283, column: 12, scope: !234)
!313 = !DILocation(line: 283, column: 10, scope: !234)
!314 = !DILocation(line: 284, column: 6, scope: !315)
!315 = distinct !DILexicalBlock(scope: !234, file: !3, line: 284, column: 6)
!316 = !DILocation(line: 284, column: 14, scope: !315)
!317 = !DILocation(line: 284, column: 6, scope: !234)
!318 = !DILocation(line: 285, column: 13, scope: !315)
!319 = !DILocation(line: 285, column: 11, scope: !315)
!320 = !DILocation(line: 285, column: 3, scope: !315)
!321 = !DILocation(line: 286, column: 6, scope: !322)
!322 = distinct !DILexicalBlock(scope: !234, file: !3, line: 286, column: 6)
!323 = !DILocation(line: 286, column: 14, scope: !322)
!324 = !DILocation(line: 286, column: 6, scope: !234)
!325 = !DILocation(line: 287, column: 3, scope: !322)
!326 = !DILocation(line: 288, column: 9, scope: !234)
!327 = !DILocation(line: 288, column: 2, scope: !234)
!328 = !DILocation(line: 289, column: 1, scope: !234)
!329 = distinct !DISubprogram(name: "find_vrm", scope: !3, file: !3, line: 259, type: !330, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!330 = !DISubroutineType(types: !331)
!331 = !{!37, !37, !37, !37, !37}
!332 = !DILocalVariable(name: "family", arg: 1, scope: !329, file: !3, line: 259, type: !37)
!333 = !DILocation(line: 259, column: 23, scope: !329)
!334 = !DILocalVariable(name: "model", arg: 2, scope: !329, file: !3, line: 259, type: !37)
!335 = !DILocation(line: 259, column: 34, scope: !329)
!336 = !DILocalVariable(name: "stepping", arg: 3, scope: !329, file: !3, line: 259, type: !37)
!337 = !DILocation(line: 259, column: 44, scope: !329)
!338 = !DILocalVariable(name: "vendor", arg: 4, scope: !329, file: !3, line: 259, type: !37)
!339 = !DILocation(line: 259, column: 57, scope: !329)
!340 = !DILocalVariable(name: "i", scope: !329, file: !3, line: 261, type: !7)
!341 = !DILocation(line: 261, column: 6, scope: !329)
!342 = !DILocation(line: 263, column: 9, scope: !343)
!343 = distinct !DILexicalBlock(scope: !329, file: !3, line: 263, column: 2)
!344 = !DILocation(line: 263, column: 7, scope: !343)
!345 = !DILocation(line: 263, column: 14, scope: !346)
!346 = distinct !DILexicalBlock(scope: !343, file: !3, line: 263, column: 2)
!347 = !DILocation(line: 263, column: 16, scope: !346)
!348 = !DILocation(line: 263, column: 2, scope: !343)
!349 = !DILocation(line: 264, column: 7, scope: !350)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 264, column: 7)
!351 = distinct !DILexicalBlock(scope: !346, file: !3, line: 263, column: 47)
!352 = !DILocation(line: 264, column: 28, scope: !350)
!353 = !DILocation(line: 264, column: 17, scope: !350)
!354 = !DILocation(line: 264, column: 31, scope: !350)
!355 = !DILocation(line: 264, column: 14, scope: !350)
