; ModuleID = '../bcout/drivers/base/devres.llvm.bc'
source_filename = "drivers/base/devres.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }
%struct.desc_struct = type { i16, i16, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !60, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/base/devres.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3, !9, !15, !21, !27, !34, !42, !48, !53}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !4, line: 65, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8}
!7 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !10, line: 16, baseType: !5, size: 32, elements: !11)
!10 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !16, line: 26, baseType: !5, size: 32, elements: !17)
!16 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!17 = !{!18, !19, !20}
!18 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !22, line: 44, baseType: !5, size: 32, elements: !23)
!22 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!23 = !{!24, !25, !26}
!24 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !28, line: 343, baseType: !5, size: 32, elements: !29)
!28 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !35, line: 524, baseType: !5, size: 32, elements: !36)
!35 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !35, line: 502, baseType: !5, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 10, baseType: !5, size: 32, elements: !50)
!49 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !54, line: 305, baseType: !5, size: 32, elements: !55)
!54 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!60 = !{!61, !63, !64, !1991, !190, !1997, !1998, !2001, !2002}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !62, line: 148, baseType: !5)
!62 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "devres_node", file: !1, line: 18, size: 192, elements: !66)
!66 = !{!67, !73}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !65, file: !1, line: 19, baseType: !68, size: 128)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !62, line: 178, size: 128, elements: !69)
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !62, line: 179, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !68, file: !62, line: 179, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !65, file: !1, line: 20, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "dr_release_t", file: !28, line: 165, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78, !63}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !28, line: 461, size: 5568, elements: !80)
!80 = !{!81, !1570, !1571, !1792, !1793, !1807, !1808, !1809, !1810, !1811, !1812, !1821, !1926, !1939, !1942, !1943, !1947, !1949, !1950, !1951, !1955, !1961, !1962, !1965, !1969, !1972, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1984, !1987, !1988, !1989, !1990}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !79, file: !28, line: 462, baseType: !82, size: 512)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !83, line: 64, size: 512, elements: !84)
!83 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!84 = !{!85, !89, !90, !92, !153, !1407, !1560, !1565, !1566, !1567, !1568, !1569}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !83, line: 65, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !82, file: !83, line: 66, baseType: !68, size: 128, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !82, file: !83, line: 67, baseType: !91, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !82, file: !83, line: 68, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !83, line: 192, size: 704, elements: !95)
!95 = !{!96, !97, !113, !114}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !94, file: !83, line: 193, baseType: !68, size: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !94, file: !83, line: 194, baseType: !98, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !99, line: 83, baseType: !100)
!99 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !99, line: 71, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, scope: !100, file: !99, line: 72, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !100, file: !99, line: 72, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !103, file: !99, line: 73, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !99, line: 20, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !106, file: !99, line: 21, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !110, line: 25, baseType: !111)
!110 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 25, elements: !112)
!112 = !{}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !94, file: !83, line: 195, baseType: !82, size: 512, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !94, file: !83, line: 196, baseType: !115, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !83, line: 156, size: 192, elements: !118)
!118 = !{!119, !125, !130}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !117, file: !83, line: 157, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!124, !93, !91}
!124 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !83, line: 158, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!86, !93, !91}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !117, file: !83, line: 159, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!124, !93, !91, !135}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !83, line: 148, size: 20736, elements: !137)
!137 = !{!138, !143, !147, !148, !152}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !136, file: !83, line: 149, baseType: !139, size: 192)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 192, elements: !141)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!141 = !{!142}
!142 = !DISubrange(count: 3)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !136, file: !83, line: 150, baseType: !144, size: 4096, offset: 192)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 4096, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !136, file: !83, line: 151, baseType: !124, size: 32, offset: 4288)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !136, file: !83, line: 152, baseType: !149, size: 16384, offset: 4320)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 16384, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 2048)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !136, file: !83, line: 153, baseType: !124, size: 32, offset: 20704)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !82, file: !83, line: 69, baseType: !154, size: 64, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !83, line: 138, size: 448, elements: !156)
!156 = !{!157, !161, !191, !193, !1353, !1386, !1390}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !155, file: !83, line: 139, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !91}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !155, file: !83, line: 140, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !165, line: 230, size: 128, elements: !166)
!165 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!166 = !{!167, !183}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !164, file: !165, line: 231, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !91, !176, !140}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !62, line: 60, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !173, line: 73, baseType: !174)
!173 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !173, line: 15, baseType: !175)
!175 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !165, line: 30, size: 128, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !165, line: 31, baseType: !86, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !177, file: !165, line: 32, baseType: !181, size: 16, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !62, line: 19, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !164, file: !165, line: 232, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!171, !91, !176, !86, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 55, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !173, line: 72, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !173, line: 16, baseType: !190)
!190 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !155, file: !83, line: 141, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !155, file: !83, line: 142, baseType: !194, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !165, line: 84, size: 320, elements: !198)
!198 = !{!199, !200, !204, !1350, !1351}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !165, line: 85, baseType: !86, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !197, file: !165, line: 86, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!181, !91, !176, !124}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !197, file: !165, line: 88, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!181, !91, !208, !124}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !165, line: 168, size: 448, elements: !210)
!210 = !{!211, !212, !213, !214, !224, !225}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !209, file: !165, line: 169, baseType: !177, size: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !209, file: !165, line: 170, baseType: !187, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !209, file: !165, line: 171, baseType: !63, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !209, file: !165, line: 172, baseType: !215, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!171, !218, !91, !208, !140, !221, !187}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !220, line: 526, flags: DIFlagFwdDecl)
!220 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !62, line: 46, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !173, line: 88, baseType: !223)
!223 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !209, file: !165, line: 174, baseType: !215, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !209, file: !165, line: 176, baseType: !226, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!124, !218, !91, !208, !229}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !231, line: 305, size: 1472, elements: !232)
!231 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!232 = !{!233, !234, !235, !236, !237, !245, !246, !1324, !1330, !1331, !1336, !1337, !1340, !1344, !1345, !1346, !1347, !1348}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !230, file: !231, line: 308, baseType: !190, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !230, file: !231, line: 309, baseType: !190, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !230, file: !231, line: 313, baseType: !229, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !230, file: !231, line: 313, baseType: !229, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !230, file: !231, line: 315, baseType: !238, size: 192, align: 64, offset: 256)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !239, line: 24, size: 192, align: 64, elements: !240)
!239 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!240 = !{!241, !242, !244}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !238, file: !239, line: 25, baseType: !190, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !238, file: !239, line: 26, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !238, file: !239, line: 27, baseType: !243, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !230, file: !231, line: 323, baseType: !190, size: 64, offset: 448)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !230, file: !231, line: 327, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !231, line: 388, size: 7296, elements: !249)
!249 = !{!250, !1320}
!250 = !DIDerivedType(tag: DW_TAG_member, scope: !248, file: !231, line: 389, baseType: !251, size: 7296)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !248, file: !231, line: 389, size: 7296, elements: !252)
!252 = !{!253, !254, !258, !264, !268, !269, !270, !271, !272, !280, !285, !286, !287, !288, !297, !298, !299, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !334, !342, !345, !393, !394, !1290, !1291, !1294, !1298, !1299, !1302, !1303, !1304, !1307, !1319}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !251, file: !231, line: 390, baseType: !229, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !251, file: !231, line: 391, baseType: !255, size: 64, offset: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !239, line: 31, size: 64, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !255, file: !239, line: 32, baseType: !243, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !251, file: !231, line: 392, baseType: !259, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !260, line: 23, baseType: !261)
!260 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !262, line: 31, baseType: !263)
!262 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!263 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !251, file: !231, line: 394, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!190, !218, !190, !190, !190, !190}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !251, file: !231, line: 398, baseType: !190, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !251, file: !231, line: 399, baseType: !190, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !251, file: !231, line: 405, baseType: !190, size: 64, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !251, file: !231, line: 406, baseType: !190, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !251, file: !231, line: 407, baseType: !273, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !220, line: 286, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !220, line: 286, size: 64, elements: !276)
!276 = !{!277}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !275, file: !220, line: 286, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !279, line: 18, baseType: !190)
!279 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!280 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !251, file: !231, line: 416, baseType: !281, size: 32, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !62, line: 168, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 166, size: 32, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !282, file: !62, line: 167, baseType: !124, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !251, file: !231, line: 428, baseType: !281, size: 32, offset: 608)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !251, file: !231, line: 437, baseType: !281, size: 32, offset: 640)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !251, file: !231, line: 447, baseType: !281, size: 32, offset: 672)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !251, file: !231, line: 450, baseType: !289, size: 64, offset: 704)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !290, line: 13, baseType: !291)
!290 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !62, line: 175, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 173, size: 64, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !292, file: !62, line: 174, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !260, line: 22, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !262, line: 30, baseType: !223)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !251, file: !231, line: 452, baseType: !124, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !251, file: !231, line: 454, baseType: !98, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !251, file: !231, line: 457, baseType: !300, size: 256, offset: 832)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !301, line: 35, size: 256, elements: !302)
!301 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!302 = !{!303, !304, !305, !307}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !300, file: !301, line: 36, baseType: !289, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !300, file: !301, line: 42, baseType: !289, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !300, file: !301, line: 46, baseType: !306, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !99, line: 29, baseType: !106)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !300, file: !301, line: 47, baseType: !68, size: 128, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !251, file: !231, line: 459, baseType: !68, size: 128, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !251, file: !231, line: 466, baseType: !190, size: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !251, file: !231, line: 467, baseType: !190, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !251, file: !231, line: 469, baseType: !190, size: 64, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !251, file: !231, line: 470, baseType: !190, size: 64, offset: 1408)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !251, file: !231, line: 471, baseType: !291, size: 64, offset: 1472)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !251, file: !231, line: 472, baseType: !190, size: 64, offset: 1536)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !251, file: !231, line: 473, baseType: !190, size: 64, offset: 1600)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !251, file: !231, line: 474, baseType: !190, size: 64, offset: 1664)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !251, file: !231, line: 475, baseType: !190, size: 64, offset: 1728)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !251, file: !231, line: 477, baseType: !98, offset: 1792)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !251, file: !231, line: 478, baseType: !190, size: 64, offset: 1792)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !251, file: !231, line: 478, baseType: !190, size: 64, offset: 1856)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !251, file: !231, line: 478, baseType: !190, size: 64, offset: 1920)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !251, file: !231, line: 478, baseType: !190, size: 64, offset: 1984)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !251, file: !231, line: 479, baseType: !190, size: 64, offset: 2048)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !251, file: !231, line: 479, baseType: !190, size: 64, offset: 2112)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !251, file: !231, line: 479, baseType: !190, size: 64, offset: 2176)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !251, file: !231, line: 480, baseType: !190, size: 64, offset: 2240)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !251, file: !231, line: 480, baseType: !190, size: 64, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !251, file: !231, line: 480, baseType: !190, size: 64, offset: 2368)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !251, file: !231, line: 480, baseType: !190, size: 64, offset: 2432)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !251, file: !231, line: 482, baseType: !331, size: 2816, offset: 2496)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 2816, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 44)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !251, file: !231, line: 488, baseType: !335, size: 256, offset: 5312)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !336, line: 60, size: 256, elements: !337)
!336 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !335, file: !336, line: 61, baseType: !339, size: 256)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 256, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 4)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !251, file: !231, line: 490, baseType: !343, size: 64, offset: 5568)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !231, line: 490, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !251, file: !231, line: 493, baseType: !346, size: 896, offset: 5632)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !347, line: 53, baseType: !348)
!347 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !347, line: 13, size: 896, elements: !349)
!349 = !{!350, !351, !352, !353, !356, !357, !364, !365, !385, !386, !389}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !348, file: !347, line: 18, baseType: !259, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !348, file: !347, line: 28, baseType: !291, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !348, file: !347, line: 31, baseType: !300, size: 256, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !348, file: !347, line: 32, baseType: !354, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !347, line: 32, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !348, file: !347, line: 37, baseType: !182, size: 16, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !348, file: !347, line: 40, baseType: !358, size: 192, offset: 512)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !359, line: 53, size: 192, elements: !360)
!359 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !358, file: !359, line: 54, baseType: !289, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !358, file: !359, line: 55, baseType: !98, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !358, file: !359, line: 59, baseType: !68, size: 128, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !348, file: !347, line: 41, baseType: !63, size: 64, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !348, file: !347, line: 42, baseType: !366, size: 64, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !369, line: 13, size: 896, elements: !370)
!369 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !368, file: !369, line: 14, baseType: !63, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !368, file: !369, line: 15, baseType: !190, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !368, file: !369, line: 17, baseType: !190, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !368, file: !369, line: 17, baseType: !190, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !368, file: !369, line: 19, baseType: !175, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !368, file: !369, line: 21, baseType: !175, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !368, file: !369, line: 22, baseType: !175, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !368, file: !369, line: 23, baseType: !175, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !368, file: !369, line: 24, baseType: !175, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !368, file: !369, line: 25, baseType: !175, size: 64, offset: 576)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !368, file: !369, line: 26, baseType: !175, size: 64, offset: 640)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !368, file: !369, line: 27, baseType: !175, size: 64, offset: 704)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !368, file: !369, line: 28, baseType: !175, size: 64, offset: 768)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !368, file: !369, line: 29, baseType: !175, size: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !348, file: !347, line: 44, baseType: !281, size: 32, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !348, file: !347, line: 50, baseType: !387, size: 16, offset: 864)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !260, line: 19, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !262, line: 24, baseType: !182)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !348, file: !347, line: 51, baseType: !390, size: 16, offset: 880)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !260, line: 18, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !262, line: 23, baseType: !392)
!392 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !231, line: 495, baseType: !190, size: 64, offset: 6528)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !251, file: !231, line: 497, baseType: !395, size: 64, offset: 6592)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !231, line: 381, size: 384, elements: !397)
!397 = !{!398, !399, !1289}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !396, file: !231, line: 382, baseType: !281, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !396, file: !231, line: 383, baseType: !400, size: 128, offset: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !231, line: 376, size: 128, elements: !401)
!401 = !{!402, !1287}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !400, file: !231, line: 377, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !405, line: 640, size: 48640, elements: !406)
!405 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!406 = !{!407, !415, !417, !418, !424, !425, !426, !427, !428, !429, !430, !431, !435, !453, !464, !559, !560, !561, !572, !573, !575, !576, !577, !578, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !657, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !713, !715, !716, !717, !729, !731, !732, !733, !734, !735, !741, !742, !743, !744, !745, !746, !747, !759, !764, !768, !769, !770, !773, !777, !780, !783, !786, !789, !792, !795, !798, !804, !805, !806, !812, !813, !814, !815, !816, !825, !826, !827, !828, !829, !834, !835, !836, !839, !840, !843, !846, !849, !852, !855, !858, !859, !939, !942, !945, !946, !949, !950, !951, !957, !958, !959, !972, !973, !974, !986, !991, !994, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !404, file: !405, line: 646, baseType: !408, size: 128)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !409, line: 56, size: 128, elements: !410)
!409 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !409, line: 57, baseType: !190, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !408, file: !409, line: 58, baseType: !413, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !260, line: 21, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !262, line: 27, baseType: !5)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !405, line: 649, baseType: !416, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !175)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !404, file: !405, line: 657, baseType: !63, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !404, file: !405, line: 658, baseType: !419, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !420, line: 113, baseType: !421)
!420 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !420, line: 111, size: 32, elements: !422)
!422 = !{!423}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !421, file: !420, line: 112, baseType: !281, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !404, file: !405, line: 660, baseType: !5, size: 32, offset: 288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !404, file: !405, line: 661, baseType: !5, size: 32, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !404, file: !405, line: 684, baseType: !124, size: 32, offset: 352)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !404, file: !405, line: 686, baseType: !124, size: 32, offset: 384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !404, file: !405, line: 687, baseType: !124, size: 32, offset: 416)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !404, file: !405, line: 688, baseType: !124, size: 32, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !404, file: !405, line: 689, baseType: !5, size: 32, offset: 480)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !404, file: !405, line: 691, baseType: !432, size: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !405, line: 691, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !404, file: !405, line: 692, baseType: !436, size: 832, offset: 576)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !405, line: 451, size: 832, elements: !437)
!437 = !{!438, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !436, file: !405, line: 453, baseType: !439, size: 128)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !405, line: 325, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !439, file: !405, line: 326, baseType: !190, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !439, file: !405, line: 327, baseType: !413, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !436, file: !405, line: 454, baseType: !238, size: 192, align: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !436, file: !405, line: 455, baseType: !68, size: 128, offset: 320)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !436, file: !405, line: 456, baseType: !5, size: 32, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !436, file: !405, line: 458, baseType: !259, size: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !436, file: !405, line: 459, baseType: !259, size: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !436, file: !405, line: 460, baseType: !259, size: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !436, file: !405, line: 461, baseType: !259, size: 64, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !436, file: !405, line: 463, baseType: !259, size: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !436, file: !405, line: 465, baseType: !452, offset: 832)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !405, line: 415, elements: !112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !404, file: !405, line: 693, baseType: !454, size: 384, offset: 1408)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !405, line: 489, size: 384, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !454, file: !405, line: 490, baseType: !68, size: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !454, file: !405, line: 491, baseType: !190, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !454, file: !405, line: 492, baseType: !190, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !454, file: !405, line: 493, baseType: !5, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !454, file: !405, line: 494, baseType: !182, size: 16, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !454, file: !405, line: 495, baseType: !182, size: 16, offset: 304)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !454, file: !405, line: 497, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !404, file: !405, line: 697, baseType: !465, size: 1792, offset: 1792)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !405, line: 507, size: 1792, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !556, !557}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !465, file: !405, line: 508, baseType: !238, size: 192, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !465, file: !405, line: 515, baseType: !259, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !465, file: !405, line: 516, baseType: !259, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !465, file: !405, line: 517, baseType: !259, size: 64, offset: 320)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !465, file: !405, line: 518, baseType: !259, size: 64, offset: 384)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !465, file: !405, line: 519, baseType: !259, size: 64, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !465, file: !405, line: 526, baseType: !295, size: 64, offset: 512)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !465, file: !405, line: 527, baseType: !259, size: 64, offset: 576)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !405, line: 528, baseType: !5, size: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !465, file: !405, line: 554, baseType: !5, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !465, file: !405, line: 555, baseType: !5, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !465, file: !405, line: 556, baseType: !5, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !465, file: !405, line: 557, baseType: !5, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !465, file: !405, line: 563, baseType: !481, size: 512, offset: 704)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !4, line: 118, size: 512, elements: !482)
!482 = !{!483, !491, !492, !497, !549, !553, !554, !555}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !481, file: !4, line: 119, baseType: !484, size: 256)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !485, line: 9, size: 256, elements: !486)
!485 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !484, file: !485, line: 10, baseType: !238, size: 192, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !484, file: !485, line: 11, baseType: !489, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !490, line: 29, baseType: !295)
!490 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !481, file: !4, line: 120, baseType: !489, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !481, file: !4, line: 121, baseType: !493, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!3, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !481, file: !4, line: 122, baseType: !498, size: 64, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !4, line: 159, size: 512, align: 512, elements: !500)
!500 = !{!501, !521, !522, !525, !535, !536, !544, !548}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !499, file: !4, line: 160, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !4, line: 214, size: 4608, align: 512, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !503, file: !4, line: 215, baseType: !306)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !503, file: !4, line: 216, baseType: !5, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !503, file: !4, line: 217, baseType: !5, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !503, file: !4, line: 218, baseType: !5, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !503, file: !4, line: 219, baseType: !5, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !503, file: !4, line: 220, baseType: !5, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !503, file: !4, line: 221, baseType: !5, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !503, file: !4, line: 222, baseType: !5, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !503, file: !4, line: 233, baseType: !489, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !503, file: !4, line: 234, baseType: !496, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !503, file: !4, line: 235, baseType: !489, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !503, file: !4, line: 236, baseType: !496, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !503, file: !4, line: 237, baseType: !518, size: 4096, offset: 512)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 4096, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !499, file: !4, line: 161, baseType: !5, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !499, file: !4, line: 162, baseType: !523, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !62, line: 27, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !173, line: 96, baseType: !124)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !499, file: !4, line: 163, baseType: !526, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !527, line: 276, baseType: !528)
!527 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !527, line: 276, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !528, file: !527, line: 276, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !527, line: 70, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !527, line: 65, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !532, file: !527, line: 66, baseType: !5, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !499, file: !4, line: 164, baseType: !496, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !499, file: !4, line: 165, baseType: !537, size: 128, offset: 256)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !485, line: 14, size: 128, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !537, file: !485, line: 15, baseType: !540, size: 128)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !239, line: 125, size: 128, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !540, file: !239, line: 126, baseType: !255, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !540, file: !239, line: 127, baseType: !243, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !499, file: !4, line: 166, baseType: !545, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!489}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !499, file: !4, line: 167, baseType: !489, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !481, file: !4, line: 123, baseType: !550, size: 8, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !260, line: 17, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !262, line: 21, baseType: !552)
!552 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !481, file: !4, line: 124, baseType: !550, size: 8, offset: 456)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !481, file: !4, line: 125, baseType: !550, size: 8, offset: 464)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !481, file: !4, line: 126, baseType: !550, size: 8, offset: 472)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !465, file: !405, line: 572, baseType: !481, size: 512, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !465, file: !405, line: 580, baseType: !558, size: 64, offset: 1728)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !404, file: !405, line: 721, baseType: !5, size: 32, offset: 3584)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !404, file: !405, line: 722, baseType: !124, size: 32, offset: 3616)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !404, file: !405, line: 723, baseType: !562, size: 64, offset: 3648)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !565, line: 17, baseType: !566)
!565 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !565, line: 17, size: 64, elements: !567)
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !566, file: !565, line: 17, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !570)
!570 = !{!571}
!571 = !DISubrange(count: 1)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !404, file: !405, line: 724, baseType: !564, size: 64, offset: 3712)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !404, file: !405, line: 749, baseType: !574, offset: 3776)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !405, line: 290, elements: !112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !404, file: !405, line: 751, baseType: !68, size: 128, offset: 3776)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !404, file: !405, line: 757, baseType: !247, size: 64, offset: 3904)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !404, file: !405, line: 758, baseType: !247, size: 64, offset: 3968)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !404, file: !405, line: 761, baseType: !579, size: 320, offset: 4032)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !336, line: 34, size: 320, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !579, file: !336, line: 35, baseType: !259, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !579, file: !336, line: 36, baseType: !583, size: 256, offset: 64)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 256, elements: !340)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !404, file: !405, line: 766, baseType: !124, size: 32, offset: 4352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !404, file: !405, line: 767, baseType: !124, size: 32, offset: 4384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !404, file: !405, line: 768, baseType: !124, size: 32, offset: 4416)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !404, file: !405, line: 770, baseType: !124, size: 32, offset: 4448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !404, file: !405, line: 772, baseType: !190, size: 64, offset: 4480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !404, file: !405, line: 775, baseType: !5, size: 32, offset: 4544)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !404, file: !405, line: 778, baseType: !5, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !404, file: !405, line: 779, baseType: !5, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !404, file: !405, line: 780, baseType: !5, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !404, file: !405, line: 803, baseType: !5, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !404, file: !405, line: 806, baseType: !5, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !404, file: !405, line: 807, baseType: !5, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !404, file: !405, line: 809, baseType: !5, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !404, file: !405, line: 815, baseType: !5, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !404, file: !405, line: 831, baseType: !190, size: 64, offset: 4672)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !404, file: !405, line: 833, baseType: !600, size: 384, offset: 4736)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !10, line: 25, size: 384, elements: !601)
!601 = !{!602, !607}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !600, file: !10, line: 26, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!175, !606}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, scope: !600, file: !10, line: 27, baseType: !608, size: 320, offset: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !600, file: !10, line: 27, size: 320, elements: !609)
!609 = !{!610, !620, !647}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !608, file: !10, line: 36, baseType: !611, size: 320)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !10, line: 29, size: 320, elements: !612)
!612 = !{!613, !615, !616, !617, !618, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !611, file: !10, line: 30, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !611, file: !10, line: 31, baseType: !413, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !611, file: !10, line: 32, baseType: !413, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !611, file: !10, line: 33, baseType: !413, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !611, file: !10, line: 34, baseType: !259, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !611, file: !10, line: 35, baseType: !614, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !608, file: !10, line: 46, baseType: !621, size: 192)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !10, line: 38, size: 192, elements: !622)
!622 = !{!623, !624, !625, !646}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !621, file: !10, line: 39, baseType: !523, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !10, line: 40, baseType: !9, size: 32, offset: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !10, line: 41, baseType: !626, size: 64, offset: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !10, line: 41, size: 64, elements: !627)
!627 = !{!628, !636}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !626, file: !10, line: 42, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !631, line: 7, size: 128, elements: !632)
!631 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!632 = !{!633, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !630, file: !631, line: 8, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !173, line: 93, baseType: !223)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !630, file: !631, line: 9, baseType: !223, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !626, file: !10, line: 43, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !639, line: 7, size: 64, elements: !640)
!639 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!640 = !{!641, !645}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !638, file: !639, line: 8, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !639, line: 5, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !260, line: 20, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !262, line: 26, baseType: !124)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !638, file: !639, line: 9, baseType: !643, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !621, file: !10, line: 45, baseType: !259, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !608, file: !10, line: 54, baseType: !648, size: 256)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !10, line: 48, size: 256, elements: !649)
!649 = !{!650, !653, !654, !655, !656}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !648, file: !10, line: 49, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !10, line: 14, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !648, file: !10, line: 50, baseType: !124, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !648, file: !10, line: 51, baseType: !124, size: 32, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !648, file: !10, line: 52, baseType: !190, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !648, file: !10, line: 53, baseType: !190, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !404, file: !405, line: 835, baseType: !658, size: 32, offset: 5120)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !62, line: 22, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !173, line: 28, baseType: !124)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !404, file: !405, line: 836, baseType: !658, size: 32, offset: 5152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !404, file: !405, line: 840, baseType: !190, size: 64, offset: 5184)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !404, file: !405, line: 849, baseType: !403, size: 64, offset: 5248)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !404, file: !405, line: 852, baseType: !403, size: 64, offset: 5312)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !404, file: !405, line: 857, baseType: !68, size: 128, offset: 5376)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !404, file: !405, line: 858, baseType: !68, size: 128, offset: 5504)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !404, file: !405, line: 859, baseType: !403, size: 64, offset: 5632)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !404, file: !405, line: 867, baseType: !68, size: 128, offset: 5696)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !404, file: !405, line: 868, baseType: !68, size: 128, offset: 5824)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !404, file: !405, line: 871, baseType: !670, size: 64, offset: 5952)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !672, line: 59, size: 768, elements: !673)
!672 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!673 = !{!674, !675, !676, !677, !688, !689, !696, !705}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !671, file: !672, line: 61, baseType: !419, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !671, file: !672, line: 62, baseType: !5, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !671, file: !672, line: 63, baseType: !98, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !671, file: !672, line: 65, baseType: !678, size: 256, offset: 64)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 256, elements: !340)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !62, line: 182, size: 64, elements: !680)
!680 = !{!681}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !679, file: !62, line: 183, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !62, line: 186, size: 128, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !683, file: !62, line: 187, baseType: !682, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !683, file: !62, line: 187, baseType: !687, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !671, file: !672, line: 66, baseType: !679, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !671, file: !672, line: 68, baseType: !690, size: 128, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !691, line: 40, baseType: !692)
!691 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !691, line: 36, size: 128, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !692, file: !691, line: 37, baseType: !98)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !692, file: !691, line: 38, baseType: !68, size: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !671, file: !672, line: 69, baseType: !697, size: 128, align: 64, offset: 512)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !62, line: 216, size: 128, align: 64, elements: !698)
!698 = !{!699, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !62, line: 217, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !697, file: !62, line: 218, baseType: !702, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !700}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !671, file: !672, line: 70, baseType: !706, size: 128, offset: 640)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, elements: !570)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !672, line: 54, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !707, file: !672, line: 55, baseType: !124, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !707, file: !672, line: 56, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !672, line: 56, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !404, file: !405, line: 872, baseType: !714, size: 512, offset: 6016)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 512, elements: !340)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !404, file: !405, line: 873, baseType: !68, size: 128, offset: 6528)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !404, file: !405, line: 874, baseType: !68, size: 128, offset: 6656)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !404, file: !405, line: 876, baseType: !718, size: 64, offset: 6784)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !720, line: 26, size: 192, elements: !721)
!720 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !719, file: !720, line: 27, baseType: !5, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !719, file: !720, line: 28, baseType: !724, size: 128, offset: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !725, line: 43, size: 128, elements: !726)
!725 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !724, file: !725, line: 44, baseType: !306)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !724, file: !725, line: 45, baseType: !68, size: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !404, file: !405, line: 879, baseType: !730, size: 64, offset: 6848)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !404, file: !405, line: 882, baseType: !730, size: 64, offset: 6912)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !404, file: !405, line: 884, baseType: !259, size: 64, offset: 6976)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !404, file: !405, line: 885, baseType: !259, size: 64, offset: 7040)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !404, file: !405, line: 890, baseType: !259, size: 64, offset: 7104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !404, file: !405, line: 891, baseType: !736, size: 128, offset: 7168)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !405, line: 242, size: 128, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !736, file: !405, line: 244, baseType: !259, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !736, file: !405, line: 245, baseType: !259, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !736, file: !405, line: 246, baseType: !306, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !404, file: !405, line: 900, baseType: !190, size: 64, offset: 7296)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !404, file: !405, line: 901, baseType: !190, size: 64, offset: 7360)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !404, file: !405, line: 904, baseType: !259, size: 64, offset: 7424)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !404, file: !405, line: 907, baseType: !259, size: 64, offset: 7488)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !404, file: !405, line: 910, baseType: !190, size: 64, offset: 7552)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !404, file: !405, line: 911, baseType: !190, size: 64, offset: 7616)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !404, file: !405, line: 914, baseType: !748, size: 640, offset: 7680)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !749, line: 123, size: 640, elements: !750)
!749 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!750 = !{!751, !757, !758}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !748, file: !749, line: 124, baseType: !752, size: 576)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 576, elements: !141)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !749, line: 108, size: 192, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !753, file: !749, line: 109, baseType: !259, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !753, file: !749, line: 110, baseType: !537, size: 128, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !748, file: !749, line: 125, baseType: !5, size: 32, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !748, file: !749, line: 126, baseType: !5, size: 32, offset: 608)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !404, file: !405, line: 917, baseType: !760, size: 192, offset: 8320)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !749, line: 134, size: 192, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !760, file: !749, line: 135, baseType: !697, size: 128, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !760, file: !749, line: 136, baseType: !5, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !404, file: !405, line: 923, baseType: !765, size: 64, offset: 8512)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !405, line: 923, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !404, file: !405, line: 926, baseType: !765, size: 64, offset: 8576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !404, file: !405, line: 929, baseType: !765, size: 64, offset: 8640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !404, file: !405, line: 933, baseType: !771, size: 64, offset: 8704)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !405, line: 933, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !404, file: !405, line: 943, baseType: !774, size: 128, offset: 8768)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 128, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 16)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !404, file: !405, line: 945, baseType: !778, size: 64, offset: 8896)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !405, line: 49, flags: DIFlagFwdDecl)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !404, file: !405, line: 956, baseType: !781, size: 64, offset: 8960)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !405, line: 45, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !404, file: !405, line: 959, baseType: !784, size: 64, offset: 9024)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !405, line: 959, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !404, file: !405, line: 962, baseType: !787, size: 64, offset: 9088)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !405, line: 66, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !404, file: !405, line: 966, baseType: !790, size: 64, offset: 9152)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !405, line: 50, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !404, file: !405, line: 969, baseType: !793, size: 64, offset: 9216)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !749, line: 223, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !404, file: !405, line: 970, baseType: !796, size: 64, offset: 9280)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !405, line: 62, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !404, file: !405, line: 971, baseType: !799, size: 64, offset: 9344)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !800, line: 25, baseType: !801)
!800 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 23, size: 64, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !801, file: !800, line: 24, baseType: !569, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !404, file: !405, line: 972, baseType: !799, size: 64, offset: 9408)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !404, file: !405, line: 974, baseType: !799, size: 64, offset: 9472)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !404, file: !405, line: 975, baseType: !807, size: 192, offset: 9536)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !808, line: 30, size: 192, elements: !809)
!808 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !807, file: !808, line: 31, baseType: !68, size: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !807, file: !808, line: 32, baseType: !799, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !404, file: !405, line: 976, baseType: !190, size: 64, offset: 9728)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !404, file: !405, line: 977, baseType: !187, size: 64, offset: 9792)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !404, file: !405, line: 978, baseType: !5, size: 32, offset: 9856)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !404, file: !405, line: 980, baseType: !700, size: 64, offset: 9920)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !404, file: !405, line: 989, baseType: !817, size: 128, offset: 9984)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !818, line: 35, size: 128, elements: !819)
!818 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !817, file: !818, line: 36, baseType: !124, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !817, file: !818, line: 37, baseType: !281, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !817, file: !818, line: 38, baseType: !823, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !818, line: 23, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !404, file: !405, line: 992, baseType: !259, size: 64, offset: 10112)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !404, file: !405, line: 993, baseType: !259, size: 64, offset: 10176)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !404, file: !405, line: 996, baseType: !98, offset: 10240)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !404, file: !405, line: 999, baseType: !306, offset: 10240)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !404, file: !405, line: 1001, baseType: !830, size: 64, offset: 10240)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !405, line: 636, size: 64, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !405, line: 637, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !404, file: !405, line: 1005, baseType: !540, size: 128, offset: 10304)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !404, file: !405, line: 1007, baseType: !403, size: 64, offset: 10432)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !404, file: !405, line: 1009, baseType: !837, size: 64, offset: 10496)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !405, line: 1009, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !404, file: !405, line: 1043, baseType: !63, size: 64, offset: 10560)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !404, file: !405, line: 1046, baseType: !841, size: 64, offset: 10624)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !405, line: 41, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !404, file: !405, line: 1050, baseType: !844, size: 64, offset: 10688)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !405, line: 42, flags: DIFlagFwdDecl)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !404, file: !405, line: 1054, baseType: !847, size: 64, offset: 10752)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !405, line: 55, flags: DIFlagFwdDecl)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !404, file: !405, line: 1056, baseType: !850, size: 64, offset: 10816)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !405, line: 40, flags: DIFlagFwdDecl)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !404, file: !405, line: 1058, baseType: !853, size: 64, offset: 10880)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !405, line: 47, flags: DIFlagFwdDecl)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !404, file: !405, line: 1061, baseType: !856, size: 64, offset: 10944)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !405, line: 43, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !404, file: !405, line: 1064, baseType: !190, size: 64, offset: 11008)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !404, file: !405, line: 1065, baseType: !860, size: 64, offset: 11072)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !808, line: 14, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !808, line: 12, size: 384, elements: !863)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !808, line: 13, baseType: !865, size: 384)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !862, file: !808, line: 13, size: 384, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !865, file: !808, line: 13, baseType: !124, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !865, file: !808, line: 13, baseType: !124, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !865, file: !808, line: 13, baseType: !124, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !865, file: !808, line: 13, baseType: !871, size: 256, offset: 128)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !872, line: 32, size: 256, elements: !873)
!872 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!873 = !{!874, !880, !893, !899, !908, !928, !933}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !871, file: !872, line: 37, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 34, size: 64, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !875, file: !872, line: 35, baseType: !659, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !875, file: !872, line: 36, baseType: !879, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !173, line: 49, baseType: !5)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !871, file: !872, line: 45, baseType: !881, size: 192)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 40, size: 192, elements: !882)
!882 = !{!883, !885, !886, !892}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !881, file: !872, line: 41, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !173, line: 95, baseType: !124)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !881, file: !872, line: 42, baseType: !124, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !881, file: !872, line: 43, baseType: !887, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !872, line: 11, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !872, line: 8, size: 64, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !888, file: !872, line: 9, baseType: !124, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !888, file: !872, line: 10, baseType: !63, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !881, file: !872, line: 44, baseType: !124, size: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !871, file: !872, line: 52, baseType: !894, size: 128)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 48, size: 128, elements: !895)
!895 = !{!896, !897, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !894, file: !872, line: 49, baseType: !659, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !894, file: !872, line: 50, baseType: !879, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !894, file: !872, line: 51, baseType: !887, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !871, file: !872, line: 61, baseType: !900, size: 256)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 55, size: 256, elements: !901)
!901 = !{!902, !903, !904, !905, !907}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !900, file: !872, line: 56, baseType: !659, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !900, file: !872, line: 57, baseType: !879, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !900, file: !872, line: 58, baseType: !124, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !900, file: !872, line: 59, baseType: !906, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !173, line: 94, baseType: !174)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !900, file: !872, line: 60, baseType: !906, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !871, file: !872, line: 95, baseType: !909, size: 256)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 64, size: 256, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !909, file: !872, line: 65, baseType: !63, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, scope: !909, file: !872, line: 77, baseType: !913, size: 192, offset: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !909, file: !872, line: 77, size: 192, elements: !914)
!914 = !{!915, !916, !923}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !913, file: !872, line: 82, baseType: !392, size: 16)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !913, file: !872, line: 88, baseType: !917, size: 192)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !913, file: !872, line: 84, size: 192, elements: !918)
!918 = !{!919, !921, !922}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !917, file: !872, line: 85, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 64, elements: !519)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !917, file: !872, line: 86, baseType: !63, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !917, file: !872, line: 87, baseType: !63, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !913, file: !872, line: 93, baseType: !924, size: 96)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !913, file: !872, line: 90, size: 96, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !924, file: !872, line: 91, baseType: !920, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !924, file: !872, line: 92, baseType: !414, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !871, file: !872, line: 101, baseType: !929, size: 128)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 98, size: 128, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !929, file: !872, line: 99, baseType: !175, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !929, file: !872, line: 100, baseType: !124, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !871, file: !872, line: 108, baseType: !934, size: 128)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !872, line: 104, size: 128, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !934, file: !872, line: 105, baseType: !63, size: 64)
