; ModuleID = '../bcout/drivers/base/property.llvm.bc'
source_filename = "drivers/base/property.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.fwnode_operations = type { %struct.fwnode_handle* (%struct.fwnode_handle*)*, void (%struct.fwnode_handle*)*, i1 (%struct.fwnode_handle*)*, i8* (%struct.fwnode_handle*, %struct.device*)*, i1 (%struct.fwnode_handle*, i8*)*, i32 (%struct.fwnode_handle*, i8*, i32, i8*, i64)*, i32 (%struct.fwnode_handle*, i8*, i8**, i64)*, i8* (%struct.fwnode_handle*)*, i8* (%struct.fwnode_handle*)*, %struct.fwnode_handle* (%struct.fwnode_handle*)*, %struct.fwnode_handle* (%struct.fwnode_handle*, %struct.fwnode_handle*)*, %struct.fwnode_handle* (%struct.fwnode_handle*, i8*)*, i32 (%struct.fwnode_handle*, i8*, i8*, i32, i32, %struct.fwnode_reference_args*)*, %struct.fwnode_handle* (%struct.fwnode_handle*, %struct.fwnode_handle*)*, %struct.fwnode_handle* (%struct.fwnode_handle*)*, %struct.fwnode_handle* (%struct.fwnode_handle*)*, i32 (%struct.fwnode_handle*, %struct.fwnode_endpoint*)*, i32 (%struct.fwnode_handle*, %struct.device*)* }
%struct.fwnode_handle = type { %struct.fwnode_handle*, %struct.fwnode_operations*, %struct.device* }

!215 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!216 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!217 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!218 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !207, line: 602, baseType: !5, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226}
!221 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!222 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!223 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!224 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!225 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!226 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!227 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !207, line: 615, baseType: !5, size: 32, elements: !228)
!228 = !{!229, !230, !231, !232}
!229 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!232 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !207, line: 626, baseType: !5, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239}
!235 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!236 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!237 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!238 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!239 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !207, line: 638, baseType: !5, size: 32, elements: !241)
!241 = !{!242, !243}
!242 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!243 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!244 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !207, line: 647, baseType: !5, size: 32, elements: !245)
!245 = !{!246, !247}
!246 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!247 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !249, line: 54, baseType: !5, size: 32, elements: !250)
!249 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!250 = !{!251, !252, !253, !254}
!251 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!252 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !29, line: 423, baseType: !5, size: 32, elements: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!258 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!259 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!260 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !262, file: !29, line: 2085, baseType: !5, size: 32, elements: !7726)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !29, line: 1858, size: 15808, elements: !263)
!263 = !{!264, !269, !292, !309, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !326, !334, !335, !336, !337, !338, !339, !340, !341, !342, !368, !378, !379, !380, !385, !386, !390, !393, !5517, !6033, !6037, !6077, !6078, !6079, !6080, !6081, !6082, !6083, !6084, !6085, !6086, !6087, !6088, !6089, !6090, !6091, !6092, !6093, !6094, !6095, !6096, !6097, !6098, !6099, !6100, !6101, !6102, !6103, !6108, !6109, !6110, !6390, !6391, !6392, !6393, !6396, !6399, !6402, !6405, !6408, !6409, !6422, !6423, !6424, !6425, !6426, !6427, !6434, !6435, !6469, !6470, !6471, !6472, !6473, !6474, !6475, !6476, !6477, !6480, !6481, !6482, !6483, !6484, !6485, !6486, !6487, !6488, !6493, !6494, !6495, !6500, !6537, !7346, !7348, !7349, !7353, !7354, !7355, !7356, !7362, !7364, !7704, !7705, !7707, !7708, !7709, !7710, !7711, !7715, !7718}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !29, line: 1859, baseType: !265, size: 128)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 128, elements: !267)
!266 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!267 = !{!268}
!268 = !DISubrange(count: 16)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !262, file: !29, line: 1860, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !29, line: 938, size: 384, elements: !272)
!272 = !{!273, !281, !287, !289}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !271, file: !29, line: 939, baseType: !274, size: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !275, line: 186, size: 128, elements: !276)
!275 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !275, line: 187, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !274, file: !275, line: 187, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !271, file: !29, line: 940, baseType: !282, size: 128, offset: 128)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !275, line: 178, size: 128, elements: !283)
!283 = !{!284, !286}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !275, line: 179, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !282, file: !275, line: 179, baseType: !285, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !271, file: !29, line: 941, baseType: !288, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !271, file: !29, line: 942, baseType: !290, size: 64, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !262, file: !29, line: 1861, baseType: !293, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !29, line: 930, size: 128, elements: !295)
!295 = !{!296, !305}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !294, file: !29, line: 931, baseType: !297, size: 128, align: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !275, line: 216, size: 128, align: 64, elements: !298)
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !275, line: 217, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !297, file: !275, line: 218, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !300}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !294, file: !29, line: 932, baseType: !306, offset: 128)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: -1)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !262, file: !29, line: 1866, baseType: !310, size: 64, offset: 256)
!310 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !262, file: !29, line: 1867, baseType: !310, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !262, file: !29, line: 1868, baseType: !310, size: 64, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !262, file: !29, line: 1869, baseType: !30, size: 32, offset: 448)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !29, line: 1877, baseType: !310, size: 64, offset: 512)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !262, file: !29, line: 1879, baseType: !282, size: 128, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !262, file: !29, line: 1880, baseType: !282, size: 128, offset: 704)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !262, file: !29, line: 1881, baseType: !282, size: 128, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !262, file: !29, line: 1882, baseType: !282, size: 128, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !262, file: !29, line: 1883, baseType: !282, size: 128, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !262, file: !29, line: 1884, baseType: !282, size: 128, offset: 1216)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !262, file: !29, line: 1889, baseType: !322, size: 256, offset: 1344)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !29, line: 1886, size: 256, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !322, file: !29, line: 1887, baseType: !282, size: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !322, file: !29, line: 1888, baseType: !282, size: 128, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !262, file: !29, line: 1891, baseType: !327, size: 64, offset: 1600)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !328, line: 12, baseType: !329)
!328 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !330, line: 23, baseType: !331)
!330 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !332, line: 31, baseType: !333)
!332 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!333 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !262, file: !29, line: 1892, baseType: !327, size: 64, offset: 1664)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !262, file: !29, line: 1893, baseType: !327, size: 64, offset: 1728)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !262, file: !29, line: 1894, baseType: !327, size: 64, offset: 1792)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !262, file: !29, line: 1895, baseType: !327, size: 64, offset: 1856)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !262, file: !29, line: 1896, baseType: !327, size: 64, offset: 1920)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !262, file: !29, line: 1897, baseType: !327, size: 64, offset: 1984)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !262, file: !29, line: 1899, baseType: !30, size: 32, offset: 2048)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !262, file: !29, line: 1900, baseType: !30, size: 32, offset: 2080)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !262, file: !29, line: 1902, baseType: !343, size: 1472, offset: 2112)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !29, line: 169, size: 1472, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !343, file: !29, line: 170, baseType: !310, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !343, file: !29, line: 171, baseType: !310, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !343, file: !29, line: 172, baseType: !310, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !343, file: !29, line: 173, baseType: !310, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !343, file: !29, line: 174, baseType: !310, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !343, file: !29, line: 175, baseType: !310, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !343, file: !29, line: 176, baseType: !310, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !343, file: !29, line: 177, baseType: !310, size: 64, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !343, file: !29, line: 178, baseType: !310, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !343, file: !29, line: 179, baseType: !310, size: 64, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !343, file: !29, line: 180, baseType: !310, size: 64, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !343, file: !29, line: 181, baseType: !310, size: 64, offset: 704)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !343, file: !29, line: 182, baseType: !310, size: 64, offset: 768)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !343, file: !29, line: 183, baseType: !310, size: 64, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !343, file: !29, line: 184, baseType: !310, size: 64, offset: 896)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !343, file: !29, line: 185, baseType: !310, size: 64, offset: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !343, file: !29, line: 186, baseType: !310, size: 64, offset: 1024)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !343, file: !29, line: 187, baseType: !310, size: 64, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !343, file: !29, line: 188, baseType: !310, size: 64, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !343, file: !29, line: 189, baseType: !310, size: 64, offset: 1216)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !343, file: !29, line: 190, baseType: !310, size: 64, offset: 1280)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !343, file: !29, line: 191, baseType: !310, size: 64, offset: 1344)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !343, file: !29, line: 192, baseType: !310, size: 64, offset: 1408)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !262, file: !29, line: 1904, baseType: !369, size: 64, offset: 3584)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !370, line: 13, baseType: !371)
!370 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !275, line: 175, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 173, size: 64, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !372, file: !275, line: 174, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !330, line: 22, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !332, line: 30, baseType: !377)
!377 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !262, file: !29, line: 1905, baseType: !369, size: 64, offset: 3648)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !262, file: !29, line: 1906, baseType: !369, size: 64, offset: 3712)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !262, file: !29, line: 1909, baseType: !381, size: 32, offset: 3776)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !275, line: 168, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 166, size: 32, elements: !383)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !382, file: !275, line: 167, baseType: !30, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !262, file: !29, line: 1910, baseType: !381, size: 32, offset: 3808)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !262, file: !29, line: 1913, baseType: !387, size: 64, offset: 3840)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !29, line: 1913, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !262, file: !29, line: 1914, baseType: !391, size: 64, offset: 3904)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !29, line: 1914, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !262, file: !29, line: 1916, baseType: !394, size: 64, offset: 3968)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !29, line: 1283, size: 4416, elements: !397)
!397 = !{!398, !402, !406, !407, !408, !571, !575, !580, !584, !585, !590, !591, !714, !719, !723, !729, !733, !765, !773, !777, !782, !786, !787, !793, !797, !801, !805, !806, !828, !832, !847, !858, !862, !871, !875, !876, !880, !901, !905, !909, !913, !917, !924, !928, !946, !950, !1000, !1004, !1009, !1013, !1017, !1021, !1031, !1032, !1041, !1047, !1048, !1052, !1056, !1060, !1064, !1065, !1069, !1070, !5477, !5497, !5501, !5507, !5513}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !396, file: !29, line: 1284, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!30, !288}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !396, file: !29, line: 1285, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !288}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !396, file: !29, line: 1286, baseType: !399, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !396, file: !29, line: 1287, baseType: !399, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !396, file: !29, line: 1288, baseType: !409, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !413, !288}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !29, line: 120, baseType: !28)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !415, line: 713, size: 1600, elements: !416)
!415 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!416 = !{!417, !439, !447, !454, !458, !470, !471, !472, !475, !476, !477, !483, !484, !485, !486, !487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !529, !530, !531, !532, !534, !535, !540, !545, !550, !551, !552, !553, !554, !555, !556, !557, !558, !560, !561, !563, !564, !565}
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 714, baseType: !418, size: 192)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 714, size: 192, elements: !419)
!419 = !{!420, !430, !438}
!420 = !DIDerivedType(tag: DW_TAG_member, scope: !418, file: !415, line: 715, baseType: !421, size: 192)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !415, line: 715, size: 192, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !415, line: 717, baseType: !413, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !415, line: 718, baseType: !413, size: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !415, line: 720, baseType: !426, size: 64, offset: 128)
!426 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !415, line: 720, size: 64, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !426, file: !415, line: 721, baseType: !288, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !426, file: !415, line: 726, baseType: !310, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !418, file: !415, line: 729, baseType: !431, size: 192, align: 64)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !432, line: 24, size: 192, align: 64, elements: !433)
!432 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!433 = !{!434, !435, !437}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !431, file: !432, line: 25, baseType: !310, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !431, file: !432, line: 26, baseType: !436, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !431, file: !432, line: 27, baseType: !436, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !418, file: !415, line: 730, baseType: !282, size: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 733, baseType: !440, size: 64, offset: 192)
!440 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 733, size: 64, elements: !441)
!441 = !{!442, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !440, file: !415, line: 734, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !445, line: 19, flags: DIFlagFwdDecl)
!445 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !440, file: !415, line: 735, baseType: !30, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 738, baseType: !448, size: 64, offset: 256)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 738, size: 64, elements: !449)
!449 = !{!450, !453}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !448, file: !415, line: 739, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !452, line: 29, baseType: !375)
!452 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!453 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !448, file: !415, line: 740, baseType: !329, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !414, file: !415, line: 748, baseType: !455, size: 384, align: 64, offset: 320)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 384, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 48)
!458 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 750, baseType: !459, size: 128, offset: 704)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 750, size: 128, elements: !460)
!460 = !{!461, !469}
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !459, file: !415, line: 751, baseType: !462, size: 128)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !415, line: 751, size: 128, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !462, file: !415, line: 752, baseType: !310, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !462, file: !415, line: 753, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !413}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !459, file: !415, line: 755, baseType: !282, size: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !414, file: !415, line: 761, baseType: !5, size: 32, offset: 832)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !414, file: !415, line: 762, baseType: !5, size: 32, offset: 864)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !414, file: !415, line: 763, baseType: !473, size: 16, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !332, line: 24, baseType: !474)
!474 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !414, file: !415, line: 764, baseType: !473, size: 16, offset: 912)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !414, file: !415, line: 769, baseType: !473, size: 16, offset: 928)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !414, file: !415, line: 780, baseType: !478, offset: 944)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, elements: !481)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !332, line: 21, baseType: !480)
!480 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!481 = !{!482}
!482 = !DISubrange(count: 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !414, file: !415, line: 782, baseType: !479, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !414, file: !415, line: 783, baseType: !479, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !414, file: !415, line: 784, baseType: !479, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !414, file: !415, line: 785, baseType: !479, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !414, file: !415, line: 786, baseType: !479, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !414, file: !415, line: 787, baseType: !479, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !414, file: !415, line: 795, baseType: !490, offset: 960)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, elements: !481)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !332, line: 27, baseType: !5)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !414, file: !415, line: 807, baseType: !478, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !414, file: !415, line: 809, baseType: !479, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !414, file: !415, line: 810, baseType: !479, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !414, file: !415, line: 811, baseType: !479, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !414, file: !415, line: 812, baseType: !479, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !414, file: !415, line: 813, baseType: !479, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !414, file: !415, line: 815, baseType: !479, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !414, file: !415, line: 816, baseType: !479, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !414, file: !415, line: 817, baseType: !479, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !414, file: !415, line: 818, baseType: !479, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !414, file: !415, line: 819, baseType: !479, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !414, file: !415, line: 821, baseType: !479, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !414, file: !415, line: 822, baseType: !479, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !414, file: !415, line: 823, baseType: !479, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !414, file: !415, line: 832, baseType: !478, offset: 976)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !414, file: !415, line: 834, baseType: !479, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !414, file: !415, line: 835, baseType: !479, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !414, file: !415, line: 836, baseType: !479, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !414, file: !415, line: 837, baseType: !479, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !414, file: !415, line: 838, baseType: !479, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !414, file: !415, line: 840, baseType: !479, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !414, file: !415, line: 843, baseType: !479, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !414, file: !415, line: 844, baseType: !479, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !414, file: !415, line: 845, baseType: !479, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !414, file: !415, line: 847, baseType: !479, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !414, file: !415, line: 848, baseType: !479, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!518 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 866, baseType: !519, size: 32, offset: 992)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 866, size: 32, elements: !520)
!520 = !{!521, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !519, file: !415, line: 867, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !523, line: 37, baseType: !491)
!523 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!524 = !DIDerivedType(tag: DW_TAG_member, scope: !519, file: !415, line: 868, baseType: !525, size: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !415, line: 868, size: 32, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !525, file: !415, line: 869, baseType: !473, size: 16)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !525, file: !415, line: 870, baseType: !473, size: 16, offset: 16)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !414, file: !415, line: 873, baseType: !491, size: 32, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !414, file: !415, line: 874, baseType: !30, size: 32, offset: 1056)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !414, file: !415, line: 875, baseType: !491, size: 32, offset: 1088)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !414, file: !415, line: 876, baseType: !533, size: 16, offset: 1120)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !523, line: 30, baseType: !473)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !414, file: !415, line: 877, baseType: !473, size: 16, offset: 1136)
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 879, baseType: !536, size: 32, offset: 1152)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 879, size: 32, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !536, file: !415, line: 880, baseType: !5, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !536, file: !415, line: 881, baseType: !5, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 888, baseType: !541, size: 32, offset: 1184)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 888, size: 32, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !541, file: !415, line: 889, baseType: !491, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !541, file: !415, line: 890, baseType: !491, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !415, line: 893, baseType: !546, size: 16, offset: 1216)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !415, line: 893, size: 16, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !546, file: !415, line: 894, baseType: !533, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !546, file: !415, line: 895, baseType: !479, size: 8)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !414, file: !415, line: 898, baseType: !473, size: 16, offset: 1232)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !414, file: !415, line: 899, baseType: !473, size: 16, offset: 1248)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !414, file: !415, line: 900, baseType: !473, size: 16, offset: 1264)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !414, file: !415, line: 902, baseType: !533, size: 16, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !414, file: !415, line: 903, baseType: !473, size: 16, offset: 1296)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !414, file: !415, line: 904, baseType: !473, size: 16, offset: 1312)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !414, file: !415, line: 905, baseType: !473, size: 16, offset: 1328)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !414, file: !415, line: 908, baseType: !490, offset: 1344)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !414, file: !415, line: 912, baseType: !559, size: 32, offset: 1344)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !415, line: 606, baseType: !5)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !414, file: !415, line: 913, baseType: !559, size: 32, offset: 1376)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !414, file: !415, line: 914, baseType: !562, size: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !415, line: 915, baseType: !562, size: 64, offset: 1472)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !414, file: !415, line: 916, baseType: !5, size: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !414, file: !415, line: 917, baseType: !566, size: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !567, line: 113, baseType: !568)
!567 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !567, line: 111, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !568, file: !567, line: 112, baseType: !381, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !396, file: !29, line: 1290, baseType: !572, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!327, !413, !288, !327}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !396, file: !29, line: 1293, baseType: !576, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!579, !288, !413, !288}
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !330, line: 19, baseType: !473)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !396, file: !29, line: 1296, baseType: !581, size: 64, offset: 448)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !288, !30}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !396, file: !29, line: 1298, baseType: !403, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !396, file: !29, line: 1299, baseType: !586, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!30, !288, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !396, file: !29, line: 1301, baseType: !399, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !396, file: !29, line: 1302, baseType: !592, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!30, !288, !595, !30}
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !597, line: 234, size: 320, elements: !598)
!597 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!598 = !{!599, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !596, file: !597, line: 239, baseType: !600, size: 128)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !596, file: !597, line: 236, size: 128, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !600, file: !597, line: 238, baseType: !265, size: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !596, file: !597, line: 255, baseType: !604, size: 192, offset: 128)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !596, file: !597, line: 241, size: 192, elements: !605)
!605 = !{!606, !618, !619, !620, !621, !622, !624, !625, !626, !635, !636, !637, !638}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !604, file: !597, line: 242, baseType: !607, size: 128)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !608, line: 32, size: 128, elements: !609)
!608 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!609 = !{!610, !614}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !607, file: !608, line: 33, baseType: !611, size: 16)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !608, line: 26, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !613, line: 10, baseType: !474)
!613 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !607, file: !608, line: 34, baseType: !615, size: 112, offset: 16)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 112, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 14)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !604, file: !597, line: 243, baseType: !607, size: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !604, file: !597, line: 244, baseType: !607, size: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !604, file: !597, line: 245, baseType: !607, size: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !604, file: !597, line: 246, baseType: !607, size: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !604, file: !597, line: 247, baseType: !623, size: 16)
!623 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !604, file: !597, line: 248, baseType: !30, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !604, file: !597, line: 249, baseType: !30, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !604, file: !597, line: 250, baseType: !627, size: 192)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !597, line: 196, size: 192, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !627, file: !597, line: 197, baseType: !310, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !627, file: !597, line: 198, baseType: !310, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !627, file: !597, line: 199, baseType: !474, size: 16, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !627, file: !597, line: 200, baseType: !480, size: 8, offset: 144)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !627, file: !597, line: 201, baseType: !480, size: 8, offset: 152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !627, file: !597, line: 202, baseType: !480, size: 8, offset: 160)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !604, file: !597, line: 251, baseType: !265, size: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !604, file: !597, line: 252, baseType: !265, size: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !604, file: !597, line: 253, baseType: !589, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !604, file: !597, line: 254, baseType: !639, size: 128)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !597, line: 207, size: 128, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !597, line: 208, baseType: !5, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !639, file: !597, line: 209, baseType: !5, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !639, file: !597, line: 222, baseType: !644, size: 64, offset: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !639, file: !597, line: 210, size: 64, elements: !645)
!645 = !{!646, !654, !661, !673, !679, !686, !697, !705}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !644, file: !597, line: 212, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !649, line: 56, baseType: !650)
!649 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 53, size: 32, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !650, file: !649, line: 54, baseType: !474, size: 16)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !650, file: !649, line: 55, baseType: !474, size: 16, offset: 16)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !644, file: !597, line: 213, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !649, line: 80, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 77, size: 64, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !657, file: !649, line: 78, baseType: !5, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !657, file: !649, line: 79, baseType: !5, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !644, file: !597, line: 214, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !649, line: 66, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 58, size: 192, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !664, file: !649, line: 59, baseType: !5, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !664, file: !649, line: 60, baseType: !5, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !664, file: !649, line: 61, baseType: !5, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !664, file: !649, line: 62, baseType: !5, size: 32, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !664, file: !649, line: 63, baseType: !5, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !664, file: !649, line: 64, baseType: !474, size: 16, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !664, file: !649, line: 65, baseType: !474, size: 16, offset: 176)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !644, file: !597, line: 215, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !649, line: 70, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 68, size: 32, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !676, file: !649, line: 69, baseType: !5, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !644, file: !597, line: 216, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !649, line: 75, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 72, size: 160, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !682, file: !649, line: 73, baseType: !5, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !682, file: !649, line: 74, baseType: !265, size: 128, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !644, file: !597, line: 217, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !649, line: 89, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 82, size: 192, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !689, file: !649, line: 83, baseType: !474, size: 16)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !689, file: !649, line: 84, baseType: !5, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !689, file: !649, line: 85, baseType: !5, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !689, file: !649, line: 86, baseType: !5, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !689, file: !649, line: 87, baseType: !5, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !689, file: !649, line: 88, baseType: !5, size: 32, offset: 160)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !644, file: !597, line: 220, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !649, line: 44, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 40, size: 96, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !700, file: !649, line: 41, baseType: !5, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !700, file: !649, line: 42, baseType: !5, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !700, file: !649, line: 43, baseType: !474, size: 16, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !644, file: !597, line: 221, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !649, line: 51, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 46, size: 128, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !708, file: !649, line: 47, baseType: !5, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !708, file: !649, line: 48, baseType: !5, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !708, file: !649, line: 49, baseType: !474, size: 16, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !708, file: !649, line: 50, baseType: !5, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !396, file: !29, line: 1304, baseType: !715, size: 64, offset: 768)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!30, !288, !718}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !396, file: !29, line: 1306, baseType: !720, size: 64, offset: 832)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!30, !288, !30}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !396, file: !29, line: 1308, baseType: !724, size: 64, offset: 896)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!30, !288, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !29, line: 206, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !396, file: !29, line: 1310, baseType: !730, size: 64, offset: 960)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !288, !5}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !396, file: !29, line: 1313, baseType: !734, size: 64, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !288, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !739, line: 214, size: 1536, elements: !740)
!739 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !738, file: !739, line: 215, baseType: !331, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !738, file: !739, line: 216, baseType: !331, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !738, file: !739, line: 217, baseType: !331, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !738, file: !739, line: 218, baseType: !331, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !738, file: !739, line: 219, baseType: !331, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !738, file: !739, line: 220, baseType: !331, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !738, file: !739, line: 221, baseType: !331, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !738, file: !739, line: 222, baseType: !331, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !738, file: !739, line: 223, baseType: !331, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !738, file: !739, line: 224, baseType: !331, size: 64, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !738, file: !739, line: 227, baseType: !331, size: 64, offset: 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !738, file: !739, line: 228, baseType: !331, size: 64, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !738, file: !739, line: 229, baseType: !331, size: 64, offset: 768)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !738, file: !739, line: 230, baseType: !331, size: 64, offset: 832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !738, file: !739, line: 231, baseType: !331, size: 64, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !738, file: !739, line: 232, baseType: !331, size: 64, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !738, file: !739, line: 235, baseType: !331, size: 64, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !738, file: !739, line: 236, baseType: !331, size: 64, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !738, file: !739, line: 237, baseType: !331, size: 64, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !738, file: !739, line: 238, baseType: !331, size: 64, offset: 1216)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !738, file: !739, line: 239, baseType: !331, size: 64, offset: 1280)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !738, file: !739, line: 242, baseType: !331, size: 64, offset: 1344)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !738, file: !739, line: 243, baseType: !331, size: 64, offset: 1408)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !738, file: !739, line: 244, baseType: !331, size: 64, offset: 1472)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !396, file: !29, line: 1315, baseType: !766, size: 64, offset: 1088)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!769, !771, !30}
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !275, line: 30, baseType: !770)
!770 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !396, file: !29, line: 1316, baseType: !774, size: 64, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!30, !30, !771, !589}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !396, file: !29, line: 1319, baseType: !778, size: 64, offset: 1216)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !288}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !396, file: !29, line: 1321, baseType: !783, size: 64, offset: 1280)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!30, !288, !533, !579}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !396, file: !29, line: 1323, baseType: !783, size: 64, offset: 1344)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !396, file: !29, line: 1331, baseType: !788, size: 64, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!30, !288, !30, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !330, line: 17, baseType: !479)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !396, file: !29, line: 1333, baseType: !794, size: 64, offset: 1472)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!30, !288, !30, !579, !792, !533}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !396, file: !29, line: 1336, baseType: !798, size: 64, offset: 1536)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!30, !288, !30, !30, !30}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !396, file: !29, line: 1339, baseType: !802, size: 64, offset: 1600)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!30, !288, !30, !769}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !396, file: !29, line: 1341, baseType: !802, size: 64, offset: 1664)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !396, file: !29, line: 1343, baseType: !807, size: 64, offset: 1728)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DISubroutineType(types: !809)
!809 = !{!30, !288, !30, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !812, line: 20, size: 576, elements: !813)
!812 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!813 = !{!814, !815, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !811, file: !812, line: 21, baseType: !491, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !811, file: !812, line: 22, baseType: !816, size: 256, offset: 32)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 256, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !811, file: !812, line: 23, baseType: !491, size: 32, offset: 288)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !811, file: !812, line: 24, baseType: !491, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !811, file: !812, line: 25, baseType: !491, size: 32, offset: 352)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !811, file: !812, line: 26, baseType: !491, size: 32, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !811, file: !812, line: 27, baseType: !491, size: 32, offset: 416)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !811, file: !812, line: 28, baseType: !491, size: 32, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !811, file: !812, line: 29, baseType: !491, size: 32, offset: 480)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !811, file: !812, line: 30, baseType: !491, size: 32, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !811, file: !812, line: 31, baseType: !533, size: 16, offset: 544)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !396, file: !29, line: 1346, baseType: !829, size: 64, offset: 1792)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!30, !288, !30, !30}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !396, file: !29, line: 1348, baseType: !833, size: 64, offset: 1856)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!30, !288, !30, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !812, line: 9, size: 512, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !837, file: !812, line: 10, baseType: !331, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !837, file: !812, line: 11, baseType: !331, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !837, file: !812, line: 12, baseType: !331, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !837, file: !812, line: 13, baseType: !331, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !837, file: !812, line: 14, baseType: !331, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !837, file: !812, line: 15, baseType: !331, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !837, file: !812, line: 16, baseType: !331, size: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !837, file: !812, line: 17, baseType: !331, size: 64, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !396, file: !29, line: 1352, baseType: !848, size: 64, offset: 1920)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{!30, !288, !30, !851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !854, line: 213, size: 32, elements: !855)
!854 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !853, file: !854, line: 214, baseType: !473, size: 16)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !853, file: !854, line: 215, baseType: !473, size: 16, offset: 16)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !396, file: !29, line: 1355, baseType: !859, size: 64, offset: 1984)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!30, !288, !30, !413}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !396, file: !29, line: 1357, baseType: !863, size: 64, offset: 2048)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!30, !288, !30, !866, !866}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !739, line: 956, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !867, file: !739, line: 957, baseType: !491, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !867, file: !739, line: 958, baseType: !331, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !396, file: !29, line: 1361, baseType: !872, size: 64, offset: 2112)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!30, !288, !30, !329, !30}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !396, file: !29, line: 1364, baseType: !802, size: 64, offset: 2176)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !396, file: !29, line: 1367, baseType: !877, size: 64, offset: 2240)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!30, !288, !35, !589}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !396, file: !29, line: 1400, baseType: !881, size: 64, offset: 2304)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!30, !288, !288, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !886, line: 75, size: 384, elements: !887)
!886 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!887 = !{!888, !889, !892, !896, !900}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !885, file: !886, line: 76, baseType: !290, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !885, file: !886, line: 77, baseType: !890, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !885, file: !886, line: 78, baseType: !893, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !886, line: 78, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !885, file: !886, line: 79, baseType: !897, size: 160, offset: 192)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 160, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 20)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !885, file: !886, line: 80, baseType: !792, size: 8, offset: 352)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !396, file: !29, line: 1403, baseType: !902, size: 64, offset: 2368)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!30, !288, !288}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !396, file: !29, line: 1405, baseType: !906, size: 64, offset: 2432)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!288, !288, !413, !769}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !396, file: !29, line: 1408, baseType: !910, size: 64, offset: 2496)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!327, !288, !327}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !396, file: !29, line: 1410, baseType: !914, size: 64, offset: 2560)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!30, !288, !327}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !396, file: !29, line: 1412, baseType: !918, size: 64, offset: 2624)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!30, !288, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !923, line: 35, flags: DIFlagFwdDecl)
!923 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !396, file: !29, line: 1414, baseType: !925, size: 64, offset: 2688)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !288, !921}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !396, file: !29, line: 1417, baseType: !929, size: 64, offset: 2752)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!30, !932, !851, !288, !944, !579, !579, !884}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !934, line: 8, size: 96, elements: !935)
!934 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!935 = !{!936, !937, !938, !939, !941, !942, !943}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !933, file: !934, line: 9, baseType: !479, size: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !933, file: !934, line: 10, baseType: !479, size: 8, offset: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !933, file: !934, line: 11, baseType: !473, size: 16, offset: 16)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !933, file: !934, line: 12, baseType: !940, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !332, line: 26, baseType: !30)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !933, file: !934, line: 13, baseType: !473, size: 16, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !933, file: !934, line: 14, baseType: !479, size: 8, offset: 80)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !933, file: !934, line: 15, baseType: !479, size: 8, offset: 88)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !396, file: !29, line: 1424, baseType: !947, size: 64, offset: 2816)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!30, !932, !851, !288, !944, !579}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !396, file: !29, line: 1429, baseType: !951, size: 64, offset: 2880)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!30, !413, !954, !288, !288, !999}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !886, line: 203, size: 1024, elements: !956)
!956 = !{!957, !958, !968, !972, !976, !977, !981, !982, !983, !984, !986, !987, !988, !989}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !955, file: !886, line: 204, baseType: !413, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !955, file: !886, line: 205, baseType: !959, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !854, line: 44, size: 128, elements: !962)
!962 = !{!963, !964, !965, !966, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !961, file: !854, line: 45, baseType: !491, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !961, file: !854, line: 46, baseType: !473, size: 16, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !961, file: !854, line: 47, baseType: !473, size: 16, offset: 48)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !961, file: !854, line: 48, baseType: !491, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !961, file: !854, line: 49, baseType: !491, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !955, file: !886, line: 206, baseType: !969, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!30, !413, !954}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !955, file: !886, line: 208, baseType: !973, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!30, !954}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !955, file: !886, line: 209, baseType: !589, size: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !955, file: !886, line: 211, baseType: !978, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !980, line: 76, flags: DIFlagFwdDecl)
!980 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!981 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !955, file: !886, line: 212, baseType: !884, size: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !955, file: !886, line: 213, baseType: !579, size: 16, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !955, file: !886, line: 214, baseType: !579, size: 16, offset: 464)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !955, file: !886, line: 215, baseType: !985, size: 32, offset: 480)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !330, line: 21, baseType: !491)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !955, file: !886, line: 216, baseType: !5, size: 32, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !955, file: !886, line: 216, baseType: !5, size: 32, offset: 544)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !955, file: !886, line: 217, baseType: !769, size: 8, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_member, scope: !955, file: !886, line: 218, baseType: !990, size: 384, offset: 640)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !955, file: !886, line: 218, size: 384, elements: !991)
!991 = !{!992, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !990, file: !886, line: 219, baseType: !993, size: 384)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 384, elements: !456)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !990, file: !886, line: 224, baseType: !995, size: 384)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 384, elements: !997)
!996 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!997 = !{!998}
!998 = !DISubrange(count: 6)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !396, file: !29, line: 1434, baseType: !1001, size: 64, offset: 2944)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!30, !413, !851, !288, !944, !579, !985, !985, !884}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !396, file: !29, line: 1440, baseType: !1005, size: 64, offset: 3008)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!30, !288, !1008, !579, !884}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !396, file: !29, line: 1444, baseType: !1010, size: 64, offset: 3072)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!30, !413, !985, !985, !288, !985, !30}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !396, file: !29, line: 1449, baseType: !1014, size: 64, offset: 3136)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!30, !288, !1008, !579}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !396, file: !29, line: 1452, baseType: !1018, size: 64, offset: 3200)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!30, !288, !769}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !396, file: !29, line: 1454, baseType: !1022, size: 64, offset: 3264)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!30, !288, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !29, line: 820, size: 264, elements: !1027)
!1027 = !{!1028, !1030}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1026, file: !29, line: 821, baseType: !1029, size: 256)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 256, elements: !817)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1026, file: !29, line: 822, baseType: !480, size: 8, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !396, file: !29, line: 1456, baseType: !1022, size: 64, offset: 3328)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !396, file: !29, line: 1458, baseType: !1033, size: 64, offset: 3392)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!30, !288, !1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !275, line: 55, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1039, line: 72, baseType: !1040)
!1039 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1039, line: 16, baseType: !310)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !396, file: !29, line: 1460, baseType: !1042, size: 64, offset: 3456)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !288, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !29, line: 67, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !396, file: !29, line: 1462, baseType: !1042, size: 64, offset: 3520)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !396, file: !29, line: 1464, baseType: !1049, size: 64, offset: 3584)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!589, !288, !288}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !396, file: !29, line: 1466, baseType: !1053, size: 64, offset: 3648)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !288, !589}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !396, file: !29, line: 1469, baseType: !1057, size: 64, offset: 3712)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!30, !288, !30, !985}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !396, file: !29, line: 1472, baseType: !1061, size: 64, offset: 3776)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!30, !771}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !396, file: !29, line: 1473, baseType: !1018, size: 64, offset: 3840)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !396, file: !29, line: 1475, baseType: !1066, size: 64, offset: 3904)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!30, !288, !413}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !396, file: !29, line: 1477, baseType: !581, size: 64, offset: 3968)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !396, file: !29, line: 1479, baseType: !1071, size: 64, offset: 4032)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!30, !288, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !29, line: 894, size: 256, elements: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1075, file: !29, line: 895, baseType: !55, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, scope: !1075, file: !29, line: 896, baseType: !1079, size: 192, offset: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1075, file: !29, line: 896, size: 192, elements: !1080)
!1080 = !{!1081, !1090, !5470}
!1081 = !DIDerivedType(tag: DW_TAG_member, scope: !1079, file: !29, line: 898, baseType: !1082, size: 192)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1079, file: !29, line: 898, size: 192, elements: !1083)
!1083 = !{!1084, !1085, !1089}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !29, line: 899, baseType: !985, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1082, file: !29, line: 900, baseType: !1086, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1088, line: 11, flags: DIFlagFwdDecl)
!1088 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1082, file: !29, line: 901, baseType: !884, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, scope: !1079, file: !29, line: 904, baseType: !1091, size: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1079, file: !29, line: 904, size: 64, elements: !1092)
!1092 = !{!1093}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1091, file: !29, line: 905, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !63, line: 222, size: 2560, elements: !1096)
!1096 = !{!1097, !5449, !5450, !5468, !5469}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1095, file: !63, line: 223, baseType: !1098, size: 2048)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !63, line: 141, size: 2048, elements: !1099)
!1099 = !{!1100, !5423, !5424, !5425, !5426, !5427, !5428, !5429, !5430, !5431, !5432, !5433, !5434, !5435, !5440, !5441, !5442, !5443, !5444, !5445, !5446, !5447, !5448}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1098, file: !63, line: 145, baseType: !1101, size: 64, align: 512)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !63, line: 54, size: 2368, elements: !1104)
!1104 = !{!1105, !1304, !1309, !5095, !5099, !5103, !5104, !5108, !5114, !5115, !5116, !5117, !5118, !5122, !5126, !5130, !5131, !5132, !5136, !5137, !5149, !5153, !5157, !5169, !5358, !5362, !5366, !5371, !5375, !5379, !5383, !5389, !5393, !5400, !5404, !5406, !5407}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1103, file: !63, line: 56, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!30, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !94, line: 483, size: 960, align: 64, elements: !1111)
!1111 = !{!1112, !1128, !1139, !1150, !1174, !1180, !1188, !1205, !1218, !1224, !1233, !1238, !1246, !1258, !1278, !1285, !1289, !1293, !1298}
!1112 = !DIDerivedType(tag: DW_TAG_member, scope: !1110, file: !94, line: 484, baseType: !1113, size: 512)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1110, file: !94, line: 484, size: 512, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1113, file: !94, line: 485, baseType: !491, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1113, file: !94, line: 486, baseType: !491, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1113, file: !94, line: 487, baseType: !491, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1113, file: !94, line: 488, baseType: !491, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1113, file: !94, line: 489, baseType: !491, size: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1113, file: !94, line: 492, baseType: !491, size: 32, offset: 160)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1113, file: !94, line: 493, baseType: !491, size: 32, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1113, file: !94, line: 496, baseType: !265, size: 128, offset: 224)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1113, file: !94, line: 497, baseType: !491, size: 32, offset: 352)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1113, file: !94, line: 498, baseType: !491, size: 32, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1113, file: !94, line: 499, baseType: !491, size: 32, offset: 416)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1113, file: !94, line: 500, baseType: !491, size: 32, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1113, file: !94, line: 501, baseType: !491, size: 32, offset: 480)
!1128 = !DIDerivedType(tag: DW_TAG_member, scope: !1110, file: !94, line: 507, baseType: !1129, size: 256)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1110, file: !94, line: 507, size: 256, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1138}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1129, file: !94, line: 508, baseType: !491, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1129, file: !94, line: 509, baseType: !331, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, scope: !1129, file: !94, line: 510, baseType: !1134, size: 64, offset: 128)
!1134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1129, file: !94, line: 510, size: 64, elements: !1135)
!1135 = !{!1136, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1134, file: !94, line: 511, baseType: !331, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1134, file: !94, line: 512, baseType: !331, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1129, file: !94, line: 514, baseType: !331, size: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1110, file: !94, line: 532, baseType: !1140, size: 448)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1110, file: !94, line: 517, size: 448, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1140, file: !94, line: 518, baseType: !331, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1140, file: !94, line: 521, baseType: !331, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1140, file: !94, line: 522, baseType: !331, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1140, file: !94, line: 523, baseType: !331, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1140, file: !94, line: 524, baseType: !491, size: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1140, file: !94, line: 529, baseType: !491, size: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1140, file: !94, line: 530, baseType: !331, size: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1140, file: !94, line: 531, baseType: !331, size: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, scope: !1110, file: !94, line: 534, baseType: !1151, size: 960)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1110, file: !94, line: 534, size: 960, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1151, file: !94, line: 535, baseType: !491, size: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1151, file: !94, line: 536, baseType: !491, size: 32, offset: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1151, file: !94, line: 537, baseType: !331, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1151, file: !94, line: 538, baseType: !331, size: 64, align: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1151, file: !94, line: 539, baseType: !491, size: 32, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1151, file: !94, line: 540, baseType: !491, size: 32, offset: 224)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1151, file: !94, line: 541, baseType: !331, size: 64, align: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1151, file: !94, line: 542, baseType: !491, size: 32, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1151, file: !94, line: 543, baseType: !491, size: 32, offset: 352)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1151, file: !94, line: 544, baseType: !265, size: 128, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1151, file: !94, line: 545, baseType: !491, size: 32, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1151, file: !94, line: 550, baseType: !491, size: 32, offset: 544)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1151, file: !94, line: 551, baseType: !491, size: 32, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1151, file: !94, line: 552, baseType: !491, size: 32, offset: 608)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1151, file: !94, line: 553, baseType: !331, size: 64, align: 64, offset: 640)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1151, file: !94, line: 554, baseType: !491, size: 32, offset: 704)
