; ModuleID = '../bcout/drivers/platform/x86/pmc_atom.llvm.bc'
source_filename = "drivers/platform/x86/pmc_atom.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_pmc_atom_init6:\09\09\09"
module asm ".long\09pmc_atom_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.pmc_dev = type { i32, i8*, %struct.pmc_reg_map*, i8 }
%struct.pmc_reg_map = type { %struct.pmc_bit_map*, %struct.pmc_bit_map*, %struct.pmc_bit_map*, %struct.pmc_bit_map*, %struct.pmc_bit_map* }
%struct.pmc_bit_map = type { i8*, i32 }
%struct.pci_device_id = type { i32, i32, i32, i32, i32, i32, i64 }
%struct.pmc_data = type { %struct.pmc_reg_map*, %struct.pmc_clk* }
%struct.pmc_clk = type { i8*, i64, i8* }
%struct.dmi_system_id = type { i32 (%struct.dmi_system_id*)*, i8*, [4 x %struct.dmi_strmatch], i8* }
%struct.dmi_strmatch = type { i8, [79 x i8] }
%struct.kmem_cache = type opaque

!48 = !DIEnumerator(name: "WRITE_LIFE_SHORT", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "WRITE_LIFE_MEDIUM", value: 3, isUnsigned: true)
!50 = !DIEnumerator(name: "WRITE_LIFE_LONG", value: 4, isUnsigned: true)
!51 = !DIEnumerator(name: "WRITE_LIFE_EXTREME", value: 5, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !53, line: 9, baseType: !7, size: 32, elements: !54)
!53 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIEnumerator(name: "PIDTYPE_PID", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "PIDTYPE_SID", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !61, line: 26, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!62 = !{!63, !64, !65}
!63 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !67, line: 44, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !73, line: 343, baseType: !7, size: 32, elements: !74)
!73 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !80, line: 524, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !80, line: 502, baseType: !7, size: 32, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 10, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!95 = !{!96, !97}
!96 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !99, line: 305, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!100 = !{!101, !102, !103, !104}
!101 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!105 = !{!106, !108, !109, !127, !145, !143, !147}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_data", file: !3, line: 33, size: 128, elements: !111)
!111 = !{!112, !135}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !110, file: !3, line: 34, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_reg_map", file: !3, line: 25, size: 320, elements: !116)
!116 = !{!117, !131, !132, !133, !134}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "d3_sts_0", scope: !115, file: !3, line: 26, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_bit_map", file: !3, line: 20, size: 128, elements: !121)
!121 = !{!122, !126}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !120, file: !3, line: 21, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bit_mask", scope: !120, file: !3, line: 22, baseType: !127, size: 32, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !128, line: 21, baseType: !129)
!128 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !130, line: 27, baseType: !7)
!130 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!131 = !DIDerivedType(tag: DW_TAG_member, name: "d3_sts_1", scope: !115, file: !3, line: 27, baseType: !118, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "func_dis", scope: !115, file: !3, line: 28, baseType: !118, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "func_dis_2", scope: !115, file: !3, line: 29, baseType: !118, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pss", scope: !115, file: !3, line: 30, baseType: !118, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "clks", scope: !110, file: !3, line: 35, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_clk", file: !139, line: 19, size: 192, elements: !140)
!139 = !DIFile(filename: "./include/linux/platform_data/x86/clk-pmc-atom.h", directory: "/home/lizy2001/genbc/linux")
!140 = !{!141, !142, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !139, line: 20, baseType: !123, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !138, file: !139, line: 21, baseType: !143, size: 64, offset: 64)
!143 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "parent_name", scope: !138, file: !139, line: 22, baseType: !123, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !146, line: 148, baseType: !7)
!146 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !{!149, !0, !151, !168, !171, !173, !178, !183, !188, !191, !193, !195, !200, !202, !207, !212, !214}
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_pmc_atom_init232", scope: !2, file: !3, line: 556, type: !108, isLocal: true, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "pmc_pci_ids", scope: !2, file: !3, line: 528, type: !153, isLocal: true, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 768, elements: !166)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_device_id", file: !156, line: 38, size: 256, elements: !157)
!156 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!157 = !{!158, !159, !160, !161, !162, !163, !164}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !155, file: !156, line: 39, baseType: !129, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !155, file: !156, line: 39, baseType: !129, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "subvendor", scope: !155, file: !156, line: 40, baseType: !129, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "subdevice", scope: !155, file: !156, line: 40, baseType: !129, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !155, file: !156, line: 41, baseType: !129, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "class_mask", scope: !155, file: !156, line: 41, baseType: !129, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !155, file: !156, line: 42, baseType: !165, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_ulong_t", file: !156, line: 14, baseType: !143)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "byt_data", scope: !2, file: !3, line: 193, type: !170, isLocal: true, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "byt_reg_map", scope: !2, file: !3, line: 177, type: !114, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "d3_sts_0_map", scope: !2, file: !3, line: 74, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 4224, elements: !176)
!176 = !{!177}
!177 = !DISubrange(count: 33)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "byt_d3_sts_1_map", scope: !2, file: !3, line: 110, type: !180, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 640, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 5)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "byt_pss_map", scope: !2, file: !3, line: 132, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2432, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 19)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "byt_clks", scope: !2, file: !3, line: 51, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 576, elements: !166)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "cht_data", scope: !2, file: !3, line: 198, type: !170, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "cht_reg_map", scope: !2, file: !3, line: 185, type: !114, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "cht_d3_sts_1_map", scope: !2, file: !3, line: 118, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 512, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 4)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "cht_func_dis_2_map", scope: !2, file: !3, line: 125, type: !197, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "cht_pss_map", scope: !2, file: !3, line: 154, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2560, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 20)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "cht_clks", scope: !2, file: !3, line: 65, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 384, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 2)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "acpi_base_addr", scope: !2, file: !3, line: 49, type: !127, isLocal: true, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "critclk_systems", scope: !2, file: !3, line: 369, type: !216, isLocal: true, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 30272, elements: !239)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dmi_system_id", file: !156, line: 566, size: 2752, elements: !219)
!219 = !{!220, !226, !227, !238}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !218, file: !156, line: 567, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !225}
!224 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !218, file: !156, line: 568, baseType: !123, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !218, file: !156, line: 569, baseType: !228, size: 2560, offset: 128)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 2560, elements: !198)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dmi_strmatch", file: !156, line: 560, size: 640, elements: !230)
!230 = !{!231, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !229, file: !156, line: 561, baseType: !232, size: 7, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !229, file: !156, line: 562, baseType: !232, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !229, file: !156, line: 563, baseType: !235, size: 632, offset: 8)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 632, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 79)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !218, file: !156, line: 570, baseType: !108, size: 64, offset: 2688)
!239 = !{!240}
!240 = !DISubrange(count: 11)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_dev", file: !3, line: 38, size: 256, elements: !242)
!242 = !{!243, !244, !245, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !241, file: !3, line: 39, baseType: !127, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "regmap", scope: !241, file: !3, line: 40, baseType: !108, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !241, file: !3, line: 41, baseType: !113, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !241, file: !3, line: 45, baseType: !247, size: 8, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !146, line: 30, baseType: !248)
!248 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!249 = !{i32 7, !"Dwarf Version", i32 4}
!250 = !{i32 2, !"Debug Info Version", i32 3}
!251 = !{i32 1, !"wchar_size", i32 2}
!252 = !{i32 1, !"Code Model", i32 2}
!253 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!254 = distinct !DISubprogram(name: "pmc_atom_read", scope: !3, file: !3, line: 213, type: !255, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !258)
!255 = !DISubroutineType(types: !256)
!256 = !{!224, !224, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!258 = !{}
!259 = !DILocalVariable(name: "offset", arg: 1, scope: !254, file: !3, line: 213, type: !224)
!260 = !DILocation(line: 213, column: 23, scope: !254)
!261 = !DILocalVariable(name: "value", arg: 2, scope: !254, file: !3, line: 213, type: !257)
!262 = !DILocation(line: 213, column: 36, scope: !254)
!263 = !DILocalVariable(name: "pmc", scope: !254, file: !3, line: 215, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!265 = !DILocation(line: 215, column: 18, scope: !254)
!266 = !DILocation(line: 217, column: 7, scope: !267)
!267 = distinct !DILexicalBlock(scope: !254, file: !3, line: 217, column: 6)
!268 = !DILocation(line: 217, column: 12, scope: !267)
!269 = !DILocation(line: 217, column: 6, scope: !254)
!270 = !DILocation(line: 218, column: 3, scope: !267)
!271 = !DILocation(line: 220, column: 24, scope: !254)
!272 = !DILocation(line: 220, column: 29, scope: !254)
!273 = !DILocation(line: 220, column: 11, scope: !254)
!274 = !DILocation(line: 220, column: 3, scope: !254)
!275 = !DILocation(line: 220, column: 9, scope: !254)
!276 = !DILocation(line: 221, column: 2, scope: !254)
!277 = !DILocation(line: 222, column: 1, scope: !254)
!278 = distinct !DISubprogram(name: "pmc_reg_read", scope: !3, file: !3, line: 203, type: !279, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !258)
!279 = !DISubroutineType(types: !280)
!280 = !{!127, !264, !224}
!281 = !DILocalVariable(name: "pmc", arg: 1, scope: !278, file: !3, line: 203, type: !264)
!282 = !DILocation(line: 203, column: 48, scope: !278)
!283 = !DILocalVariable(name: "reg_offset", arg: 2, scope: !278, file: !3, line: 203, type: !224)
!284 = !DILocation(line: 203, column: 57, scope: !278)
!285 = !DILocation(line: 205, column: 15, scope: !278)
!286 = !DILocation(line: 205, column: 20, scope: !278)
!287 = !DILocation(line: 205, column: 29, scope: !278)
!288 = !DILocation(line: 205, column: 27, scope: !278)
!289 = !DILocation(line: 205, column: 9, scope: !278)
!290 = !DILocation(line: 205, column: 2, scope: !278)
!291 = distinct !DISubprogram(name: "pmc_atom_write", scope: !3, file: !3, line: 225, type: !292, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !258)
!292 = !DISubroutineType(types: !293)
!293 = !{!224, !224, !127}
!294 = !DILocalVariable(name: "offset", arg: 1, scope: !291, file: !3, line: 225, type: !224)
!295 = !DILocation(line: 225, column: 24, scope: !291)
!296 = !DILocalVariable(name: "value", arg: 2, scope: !291, file: !3, line: 225, type: !127)
!297 = !DILocation(line: 225, column: 36, scope: !291)
!298 = !DILocalVariable(name: "pmc", scope: !291, file: !3, line: 227, type: !264)
!299 = !DILocation(line: 227, column: 18, scope: !291)
!300 = !DILocation(line: 229, column: 7, scope: !301)
!301 = distinct !DILexicalBlock(scope: !291, file: !3, line: 229, column: 6)
!302 = !DILocation(line: 229, column: 12, scope: !301)
!303 = !DILocation(line: 229, column: 6, scope: !291)
!304 = !DILocation(line: 230, column: 3, scope: !301)
!305 = !DILocation(line: 232, column: 16, scope: !291)
!306 = !DILocation(line: 232, column: 21, scope: !291)
!307 = !DILocation(line: 232, column: 29, scope: !291)
!308 = !DILocation(line: 232, column: 2, scope: !291)
!309 = !DILocation(line: 233, column: 2, scope: !291)
!310 = !DILocation(line: 234, column: 1, scope: !291)
!311 = distinct !DISubprogram(name: "pmc_reg_write", scope: !3, file: !3, line: 208, type: !312, scopeLine: 209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !258)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !264, !224, !127}
!314 = !DILocalVariable(name: "pmc", arg: 1, scope: !311, file: !3, line: 208, type: !264)
!315 = !DILocation(line: 208, column: 50, scope: !311)
!316 = !DILocalVariable(name: "reg_offset", arg: 2, scope: !311, file: !3, line: 208, type: !224)
!317 = !DILocation(line: 208, column: 59, scope: !311)
!318 = !DILocalVariable(name: "val", arg: 3, scope: !311, file: !3, line: 208, type: !127)
!319 = !DILocation(line: 208, column: 75, scope: !311)
!320 = !DILocation(line: 210, column: 9, scope: !311)
!321 = !DILocation(line: 210, column: 14, scope: !311)
!322 = !DILocation(line: 210, column: 19, scope: !311)
!323 = !DILocation(line: 210, column: 28, scope: !311)
!324 = !DILocation(line: 210, column: 26, scope: !311)
!325 = !DILocation(line: 210, column: 2, scope: !311)
!326 = !DILocation(line: 211, column: 1, scope: !311)
!327 = distinct !DISubprogram(name: "pmc_atom_init", scope: !3, file: !3, line: 534, type: !328, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !258)
!328 = !DISubroutineType(types: !329)
!329 = !{!224}
!330 = !DILocalVariable(name: "pdev", scope: !327, file: !3, line: 536, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_dev", file: !333, line: 309, size: 19264, elements: !334)
!333 = !DIFile(filename: "./include/linux/pci.h", directory: "/home/lizy2001/genbc/linux")
!334 = !{!335, !341, !4009, !4010, !4011, !4012, !4023, !4024, !4025, !4026, !4027, !4028, !4029, !4030, !4031, !4032, !4033, !4034, !4035, !4036, !4037, !4038, !4040, !4095, !4096, !4097, !4099, !4100, !4101, !4102, !4103, !4104, !4105, !4106, !4107, !4108, !4109, !4110, !4111, !4112, !4113, !4114, !4115, !4116, !4117, !4118, !4121, !4122, !4123, !4124, !4125, !4126, !4127, !4128, !4132, !4133, !4134, !4135, !4136, !4137, !4138, !4139, !4140, !4141, !4142, !4143, !4144, !4145, !4146, !4147, !4148, !4149, !4150, !4151, !4152, !4153, !4154, !4155, !4156, !4157, !4158, !4159, !4160, !4161, !4162, !4163, !4164, !4165, !4166, !4167, !4168, !4169, !4171, !4172, !4174, !4175, !4176, !4177, !4179, !4180, !4181, !4184, !4191, !4192, !4193, !4194, !4195, !4196, !4197}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bus_list", scope: !332, file: !333, line: 310, baseType: !336, size: 128)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !146, line: 178, size: 128, elements: !337)
!337 = !{!338, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !146, line: 179, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !336, file: !146, line: 179, baseType: !339, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !332, file: !333, line: 311, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_bus", file: !333, line: 605, size: 8064, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !370, !371, !372, !396, !399, !400, !404, !405, !406, !407, !408, !412, !414, !416, !4005, !4006, !4007, !4008}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !343, file: !333, line: 606, baseType: !336, size: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !343, file: !333, line: 607, baseType: !342, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !343, file: !333, line: 608, baseType: !336, size: 128, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !343, file: !333, line: 609, baseType: !336, size: 128, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !343, file: !333, line: 610, baseType: !331, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !343, file: !333, line: 611, baseType: !336, size: 128, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "resource", scope: !343, file: !333, line: 613, baseType: !352, size: 256, offset: 640)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 256, elements: !198)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "resource", file: !355, line: 20, size: 512, elements: !356)
!355 = !DIFile(filename: "./include/linux/ioport.h", directory: "/home/lizy2001/genbc/linux")
!356 = !{!357, !363, !364, !365, !366, !367, !368, !369}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !354, file: !355, line: 21, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !146, line: 158, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !146, line: 153, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !128, line: 23, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !130, line: 31, baseType: !362)
!362 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !354, file: !355, line: 22, baseType: !358, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !355, line: 23, baseType: !123, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !354, file: !355, line: 24, baseType: !143, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !354, file: !355, line: 25, baseType: !143, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !354, file: !355, line: 26, baseType: !353, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !354, file: !355, line: 26, baseType: !353, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !354, file: !355, line: 26, baseType: !353, size: 64, offset: 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !343, file: !333, line: 614, baseType: !336, size: 128, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "busn_res", scope: !343, file: !333, line: 615, baseType: !354, size: 512, offset: 1024)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !343, file: !333, line: 617, baseType: !373, size: 64, offset: 1536)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_ops", file: !333, line: 731, size: 320, elements: !375)
!375 = !{!376, !380, !384, !388, !392}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "add_bus", scope: !374, file: !333, line: 732, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!224, !342}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "remove_bus", scope: !374, file: !333, line: 733, baseType: !381, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !342}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "map_bus", scope: !374, file: !333, line: 734, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{!108, !342, !7, !224}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !374, file: !333, line: 735, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!224, !342, !7, !224, !224, !257}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !374, file: !333, line: 736, baseType: !393, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!224, !342, !7, !224, !224, !127}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "msi", scope: !343, file: !333, line: 618, baseType: !397, size: 64, offset: 1600)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "msi_controller", file: !333, line: 537, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sysdata", scope: !343, file: !333, line: 619, baseType: !108, size: 64, offset: 1664)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "procdir", scope: !343, file: !333, line: 620, baseType: !401, size: 64, offset: 1728)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_dir_entry", file: !403, line: 123, flags: DIFlagFwdDecl)
!403 = !DIFile(filename: "./include/linux/interrupt.h", directory: "/home/lizy2001/genbc/linux")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !343, file: !333, line: 622, baseType: !232, size: 8, offset: 1792)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !343, file: !333, line: 623, baseType: !232, size: 8, offset: 1800)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "max_bus_speed", scope: !343, file: !333, line: 624, baseType: !232, size: 8, offset: 1808)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bus_speed", scope: !343, file: !333, line: 625, baseType: !232, size: 8, offset: 1816)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !343, file: !333, line: 630, baseType: !409, size: 384, offset: 1824)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 384, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 48)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bridge_ctl", scope: !343, file: !333, line: 632, baseType: !413, size: 16, offset: 2208)
!413 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bus_flags", scope: !343, file: !333, line: 633, baseType: !415, size: 16, offset: 2224)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "pci_bus_flags_t", file: !333, line: 237, baseType: !413)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !343, file: !333, line: 634, baseType: !417, size: 64, offset: 2240)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !73, line: 461, size: 5568, elements: !419)
!419 = !{!420, !3561, !3562, !3565, !3566, !3617, !3706, !3707, !3708, !3709, !3710, !3719, !3824, !3837, !3840, !3841, !3845, !3847, !3848, !3849, !3853, !3859, !3860, !3863, !3867, !3957, !3958, !3959, !3960, !3961, !3993, !3994, !3995, !3998, !4001, !4002, !4003, !4004}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !418, file: !73, line: 462, baseType: !421, size: 512)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !422, line: 64, size: 512, elements: !423)
!422 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!423 = !{!424, !425, !426, !428, !485, !3423, !3551, !3556, !3557, !3558, !3559, !3560}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !421, file: !422, line: 65, baseType: !123, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !421, file: !422, line: 66, baseType: !336, size: 128, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !421, file: !422, line: 67, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !421, file: !422, line: 68, baseType: !429, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !422, line: 192, size: 704, elements: !431)
!431 = !{!432, !433, !448, !449}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !430, file: !422, line: 193, baseType: !336, size: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !430, file: !422, line: 194, baseType: !434, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !435, line: 83, baseType: !436)
!435 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !435, line: 71, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !436, file: !435, line: 72, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !436, file: !435, line: 72, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !439, file: !435, line: 73, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !435, line: 20, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !442, file: !435, line: 21, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !446, line: 25, baseType: !447)
!446 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !446, line: 25, elements: !258)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !430, file: !422, line: 195, baseType: !421, size: 512, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !430, file: !422, line: 196, baseType: !450, size: 64, offset: 640)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !422, line: 156, size: 192, elements: !453)
!453 = !{!454, !459, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !452, file: !422, line: 157, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!224, !429, !427}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !422, line: 158, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!123, !429, !427}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !452, file: !422, line: 159, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!224, !429, !427, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !422, line: 148, size: 20736, elements: !471)
!471 = !{!472, !475, !479, !480, !484}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !470, file: !422, line: 149, baseType: !473, size: 192)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 192, elements: !166)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !470, file: !422, line: 150, baseType: !476, size: 4096, offset: 192)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 4096, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !470, file: !422, line: 151, baseType: !224, size: 32, offset: 4288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !470, file: !422, line: 152, baseType: !481, size: 16384, offset: 4320)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 16384, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 2048)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !470, file: !422, line: 153, baseType: !224, size: 32, offset: 20704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !421, file: !422, line: 69, baseType: !486, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !422, line: 138, size: 448, elements: !488)
!488 = !{!489, !493, !520, !522, !3385, !3413, !3417}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !487, file: !422, line: 139, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !427}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !487, file: !422, line: 140, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !497, line: 230, size: 128, elements: !498)
!497 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!498 = !{!499, !513}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !496, file: !497, line: 231, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!503, !427, !507, !474}
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !146, line: 60, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !505, line: 73, baseType: !506)
!505 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !505, line: 15, baseType: !147)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !497, line: 30, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !497, line: 31, baseType: !123, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !508, file: !497, line: 32, baseType: !512, size: 16, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !146, line: 19, baseType: !413)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !496, file: !497, line: 232, baseType: !514, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{!503, !427, !507, !123, !517}
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !146, line: 55, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !505, line: 72, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !505, line: 16, baseType: !143)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !487, file: !422, line: 141, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !487, file: !422, line: 142, baseType: !523, size: 64, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !497, line: 84, size: 320, elements: !527)
!527 = !{!528, !529, !533, !3382, !3383}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !526, file: !497, line: 85, baseType: !123, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !526, file: !497, line: 86, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!512, !427, !507, !224}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !526, file: !497, line: 88, baseType: !534, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!512, !427, !537, !224}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !497, line: 168, size: 448, elements: !539)
!539 = !{!540, !541, !542, !543, !3377, !3378}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !538, file: !497, line: 169, baseType: !508, size: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !538, file: !497, line: 170, baseType: !517, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !538, file: !497, line: 171, baseType: !108, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !538, file: !497, line: 172, baseType: !544, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!503, !547, !427, !537, !474, !716, !517}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !44, line: 916, size: 1856, align: 32, elements: !549)
!549 = !{!550, !568, !3342, !3343, !3344, !3345, !3346, !3347, !3348, !3349, !3350, !3351, !3360, !3361, !3370, !3371, !3372, !3373, !3374, !3375, !3376}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !548, file: !44, line: 920, baseType: !551, size: 128)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !548, file: !44, line: 917, size: 128, elements: !552)
!552 = !{!553, !559}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !551, file: !44, line: 918, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !555, line: 58, size: 64, elements: !556)
!555 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !555, line: 59, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !551, file: !44, line: 919, baseType: !560, size: 128, align: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !146, line: 216, size: 128, align: 64, elements: !561)
!561 = !{!562, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !146, line: 217, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !560, file: !146, line: 218, baseType: !565, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !563}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !548, file: !44, line: 921, baseType: !569, size: 128, offset: 128)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !570, line: 8, size: 128, elements: !571)
!570 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!571 = !{!572, !576}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !569, file: !570, line: 9, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !575, line: 18, flags: DIFlagFwdDecl)
!575 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !569, file: !570, line: 10, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !575, line: 89, size: 1536, elements: !579)
!579 = !{!580, !581, !591, !599, !600, !615, !3310, !3312, !3324, !3325, !3326, !3327, !3328, !3334, !3335, !3336}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !578, file: !575, line: 91, baseType: !7, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !578, file: !575, line: 92, baseType: !582, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !583, line: 277, baseType: !584)
!583 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !583, line: 277, size: 32, elements: !585)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !584, file: !583, line: 277, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !583, line: 70, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !583, line: 65, size: 32, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !588, file: !583, line: 66, baseType: !7, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !578, file: !575, line: 93, baseType: !592, size: 128, offset: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !593, line: 38, size: 128, elements: !594)
!593 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!594 = !{!595, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !592, file: !593, line: 39, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !592, file: !593, line: 39, baseType: !598, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !578, file: !575, line: 94, baseType: !577, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !578, file: !575, line: 95, baseType: !601, size: 128, offset: 256)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !575, line: 47, size: 128, elements: !602)
!602 = !{!603, !612}
!603 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !575, line: 48, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !601, file: !575, line: 48, size: 64, elements: !605)
!605 = !{!606, !611}
!606 = !DIDerivedType(tag: DW_TAG_member, scope: !604, file: !575, line: 49, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !575, line: 49, size: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !607, file: !575, line: 50, baseType: !127, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !607, file: !575, line: 50, baseType: !127, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !604, file: !575, line: 52, baseType: !360, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !575, line: 54, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !578, file: !575, line: 96, baseType: !616, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !44, line: 610, size: 4224, elements: !618)
!618 = !{!619, !620, !621, !629, !636, !637, !783, !3022, !3023, !3024, !3030, !3031, !3032, !3033, !3034, !3035, !3036, !3037, !3038, !3039, !3040, !3041, !3042, !3043, !3044, !3045, !3046, !3047, !3048, !3049, !3054, !3055, !3056, !3057, !3058, !3059, !3060, !3286, !3294, !3295, !3296, !3306, !3307, !3308, !3309}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !617, file: !44, line: 611, baseType: !512, size: 16)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !617, file: !44, line: 612, baseType: !413, size: 16, offset: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !617, file: !44, line: 613, baseType: !622, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !623, line: 23, baseType: !624)
!623 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 21, size: 32, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !624, file: !623, line: 22, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !146, line: 32, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !505, line: 49, baseType: !7)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !617, file: !44, line: 614, baseType: !630, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !623, line: 28, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !623, line: 26, size: 32, elements: !632)
!632 = !{!633}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !631, file: !623, line: 27, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !146, line: 33, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !505, line: 50, baseType: !7)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !617, file: !44, line: 615, baseType: !7, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !617, file: !44, line: 622, baseType: !638, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !44, line: 1864, size: 1536, align: 512, elements: !641)
!641 = !{!642, !646, !659, !663, !669, !673, !677, !681, !685, !689, !693, !694, !700, !704, !730, !759, !763, !769, !774, !778, !779}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !640, file: !44, line: 1865, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!577, !616, !577, !7}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !640, file: !44, line: 1866, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!123, !577, !616, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !652, line: 10, size: 128, elements: !653)
!652 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!653 = !{!654, !658}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !651, file: !652, line: 11, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !108}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !651, file: !652, line: 12, baseType: !108, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !640, file: !44, line: 1867, baseType: !660, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!224, !616, !224}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !640, file: !44, line: 1868, baseType: !664, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !616, !224}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !44, line: 581, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !640, file: !44, line: 1870, baseType: !670, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!224, !577, !474, !224}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !640, file: !44, line: 1872, baseType: !674, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!224, !616, !577, !512, !247}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !640, file: !44, line: 1873, baseType: !678, size: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!224, !577, !616, !577}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !640, file: !44, line: 1874, baseType: !682, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!224, !616, !577}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !640, file: !44, line: 1875, baseType: !686, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!224, !616, !577, !123}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !640, file: !44, line: 1876, baseType: !690, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!224, !616, !577, !512}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !640, file: !44, line: 1877, baseType: !682, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !640, file: !44, line: 1878, baseType: !695, size: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{!224, !616, !577, !512, !698}
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !146, line: 16, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !146, line: 13, baseType: !127)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !640, file: !44, line: 1879, baseType: !701, size: 64, offset: 768)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DISubroutineType(types: !703)
!703 = !{!224, !616, !577, !616, !577, !7}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !640, file: !44, line: 1881, baseType: !705, size: 64, offset: 832)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!224, !577, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !44, line: 219, size: 640, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !719, !727, !728, !729}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !709, file: !44, line: 220, baseType: !7, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !709, file: !44, line: 221, baseType: !512, size: 16, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !709, file: !44, line: 222, baseType: !622, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !709, file: !44, line: 223, baseType: !630, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !709, file: !44, line: 224, baseType: !716, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !146, line: 46, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !505, line: 88, baseType: !718)
!718 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !709, file: !44, line: 225, baseType: !720, size: 128, offset: 192)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !721, line: 13, size: 128, elements: !722)
!721 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!722 = !{!723, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !720, file: !721, line: 14, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !721, line: 8, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !130, line: 30, baseType: !718)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !720, file: !721, line: 15, baseType: !147, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !709, file: !44, line: 226, baseType: !720, size: 128, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !709, file: !44, line: 227, baseType: !720, size: 128, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !709, file: !44, line: 234, baseType: !547, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !640, file: !44, line: 1882, baseType: !731, size: 64, offset: 896)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!224, !734, !736, !127, !7}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !738, line: 22, size: 1152, elements: !739)
!738 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!739 = !{!740, !741, !742, !743, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !737, file: !738, line: 23, baseType: !127, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !737, file: !738, line: 24, baseType: !512, size: 16, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !737, file: !738, line: 25, baseType: !7, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !737, file: !738, line: 26, baseType: !744, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !146, line: 104, baseType: !127)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !737, file: !738, line: 27, baseType: !360, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !737, file: !738, line: 28, baseType: !360, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !737, file: !738, line: 37, baseType: !360, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !737, file: !738, line: 38, baseType: !698, size: 32, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !737, file: !738, line: 39, baseType: !698, size: 32, offset: 352)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !737, file: !738, line: 40, baseType: !622, size: 32, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !737, file: !738, line: 41, baseType: !630, size: 32, offset: 416)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !737, file: !738, line: 42, baseType: !716, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !737, file: !738, line: 43, baseType: !720, size: 128, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !737, file: !738, line: 44, baseType: !720, size: 128, offset: 640)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !737, file: !738, line: 45, baseType: !720, size: 128, offset: 768)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !737, file: !738, line: 46, baseType: !720, size: 128, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !737, file: !738, line: 47, baseType: !360, size: 64, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !737, file: !738, line: 48, baseType: !360, size: 64, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !640, file: !44, line: 1883, baseType: !760, size: 64, offset: 960)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!503, !577, !474, !517}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !640, file: !44, line: 1884, baseType: !764, size: 64, offset: 1024)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!224, !616, !767, !360, !360}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !44, line: 50, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !640, file: !44, line: 1886, baseType: !770, size: 64, offset: 1088)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!224, !616, !773, !224}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !640, file: !44, line: 1887, baseType: !775, size: 64, offset: 1152)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!224, !616, !577, !547, !7, !512}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !640, file: !44, line: 1890, baseType: !690, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !640, file: !44, line: 1891, baseType: !780, size: 64, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!224, !616, !667, !224}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !617, file: !44, line: 623, baseType: !784, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !44, line: 1416, size: 9472, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !841, !2629, !2711, !2794, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2810, !2814, !2815, !2818, !2819, !2822, !2823, !2824, !2865, !2892, !2893, !2894, !2895, !2896, !2897, !2900, !2902, !2909, !2910, !2912, !2913, !2914, !2973, !2974, !2989, !2990, !2991, !2992, !2993, !2996, !2997, !2998, !3013, !3014, !3015, !3016, !3017, !3018, !3019, !3020, !3021}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !785, file: !44, line: 1417, baseType: !336, size: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !785, file: !44, line: 1418, baseType: !698, size: 32, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !785, file: !44, line: 1419, baseType: !232, size: 8, offset: 160)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !785, file: !44, line: 1420, baseType: !143, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !785, file: !44, line: 1421, baseType: !716, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !785, file: !44, line: 1422, baseType: !793, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !44, line: 2228, size: 576, elements: !795)
!795 = !{!796, !797, !798, !804, !808, !812, !816, !820, !821, !831, !834, !835, !836, !838, !839, !840}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !44, line: 2229, baseType: !123, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !794, file: !44, line: 2230, baseType: !224, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !794, file: !44, line: 2238, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!224, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !44, line: 69, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !794, file: !44, line: 2239, baseType: !805, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !807)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !44, line: 70, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !794, file: !44, line: 2240, baseType: !809, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!577, !793, !224, !123, !108}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !794, file: !44, line: 2242, baseType: !813, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !784}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !794, file: !44, line: 2243, baseType: !817, size: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !819, line: 76, flags: DIFlagFwdDecl)
!819 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !794, file: !44, line: 2244, baseType: !793, size: 64, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !794, file: !44, line: 2245, baseType: !822, size: 64, offset: 512)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !146, line: 182, size: 64, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !822, file: !146, line: 183, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !146, line: 186, size: 128, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !146, line: 187, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !826, file: !146, line: 187, baseType: !830, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !794, file: !44, line: 2247, baseType: !832, offset: 576)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !833, line: 187, elements: !258)
!833 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!834 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !794, file: !44, line: 2248, baseType: !832, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !794, file: !44, line: 2249, baseType: !832, offset: 576)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !794, file: !44, line: 2250, baseType: !837, offset: 576)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, elements: !166)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !794, file: !44, line: 2252, baseType: !832, offset: 576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !794, file: !44, line: 2253, baseType: !832, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !794, file: !44, line: 2254, baseType: !832, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !785, file: !44, line: 1423, baseType: !842, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !44, line: 1935, size: 1472, elements: !845)
!845 = !{!846, !850, !854, !855, !859, !865, !869, !870, !871, !875, !879, !880, !881, !882, !888, !893, !894, !950, !951, !952, !953, !2613, !2628}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !844, file: !44, line: 1936, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!616, !784}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !844, file: !44, line: 1937, baseType: !851, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !616}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !844, file: !44, line: 1938, baseType: !851, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !844, file: !44, line: 1940, baseType: !856, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !616, !224}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !844, file: !44, line: 1941, baseType: !860, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!224, !616, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !44, line: 289, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !844, file: !44, line: 1942, baseType: !866, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!224, !616}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !844, file: !44, line: 1943, baseType: !851, size: 64, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !844, file: !44, line: 1944, baseType: !813, size: 64, offset: 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !844, file: !44, line: 1945, baseType: !872, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{!224, !784, !224}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !844, file: !44, line: 1946, baseType: !876, size: 64, offset: 576)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!224, !784}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !844, file: !44, line: 1947, baseType: !876, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !844, file: !44, line: 1948, baseType: !876, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !844, file: !44, line: 1949, baseType: !876, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !844, file: !44, line: 1950, baseType: !883, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!224, !577, !886}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !44, line: 57, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !844, file: !44, line: 1951, baseType: !889, size: 64, offset: 896)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!224, !784, !892, !474}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !844, file: !44, line: 1952, baseType: !813, size: 64, offset: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !844, file: !44, line: 1954, baseType: !895, size: 64, offset: 1024)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!224, !898, !577}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !900, line: 16, size: 896, elements: !901)
!900 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/home/lizy2001/genbc/linux")
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !923, !945, !946, !949}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !899, file: !900, line: 17, baseType: !474, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !899, file: !900, line: 18, baseType: !517, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !899, file: !900, line: 19, baseType: !517, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !899, file: !900, line: 20, baseType: !517, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !899, file: !900, line: 21, baseType: !517, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !899, file: !900, line: 22, baseType: !716, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !899, file: !900, line: 23, baseType: !716, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !899, file: !900, line: 24, baseType: !910, size: 192, offset: 448)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !911, line: 53, size: 192, elements: !912)
!911 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!912 = !{!913, !921, !922}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !910, file: !911, line: 54, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !915, line: 13, baseType: !916)
!915 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !146, line: 175, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 173, size: 64, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !917, file: !146, line: 174, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !128, line: 22, baseType: !725)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !910, file: !911, line: 55, baseType: !434, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !910, file: !911, line: 59, baseType: !336, size: 128, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !899, file: !900, line: 25, baseType: !924, size: 64, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !900, line: 31, size: 256, elements: !927)
!927 = !{!928, !933, !937, !941}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !926, file: !900, line: 32, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!108, !898, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !926, file: !900, line: 33, baseType: !934, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !898, !108}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !926, file: !900, line: 34, baseType: !938, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!108, !898, !108, !932}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !926, file: !900, line: 35, baseType: !942, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!224, !898, !108}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !899, file: !900, line: 26, baseType: !224, size: 32, offset: 704)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !899, file: !900, line: 27, baseType: !947, size: 64, offset: 768)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !899, file: !900, line: 28, baseType: !108, size: 64, offset: 832)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !844, file: !44, line: 1955, baseType: !895, size: 64, offset: 1088)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !844, file: !44, line: 1956, baseType: !895, size: 64, offset: 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !844, file: !44, line: 1957, baseType: !895, size: 64, offset: 1216)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !844, file: !44, line: 1963, baseType: !954, size: 64, offset: 1280)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!224, !784, !957, !145}
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !959, line: 68, size: 512, align: 128, elements: !960)
!959 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!960 = !{!961, !962, !2605, !2612}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !958, file: !959, line: 69, baseType: !143, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, scope: !958, file: !959, line: 77, baseType: !963, size: 320, offset: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !958, file: !959, line: 77, size: 320, elements: !964)
!964 = !{!965, !1145, !1150, !1178, !1186, !1192, !2536, !2604}
!965 = !DIDerivedType(tag: DW_TAG_member, scope: !963, file: !959, line: 78, baseType: !966, size: 320)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !963, file: !959, line: 78, size: 320, elements: !967)
!967 = !{!968, !969, !1143, !1144}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !966, file: !959, line: 84, baseType: !336, size: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !966, file: !959, line: 86, baseType: !970, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !44, line: 451, size: 1216, align: 64, elements: !972)
!972 = !{!973, !974, !981, !982, !987, !1002, !1011, !1012, !1013, !1014, !1136, !1137, !1140, !1141, !1142}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !971, file: !44, line: 452, baseType: !616, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !971, file: !44, line: 453, baseType: !975, size: 128, offset: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !976, line: 292, size: 128, elements: !977)
!976 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !975, file: !976, line: 293, baseType: !434)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !975, file: !976, line: 295, baseType: !145, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !975, file: !976, line: 296, baseType: !108, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !971, file: !44, line: 454, baseType: !145, size: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !971, file: !44, line: 455, baseType: !983, size: 32, offset: 224)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !146, line: 168, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 166, size: 32, elements: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !984, file: !146, line: 167, baseType: !224, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !971, file: !44, line: 460, baseType: !988, size: 128, offset: 256)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !989, line: 125, size: 128, elements: !990)
!989 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!990 = !{!991, !1001}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !988, file: !989, line: 126, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !989, line: 31, size: 64, elements: !993)
!993 = !{!994}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !992, file: !989, line: 32, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !989, line: 24, size: 192, align: 64, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !996, file: !989, line: 25, baseType: !143, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !996, file: !989, line: 26, baseType: !995, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !996, file: !989, line: 27, baseType: !995, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !988, file: !989, line: 127, baseType: !995, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !971, file: !44, line: 461, baseType: !1003, size: 256, offset: 384)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1004, line: 35, size: 256, elements: !1005)
!1004 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1005 = !{!1006, !1007, !1008, !1010}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1003, file: !1004, line: 36, baseType: !914, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1003, file: !1004, line: 42, baseType: !914, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1003, file: !1004, line: 46, baseType: !1009, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !435, line: 29, baseType: !442)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1003, file: !1004, line: 47, baseType: !336, size: 128, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !971, file: !44, line: 462, baseType: !143, size: 64, offset: 640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !971, file: !44, line: 463, baseType: !143, size: 64, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !971, file: !44, line: 464, baseType: !143, size: 64, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !971, file: !44, line: 465, baseType: !1015, size: 64, offset: 832)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !44, line: 367, size: 1408, elements: !1018)
!1018 = !{!1019, !1023, !1027, !1031, !1035, !1039, !1045, !1051, !1055, !1060, !1064, !1068, !1072, !1100, !1104, !1110, !1111, !1112, !1116, !1121, !1125, !1132}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1017, file: !44, line: 368, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!224, !957, !863}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1017, file: !44, line: 369, baseType: !1024, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!224, !547, !957}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1017, file: !44, line: 372, baseType: !1028, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!224, !970, !863}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1017, file: !44, line: 375, baseType: !1032, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!224, !957}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !1017, file: !44, line: 381, baseType: !1036, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!224, !547, !970, !339, !7}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !1017, file: !44, line: 383, baseType: !1040, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !44, line: 290, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !1017, file: !44, line: 385, baseType: !1046, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!224, !547, !970, !716, !7, !7, !1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !1017, file: !44, line: 388, baseType: !1052, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!224, !547, !970, !716, !7, !7, !957, !108}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !1017, file: !44, line: 393, baseType: !1056, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!1059, !970, !1059}
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !146, line: 125, baseType: !360)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !1017, file: !44, line: 394, baseType: !1061, size: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !957, !7, !7}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !1017, file: !44, line: 395, baseType: !1065, size: 64, offset: 640)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!224, !957, !145}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !1017, file: !44, line: 396, baseType: !1069, size: 64, offset: 704)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !957}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !1017, file: !44, line: 397, baseType: !1073, size: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!503, !1076, !1098}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !44, line: 320, size: 384, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1085, !1086, !1087, !1090, !1091}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !1077, file: !44, line: 321, baseType: !547, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !1077, file: !44, line: 326, baseType: !716, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !1077, file: !44, line: 327, baseType: !1082, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1076, !147, !147}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1077, file: !44, line: 328, baseType: !108, size: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !1077, file: !44, line: 329, baseType: !224, size: 32, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !1077, file: !44, line: 330, baseType: !1088, size: 16, offset: 288)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !128, line: 19, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !130, line: 24, baseType: !413)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !1077, file: !44, line: 331, baseType: !1088, size: 16, offset: 304)
!1091 = !DIDerivedType(tag: DW_TAG_member, scope: !1077, file: !44, line: 332, baseType: !1092, size: 64, offset: 320)
!1092 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1077, file: !44, line: 332, size: 64, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !1092, file: !44, line: 333, baseType: !7, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !1092, file: !44, line: 334, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !44, line: 334, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !44, line: 64, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !1017, file: !44, line: 402, baseType: !1101, size: 64, offset: 832)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!224, !970, !957, !957, !5}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !1017, file: !44, line: 404, baseType: !1105, size: 64, offset: 896)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!247, !957, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !1109, line: 305, baseType: !7)
!1109 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !1017, file: !44, line: 405, baseType: !1069, size: 64, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !1017, file: !44, line: 406, baseType: !1032, size: 64, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !1017, file: !44, line: 407, baseType: !1113, size: 64, offset: 1088)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!224, !957, !143, !143}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "is_dirty_writeback", scope: !1017, file: !44, line: 409, baseType: !1117, size: 64, offset: 1152)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !957, !1120, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "error_remove_page", scope: !1017, file: !44, line: 410, baseType: !1122, size: 64, offset: 1216)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!224, !970, !957}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "swap_activate", scope: !1017, file: !44, line: 413, baseType: !1126, size: 64, offset: 1280)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!224, !1129, !547, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "swap_info_struct", file: !44, line: 61, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "swap_deactivate", scope: !1017, file: !44, line: 415, baseType: !1133, size: 64, offset: 1344)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !547}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !971, file: !44, line: 466, baseType: !143, size: 64, offset: 896)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "wb_err", scope: !971, file: !44, line: 467, baseType: !1138, size: 32, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "errseq_t", file: !1139, line: 8, baseType: !127)
!1139 = !DIFile(filename: "./include/linux/errseq.h", directory: "/home/lizy2001/genbc/linux")
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "private_lock", scope: !971, file: !44, line: 468, baseType: !434, offset: 992)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !971, file: !44, line: 469, baseType: !336, size: 128, offset: 1024)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !971, file: !44, line: 470, baseType: !108, size: 64, offset: 1152)
