; ModuleID = '../bcout/drivers/mtd/nand/core.llvm.bc'
source_filename = "drivers/mtd/nand/core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.nand_device = type { %struct.mtd_info, %struct.nand_memory_organization, %struct.nand_ecc, %struct.nand_row_converter, %struct.nand_bbt, %struct.nand_ops* }

!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_engine_type", file: !51, line: 142, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/mtd/nand.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_INVALID", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_NONE", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_SOFT", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_HOST", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_DIE", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_placement", file: !51, line: 158, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_UNKNOWN", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_OOB", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_INTERLEAVED", value: 2, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_algo", file: !51, line: 171, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_UNKNOWN", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !51, line: 90, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_bbt_block_status", file: !51, line: 888, baseType: !7, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80}
!75 = !DIEnumerator(name: "NAND_BBT_BLOCK_STATUS_UNKNOWN", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "NAND_BBT_BLOCK_GOOD", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "NAND_BBT_BLOCK_WORN", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "NAND_BBT_BLOCK_RESERVED", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "NAND_BBT_BLOCK_FACTORY_BAD", value: 4, isUnsigned: true)
!80 = !DIEnumerator(name: "NAND_BBT_BLOCK_NUM_STATUS", value: 5, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 10, baseType: !7, size: 32, elements: !83)
!82 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!83 = !{!84, !85}
!84 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!86 = !{!87, !92, !93, !110, !111}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !88, line: 46, baseType: !89)
!88 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !90, line: 88, baseType: !91)
!90 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!91 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !51, line: 319, size: 11200, elements: !95)
!95 = !{!96, !2298, !2310, !2379, !2384, !2388}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !94, file: !51, line: 320, baseType: !97, size: 9664)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !98, line: 235, size: 9664, elements: !99)
!98 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!99 = !{!100, !103, !109, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !128, !130, !146, !167, !168, !169, !170, !180, !190, !202, !206, !211, !217, !218, !237, !238, !249, !250, !251, !252, !253, !254, !265, !269, !273, !274, !275, !279, !280, !281, !282, !286, !287, !288, !289, !290, !293, !305, !312, !313, !314, !318, !2268, !2269, !2277, !2281, !2282, !2283}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !98, line: 236, baseType: !101, size: 8)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !88, line: 79, baseType: !102)
!102 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !98, line: 237, baseType: !104, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !88, line: 104, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !106, line: 21, baseType: !107)
!106 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !108, line: 27, baseType: !7)
!108 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !97, file: !98, line: 238, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !88, line: 107, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !106, line: 23, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !108, line: 31, baseType: !113)
!113 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !97, file: !98, line: 244, baseType: !104, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !97, file: !98, line: 252, baseType: !104, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !97, file: !98, line: 263, baseType: !104, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !97, file: !98, line: 265, baseType: !104, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !97, file: !98, line: 266, baseType: !104, size: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !97, file: !98, line: 272, baseType: !7, size: 32, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !97, file: !98, line: 273, baseType: !7, size: 32, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !97, file: !98, line: 275, baseType: !7, size: 32, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !97, file: !98, line: 276, baseType: !7, size: 32, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !97, file: !98, line: 285, baseType: !7, size: 32, offset: 416)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !98, line: 288, baseType: !125, size: 64, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !97, file: !98, line: 289, baseType: !129, size: 32, offset: 512)
!129 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !97, file: !98, line: 292, baseType: !131, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !98, line: 101, size: 128, elements: !134)
!134 = !{!135, !145}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !133, file: !98, line: 102, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!129, !139, !129, !140}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !98, line: 87, size: 64, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !141, file: !98, line: 88, baseType: !105, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !141, file: !98, line: 89, baseType: !105, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !133, file: !98, line: 104, baseType: !136, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !97, file: !98, line: 295, baseType: !147, size: 64, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !98, line: 176, size: 192, elements: !150)
!150 = !{!151, !152, !161}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !149, file: !98, line: 177, baseType: !129, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !149, file: !98, line: 178, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!129, !139, !129, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !98, line: 138, size: 64, elements: !158)
!158 = !{!159, !160}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !157, file: !98, line: 139, baseType: !129, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !157, file: !98, line: 140, baseType: !129, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !149, file: !98, line: 180, baseType: !162, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!129, !139, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !97, file: !98, line: 298, baseType: !7, size: 32, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !97, file: !98, line: 301, baseType: !7, size: 32, offset: 736)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !97, file: !98, line: 306, baseType: !129, size: 32, offset: 768)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !97, file: !98, line: 307, baseType: !171, size: 64, offset: 832)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !98, line: 36, size: 192, elements: !173)
!173 = !{!174, !175, !176, !177}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !172, file: !98, line: 37, baseType: !110, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !172, file: !98, line: 38, baseType: !104, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !172, file: !98, line: 39, baseType: !104, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !172, file: !98, line: 40, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !97, file: !98, line: 313, baseType: !181, size: 64, offset: 896)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!129, !139, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !98, line: 30, size: 192, elements: !186)
!186 = !{!187, !188, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !185, file: !98, line: 31, baseType: !110, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !185, file: !98, line: 32, baseType: !110, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !185, file: !98, line: 33, baseType: !110, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !97, file: !98, line: 314, baseType: !191, size: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!129, !139, !87, !194, !197, !198, !199}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !88, line: 55, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !90, line: 72, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !90, line: 16, baseType: !179)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !88, line: 158, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !88, line: 153, baseType: !111)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !97, file: !98, line: 316, baseType: !203, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DISubroutineType(types: !205)
!205 = !{!129, !139, !87, !194}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !97, file: !98, line: 317, baseType: !207, size: 64, offset: 1088)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!129, !139, !87, !194, !197, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !97, file: !98, line: 319, baseType: !212, size: 64, offset: 1152)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!129, !139, !87, !194, !197, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !97, file: !98, line: 321, baseType: !212, size: 64, offset: 1216)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !97, file: !98, line: 323, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!129, !139, !87, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !98, line: 64, size: 512, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !236}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !223, file: !98, line: 65, baseType: !7, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !223, file: !98, line: 66, baseType: !194, size: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !223, file: !98, line: 67, baseType: !194, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !223, file: !98, line: 68, baseType: !194, size: 64, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !223, file: !98, line: 69, baseType: !194, size: 64, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !223, file: !98, line: 70, baseType: !104, size: 32, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !223, file: !98, line: 71, baseType: !232, size: 64, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !88, line: 102, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !106, line: 17, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !108, line: 21, baseType: !102)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !223, file: !98, line: 72, baseType: !232, size: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !97, file: !98, line: 325, baseType: !219, size: 64, offset: 1344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !97, file: !98, line: 327, baseType: !239, size: 64, offset: 1408)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!129, !139, !194, !197, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !244, line: 146, size: 96, elements: !245)
!244 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!245 = !{!246, !247, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !243, file: !244, line: 147, baseType: !107, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !243, file: !244, line: 148, baseType: !107, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !243, file: !244, line: 149, baseType: !107, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !97, file: !98, line: 329, baseType: !207, size: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !97, file: !98, line: 331, baseType: !239, size: 64, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !97, file: !98, line: 333, baseType: !207, size: 64, offset: 1600)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !97, file: !98, line: 335, baseType: !207, size: 64, offset: 1664)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !97, file: !98, line: 337, baseType: !203, size: 64, offset: 1728)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !97, file: !98, line: 339, baseType: !255, size: 64, offset: 1792)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!129, !139, !258, !179, !87, !197}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !261, line: 15, size: 128, elements: !262)
!261 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !260, file: !261, line: 16, baseType: !92, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !260, file: !261, line: 17, baseType: !194, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !97, file: !98, line: 341, baseType: !266, size: 64, offset: 1856)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !139}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !97, file: !98, line: 342, baseType: !270, size: 64, offset: 1920)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!129, !139, !87, !110}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !97, file: !98, line: 343, baseType: !270, size: 64, offset: 1984)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !97, file: !98, line: 344, baseType: !270, size: 64, offset: 2048)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !97, file: !98, line: 345, baseType: !276, size: 64, offset: 2112)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!129, !139, !87}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !97, file: !98, line: 346, baseType: !276, size: 64, offset: 2176)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !97, file: !98, line: 347, baseType: !276, size: 64, offset: 2240)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !97, file: !98, line: 348, baseType: !203, size: 64, offset: 2304)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !97, file: !98, line: 349, baseType: !283, size: 64, offset: 2368)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!129, !139}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !97, file: !98, line: 350, baseType: !266, size: 64, offset: 2432)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !97, file: !98, line: 351, baseType: !266, size: 64, offset: 2496)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !97, file: !98, line: 356, baseType: !283, size: 64, offset: 2560)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !97, file: !98, line: 357, baseType: !266, size: 64, offset: 2624)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !97, file: !98, line: 363, baseType: !291, size: 8, offset: 2688)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !88, line: 30, baseType: !292)
!292 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !97, file: !98, line: 365, baseType: !294, size: 192, offset: 2752)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !295, line: 54, size: 192, elements: !296)
!295 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!296 = !{!297, !303, !304}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !294, file: !295, line: 55, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !295, line: 51, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{!129, !302, !179, !92}
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !295, line: 56, baseType: !302, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !294, file: !295, line: 57, baseType: !129, size: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !97, file: !98, line: 368, baseType: !306, size: 128, offset: 2944)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !244, line: 250, size: 128, elements: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !306, file: !244, line: 251, baseType: !107, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !306, file: !244, line: 252, baseType: !107, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !306, file: !244, line: 253, baseType: !107, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !306, file: !244, line: 254, baseType: !107, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !97, file: !98, line: 370, baseType: !129, size: 32, offset: 3072)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !97, file: !98, line: 372, baseType: !92, size: 64, offset: 3136)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !97, file: !98, line: 374, baseType: !315, size: 64, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !317, line: 76, flags: DIFlagFwdDecl)
!317 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !97, file: !98, line: 375, baseType: !319, size: 5568, offset: 3264)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !320)
!320 = !{!321, !1794, !1796, !1799, !1800, !1851, !1945, !1946, !1947, !1948, !1949, !1958, !2063, !2076, !2079, !2080, !2084, !2086, !2087, !2088, !2092, !2098, !2099, !2102, !2217, !2218, !2221, !2222, !2223, !2224, !2256, !2257, !2258, !2261, !2264, !2265, !2266, !2267}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !319, file: !30, line: 462, baseType: !322, size: 512)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !323, line: 64, size: 512, elements: !324)
!323 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!324 = !{!325, !326, !332, !334, !394, !1630, !1784, !1789, !1790, !1791, !1792, !1793}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !322, file: !323, line: 65, baseType: !125, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !322, file: !323, line: 66, baseType: !327, size: 128, offset: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !88, line: 178, size: 128, elements: !328)
!328 = !{!329, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !88, line: 179, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !327, file: !88, line: 179, baseType: !330, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !322, file: !323, line: 67, baseType: !333, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !322, file: !323, line: 68, baseType: !335, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !323, line: 192, size: 704, elements: !337)
!337 = !{!338, !339, !355, !356}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !336, file: !323, line: 193, baseType: !327, size: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !336, file: !323, line: 194, baseType: !340, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !341, line: 83, baseType: !342)
!341 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !341, line: 71, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !342, file: !341, line: 72, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !342, file: !341, line: 72, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !345, file: !341, line: 73, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !341, line: 20, elements: !349)
!349 = !{!350}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !348, file: !341, line: 21, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !352, line: 25, baseType: !353)
!352 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !352, line: 25, elements: !354)
!354 = !{}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !336, file: !323, line: 195, baseType: !322, size: 512, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !336, file: !323, line: 196, baseType: !357, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !323, line: 156, size: 192, elements: !360)
!360 = !{!361, !366, !371}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !359, file: !323, line: 157, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{!129, !335, !333}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !359, file: !323, line: 158, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!125, !335, !333}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !359, file: !323, line: 159, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!129, !335, !333, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !323, line: 148, size: 20736, elements: !378)
!378 = !{!379, !384, !388, !389, !393}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !377, file: !323, line: 149, baseType: !380, size: 192)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 192, elements: !382)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!382 = !{!383}
!383 = !DISubrange(count: 3)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !377, file: !323, line: 150, baseType: !385, size: 4096, offset: 192)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 4096, elements: !386)
!386 = !{!387}
!387 = !DISubrange(count: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !377, file: !323, line: 151, baseType: !129, size: 32, offset: 4288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !377, file: !323, line: 152, baseType: !390, size: 16384, offset: 4320)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 16384, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 2048)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !377, file: !323, line: 153, baseType: !129, size: 32, offset: 20704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !322, file: !323, line: 69, baseType: !395, size: 64, offset: 320)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !323, line: 138, size: 448, elements: !397)
!397 = !{!398, !402, !427, !429, !1576, !1609, !1613}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !396, file: !323, line: 139, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !333}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !396, file: !323, line: 140, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !406, line: 230, size: 128, elements: !407)
!406 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!407 = !{!408, !423}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !405, file: !406, line: 231, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!412, !333, !416, !381}
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !88, line: 60, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !90, line: 73, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !90, line: 15, baseType: !415)
!415 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !406, line: 30, size: 128, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !417, file: !406, line: 31, baseType: !125, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !417, file: !406, line: 32, baseType: !421, size: 16, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !88, line: 19, baseType: !422)
!422 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !405, file: !406, line: 232, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!412, !333, !416, !125, !194}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !396, file: !323, line: 141, baseType: !428, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !396, file: !323, line: 142, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !406, line: 84, size: 320, elements: !434)
!434 = !{!435, !436, !440, !1573, !1574}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !406, line: 85, baseType: !125, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !433, file: !406, line: 86, baseType: !437, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!421, !333, !416, !129}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !433, file: !406, line: 88, baseType: !441, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!421, !333, !444, !129}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !406, line: 168, size: 448, elements: !446)
!446 = !{!447, !448, !449, !450, !457, !458}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !445, file: !406, line: 169, baseType: !417, size: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !445, file: !406, line: 170, baseType: !194, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !445, file: !406, line: 171, baseType: !92, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !445, file: !406, line: 172, baseType: !451, size: 64, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!412, !454, !333, !444, !381, !87, !194}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !456, line: 526, flags: DIFlagFwdDecl)
!456 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!457 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !445, file: !406, line: 174, baseType: !451, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !445, file: !406, line: 176, baseType: !459, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!129, !454, !333, !444, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !464, line: 305, size: 1472, elements: !465)
!464 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!465 = !{!466, !467, !468, !469, !470, !478, !479, !1547, !1553, !1554, !1559, !1560, !1563, !1567, !1568, !1569, !1570, !1571}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !463, file: !464, line: 308, baseType: !179, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !463, file: !464, line: 309, baseType: !179, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !463, file: !464, line: 313, baseType: !462, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !463, file: !464, line: 313, baseType: !462, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !463, file: !464, line: 315, baseType: !471, size: 192, align: 64, offset: 256)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !472, line: 24, size: 192, align: 64, elements: !473)
!472 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!473 = !{!474, !475, !477}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !471, file: !472, line: 25, baseType: !179, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !471, file: !472, line: 26, baseType: !476, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !471, file: !472, line: 27, baseType: !476, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !463, file: !464, line: 323, baseType: !179, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !463, file: !464, line: 327, baseType: !480, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !464, line: 388, size: 7296, elements: !482)
!482 = !{!483, !1543}
!483 = !DIDerivedType(tag: DW_TAG_member, scope: !481, file: !464, line: 389, baseType: !484, size: 7296)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !481, file: !464, line: 389, size: 7296, elements: !485)
!485 = !{!486, !487, !491, !492, !496, !497, !498, !499, !500, !508, !513, !514, !515, !516, !525, !526, !527, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !562, !570, !573, !621, !622, !1513, !1514, !1517, !1521, !1522, !1525, !1526, !1527, !1530, !1542}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !484, file: !464, line: 390, baseType: !462, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !484, file: !464, line: 391, baseType: !488, size: 64, offset: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !472, line: 31, size: 64, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !488, file: !472, line: 32, baseType: !476, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !484, file: !464, line: 392, baseType: !111, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !484, file: !464, line: 394, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!179, !454, !179, !179, !179, !179}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !484, file: !464, line: 398, baseType: !179, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !484, file: !464, line: 399, baseType: !179, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !484, file: !464, line: 405, baseType: !179, size: 64, offset: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !484, file: !464, line: 406, baseType: !179, size: 64, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !484, file: !464, line: 407, baseType: !501, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !456, line: 286, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 286, size: 64, elements: !504)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !503, file: !456, line: 286, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !507, line: 18, baseType: !179)
!507 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!508 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !484, file: !464, line: 416, baseType: !509, size: 32, offset: 576)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !88, line: 168, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 166, size: 32, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !510, file: !88, line: 167, baseType: !129, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !484, file: !464, line: 428, baseType: !509, size: 32, offset: 608)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !484, file: !464, line: 437, baseType: !509, size: 32, offset: 640)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !484, file: !464, line: 447, baseType: !509, size: 32, offset: 672)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !484, file: !464, line: 450, baseType: !517, size: 64, offset: 704)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !518, line: 13, baseType: !519)
!518 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !88, line: 175, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 173, size: 64, elements: !521)
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !520, file: !88, line: 174, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !106, line: 22, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !108, line: 30, baseType: !91)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !484, file: !464, line: 452, baseType: !129, size: 32, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !484, file: !464, line: 454, baseType: !340, offset: 800)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !484, file: !464, line: 457, baseType: !528, size: 256, offset: 832)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !529, line: 35, size: 256, elements: !530)
!529 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!530 = !{!531, !532, !533, !535}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !528, file: !529, line: 36, baseType: !517, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !528, file: !529, line: 42, baseType: !517, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !528, file: !529, line: 46, baseType: !534, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !341, line: 29, baseType: !348)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !528, file: !529, line: 47, baseType: !327, size: 128, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !484, file: !464, line: 459, baseType: !327, size: 128, offset: 1088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !484, file: !464, line: 466, baseType: !179, size: 64, offset: 1216)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !484, file: !464, line: 467, baseType: !179, size: 64, offset: 1280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !484, file: !464, line: 469, baseType: !179, size: 64, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !484, file: !464, line: 470, baseType: !179, size: 64, offset: 1408)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !484, file: !464, line: 471, baseType: !519, size: 64, offset: 1472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !484, file: !464, line: 472, baseType: !179, size: 64, offset: 1536)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !484, file: !464, line: 473, baseType: !179, size: 64, offset: 1600)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !484, file: !464, line: 474, baseType: !179, size: 64, offset: 1664)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !484, file: !464, line: 475, baseType: !179, size: 64, offset: 1728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !484, file: !464, line: 477, baseType: !340, offset: 1792)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !484, file: !464, line: 478, baseType: !179, size: 64, offset: 1792)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !484, file: !464, line: 478, baseType: !179, size: 64, offset: 1856)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !484, file: !464, line: 478, baseType: !179, size: 64, offset: 1920)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !484, file: !464, line: 478, baseType: !179, size: 64, offset: 1984)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !484, file: !464, line: 479, baseType: !179, size: 64, offset: 2048)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !484, file: !464, line: 479, baseType: !179, size: 64, offset: 2112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !484, file: !464, line: 479, baseType: !179, size: 64, offset: 2176)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !484, file: !464, line: 480, baseType: !179, size: 64, offset: 2240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !484, file: !464, line: 480, baseType: !179, size: 64, offset: 2304)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !484, file: !464, line: 480, baseType: !179, size: 64, offset: 2368)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !484, file: !464, line: 480, baseType: !179, size: 64, offset: 2432)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !484, file: !464, line: 482, baseType: !559, size: 2816, offset: 2496)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2816, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 44)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !484, file: !464, line: 488, baseType: !563, size: 256, offset: 5312)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !564, line: 60, size: 256, elements: !565)
!564 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !563, file: !564, line: 61, baseType: !567, size: 256)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 256, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 4)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !484, file: !464, line: 490, baseType: !571, size: 64, offset: 5568)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !464, line: 490, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !484, file: !464, line: 493, baseType: !574, size: 896, offset: 5632)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !575, line: 53, baseType: !576)
!575 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !575, line: 13, size: 896, elements: !577)
!577 = !{!578, !579, !580, !581, !584, !585, !592, !593, !613, !614, !617}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !576, file: !575, line: 18, baseType: !111, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !576, file: !575, line: 28, baseType: !519, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !576, file: !575, line: 31, baseType: !528, size: 256, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !576, file: !575, line: 32, baseType: !582, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !575, line: 32, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !576, file: !575, line: 37, baseType: !422, size: 16, offset: 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !576, file: !575, line: 40, baseType: !586, size: 192, offset: 512)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !587, line: 53, size: 192, elements: !588)
!587 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !586, file: !587, line: 54, baseType: !517, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !586, file: !587, line: 55, baseType: !340, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !586, file: !587, line: 59, baseType: !327, size: 128, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !576, file: !575, line: 41, baseType: !92, size: 64, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !576, file: !575, line: 42, baseType: !594, size: 64, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !597, line: 13, size: 896, elements: !598)
!597 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !596, file: !597, line: 14, baseType: !92, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !597, line: 15, baseType: !179, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !596, file: !597, line: 17, baseType: !179, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !596, file: !597, line: 17, baseType: !179, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !596, file: !597, line: 19, baseType: !415, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !596, file: !597, line: 21, baseType: !415, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !596, file: !597, line: 22, baseType: !415, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !596, file: !597, line: 23, baseType: !415, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !596, file: !597, line: 24, baseType: !415, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !596, file: !597, line: 25, baseType: !415, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !596, file: !597, line: 26, baseType: !415, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !596, file: !597, line: 27, baseType: !415, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !596, file: !597, line: 28, baseType: !415, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !596, file: !597, line: 29, baseType: !415, size: 64, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !576, file: !575, line: 44, baseType: !509, size: 32, offset: 832)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !576, file: !575, line: 50, baseType: !615, size: 16, offset: 864)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !106, line: 19, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !108, line: 24, baseType: !422)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !576, file: !575, line: 51, baseType: !618, size: 16, offset: 880)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !106, line: 18, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !108, line: 23, baseType: !620)
!620 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !484, file: !464, line: 495, baseType: !179, size: 64, offset: 6528)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !484, file: !464, line: 497, baseType: !623, size: 64, offset: 6592)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !464, line: 381, size: 384, elements: !625)
!625 = !{!626, !627, !1512}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !624, file: !464, line: 382, baseType: !509, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !624, file: !464, line: 383, baseType: !628, size: 128, offset: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !464, line: 376, size: 128, elements: !629)
!629 = !{!630, !1510}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !628, file: !464, line: 377, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !633, line: 640, size: 48640, elements: !634)
!633 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!634 = !{!635, !641, !643, !644, !650, !651, !652, !653, !654, !655, !656, !657, !661, !679, !690, !782, !783, !784, !795, !796, !798, !799, !800, !801, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !880, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !936, !938, !939, !940, !952, !954, !955, !956, !957, !958, !964, !965, !966, !967, !968, !969, !970, !982, !987, !992, !993, !994, !997, !1001, !1004, !1007, !1010, !1013, !1017, !1020, !1023, !1029, !1030, !1031, !1037, !1038, !1039, !1040, !1041, !1050, !1051, !1052, !1053, !1054, !1059, !1060, !1061, !1064, !1065, !1068, !1071, !1074, !1077, !1080, !1083, !1084, !1164, !1167, !1170, !1171, !1174, !1175, !1176, !1182, !1183, !1184, !1197, !1198, !1199, !1209, !1214, !1217, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !632, file: !633, line: 646, baseType: !636, size: 128)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !637, line: 56, size: 128, elements: !638)
!637 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !636, file: !637, line: 57, baseType: !179, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !636, file: !637, line: 58, baseType: !105, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !632, file: !633, line: 649, baseType: !642, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !415)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !632, file: !633, line: 657, baseType: !92, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !632, file: !633, line: 658, baseType: !645, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !646, line: 113, baseType: !647)
!646 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !646, line: 111, size: 32, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !647, file: !646, line: 112, baseType: !509, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !633, line: 660, baseType: !7, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !632, file: !633, line: 661, baseType: !7, size: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !632, file: !633, line: 684, baseType: !129, size: 32, offset: 352)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !632, file: !633, line: 686, baseType: !129, size: 32, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !632, file: !633, line: 687, baseType: !129, size: 32, offset: 416)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !632, file: !633, line: 688, baseType: !129, size: 32, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !632, file: !633, line: 689, baseType: !7, size: 32, offset: 480)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !632, file: !633, line: 691, baseType: !658, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !633, line: 691, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !632, file: !633, line: 692, baseType: !662, size: 832, offset: 576)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !633, line: 451, size: 832, elements: !663)
!663 = !{!664, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !662, file: !633, line: 453, baseType: !665, size: 128)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !633, line: 325, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !665, file: !633, line: 326, baseType: !179, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !665, file: !633, line: 327, baseType: !105, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !662, file: !633, line: 454, baseType: !471, size: 192, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !662, file: !633, line: 455, baseType: !327, size: 128, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !662, file: !633, line: 456, baseType: !7, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !662, file: !633, line: 458, baseType: !111, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !662, file: !633, line: 459, baseType: !111, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !662, file: !633, line: 460, baseType: !111, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !662, file: !633, line: 461, baseType: !111, size: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !662, file: !633, line: 463, baseType: !111, size: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !662, file: !633, line: 465, baseType: !678, offset: 832)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !633, line: 415, elements: !354)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !632, file: !633, line: 693, baseType: !680, size: 384, offset: 1408)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !633, line: 489, size: 384, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !680, file: !633, line: 490, baseType: !327, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !680, file: !633, line: 491, baseType: !179, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !680, file: !633, line: 492, baseType: !179, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !680, file: !633, line: 493, baseType: !7, size: 32, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !680, file: !633, line: 494, baseType: !422, size: 16, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !680, file: !633, line: 495, baseType: !422, size: 16, offset: 304)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !680, file: !633, line: 497, baseType: !689, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !632, file: !633, line: 697, baseType: !691, size: 1792, offset: 1792)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !633, line: 507, size: 1792, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !779, !780}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !691, file: !633, line: 508, baseType: !471, size: 192, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !691, file: !633, line: 515, baseType: !111, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !691, file: !633, line: 516, baseType: !111, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !691, file: !633, line: 517, baseType: !111, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !691, file: !633, line: 518, baseType: !111, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !691, file: !633, line: 519, baseType: !111, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !691, file: !633, line: 526, baseType: !523, size: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !691, file: !633, line: 527, baseType: !111, size: 64, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !633, line: 528, baseType: !7, size: 32, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !691, file: !633, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !691, file: !633, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !691, file: !633, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !691, file: !633, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !691, file: !633, line: 563, baseType: !707, size: 512, offset: 704)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !708)
!708 = !{!709, !717, !718, !723, !775, !776, !777, !778}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !6, line: 119, baseType: !710, size: 256)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !711, line: 9, size: 256, elements: !712)
!711 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !710, file: !711, line: 10, baseType: !471, size: 192, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !710, file: !711, line: 11, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !716, line: 29, baseType: !523)
!716 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !707, file: !6, line: 120, baseType: !715, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !707, file: !6, line: 121, baseType: !719, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!5, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !707, file: !6, line: 122, baseType: !724, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !726)
!726 = !{!727, !747, !748, !751, !761, !762, !770, !774}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !725, file: !6, line: 160, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !729, file: !6, line: 215, baseType: !534)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !729, file: !6, line: 216, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !729, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !729, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !729, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !729, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !729, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !729, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !729, file: !6, line: 233, baseType: !715, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !729, file: !6, line: 234, baseType: !722, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !729, file: !6, line: 235, baseType: !715, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !729, file: !6, line: 236, baseType: !722, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !729, file: !6, line: 237, baseType: !744, size: 4096, offset: 512)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 4096, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !725, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !725, file: !6, line: 162, baseType: !749, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !88, line: 27, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !90, line: 96, baseType: !129)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !725, file: !6, line: 163, baseType: !752, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !753, line: 276, baseType: !754)
!753 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !753, line: 276, size: 32, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !754, file: !753, line: 276, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !753, line: 70, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !753, line: 65, size: 32, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !758, file: !753, line: 66, baseType: !7, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !725, file: !6, line: 164, baseType: !722, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !725, file: !6, line: 165, baseType: !763, size: 128, offset: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !711, line: 14, size: 128, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !763, file: !711, line: 15, baseType: !766, size: 128)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !472, line: 125, size: 128, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !766, file: !472, line: 126, baseType: !488, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !766, file: !472, line: 127, baseType: !476, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !725, file: !6, line: 166, baseType: !771, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!715}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !725, file: !6, line: 167, baseType: !715, size: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !707, file: !6, line: 123, baseType: !234, size: 8, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !707, file: !6, line: 124, baseType: !234, size: 8, offset: 456)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !707, file: !6, line: 125, baseType: !234, size: 8, offset: 464)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !707, file: !6, line: 126, baseType: !234, size: 8, offset: 472)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !691, file: !633, line: 572, baseType: !707, size: 512, offset: 1216)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !691, file: !633, line: 580, baseType: !781, size: 64, offset: 1728)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !632, file: !633, line: 721, baseType: !7, size: 32, offset: 3584)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !632, file: !633, line: 722, baseType: !129, size: 32, offset: 3616)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !632, file: !633, line: 723, baseType: !785, size: 64, offset: 3648)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !788, line: 17, baseType: !789)
!788 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !788, line: 17, size: 64, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !789, file: !788, line: 17, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 1)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !632, file: !633, line: 724, baseType: !787, size: 64, offset: 3712)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !632, file: !633, line: 749, baseType: !797, offset: 3776)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !633, line: 290, elements: !354)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !632, file: !633, line: 751, baseType: !327, size: 128, offset: 3776)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !632, file: !633, line: 757, baseType: !480, size: 64, offset: 3904)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !632, file: !633, line: 758, baseType: !480, size: 64, offset: 3968)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !632, file: !633, line: 761, baseType: !802, size: 320, offset: 4032)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !564, line: 34, size: 320, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !802, file: !564, line: 35, baseType: !111, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !802, file: !564, line: 36, baseType: !806, size: 256, offset: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 256, elements: !568)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !632, file: !633, line: 766, baseType: !129, size: 32, offset: 4352)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !632, file: !633, line: 767, baseType: !129, size: 32, offset: 4384)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !632, file: !633, line: 768, baseType: !129, size: 32, offset: 4416)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !632, file: !633, line: 770, baseType: !129, size: 32, offset: 4448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !632, file: !633, line: 772, baseType: !179, size: 64, offset: 4480)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !632, file: !633, line: 775, baseType: !7, size: 32, offset: 4544)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !632, file: !633, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !632, file: !633, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !632, file: !633, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !632, file: !633, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !632, file: !633, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !632, file: !633, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !632, file: !633, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !632, file: !633, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !632, file: !633, line: 831, baseType: !179, size: 64, offset: 4672)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !632, file: !633, line: 833, baseType: !823, size: 384, offset: 4736)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !824)
!824 = !{!825, !830}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !823, file: !12, line: 26, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!415, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, scope: !823, file: !12, line: 27, baseType: !831, size: 320, offset: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !823, file: !12, line: 27, size: 320, elements: !832)
!832 = !{!833, !843, !870}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !831, file: !12, line: 36, baseType: !834, size: 320)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !831, file: !12, line: 29, size: 320, elements: !835)
!835 = !{!836, !838, !839, !840, !841, !842}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !834, file: !12, line: 30, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !834, file: !12, line: 31, baseType: !105, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !834, file: !12, line: 32, baseType: !105, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !834, file: !12, line: 33, baseType: !105, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !834, file: !12, line: 34, baseType: !111, size: 64, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !834, file: !12, line: 35, baseType: !837, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !831, file: !12, line: 46, baseType: !844, size: 192)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !831, file: !12, line: 38, size: 192, elements: !845)
!845 = !{!846, !847, !848, !869}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !844, file: !12, line: 39, baseType: !749, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !844, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, scope: !844, file: !12, line: 41, baseType: !849, size: 64, offset: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !12, line: 41, size: 64, elements: !850)
!850 = !{!851, !859}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !849, file: !12, line: 42, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !854, line: 7, size: 128, elements: !855)
!854 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!855 = !{!856, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !853, file: !854, line: 8, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !90, line: 93, baseType: !91)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !853, file: !854, line: 9, baseType: !91, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !849, file: !12, line: 43, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !862, line: 7, size: 64, elements: !863)
!862 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!863 = !{!864, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !861, file: !862, line: 8, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !862, line: 5, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !106, line: 20, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !108, line: 26, baseType: !129)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !861, file: !862, line: 9, baseType: !866, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !844, file: !12, line: 45, baseType: !111, size: 64, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !831, file: !12, line: 54, baseType: !871, size: 256)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !831, file: !12, line: 48, size: 256, elements: !872)
!872 = !{!873, !876, !877, !878, !879}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !871, file: !12, line: 49, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !871, file: !12, line: 50, baseType: !129, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !871, file: !12, line: 51, baseType: !129, size: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !871, file: !12, line: 52, baseType: !179, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !871, file: !12, line: 53, baseType: !179, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !632, file: !633, line: 835, baseType: !881, size: 32, offset: 5120)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !88, line: 22, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !90, line: 28, baseType: !129)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !632, file: !633, line: 836, baseType: !881, size: 32, offset: 5152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !632, file: !633, line: 840, baseType: !179, size: 64, offset: 5184)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !632, file: !633, line: 849, baseType: !631, size: 64, offset: 5248)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !632, file: !633, line: 852, baseType: !631, size: 64, offset: 5312)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !632, file: !633, line: 857, baseType: !327, size: 128, offset: 5376)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !632, file: !633, line: 858, baseType: !327, size: 128, offset: 5504)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !632, file: !633, line: 859, baseType: !631, size: 64, offset: 5632)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !632, file: !633, line: 867, baseType: !327, size: 128, offset: 5696)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !632, file: !633, line: 868, baseType: !327, size: 128, offset: 5824)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !632, file: !633, line: 871, baseType: !893, size: 64, offset: 5952)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !895, line: 59, size: 768, elements: !896)
!895 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!896 = !{!897, !898, !899, !900, !911, !912, !919, !928}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !894, file: !895, line: 61, baseType: !645, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !894, file: !895, line: 62, baseType: !7, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !894, file: !895, line: 63, baseType: !340, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !894, file: !895, line: 65, baseType: !901, size: 256, offset: 64)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 256, elements: !568)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !88, line: 182, size: 64, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !902, file: !88, line: 183, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !88, line: 186, size: 128, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !906, file: !88, line: 187, baseType: !905, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !906, file: !88, line: 187, baseType: !910, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !894, file: !895, line: 66, baseType: !902, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !894, file: !895, line: 68, baseType: !913, size: 128, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !914, line: 40, baseType: !915)
!914 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !914, line: 36, size: 128, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !915, file: !914, line: 37, baseType: !340)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !915, file: !914, line: 38, baseType: !327, size: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !894, file: !895, line: 69, baseType: !920, size: 128, align: 64, offset: 512)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !88, line: 216, size: 128, align: 64, elements: !921)
!921 = !{!922, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !88, line: 217, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !920, file: !88, line: 218, baseType: !925, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{null, !923}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !894, file: !895, line: 70, baseType: !929, size: 128, offset: 640)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 128, elements: !793)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !895, line: 54, size: 128, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !930, file: !895, line: 55, baseType: !129, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !930, file: !895, line: 56, baseType: !934, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !895, line: 56, flags: DIFlagFwdDecl)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !632, file: !633, line: 872, baseType: !937, size: 512, offset: 6016)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 512, elements: !568)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !632, file: !633, line: 873, baseType: !327, size: 128, offset: 6528)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !632, file: !633, line: 874, baseType: !327, size: 128, offset: 6656)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !632, file: !633, line: 876, baseType: !941, size: 64, offset: 6784)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !943, line: 26, size: 192, elements: !944)
!943 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !942, file: !943, line: 27, baseType: !7, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !942, file: !943, line: 28, baseType: !947, size: 128, offset: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !948, line: 43, size: 128, elements: !949)
!948 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !947, file: !948, line: 44, baseType: !534)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !947, file: !948, line: 45, baseType: !327, size: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !632, file: !633, line: 879, baseType: !953, size: 64, offset: 6848)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !632, file: !633, line: 882, baseType: !953, size: 64, offset: 6912)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !632, file: !633, line: 884, baseType: !111, size: 64, offset: 6976)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !632, file: !633, line: 885, baseType: !111, size: 64, offset: 7040)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !632, file: !633, line: 890, baseType: !111, size: 64, offset: 7104)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !632, file: !633, line: 891, baseType: !959, size: 128, offset: 7168)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !633, line: 242, size: 128, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !959, file: !633, line: 244, baseType: !111, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !959, file: !633, line: 245, baseType: !111, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !959, file: !633, line: 246, baseType: !534, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !632, file: !633, line: 900, baseType: !179, size: 64, offset: 7296)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !632, file: !633, line: 901, baseType: !179, size: 64, offset: 7360)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !632, file: !633, line: 904, baseType: !111, size: 64, offset: 7424)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !632, file: !633, line: 907, baseType: !111, size: 64, offset: 7488)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !632, file: !633, line: 910, baseType: !179, size: 64, offset: 7552)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !632, file: !633, line: 911, baseType: !179, size: 64, offset: 7616)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !632, file: !633, line: 914, baseType: !971, size: 640, offset: 7680)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !972, line: 123, size: 640, elements: !973)
!972 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!973 = !{!974, !980, !981}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !971, file: !972, line: 124, baseType: !975, size: 576)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 576, elements: !382)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !972, line: 108, size: 192, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !976, file: !972, line: 109, baseType: !111, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !976, file: !972, line: 110, baseType: !763, size: 128, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !971, file: !972, line: 125, baseType: !7, size: 32, offset: 576)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !971, file: !972, line: 126, baseType: !7, size: 32, offset: 608)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !632, file: !633, line: 917, baseType: !983, size: 192, offset: 8320)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !972, line: 134, size: 192, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !983, file: !972, line: 135, baseType: !920, size: 128, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !983, file: !972, line: 136, baseType: !7, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !632, file: !633, line: 923, baseType: !988, size: 64, offset: 8512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !991, line: 11, flags: DIFlagFwdDecl)
!991 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!992 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !632, file: !633, line: 926, baseType: !988, size: 64, offset: 8576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !632, file: !633, line: 929, baseType: !988, size: 64, offset: 8640)
