; ModuleID = '../bcout/drivers/mtd/nand/ecc.llvm.bc'
source_filename = "drivers/mtd/nand/ecc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.mtd_ooblayout_ops = type { i32 (%struct.mtd_info*, i32, %struct.mtd_oob_region*)*, i32 (%struct.mtd_info*, i32, %struct.mtd_oob_region*)* }

!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_engine_type", file: !51, line: 142, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/mtd/nand.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57}
!53 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_INVALID", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_NONE", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_SOFT", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_HOST", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "NAND_ECC_ENGINE_TYPE_ON_DIE", value: 4, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_placement", file: !51, line: 158, baseType: !7, size: 32, elements: !59)
!59 = !{!60, !61, !62}
!60 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_UNKNOWN", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_OOB", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "NAND_ECC_PLACEMENT_INTERLEAVED", value: 2, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_ecc_algo", file: !51, line: 171, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66, !67, !68}
!65 = !DIEnumerator(name: "NAND_ECC_ALGO_UNKNOWN", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "NAND_ECC_ALGO_HAMMING", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "NAND_ECC_ALGO_BCH", value: 2, isUnsigned: true)
!68 = !DIEnumerator(name: "NAND_ECC_ALGO_RS", value: 3, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nand_page_io_req_type", file: !51, line: 90, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "NAND_PAGE_READ", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "NAND_PAGE_WRITE", value: 1, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !74, line: 10, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76, !77}
!76 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!78 = !{!79, !80, !117}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nand_device", file: !51, line: 319, size: 11200, elements: !82)
!82 = !{!83, !2290, !2302, !2371, !2376, !2380}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mtd", scope: !81, file: !51, line: 320, baseType: !84, size: 9664)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !85, line: 235, size: 9664, elements: !86)
!85 = !DIFile(filename: "./include/linux/mtd/mtd.h", directory: "/home/lizy2001/genbc/linux")
!86 = !{!87, !91, !97, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !116, !118, !134, !155, !156, !157, !158, !168, !178, !194, !198, !203, !209, !210, !229, !230, !241, !242, !243, !244, !245, !246, !257, !261, !265, !266, !267, !271, !272, !273, !274, !278, !279, !280, !281, !282, !285, !297, !304, !305, !306, !310, !2260, !2261, !2269, !2273, !2274, !2275}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !85, line: 236, baseType: !88, size: 8)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_char", file: !89, line: 79, baseType: !90)
!89 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !84, file: !85, line: 237, baseType: !92, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !89, line: 104, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !94, line: 21, baseType: !95)
!94 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !96, line: 27, baseType: !7)
!96 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !84, file: !85, line: 238, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !89, line: 107, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !94, line: 23, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !96, line: 31, baseType: !101)
!101 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !84, file: !85, line: 244, baseType: !92, size: 32, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "writesize", scope: !84, file: !85, line: 252, baseType: !92, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "writebufsize", scope: !84, file: !85, line: 263, baseType: !92, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "oobsize", scope: !84, file: !85, line: 265, baseType: !92, size: 32, offset: 224)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "oobavail", scope: !84, file: !85, line: 266, baseType: !92, size: 32, offset: 256)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_shift", scope: !84, file: !85, line: 272, baseType: !7, size: 32, offset: 288)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_shift", scope: !84, file: !85, line: 273, baseType: !7, size: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize_mask", scope: !84, file: !85, line: 275, baseType: !7, size: 32, offset: 352)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "writesize_mask", scope: !84, file: !85, line: 276, baseType: !7, size: 32, offset: 384)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bitflip_threshold", scope: !84, file: !85, line: 285, baseType: !7, size: 32, offset: 416)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !85, line: 288, baseType: !113, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !84, file: !85, line: 289, baseType: !117, size: 32, offset: 512)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ooblayout", scope: !84, file: !85, line: 292, baseType: !119, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ooblayout_ops", file: !85, line: 101, size: 128, elements: !122)
!122 = !{!123, !133}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ecc", scope: !121, file: !85, line: 102, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!117, !127, !117, !128}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_region", file: !85, line: 87, size: 64, elements: !130)
!130 = !{!131, !132}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !129, file: !85, line: 88, baseType: !93, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !129, file: !85, line: 89, baseType: !93, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !121, file: !85, line: 104, baseType: !124, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pairing", scope: !84, file: !85, line: 295, baseType: !135, size: 64, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_scheme", file: !85, line: 176, size: 192, elements: !138)
!138 = !{!139, !140, !149}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ngroups", scope: !137, file: !85, line: 177, baseType: !117, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !137, file: !85, line: 178, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!117, !127, !117, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_pairing_info", file: !85, line: 138, size: 64, elements: !146)
!146 = !{!147, !148}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pair", scope: !145, file: !85, line: 139, baseType: !117, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !145, file: !85, line: 140, baseType: !117, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "get_wunit", scope: !137, file: !85, line: 180, baseType: !150, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!117, !127, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_step_size", scope: !84, file: !85, line: 298, baseType: !7, size: 32, offset: 704)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_strength", scope: !84, file: !85, line: 301, baseType: !7, size: 32, offset: 736)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "numeraseregions", scope: !84, file: !85, line: 306, baseType: !117, size: 32, offset: 768)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "eraseregions", scope: !84, file: !85, line: 307, baseType: !159, size: 64, offset: 832)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_erase_region_info", file: !85, line: 36, size: 192, elements: !161)
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !160, file: !85, line: 37, baseType: !98, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "erasesize", scope: !160, file: !85, line: 38, baseType: !92, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "numblocks", scope: !160, file: !85, line: 39, baseType: !92, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "lockmap", scope: !160, file: !85, line: 40, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_erase", scope: !84, file: !85, line: 313, baseType: !169, size: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!117, !127, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "erase_info", file: !85, line: 30, size: 192, elements: !174)
!174 = !{!175, !176, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !173, file: !85, line: 31, baseType: !98, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !173, file: !85, line: 32, baseType: !98, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "fail_addr", scope: !173, file: !85, line: 33, baseType: !98, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_point", scope: !84, file: !85, line: 314, baseType: !179, size: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!117, !127, !182, !186, !189, !190, !191}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !89, line: 46, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !184, line: 88, baseType: !185)
!184 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!185 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 55, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !184, line: 72, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !184, line: 16, baseType: !167)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !89, line: 158, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !89, line: 153, baseType: !99)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_unpoint", scope: !84, file: !85, line: 316, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!117, !127, !182, !186}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !84, file: !85, line: 317, baseType: !199, size: 64, offset: 1088)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!117, !127, !182, !186, !189, !202}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !84, file: !85, line: 319, baseType: !204, size: 64, offset: 1152)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!117, !127, !182, !186, !189, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "_panic_write", scope: !84, file: !85, line: 321, baseType: !204, size: 64, offset: 1216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_read_oob", scope: !84, file: !85, line: 323, baseType: !211, size: 64, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!117, !127, !182, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_oob_ops", file: !85, line: 64, size: 512, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !228}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !215, file: !85, line: 65, baseType: !7, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !85, line: 66, baseType: !186, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "retlen", scope: !215, file: !85, line: 67, baseType: !186, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ooblen", scope: !215, file: !85, line: 68, baseType: !186, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "oobretlen", scope: !215, file: !85, line: 69, baseType: !186, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ooboffs", scope: !215, file: !85, line: 70, baseType: !92, size: 32, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "datbuf", scope: !215, file: !85, line: 71, baseType: !224, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !89, line: 102, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !94, line: 17, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !96, line: 21, baseType: !90)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "oobbuf", scope: !215, file: !85, line: 72, baseType: !224, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_write_oob", scope: !84, file: !85, line: 325, baseType: !211, size: 64, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_get_fact_prot_info", scope: !84, file: !85, line: 327, baseType: !231, size: 64, offset: 1408)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!117, !127, !186, !189, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "otp_info", file: !236, line: 146, size: 96, elements: !237)
!236 = !DIFile(filename: "./include/uapi/mtd/mtd-abi.h", directory: "/home/lizy2001/genbc/linux")
!237 = !{!238, !239, !240}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !235, file: !236, line: 147, baseType: !95, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !235, file: !236, line: 148, baseType: !95, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !235, file: !236, line: 149, baseType: !95, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_read_fact_prot_reg", scope: !84, file: !85, line: 329, baseType: !199, size: 64, offset: 1472)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_get_user_prot_info", scope: !84, file: !85, line: 331, baseType: !231, size: 64, offset: 1536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_read_user_prot_reg", scope: !84, file: !85, line: 333, baseType: !199, size: 64, offset: 1600)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_write_user_prot_reg", scope: !84, file: !85, line: 335, baseType: !199, size: 64, offset: 1664)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_lock_user_prot_reg", scope: !84, file: !85, line: 337, baseType: !195, size: 64, offset: 1728)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_writev", scope: !84, file: !85, line: 339, baseType: !247, size: 64, offset: 1792)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!117, !127, !250, !167, !182, !189}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !253, line: 15, size: 128, elements: !254)
!253 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !252, file: !253, line: 16, baseType: !79, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !252, file: !253, line: 17, baseType: !186, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_sync", scope: !84, file: !85, line: 341, baseType: !258, size: 64, offset: 1856)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{null, !127}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !84, file: !85, line: 342, baseType: !262, size: 64, offset: 1920)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!117, !127, !182, !98}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_unlock", scope: !84, file: !85, line: 343, baseType: !262, size: 64, offset: 1984)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_is_locked", scope: !84, file: !85, line: 344, baseType: !262, size: 64, offset: 2048)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isreserved", scope: !84, file: !85, line: 345, baseType: !268, size: 64, offset: 2112)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!117, !127, !182}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_block_isbad", scope: !84, file: !85, line: 346, baseType: !268, size: 64, offset: 2176)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_block_markbad", scope: !84, file: !85, line: 347, baseType: !268, size: 64, offset: 2240)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_max_bad_blocks", scope: !84, file: !85, line: 348, baseType: !195, size: 64, offset: 2304)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_suspend", scope: !84, file: !85, line: 349, baseType: !275, size: 64, offset: 2368)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!117, !127}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_resume", scope: !84, file: !85, line: 350, baseType: !258, size: 64, offset: 2432)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_reboot", scope: !84, file: !85, line: 351, baseType: !258, size: 64, offset: 2496)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_get_device", scope: !84, file: !85, line: 356, baseType: !275, size: 64, offset: 2560)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_put_device", scope: !84, file: !85, line: 357, baseType: !258, size: 64, offset: 2624)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "oops_panic_write", scope: !84, file: !85, line: 363, baseType: !283, size: 8, offset: 2688)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !89, line: 30, baseType: !284)
!284 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "reboot_notifier", scope: !84, file: !85, line: 365, baseType: !286, size: 192, offset: 2752)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !287, line: 54, size: 192, elements: !288)
!287 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!288 = !{!289, !295, !296}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !286, file: !287, line: 55, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !287, line: 51, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!117, !294, !167, !79}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !287, line: 56, baseType: !294, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !286, file: !287, line: 57, baseType: !117, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ecc_stats", scope: !84, file: !85, line: 368, baseType: !298, size: 128, offset: 2944)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_ecc_stats", file: !236, line: 250, size: 128, elements: !299)
!299 = !{!300, !301, !302, !303}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "corrected", scope: !298, file: !236, line: 251, baseType: !95, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !298, file: !236, line: 252, baseType: !95, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "badblocks", scope: !298, file: !236, line: 253, baseType: !95, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bbtblocks", scope: !298, file: !236, line: 254, baseType: !95, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "subpage_sft", scope: !84, file: !85, line: 370, baseType: !117, size: 32, offset: 3072)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !84, file: !85, line: 372, baseType: !79, size: 64, offset: 3136)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !84, file: !85, line: 374, baseType: !307, size: 64, offset: 3200)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !309, line: 76, flags: DIFlagFwdDecl)
!309 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !84, file: !85, line: 375, baseType: !311, size: 5568, offset: 3264)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !312)
!312 = !{!313, !1786, !1788, !1791, !1792, !1843, !1937, !1938, !1939, !1940, !1941, !1950, !2055, !2068, !2071, !2072, !2076, !2078, !2079, !2080, !2084, !2090, !2091, !2094, !2209, !2210, !2213, !2214, !2215, !2216, !2248, !2249, !2250, !2253, !2256, !2257, !2258, !2259}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !311, file: !30, line: 462, baseType: !314, size: 512)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !315, line: 64, size: 512, elements: !316)
!315 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!316 = !{!317, !318, !324, !326, !386, !1622, !1776, !1781, !1782, !1783, !1784, !1785}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 65, baseType: !113, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !314, file: !315, line: 66, baseType: !319, size: 128, offset: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !89, line: 178, size: 128, elements: !320)
!320 = !{!321, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !89, line: 179, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !319, file: !89, line: 179, baseType: !322, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !314, file: !315, line: 67, baseType: !325, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !314, file: !315, line: 68, baseType: !327, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !315, line: 192, size: 704, elements: !329)
!329 = !{!330, !331, !347, !348}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !328, file: !315, line: 193, baseType: !319, size: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !328, file: !315, line: 194, baseType: !332, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !333, line: 83, baseType: !334)
!333 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !333, line: 71, elements: !335)
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !333, line: 72, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !333, line: 72, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !337, file: !333, line: 73, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !333, line: 20, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !340, file: !333, line: 21, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !344, line: 25, baseType: !345)
!344 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 25, elements: !346)
!346 = !{}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !328, file: !315, line: 195, baseType: !314, size: 512, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !328, file: !315, line: 196, baseType: !349, size: 64, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !315, line: 156, size: 192, elements: !352)
!352 = !{!353, !358, !363}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !351, file: !315, line: 157, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!117, !327, !325}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !351, file: !315, line: 158, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!113, !327, !325}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !351, file: !315, line: 159, baseType: !364, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DISubroutineType(types: !367)
!367 = !{!117, !327, !325, !368}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !315, line: 148, size: 20736, elements: !370)
!370 = !{!371, !376, !380, !381, !385}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !369, file: !315, line: 149, baseType: !372, size: 192)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 192, elements: !374)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!374 = !{!375}
!375 = !DISubrange(count: 3)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !369, file: !315, line: 150, baseType: !377, size: 4096, offset: 192)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 4096, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !369, file: !315, line: 151, baseType: !117, size: 32, offset: 4288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !369, file: !315, line: 152, baseType: !382, size: 16384, offset: 4320)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 16384, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 2048)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !369, file: !315, line: 153, baseType: !117, size: 32, offset: 20704)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !314, file: !315, line: 69, baseType: !387, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !315, line: 138, size: 448, elements: !389)
!389 = !{!390, !394, !419, !421, !1568, !1601, !1605}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !388, file: !315, line: 139, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !325}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !388, file: !315, line: 140, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !398, line: 230, size: 128, elements: !399)
!398 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!399 = !{!400, !415}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !397, file: !398, line: 231, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !325, !408, !373}
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !89, line: 60, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !184, line: 73, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !184, line: 15, baseType: !407)
!407 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !398, line: 30, size: 128, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !409, file: !398, line: 31, baseType: !113, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !409, file: !398, line: 32, baseType: !413, size: 16, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !89, line: 19, baseType: !414)
!414 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !397, file: !398, line: 232, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{!404, !325, !408, !113, !186}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !388, file: !315, line: 141, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !388, file: !315, line: 142, baseType: !422, size: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !398, line: 84, size: 320, elements: !426)
!426 = !{!427, !428, !432, !1565, !1566}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !425, file: !398, line: 85, baseType: !113, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !425, file: !398, line: 86, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{!413, !325, !408, !117}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !425, file: !398, line: 88, baseType: !433, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!413, !325, !436, !117}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !398, line: 168, size: 448, elements: !438)
!438 = !{!439, !440, !441, !442, !449, !450}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !437, file: !398, line: 169, baseType: !409, size: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !437, file: !398, line: 170, baseType: !186, size: 64, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !437, file: !398, line: 171, baseType: !79, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !437, file: !398, line: 172, baseType: !443, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!404, !446, !325, !436, !373, !182, !186}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !448, line: 526, flags: DIFlagFwdDecl)
!448 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!449 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !437, file: !398, line: 174, baseType: !443, size: 64, offset: 320)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !437, file: !398, line: 176, baseType: !451, size: 64, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!117, !446, !325, !436, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !456, line: 305, size: 1472, elements: !457)
!456 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!457 = !{!458, !459, !460, !461, !462, !470, !471, !1539, !1545, !1546, !1551, !1552, !1555, !1559, !1560, !1561, !1562, !1563}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !455, file: !456, line: 308, baseType: !167, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !455, file: !456, line: 309, baseType: !167, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !455, file: !456, line: 313, baseType: !454, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !455, file: !456, line: 313, baseType: !454, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !455, file: !456, line: 315, baseType: !463, size: 192, align: 64, offset: 256)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !464, line: 24, size: 192, align: 64, elements: !465)
!464 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!465 = !{!466, !467, !469}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !463, file: !464, line: 25, baseType: !167, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !463, file: !464, line: 26, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !463, file: !464, line: 27, baseType: !468, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !455, file: !456, line: 323, baseType: !167, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !455, file: !456, line: 327, baseType: !472, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !456, line: 388, size: 7296, elements: !474)
!474 = !{!475, !1535}
!475 = !DIDerivedType(tag: DW_TAG_member, scope: !473, file: !456, line: 389, baseType: !476, size: 7296)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !473, file: !456, line: 389, size: 7296, elements: !477)
!477 = !{!478, !479, !483, !484, !488, !489, !490, !491, !492, !500, !505, !506, !507, !508, !517, !518, !519, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !554, !562, !565, !613, !614, !1505, !1506, !1509, !1513, !1514, !1517, !1518, !1519, !1522, !1534}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !476, file: !456, line: 390, baseType: !454, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !476, file: !456, line: 391, baseType: !480, size: 64, offset: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !464, line: 31, size: 64, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !480, file: !464, line: 32, baseType: !468, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !476, file: !456, line: 392, baseType: !99, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !476, file: !456, line: 394, baseType: !485, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!167, !446, !167, !167, !167, !167}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !476, file: !456, line: 398, baseType: !167, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !476, file: !456, line: 399, baseType: !167, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !476, file: !456, line: 405, baseType: !167, size: 64, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !476, file: !456, line: 406, baseType: !167, size: 64, offset: 448)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !476, file: !456, line: 407, baseType: !493, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !448, line: 286, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 286, size: 64, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !495, file: !448, line: 286, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !499, line: 18, baseType: !167)
!499 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!500 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !476, file: !456, line: 416, baseType: !501, size: 32, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !89, line: 168, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 166, size: 32, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !502, file: !89, line: 167, baseType: !117, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !476, file: !456, line: 428, baseType: !501, size: 32, offset: 608)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !476, file: !456, line: 437, baseType: !501, size: 32, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !476, file: !456, line: 447, baseType: !501, size: 32, offset: 672)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !476, file: !456, line: 450, baseType: !509, size: 64, offset: 704)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !510, line: 13, baseType: !511)
!510 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !89, line: 175, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 173, size: 64, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !512, file: !89, line: 174, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !94, line: 22, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !96, line: 30, baseType: !185)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !476, file: !456, line: 452, baseType: !117, size: 32, offset: 768)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !476, file: !456, line: 454, baseType: !332, offset: 800)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !476, file: !456, line: 457, baseType: !520, size: 256, offset: 832)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !521, line: 35, size: 256, elements: !522)
!521 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!522 = !{!523, !524, !525, !527}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !520, file: !521, line: 36, baseType: !509, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !520, file: !521, line: 42, baseType: !509, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !520, file: !521, line: 46, baseType: !526, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !333, line: 29, baseType: !340)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !520, file: !521, line: 47, baseType: !319, size: 128, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !476, file: !456, line: 459, baseType: !319, size: 128, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !476, file: !456, line: 466, baseType: !167, size: 64, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !476, file: !456, line: 467, baseType: !167, size: 64, offset: 1280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !476, file: !456, line: 469, baseType: !167, size: 64, offset: 1344)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !476, file: !456, line: 470, baseType: !167, size: 64, offset: 1408)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !476, file: !456, line: 471, baseType: !511, size: 64, offset: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !476, file: !456, line: 472, baseType: !167, size: 64, offset: 1536)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !476, file: !456, line: 473, baseType: !167, size: 64, offset: 1600)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !476, file: !456, line: 474, baseType: !167, size: 64, offset: 1664)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !476, file: !456, line: 475, baseType: !167, size: 64, offset: 1728)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !476, file: !456, line: 477, baseType: !332, offset: 1792)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !476, file: !456, line: 478, baseType: !167, size: 64, offset: 1792)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !476, file: !456, line: 478, baseType: !167, size: 64, offset: 1856)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !476, file: !456, line: 478, baseType: !167, size: 64, offset: 1920)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !476, file: !456, line: 478, baseType: !167, size: 64, offset: 1984)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !476, file: !456, line: 479, baseType: !167, size: 64, offset: 2048)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !476, file: !456, line: 479, baseType: !167, size: 64, offset: 2112)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !476, file: !456, line: 479, baseType: !167, size: 64, offset: 2176)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !476, file: !456, line: 480, baseType: !167, size: 64, offset: 2240)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !476, file: !456, line: 480, baseType: !167, size: 64, offset: 2304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !476, file: !456, line: 480, baseType: !167, size: 64, offset: 2368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !476, file: !456, line: 480, baseType: !167, size: 64, offset: 2432)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !476, file: !456, line: 482, baseType: !551, size: 2816, offset: 2496)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2816, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 44)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !476, file: !456, line: 488, baseType: !555, size: 256, offset: 5312)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !556, line: 60, size: 256, elements: !557)
!556 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !555, file: !556, line: 61, baseType: !559, size: 256)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 256, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 4)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !476, file: !456, line: 490, baseType: !563, size: 64, offset: 5568)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !456, line: 490, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !476, file: !456, line: 493, baseType: !566, size: 896, offset: 5632)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !567, line: 53, baseType: !568)
!567 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !567, line: 13, size: 896, elements: !569)
!569 = !{!570, !571, !572, !573, !576, !577, !584, !585, !605, !606, !609}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !568, file: !567, line: 18, baseType: !99, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !568, file: !567, line: 28, baseType: !511, size: 64, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !568, file: !567, line: 31, baseType: !520, size: 256, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !568, file: !567, line: 32, baseType: !574, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !567, line: 32, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !568, file: !567, line: 37, baseType: !414, size: 16, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !568, file: !567, line: 40, baseType: !578, size: 192, offset: 512)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !579, line: 53, size: 192, elements: !580)
!579 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !578, file: !579, line: 54, baseType: !509, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !578, file: !579, line: 55, baseType: !332, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !578, file: !579, line: 59, baseType: !319, size: 128, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !568, file: !567, line: 41, baseType: !79, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !568, file: !567, line: 42, baseType: !586, size: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !589, line: 13, size: 896, elements: !590)
!589 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !588, file: !589, line: 14, baseType: !79, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !588, file: !589, line: 15, baseType: !167, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !588, file: !589, line: 17, baseType: !167, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !588, file: !589, line: 17, baseType: !167, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !588, file: !589, line: 19, baseType: !407, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !588, file: !589, line: 21, baseType: !407, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !588, file: !589, line: 22, baseType: !407, size: 64, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !588, file: !589, line: 23, baseType: !407, size: 64, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !588, file: !589, line: 24, baseType: !407, size: 64, offset: 512)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !588, file: !589, line: 25, baseType: !407, size: 64, offset: 576)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !588, file: !589, line: 26, baseType: !407, size: 64, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !588, file: !589, line: 27, baseType: !407, size: 64, offset: 704)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !588, file: !589, line: 28, baseType: !407, size: 64, offset: 768)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !588, file: !589, line: 29, baseType: !407, size: 64, offset: 832)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !568, file: !567, line: 44, baseType: !501, size: 32, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !568, file: !567, line: 50, baseType: !607, size: 16, offset: 864)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !94, line: 19, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !96, line: 24, baseType: !414)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !568, file: !567, line: 51, baseType: !610, size: 16, offset: 880)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !94, line: 18, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !96, line: 23, baseType: !612)
!612 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !456, line: 495, baseType: !167, size: 64, offset: 6528)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !476, file: !456, line: 497, baseType: !615, size: 64, offset: 6592)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !456, line: 381, size: 384, elements: !617)
!617 = !{!618, !619, !1504}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !616, file: !456, line: 382, baseType: !501, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !616, file: !456, line: 383, baseType: !620, size: 128, offset: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !456, line: 376, size: 128, elements: !621)
!621 = !{!622, !1502}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !620, file: !456, line: 377, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !625, line: 640, size: 48640, elements: !626)
!625 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!626 = !{!627, !633, !635, !636, !642, !643, !644, !645, !646, !647, !648, !649, !653, !671, !682, !774, !775, !776, !787, !788, !790, !791, !792, !793, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !872, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !928, !930, !931, !932, !944, !946, !947, !948, !949, !950, !956, !957, !958, !959, !960, !961, !962, !974, !979, !984, !985, !986, !989, !993, !996, !999, !1002, !1005, !1009, !1012, !1015, !1021, !1022, !1023, !1029, !1030, !1031, !1032, !1033, !1042, !1043, !1044, !1045, !1046, !1051, !1052, !1053, !1056, !1057, !1060, !1063, !1066, !1069, !1072, !1075, !1076, !1156, !1159, !1162, !1163, !1166, !1167, !1168, !1174, !1175, !1176, !1189, !1190, !1191, !1201, !1206, !1209, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !624, file: !625, line: 646, baseType: !628, size: 128)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !629, line: 56, size: 128, elements: !630)
!629 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !629, line: 57, baseType: !167, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !628, file: !629, line: 58, baseType: !93, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !624, file: !625, line: 649, baseType: !634, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !407)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !624, file: !625, line: 657, baseType: !79, size: 64, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !624, file: !625, line: 658, baseType: !637, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !638, line: 113, baseType: !639)
!638 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !638, line: 111, size: 32, elements: !640)
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !639, file: !638, line: 112, baseType: !501, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !624, file: !625, line: 660, baseType: !7, size: 32, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !624, file: !625, line: 661, baseType: !7, size: 32, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !624, file: !625, line: 684, baseType: !117, size: 32, offset: 352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !624, file: !625, line: 686, baseType: !117, size: 32, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !624, file: !625, line: 687, baseType: !117, size: 32, offset: 416)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !624, file: !625, line: 688, baseType: !117, size: 32, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !624, file: !625, line: 689, baseType: !7, size: 32, offset: 480)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !624, file: !625, line: 691, baseType: !650, size: 64, offset: 512)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !625, line: 691, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !624, file: !625, line: 692, baseType: !654, size: 832, offset: 576)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !625, line: 451, size: 832, elements: !655)
!655 = !{!656, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !654, file: !625, line: 453, baseType: !657, size: 128)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !625, line: 325, size: 128, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !657, file: !625, line: 326, baseType: !167, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !657, file: !625, line: 327, baseType: !93, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !654, file: !625, line: 454, baseType: !463, size: 192, align: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !654, file: !625, line: 455, baseType: !319, size: 128, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !654, file: !625, line: 456, baseType: !7, size: 32, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !654, file: !625, line: 458, baseType: !99, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !654, file: !625, line: 459, baseType: !99, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !654, file: !625, line: 460, baseType: !99, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !654, file: !625, line: 461, baseType: !99, size: 64, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !654, file: !625, line: 463, baseType: !99, size: 64, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !654, file: !625, line: 465, baseType: !670, offset: 832)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !625, line: 415, elements: !346)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !624, file: !625, line: 693, baseType: !672, size: 384, offset: 1408)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !625, line: 489, size: 384, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !672, file: !625, line: 490, baseType: !319, size: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !672, file: !625, line: 491, baseType: !167, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !672, file: !625, line: 492, baseType: !167, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !672, file: !625, line: 493, baseType: !7, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !672, file: !625, line: 494, baseType: !414, size: 16, offset: 288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !672, file: !625, line: 495, baseType: !414, size: 16, offset: 304)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !672, file: !625, line: 497, baseType: !681, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !624, file: !625, line: 697, baseType: !683, size: 1792, offset: 1792)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !625, line: 507, size: 1792, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !771, !772}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !683, file: !625, line: 508, baseType: !463, size: 192, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !683, file: !625, line: 515, baseType: !99, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !683, file: !625, line: 516, baseType: !99, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !683, file: !625, line: 517, baseType: !99, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !683, file: !625, line: 518, baseType: !99, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !683, file: !625, line: 519, baseType: !99, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !683, file: !625, line: 526, baseType: !515, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !683, file: !625, line: 527, baseType: !99, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !683, file: !625, line: 528, baseType: !7, size: 32, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !683, file: !625, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !683, file: !625, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !683, file: !625, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !683, file: !625, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !683, file: !625, line: 563, baseType: !699, size: 512, offset: 704)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !700)
!700 = !{!701, !709, !710, !715, !767, !768, !769, !770}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !699, file: !6, line: 119, baseType: !702, size: 256)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !703, line: 9, size: 256, elements: !704)
!703 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !702, file: !703, line: 10, baseType: !463, size: 192, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !702, file: !703, line: 11, baseType: !707, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !708, line: 29, baseType: !515)
!708 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !699, file: !6, line: 120, baseType: !707, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !699, file: !6, line: 121, baseType: !711, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!5, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !699, file: !6, line: 122, baseType: !716, size: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !718)
!718 = !{!719, !739, !740, !743, !753, !754, !762, !766}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !717, file: !6, line: 160, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !721, file: !6, line: 215, baseType: !526)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !721, file: !6, line: 216, baseType: !7, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !721, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !721, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !721, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !721, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !721, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !721, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !721, file: !6, line: 233, baseType: !707, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !721, file: !6, line: 234, baseType: !714, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !721, file: !6, line: 235, baseType: !707, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !721, file: !6, line: 236, baseType: !714, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !721, file: !6, line: 237, baseType: !736, size: 4096, offset: 512)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 4096, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !717, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !717, file: !6, line: 162, baseType: !741, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !89, line: 27, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !184, line: 96, baseType: !117)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !717, file: !6, line: 163, baseType: !744, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !745, line: 276, baseType: !746)
!745 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !745, line: 276, size: 32, elements: !747)
!747 = !{!748}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !746, file: !745, line: 276, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !745, line: 70, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !745, line: 65, size: 32, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !750, file: !745, line: 66, baseType: !7, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !717, file: !6, line: 164, baseType: !714, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !717, file: !6, line: 165, baseType: !755, size: 128, offset: 256)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !703, line: 14, size: 128, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !755, file: !703, line: 15, baseType: !758, size: 128)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !464, line: 125, size: 128, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !758, file: !464, line: 126, baseType: !480, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !758, file: !464, line: 127, baseType: !468, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !717, file: !6, line: 166, baseType: !763, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!707}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !717, file: !6, line: 167, baseType: !707, size: 64, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !699, file: !6, line: 123, baseType: !226, size: 8, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !699, file: !6, line: 124, baseType: !226, size: 8, offset: 456)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !699, file: !6, line: 125, baseType: !226, size: 8, offset: 464)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !699, file: !6, line: 126, baseType: !226, size: 8, offset: 472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !683, file: !625, line: 572, baseType: !699, size: 512, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !683, file: !625, line: 580, baseType: !773, size: 64, offset: 1728)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !624, file: !625, line: 721, baseType: !7, size: 32, offset: 3584)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !624, file: !625, line: 722, baseType: !117, size: 32, offset: 3616)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !624, file: !625, line: 723, baseType: !777, size: 64, offset: 3648)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !780, line: 17, baseType: !781)
!780 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !780, line: 17, size: 64, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !781, file: !780, line: 17, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 1)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !624, file: !625, line: 724, baseType: !779, size: 64, offset: 3712)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !624, file: !625, line: 749, baseType: !789, offset: 3776)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !625, line: 290, elements: !346)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !624, file: !625, line: 751, baseType: !319, size: 128, offset: 3776)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !624, file: !625, line: 757, baseType: !472, size: 64, offset: 3904)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !624, file: !625, line: 758, baseType: !472, size: 64, offset: 3968)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !624, file: !625, line: 761, baseType: !794, size: 320, offset: 4032)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !556, line: 34, size: 320, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !794, file: !556, line: 35, baseType: !99, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !794, file: !556, line: 36, baseType: !798, size: 256, offset: 64)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 256, elements: !560)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !624, file: !625, line: 766, baseType: !117, size: 32, offset: 4352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !624, file: !625, line: 767, baseType: !117, size: 32, offset: 4384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !624, file: !625, line: 768, baseType: !117, size: 32, offset: 4416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !624, file: !625, line: 770, baseType: !117, size: 32, offset: 4448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !624, file: !625, line: 772, baseType: !167, size: 64, offset: 4480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !624, file: !625, line: 775, baseType: !7, size: 32, offset: 4544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !624, file: !625, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !624, file: !625, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !624, file: !625, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !624, file: !625, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !624, file: !625, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !624, file: !625, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !624, file: !625, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !624, file: !625, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !624, file: !625, line: 831, baseType: !167, size: 64, offset: 4672)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !624, file: !625, line: 833, baseType: !815, size: 384, offset: 4736)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !816)
!816 = !{!817, !822}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !815, file: !12, line: 26, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!407, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, scope: !815, file: !12, line: 27, baseType: !823, size: 320, offset: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !815, file: !12, line: 27, size: 320, elements: !824)
!824 = !{!825, !835, !862}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !823, file: !12, line: 36, baseType: !826, size: 320)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !12, line: 29, size: 320, elements: !827)
!827 = !{!828, !830, !831, !832, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !826, file: !12, line: 30, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !826, file: !12, line: 31, baseType: !93, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !12, line: 32, baseType: !93, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !826, file: !12, line: 33, baseType: !93, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !826, file: !12, line: 34, baseType: !99, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !826, file: !12, line: 35, baseType: !829, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !823, file: !12, line: 46, baseType: !836, size: 192)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !12, line: 38, size: 192, elements: !837)
!837 = !{!838, !839, !840, !861}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !836, file: !12, line: 39, baseType: !741, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !836, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, scope: !836, file: !12, line: 41, baseType: !841, size: 64, offset: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !12, line: 41, size: 64, elements: !842)
!842 = !{!843, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !841, file: !12, line: 42, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !846, line: 7, size: 128, elements: !847)
!846 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!847 = !{!848, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !845, file: !846, line: 8, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !184, line: 93, baseType: !185)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !845, file: !846, line: 9, baseType: !185, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !841, file: !12, line: 43, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !854, line: 7, size: 64, elements: !855)
!854 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!855 = !{!856, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !853, file: !854, line: 8, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !854, line: 5, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !94, line: 20, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !96, line: 26, baseType: !117)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !853, file: !854, line: 9, baseType: !858, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !836, file: !12, line: 45, baseType: !99, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !823, file: !12, line: 54, baseType: !863, size: 256)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !12, line: 48, size: 256, elements: !864)
!864 = !{!865, !868, !869, !870, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !863, file: !12, line: 49, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !863, file: !12, line: 50, baseType: !117, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !863, file: !12, line: 51, baseType: !117, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !863, file: !12, line: 52, baseType: !167, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !863, file: !12, line: 53, baseType: !167, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !624, file: !625, line: 835, baseType: !873, size: 32, offset: 5120)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !89, line: 22, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !184, line: 28, baseType: !117)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !624, file: !625, line: 836, baseType: !873, size: 32, offset: 5152)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !624, file: !625, line: 840, baseType: !167, size: 64, offset: 5184)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !624, file: !625, line: 849, baseType: !623, size: 64, offset: 5248)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !624, file: !625, line: 852, baseType: !623, size: 64, offset: 5312)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !624, file: !625, line: 857, baseType: !319, size: 128, offset: 5376)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !624, file: !625, line: 858, baseType: !319, size: 128, offset: 5504)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !624, file: !625, line: 859, baseType: !623, size: 64, offset: 5632)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !624, file: !625, line: 867, baseType: !319, size: 128, offset: 5696)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !624, file: !625, line: 868, baseType: !319, size: 128, offset: 5824)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !624, file: !625, line: 871, baseType: !885, size: 64, offset: 5952)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !887, line: 59, size: 768, elements: !888)
!887 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!888 = !{!889, !890, !891, !892, !903, !904, !911, !920}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !886, file: !887, line: 61, baseType: !637, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !886, file: !887, line: 62, baseType: !7, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !886, file: !887, line: 63, baseType: !332, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !886, file: !887, line: 65, baseType: !893, size: 256, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 256, elements: !560)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !89, line: 182, size: 64, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !894, file: !89, line: 183, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !89, line: 186, size: 128, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !89, line: 187, baseType: !897, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !898, file: !89, line: 187, baseType: !902, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !886, file: !887, line: 66, baseType: !894, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !886, file: !887, line: 68, baseType: !905, size: 128, offset: 384)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !906, line: 40, baseType: !907)
!906 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !906, line: 36, size: 128, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !907, file: !906, line: 37, baseType: !332)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !907, file: !906, line: 38, baseType: !319, size: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !886, file: !887, line: 69, baseType: !912, size: 128, align: 64, offset: 512)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !89, line: 216, size: 128, align: 64, elements: !913)
!913 = !{!914, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !89, line: 217, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !912, file: !89, line: 218, baseType: !917, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !915}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !886, file: !887, line: 70, baseType: !921, size: 128, offset: 640)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 128, elements: !785)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !887, line: 54, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !922, file: !887, line: 55, baseType: !117, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !922, file: !887, line: 56, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !887, line: 56, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !624, file: !625, line: 872, baseType: !929, size: 512, offset: 6016)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 512, elements: !560)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !624, file: !625, line: 873, baseType: !319, size: 128, offset: 6528)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !624, file: !625, line: 874, baseType: !319, size: 128, offset: 6656)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !624, file: !625, line: 876, baseType: !933, size: 64, offset: 6784)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !935, line: 26, size: 192, elements: !936)
!935 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !934, file: !935, line: 27, baseType: !7, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !934, file: !935, line: 28, baseType: !939, size: 128, offset: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !940, line: 43, size: 128, elements: !941)
!940 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !939, file: !940, line: 44, baseType: !526)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !939, file: !940, line: 45, baseType: !319, size: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !624, file: !625, line: 879, baseType: !945, size: 64, offset: 6848)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !624, file: !625, line: 882, baseType: !945, size: 64, offset: 6912)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !624, file: !625, line: 884, baseType: !99, size: 64, offset: 6976)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !624, file: !625, line: 885, baseType: !99, size: 64, offset: 7040)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !624, file: !625, line: 890, baseType: !99, size: 64, offset: 7104)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !624, file: !625, line: 891, baseType: !951, size: 128, offset: 7168)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !625, line: 242, size: 128, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !951, file: !625, line: 244, baseType: !99, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !951, file: !625, line: 245, baseType: !99, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !951, file: !625, line: 246, baseType: !526, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !624, file: !625, line: 900, baseType: !167, size: 64, offset: 7296)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !624, file: !625, line: 901, baseType: !167, size: 64, offset: 7360)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !624, file: !625, line: 904, baseType: !99, size: 64, offset: 7424)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !624, file: !625, line: 907, baseType: !99, size: 64, offset: 7488)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !624, file: !625, line: 910, baseType: !167, size: 64, offset: 7552)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !624, file: !625, line: 911, baseType: !167, size: 64, offset: 7616)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !624, file: !625, line: 914, baseType: !963, size: 640, offset: 7680)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !964, line: 123, size: 640, elements: !965)
!964 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!965 = !{!966, !972, !973}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !963, file: !964, line: 124, baseType: !967, size: 576)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 576, elements: !374)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !964, line: 108, size: 192, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !968, file: !964, line: 109, baseType: !99, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !968, file: !964, line: 110, baseType: !755, size: 128, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !963, file: !964, line: 125, baseType: !7, size: 32, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !963, file: !964, line: 126, baseType: !7, size: 32, offset: 608)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !624, file: !625, line: 917, baseType: !975, size: 192, offset: 8320)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !964, line: 134, size: 192, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !975, file: !964, line: 135, baseType: !912, size: 128, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !975, file: !964, line: 136, baseType: !7, size: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !624, file: !625, line: 923, baseType: !980, size: 64, offset: 8512)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !983, line: 11, flags: DIFlagFwdDecl)
