; ModuleID = '../bcout/drivers/clk/x86/clk-pmc-atom.llvm.bc'
source_filename = "drivers/clk/x86/clk-pmc-atom.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_plt_clk_driver_init6:\09\09\09"
module asm ".long\09plt_clk_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !230, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/x86/clk-pmc-atom.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !51, line: 305, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!57 = !{!58, !61, !63, !64, !65, !66, !97, !228}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !60, line: 76, flags: DIFlagFwdDecl)
!60 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !62, line: 148, baseType: !7)
!62 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_plt", file: !3, line: 36, size: 320, elements: !68)
!68 = !{!69, !196, !197, !212}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !67, file: !3, line: 37, baseType: !70, size: 192)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !71, line: 312, size: 192, elements: !72)
!71 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!72 = !{!73, !76, !79}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !70, file: !71, line: 313, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !71, line: 38, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !70, file: !71, line: 314, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !71, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !70, file: !71, line: 315, baseType: !80, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !71, line: 285, size: 448, elements: !83)
!83 = !{!84, !88, !178, !181, !192, !194, !195}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !71, line: 286, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !82, file: !71, line: 287, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !71, line: 220, size: 1600, elements: !92)
!92 = !{!93, !99, !103, !104, !105, !106, !107, !108, !109, !110, !111, !115, !120, !132, !141, !145, !149, !153, !154, !155, !159, !168, !169, !170, !171}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !91, file: !71, line: 221, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !98}
!97 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !91, file: !71, line: 222, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !98}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !91, file: !71, line: 223, baseType: !94, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !91, file: !71, line: 224, baseType: !100, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !91, file: !71, line: 225, baseType: !94, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !91, file: !71, line: 226, baseType: !100, size: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !91, file: !71, line: 227, baseType: !94, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !91, file: !71, line: 228, baseType: !100, size: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !91, file: !71, line: 229, baseType: !94, size: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !91, file: !71, line: 230, baseType: !100, size: 64, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !91, file: !71, line: 231, baseType: !112, size: 64, offset: 640)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!64, !98, !64}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !91, file: !71, line: 233, baseType: !116, size: 64, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!65, !98, !64, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !91, file: !71, line: 235, baseType: !121, size: 64, offset: 768)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!97, !98, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !71, line: 55, size: 320, elements: !126)
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !125, file: !71, line: 56, baseType: !64, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !125, file: !71, line: 57, baseType: !64, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !125, file: !71, line: 58, baseType: !64, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !125, file: !71, line: 59, baseType: !64, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !125, file: !71, line: 60, baseType: !98, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !91, file: !71, line: 237, baseType: !133, size: 64, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!97, !98, !136}
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !137, line: 17, baseType: !138)
!137 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !139, line: 21, baseType: !140)
!139 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !91, file: !71, line: 238, baseType: !142, size: 64, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!136, !98}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !91, file: !71, line: 239, baseType: !146, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!97, !98, !64, !64}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !91, file: !71, line: 241, baseType: !150, size: 64, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!97, !98, !64, !64, !136}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !91, file: !71, line: 244, baseType: !112, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !91, file: !71, line: 246, baseType: !94, size: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !91, file: !71, line: 247, baseType: !156, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!97, !98, !97}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !91, file: !71, line: 248, baseType: !160, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!97, !98, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !71, line: 69, size: 64, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !164, file: !71, line: 70, baseType: !7, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !164, file: !71, line: 71, baseType: !7, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !91, file: !71, line: 250, baseType: !160, size: 64, offset: 1344)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !91, file: !71, line: 252, baseType: !94, size: 64, offset: 1408)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !91, file: !71, line: 253, baseType: !100, size: 64, offset: 1472)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !91, file: !71, line: 254, baseType: !172, size: 64, offset: 1536)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{null, !98, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !177, line: 21, flags: DIFlagFwdDecl)
!177 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !82, file: !71, line: 289, baseType: !179, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !82, file: !71, line: 290, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !71, line: 264, size: 256, elements: !185)
!185 = !{!186, !189, !190, !191}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !184, file: !71, line: 265, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !184, file: !71, line: 266, baseType: !85, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !71, line: 267, baseType: !85, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !184, file: !71, line: 268, baseType: !97, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !82, file: !71, line: 291, baseType: !193, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !82, file: !71, line: 292, baseType: !136, size: 8, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !71, line: 293, baseType: !64, size: 64, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !67, file: !3, line: 38, baseType: !63, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !67, file: !3, line: 39, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_lookup", file: !200, line: 18, size: 384, elements: !201)
!200 = !DIFile(filename: "./include/linux/clkdev.h", directory: "/home/lizy2001/genbc/linux")
!201 = !{!202, !208, !209, !210, !211}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !200, line: 19, baseType: !203, size: 128)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !62, line: 178, size: 128, elements: !204)
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !203, file: !62, line: 179, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !203, file: !62, line: 179, baseType: !206, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dev_id", scope: !199, file: !200, line: 20, baseType: !85, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "con_id", scope: !199, file: !200, line: 21, baseType: !85, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !199, file: !200, line: 22, baseType: !77, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "clk_hw", scope: !199, file: !200, line: 23, baseType: !98, size: 64, offset: 320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !67, file: !3, line: 41, baseType: !213, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !214, line: 83, baseType: !215)
!214 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !214, line: 71, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, scope: !215, file: !214, line: 72, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !215, file: !214, line: 72, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !218, file: !214, line: 73, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !214, line: 20, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !221, file: !214, line: 21, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !225, line: 25, baseType: !226)
!225 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !225, line: 25, elements: !227)
!227 = !{}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!230 = !{!0, !231, !2225}
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "plt_clk_driver", scope: !2, file: !3, line: 383, type: !233, isLocal: true, isDefinition: true)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "platform_driver", file: !234, line: 200, size: 1600, elements: !235)
!234 = !DIFile(filename: "./include/linux/platform_device.h", directory: "/home/lizy2001/genbc/linux")
!235 = !{!236, !2212, !2213, !2217, !2221, !2222, !2223, !2224}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !233, file: !234, line: 201, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!97, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "platform_device", file: !234, line: 22, size: 6208, elements: !242)
!242 = !{!243, !244, !245, !248, !2181, !2182, !2183, !2184, !2198, !2206, !2207, !2210}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !234, line: 23, baseType: !85, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !241, file: !234, line: 24, baseType: !97, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "id_auto", scope: !241, file: !234, line: 25, baseType: !246, size: 8, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !62, line: 30, baseType: !247)
!247 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !241, file: !234, line: 26, baseType: !249, size: 5568, offset: 128)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !250)
!250 = !{!251, !1707, !1709, !1712, !1713, !1764, !1858, !1859, !1860, !1861, !1862, !1871, !1976, !1989, !1992, !1993, !1997, !1999, !2000, !2001, !2005, !2011, !2012, !2015, !2130, !2131, !2134, !2135, !2136, !2137, !2169, !2170, !2171, !2174, !2177, !2178, !2179, !2180}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !249, file: !30, line: 462, baseType: !252, size: 512)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !253, line: 64, size: 512, elements: !254)
!253 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!254 = !{!255, !256, !257, !259, !304, !1545, !1697, !1702, !1703, !1704, !1705, !1706}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !253, line: 65, baseType: !85, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !252, file: !253, line: 66, baseType: !203, size: 128, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !252, file: !253, line: 67, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !252, file: !253, line: 68, baseType: !260, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !253, line: 192, size: 704, elements: !262)
!262 = !{!263, !264, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !261, file: !253, line: 193, baseType: !203, size: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !261, file: !253, line: 194, baseType: !213, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !261, file: !253, line: 195, baseType: !252, size: 512, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !261, file: !253, line: 196, baseType: !267, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !253, line: 156, size: 192, elements: !270)
!270 = !{!271, !276, !281}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !269, file: !253, line: 157, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!97, !260, !258}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !253, line: 158, baseType: !277, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DISubroutineType(types: !280)
!280 = !{!85, !260, !258}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !269, file: !253, line: 159, baseType: !282, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DISubroutineType(types: !285)
!285 = !{!97, !260, !258, !286}
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !253, line: 148, size: 20736, elements: !288)
!288 = !{!289, !294, !298, !299, !303}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !287, file: !253, line: 149, baseType: !290, size: 192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 192, elements: !292)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!292 = !{!293}
!293 = !DISubrange(count: 3)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !287, file: !253, line: 150, baseType: !295, size: 4096, offset: 192)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 4096, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !287, file: !253, line: 151, baseType: !97, size: 32, offset: 4288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !253, line: 152, baseType: !300, size: 16384, offset: 4320)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 16384, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 2048)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !287, file: !253, line: 153, baseType: !97, size: 32, offset: 20704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !252, file: !253, line: 69, baseType: !305, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !253, line: 138, size: 448, elements: !307)
!307 = !{!308, !312, !340, !342, !1492, !1523, !1527}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !306, file: !253, line: 139, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !258}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !306, file: !253, line: 140, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !316, line: 230, size: 128, elements: !317)
!316 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!317 = !{!318, !333}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !315, file: !316, line: 231, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!322, !258, !326, !291}
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !62, line: 60, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !324, line: 73, baseType: !325)
!324 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !324, line: 15, baseType: !65)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !316, line: 30, size: 128, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !316, line: 31, baseType: !85, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !327, file: !316, line: 32, baseType: !331, size: 16, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !62, line: 19, baseType: !332)
!332 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !315, file: !316, line: 232, baseType: !334, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!322, !258, !326, !85, !337}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 55, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !324, line: 72, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !324, line: 16, baseType: !64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !306, file: !253, line: 141, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !306, file: !253, line: 142, baseType: !343, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !316, line: 84, size: 320, elements: !347)
!347 = !{!348, !349, !353, !1489, !1490}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !346, file: !316, line: 85, baseType: !85, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !346, file: !316, line: 86, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!331, !258, !326, !97}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !346, file: !316, line: 88, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!331, !258, !357, !97}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !316, line: 168, size: 448, elements: !359)
!359 = !{!360, !361, !362, !363, !373, !374}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !358, file: !316, line: 169, baseType: !327, size: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !358, file: !316, line: 170, baseType: !337, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !358, file: !316, line: 171, baseType: !63, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !358, file: !316, line: 172, baseType: !364, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!322, !367, !258, !357, !291, !370, !337}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !369, line: 526, flags: DIFlagFwdDecl)
!369 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !62, line: 46, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !324, line: 88, baseType: !372)
!372 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !358, file: !316, line: 174, baseType: !364, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !358, file: !316, line: 176, baseType: !375, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!97, !367, !258, !357, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !380, line: 305, size: 1472, elements: !381)
!380 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!381 = !{!382, !383, !384, !385, !386, !394, !395, !1463, !1469, !1470, !1475, !1476, !1479, !1483, !1484, !1485, !1486, !1487}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !379, file: !380, line: 308, baseType: !64, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !379, file: !380, line: 309, baseType: !64, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !379, file: !380, line: 313, baseType: !378, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !379, file: !380, line: 313, baseType: !378, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !379, file: !380, line: 315, baseType: !387, size: 192, align: 64, offset: 256)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !388, line: 24, size: 192, align: 64, elements: !389)
!388 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!389 = !{!390, !391, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !387, file: !388, line: 25, baseType: !64, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !387, file: !388, line: 26, baseType: !392, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !387, file: !388, line: 27, baseType: !392, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !379, file: !380, line: 323, baseType: !64, size: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !379, file: !380, line: 327, baseType: !396, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !380, line: 388, size: 7296, elements: !398)
!398 = !{!399, !1459}
!399 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !380, line: 389, baseType: !400, size: 7296)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !380, line: 389, size: 7296, elements: !401)
!401 = !{!402, !403, !407, !411, !415, !416, !417, !418, !419, !427, !432, !433, !434, !435, !444, !445, !446, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !481, !489, !492, !524, !525, !1430, !1431, !1434, !1437, !1438, !1441, !1442, !1443, !1446, !1458}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !400, file: !380, line: 390, baseType: !378, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !400, file: !380, line: 391, baseType: !404, size: 64, offset: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !388, line: 31, size: 64, elements: !405)
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !404, file: !388, line: 32, baseType: !392, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !400, file: !380, line: 392, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !137, line: 23, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !139, line: 31, baseType: !410)
!410 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !400, file: !380, line: 394, baseType: !412, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{!64, !367, !64, !64, !64, !64}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !400, file: !380, line: 398, baseType: !64, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !400, file: !380, line: 399, baseType: !64, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !400, file: !380, line: 405, baseType: !64, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !400, file: !380, line: 406, baseType: !64, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !400, file: !380, line: 407, baseType: !420, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !369, line: 286, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 286, size: 64, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !422, file: !369, line: 286, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !426, line: 18, baseType: !64)
!426 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!427 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !400, file: !380, line: 416, baseType: !428, size: 32, offset: 576)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !62, line: 168, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 166, size: 32, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !429, file: !62, line: 167, baseType: !97, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !400, file: !380, line: 428, baseType: !428, size: 32, offset: 608)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !400, file: !380, line: 437, baseType: !428, size: 32, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !400, file: !380, line: 447, baseType: !428, size: 32, offset: 672)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !400, file: !380, line: 450, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !437, line: 13, baseType: !438)
!437 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !62, line: 175, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 173, size: 64, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !439, file: !62, line: 174, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !137, line: 22, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !139, line: 30, baseType: !372)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !400, file: !380, line: 452, baseType: !97, size: 32, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !400, file: !380, line: 454, baseType: !213, offset: 800)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !400, file: !380, line: 457, baseType: !447, size: 256, offset: 832)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !448, line: 35, size: 256, elements: !449)
!448 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!449 = !{!450, !451, !452, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !447, file: !448, line: 36, baseType: !436, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !447, file: !448, line: 42, baseType: !436, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !447, file: !448, line: 46, baseType: !453, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !214, line: 29, baseType: !221)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !447, file: !448, line: 47, baseType: !203, size: 128, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !400, file: !380, line: 459, baseType: !203, size: 128, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !400, file: !380, line: 466, baseType: !64, size: 64, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !400, file: !380, line: 467, baseType: !64, size: 64, offset: 1280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !400, file: !380, line: 469, baseType: !64, size: 64, offset: 1344)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !400, file: !380, line: 470, baseType: !64, size: 64, offset: 1408)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !400, file: !380, line: 471, baseType: !438, size: 64, offset: 1472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !400, file: !380, line: 472, baseType: !64, size: 64, offset: 1536)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !400, file: !380, line: 473, baseType: !64, size: 64, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !400, file: !380, line: 474, baseType: !64, size: 64, offset: 1664)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !400, file: !380, line: 475, baseType: !64, size: 64, offset: 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !400, file: !380, line: 477, baseType: !213, offset: 1792)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !400, file: !380, line: 478, baseType: !64, size: 64, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !400, file: !380, line: 478, baseType: !64, size: 64, offset: 1856)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !400, file: !380, line: 478, baseType: !64, size: 64, offset: 1920)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !400, file: !380, line: 478, baseType: !64, size: 64, offset: 1984)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !400, file: !380, line: 479, baseType: !64, size: 64, offset: 2048)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !400, file: !380, line: 479, baseType: !64, size: 64, offset: 2112)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !400, file: !380, line: 479, baseType: !64, size: 64, offset: 2176)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !400, file: !380, line: 480, baseType: !64, size: 64, offset: 2240)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !400, file: !380, line: 480, baseType: !64, size: 64, offset: 2304)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !400, file: !380, line: 480, baseType: !64, size: 64, offset: 2368)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !400, file: !380, line: 480, baseType: !64, size: 64, offset: 2432)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !400, file: !380, line: 482, baseType: !478, size: 2816, offset: 2496)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2816, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 44)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !400, file: !380, line: 488, baseType: !482, size: 256, offset: 5312)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !483, line: 60, size: 256, elements: !484)
!483 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !482, file: !483, line: 61, baseType: !486, size: 256)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 256, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 4)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !400, file: !380, line: 490, baseType: !490, size: 64, offset: 5568)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !380, line: 490, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !400, file: !380, line: 493, baseType: !493, size: 896, offset: 5632)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !494, line: 53, baseType: !495)
!494 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 13, size: 896, elements: !496)
!496 = !{!497, !498, !499, !500, !503, !504, !511, !512, !516, !517, !520}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !495, file: !494, line: 18, baseType: !408, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !495, file: !494, line: 28, baseType: !438, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !495, file: !494, line: 31, baseType: !447, size: 256, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !495, file: !494, line: 32, baseType: !501, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !494, line: 32, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !495, file: !494, line: 37, baseType: !332, size: 16, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !494, line: 40, baseType: !505, size: 192, offset: 512)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !506, line: 53, size: 192, elements: !507)
!506 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !505, file: !506, line: 54, baseType: !436, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !505, file: !506, line: 55, baseType: !213, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !505, file: !506, line: 59, baseType: !203, size: 128, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !495, file: !494, line: 41, baseType: !63, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !495, file: !494, line: 42, baseType: !513, size: 64, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !494, line: 42, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !495, file: !494, line: 44, baseType: !428, size: 32, offset: 832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !495, file: !494, line: 50, baseType: !518, size: 16, offset: 864)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !137, line: 19, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !139, line: 24, baseType: !332)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !495, file: !494, line: 51, baseType: !521, size: 16, offset: 880)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !137, line: 18, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !139, line: 23, baseType: !523)
!523 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !380, line: 495, baseType: !64, size: 64, offset: 6528)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !400, file: !380, line: 497, baseType: !526, size: 64, offset: 6592)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !380, line: 381, size: 384, elements: !528)
!528 = !{!529, !530, !1429}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !527, file: !380, line: 382, baseType: !428, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !527, file: !380, line: 383, baseType: !531, size: 128, offset: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !380, line: 376, size: 128, elements: !532)
!532 = !{!533, !1427}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !531, file: !380, line: 377, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !536, line: 640, size: 48640, elements: !537)
!536 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!537 = !{!538, !546, !548, !549, !555, !556, !557, !558, !559, !560, !561, !562, !566, !584, !595, !687, !688, !689, !700, !701, !703, !704, !705, !706, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !785, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !841, !843, !844, !845, !857, !859, !860, !861, !862, !863, !869, !870, !871, !872, !873, !874, !875, !887, !892, !896, !897, !898, !901, !905, !908, !911, !914, !917, !920, !923, !926, !932, !933, !934, !940, !941, !942, !943, !944, !953, !954, !955, !956, !957, !962, !963, !964, !967, !968, !971, !974, !977, !980, !983, !986, !987, !1067, !1070, !1073, !1074, !1077, !1078, !1079, !1085, !1086, !1087, !1100, !1101, !1102, !1112, !1117, !1120, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !535, file: !536, line: 646, baseType: !539, size: 128)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !540, line: 56, size: 128, elements: !541)
!540 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !539, file: !540, line: 57, baseType: !64, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !539, file: !540, line: 58, baseType: !544, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !137, line: 21, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !139, line: 27, baseType: !7)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !535, file: !536, line: 649, baseType: !547, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !535, file: !536, line: 657, baseType: !63, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !535, file: !536, line: 658, baseType: !550, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !551, line: 113, baseType: !552)
!551 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !551, line: 111, size: 32, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !552, file: !551, line: 112, baseType: !428, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !536, line: 660, baseType: !7, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !535, file: !536, line: 661, baseType: !7, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !535, file: !536, line: 684, baseType: !97, size: 32, offset: 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !535, file: !536, line: 686, baseType: !97, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !535, file: !536, line: 687, baseType: !97, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !535, file: !536, line: 688, baseType: !97, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !535, file: !536, line: 689, baseType: !7, size: 32, offset: 480)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !535, file: !536, line: 691, baseType: !563, size: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !536, line: 691, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !535, file: !536, line: 692, baseType: !567, size: 832, offset: 576)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !536, line: 451, size: 832, elements: !568)
!568 = !{!569, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !567, file: !536, line: 453, baseType: !570, size: 128)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !536, line: 325, size: 128, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !570, file: !536, line: 326, baseType: !64, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !570, file: !536, line: 327, baseType: !544, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !567, file: !536, line: 454, baseType: !387, size: 192, align: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !567, file: !536, line: 455, baseType: !203, size: 128, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !567, file: !536, line: 456, baseType: !7, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !567, file: !536, line: 458, baseType: !408, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !567, file: !536, line: 459, baseType: !408, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !567, file: !536, line: 460, baseType: !408, size: 64, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !567, file: !536, line: 461, baseType: !408, size: 64, offset: 704)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !567, file: !536, line: 463, baseType: !408, size: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !567, file: !536, line: 465, baseType: !583, offset: 832)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !536, line: 415, elements: !227)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !535, file: !536, line: 693, baseType: !585, size: 384, offset: 1408)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !536, line: 489, size: 384, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !585, file: !536, line: 490, baseType: !203, size: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !585, file: !536, line: 491, baseType: !64, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !585, file: !536, line: 492, baseType: !64, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !585, file: !536, line: 493, baseType: !7, size: 32, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !585, file: !536, line: 494, baseType: !332, size: 16, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !585, file: !536, line: 495, baseType: !332, size: 16, offset: 304)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !585, file: !536, line: 497, baseType: !594, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !535, file: !536, line: 697, baseType: !596, size: 1792, offset: 1792)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !536, line: 507, size: 1792, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !684, !685}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !596, file: !536, line: 508, baseType: !387, size: 192, align: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !596, file: !536, line: 515, baseType: !408, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !596, file: !536, line: 516, baseType: !408, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !596, file: !536, line: 517, baseType: !408, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !596, file: !536, line: 518, baseType: !408, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !596, file: !536, line: 519, baseType: !408, size: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !596, file: !536, line: 526, baseType: !442, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !596, file: !536, line: 527, baseType: !408, size: 64, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !536, line: 528, baseType: !7, size: 32, offset: 640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !596, file: !536, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !596, file: !536, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !596, file: !536, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !596, file: !536, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !596, file: !536, line: 563, baseType: !612, size: 512, offset: 704)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !613)
!613 = !{!614, !622, !623, !628, !680, !681, !682, !683}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !612, file: !6, line: 119, baseType: !615, size: 256)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !616, line: 9, size: 256, elements: !617)
!616 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !615, file: !616, line: 10, baseType: !387, size: 192, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !615, file: !616, line: 11, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !621, line: 29, baseType: !442)
!621 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !612, file: !6, line: 120, baseType: !620, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !612, file: !6, line: 121, baseType: !624, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!5, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !612, file: !6, line: 122, baseType: !629, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !631)
!631 = !{!632, !652, !653, !656, !666, !667, !675, !679}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !630, file: !6, line: 160, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !634, file: !6, line: 215, baseType: !453)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !634, file: !6, line: 216, baseType: !7, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !634, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !634, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !634, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !634, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !634, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !634, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !634, file: !6, line: 233, baseType: !620, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !634, file: !6, line: 234, baseType: !627, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !634, file: !6, line: 235, baseType: !620, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !634, file: !6, line: 236, baseType: !627, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !634, file: !6, line: 237, baseType: !649, size: 4096, offset: 512)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 4096, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !630, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !630, file: !6, line: 162, baseType: !654, size: 32, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !62, line: 27, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !324, line: 96, baseType: !97)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !630, file: !6, line: 163, baseType: !657, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !658, line: 276, baseType: !659)
!658 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !658, line: 276, size: 32, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !659, file: !658, line: 276, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !658, line: 70, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !658, line: 65, size: 32, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !663, file: !658, line: 66, baseType: !7, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !630, file: !6, line: 164, baseType: !627, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !630, file: !6, line: 165, baseType: !668, size: 128, offset: 256)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !616, line: 14, size: 128, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !668, file: !616, line: 15, baseType: !671, size: 128)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !388, line: 125, size: 128, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !671, file: !388, line: 126, baseType: !404, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !671, file: !388, line: 127, baseType: !392, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !630, file: !6, line: 166, baseType: !676, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{!620}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !630, file: !6, line: 167, baseType: !620, size: 64, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !612, file: !6, line: 123, baseType: !136, size: 8, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !612, file: !6, line: 124, baseType: !136, size: 8, offset: 456)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !612, file: !6, line: 125, baseType: !136, size: 8, offset: 464)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !612, file: !6, line: 126, baseType: !136, size: 8, offset: 472)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !596, file: !536, line: 572, baseType: !612, size: 512, offset: 1216)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !596, file: !536, line: 580, baseType: !686, size: 64, offset: 1728)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !535, file: !536, line: 721, baseType: !7, size: 32, offset: 3584)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !535, file: !536, line: 722, baseType: !97, size: 32, offset: 3616)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !535, file: !536, line: 723, baseType: !690, size: 64, offset: 3648)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !693, line: 17, baseType: !694)
!693 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !693, line: 17, size: 64, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !694, file: !693, line: 17, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 1)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !535, file: !536, line: 724, baseType: !692, size: 64, offset: 3712)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !535, file: !536, line: 749, baseType: !702, offset: 3776)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !536, line: 290, elements: !227)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !535, file: !536, line: 751, baseType: !203, size: 128, offset: 3776)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !535, file: !536, line: 757, baseType: !396, size: 64, offset: 3904)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !535, file: !536, line: 758, baseType: !396, size: 64, offset: 3968)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !535, file: !536, line: 761, baseType: !707, size: 320, offset: 4032)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !483, line: 34, size: 320, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !707, file: !483, line: 35, baseType: !408, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !707, file: !483, line: 36, baseType: !711, size: 256, offset: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 256, elements: !487)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !535, file: !536, line: 766, baseType: !97, size: 32, offset: 4352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !535, file: !536, line: 767, baseType: !97, size: 32, offset: 4384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !535, file: !536, line: 768, baseType: !97, size: 32, offset: 4416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !535, file: !536, line: 770, baseType: !97, size: 32, offset: 4448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !535, file: !536, line: 772, baseType: !64, size: 64, offset: 4480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !535, file: !536, line: 775, baseType: !7, size: 32, offset: 4544)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !535, file: !536, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !535, file: !536, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !535, file: !536, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !535, file: !536, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !535, file: !536, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !535, file: !536, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !535, file: !536, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !535, file: !536, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !535, file: !536, line: 831, baseType: !64, size: 64, offset: 4672)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !535, file: !536, line: 833, baseType: !728, size: 384, offset: 4736)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !729)
!729 = !{!730, !735}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !728, file: !12, line: 26, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!65, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, scope: !728, file: !12, line: 27, baseType: !736, size: 320, offset: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !728, file: !12, line: 27, size: 320, elements: !737)
!737 = !{!738, !748, !775}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !736, file: !12, line: 36, baseType: !739, size: 320)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !12, line: 29, size: 320, elements: !740)
!740 = !{!741, !743, !744, !745, !746, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !739, file: !12, line: 30, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !739, file: !12, line: 31, baseType: !544, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !739, file: !12, line: 32, baseType: !544, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !739, file: !12, line: 33, baseType: !544, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !739, file: !12, line: 34, baseType: !408, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !739, file: !12, line: 35, baseType: !742, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !736, file: !12, line: 46, baseType: !749, size: 192)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !12, line: 38, size: 192, elements: !750)
!750 = !{!751, !752, !753, !774}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !749, file: !12, line: 39, baseType: !654, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !749, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, scope: !749, file: !12, line: 41, baseType: !754, size: 64, offset: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !749, file: !12, line: 41, size: 64, elements: !755)
!755 = !{!756, !764}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !754, file: !12, line: 42, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !759, line: 7, size: 128, elements: !760)
!759 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!760 = !{!761, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !758, file: !759, line: 8, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !324, line: 93, baseType: !372)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !758, file: !759, line: 9, baseType: !372, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !754, file: !12, line: 43, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !767, line: 7, size: 64, elements: !768)
!767 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!768 = !{!769, !773}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !766, file: !767, line: 8, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !767, line: 5, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !137, line: 20, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !139, line: 26, baseType: !97)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !766, file: !767, line: 9, baseType: !771, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !749, file: !12, line: 45, baseType: !408, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !736, file: !12, line: 54, baseType: !776, size: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !12, line: 48, size: 256, elements: !777)
!777 = !{!778, !781, !782, !783, !784}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !776, file: !12, line: 49, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !776, file: !12, line: 50, baseType: !97, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !776, file: !12, line: 51, baseType: !97, size: 32, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !776, file: !12, line: 52, baseType: !64, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !776, file: !12, line: 53, baseType: !64, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !535, file: !536, line: 835, baseType: !786, size: 32, offset: 5120)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !62, line: 22, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !324, line: 28, baseType: !97)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !535, file: !536, line: 836, baseType: !786, size: 32, offset: 5152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !535, file: !536, line: 840, baseType: !64, size: 64, offset: 5184)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !535, file: !536, line: 849, baseType: !534, size: 64, offset: 5248)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !535, file: !536, line: 852, baseType: !534, size: 64, offset: 5312)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !535, file: !536, line: 857, baseType: !203, size: 128, offset: 5376)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !535, file: !536, line: 858, baseType: !203, size: 128, offset: 5504)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !535, file: !536, line: 859, baseType: !534, size: 64, offset: 5632)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !535, file: !536, line: 867, baseType: !203, size: 128, offset: 5696)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !535, file: !536, line: 868, baseType: !203, size: 128, offset: 5824)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !535, file: !536, line: 871, baseType: !798, size: 64, offset: 5952)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !800, line: 59, size: 768, elements: !801)
!800 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!801 = !{!802, !803, !804, !805, !816, !817, !824, !833}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !799, file: !800, line: 61, baseType: !550, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !799, file: !800, line: 62, baseType: !7, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !799, file: !800, line: 63, baseType: !213, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !799, file: !800, line: 65, baseType: !806, size: 256, offset: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 256, elements: !487)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !62, line: 182, size: 64, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !807, file: !62, line: 183, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !62, line: 186, size: 128, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !811, file: !62, line: 187, baseType: !810, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !811, file: !62, line: 187, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !799, file: !800, line: 66, baseType: !807, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !799, file: !800, line: 68, baseType: !818, size: 128, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !819, line: 40, baseType: !820)
!819 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !819, line: 36, size: 128, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !820, file: !819, line: 37, baseType: !213)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !820, file: !819, line: 38, baseType: !203, size: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !799, file: !800, line: 69, baseType: !825, size: 128, align: 64, offset: 512)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !62, line: 216, size: 128, align: 64, elements: !826)
!826 = !{!827, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !62, line: 217, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !825, file: !62, line: 218, baseType: !830, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !828}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !799, file: !800, line: 70, baseType: !834, size: 128, offset: 640)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 128, elements: !698)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !800, line: 54, size: 128, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !835, file: !800, line: 55, baseType: !97, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !835, file: !800, line: 56, baseType: !839, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !800, line: 56, flags: DIFlagFwdDecl)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !535, file: !536, line: 872, baseType: !842, size: 512, offset: 6016)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 512, elements: !487)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !535, file: !536, line: 873, baseType: !203, size: 128, offset: 6528)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !535, file: !536, line: 874, baseType: !203, size: 128, offset: 6656)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !535, file: !536, line: 876, baseType: !846, size: 64, offset: 6784)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !848, line: 26, size: 192, elements: !849)
!848 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !847, file: !848, line: 27, baseType: !7, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !847, file: !848, line: 28, baseType: !852, size: 128, offset: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !853, line: 43, size: 128, elements: !854)
!853 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !852, file: !853, line: 44, baseType: !453)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !852, file: !853, line: 45, baseType: !203, size: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !535, file: !536, line: 879, baseType: !858, size: 64, offset: 6848)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !535, file: !536, line: 882, baseType: !858, size: 64, offset: 6912)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !535, file: !536, line: 884, baseType: !408, size: 64, offset: 6976)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !535, file: !536, line: 885, baseType: !408, size: 64, offset: 7040)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !535, file: !536, line: 890, baseType: !408, size: 64, offset: 7104)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !535, file: !536, line: 891, baseType: !864, size: 128, offset: 7168)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !536, line: 242, size: 128, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !864, file: !536, line: 244, baseType: !408, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !864, file: !536, line: 245, baseType: !408, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !864, file: !536, line: 246, baseType: !453, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !535, file: !536, line: 900, baseType: !64, size: 64, offset: 7296)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !535, file: !536, line: 901, baseType: !64, size: 64, offset: 7360)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !535, file: !536, line: 904, baseType: !408, size: 64, offset: 7424)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !535, file: !536, line: 907, baseType: !408, size: 64, offset: 7488)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !535, file: !536, line: 910, baseType: !64, size: 64, offset: 7552)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !535, file: !536, line: 911, baseType: !64, size: 64, offset: 7616)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !535, file: !536, line: 914, baseType: !876, size: 640, offset: 7680)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !877, line: 123, size: 640, elements: !878)
!877 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!878 = !{!879, !885, !886}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !876, file: !877, line: 124, baseType: !880, size: 576)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 576, elements: !292)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !877, line: 108, size: 192, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !881, file: !877, line: 109, baseType: !408, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !881, file: !877, line: 110, baseType: !668, size: 128, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !876, file: !877, line: 125, baseType: !7, size: 32, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !876, file: !877, line: 126, baseType: !7, size: 32, offset: 608)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !535, file: !536, line: 917, baseType: !888, size: 192, offset: 8320)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !877, line: 134, size: 192, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !888, file: !877, line: 135, baseType: !825, size: 128, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !888, file: !877, line: 136, baseType: !7, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !535, file: !536, line: 923, baseType: !893, size: 64, offset: 8512)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !536, line: 923, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !535, file: !536, line: 926, baseType: !893, size: 64, offset: 8576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !535, file: !536, line: 929, baseType: !893, size: 64, offset: 8640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !535, file: !536, line: 933, baseType: !899, size: 64, offset: 8704)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !536, line: 933, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !535, file: !536, line: 943, baseType: !902, size: 128, offset: 8768)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 128, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 16)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !535, file: !536, line: 945, baseType: !906, size: 64, offset: 8896)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !536, line: 49, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !535, file: !536, line: 956, baseType: !909, size: 64, offset: 8960)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !536, line: 45, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !535, file: !536, line: 959, baseType: !912, size: 64, offset: 9024)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !536, line: 959, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !535, file: !536, line: 962, baseType: !915, size: 64, offset: 9088)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !536, line: 66, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !535, file: !536, line: 966, baseType: !918, size: 64, offset: 9152)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !536, line: 50, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !535, file: !536, line: 969, baseType: !921, size: 64, offset: 9216)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !877, line: 223, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !535, file: !536, line: 970, baseType: !924, size: 64, offset: 9280)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !536, line: 62, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !535, file: !536, line: 971, baseType: !927, size: 64, offset: 9344)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !928, line: 25, baseType: !929)
!928 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !928, line: 23, size: 64, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !929, file: !928, line: 24, baseType: !697, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !535, file: !536, line: 972, baseType: !927, size: 64, offset: 9408)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !535, file: !536, line: 974, baseType: !927, size: 64, offset: 9472)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !535, file: !536, line: 975, baseType: !935, size: 192, offset: 9536)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !936, line: 30, size: 192, elements: !937)
!936 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !935, file: !936, line: 31, baseType: !203, size: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !935, file: !936, line: 32, baseType: !927, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !535, file: !536, line: 976, baseType: !64, size: 64, offset: 9728)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !535, file: !536, line: 977, baseType: !337, size: 64, offset: 9792)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !535, file: !536, line: 978, baseType: !7, size: 32, offset: 9856)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !535, file: !536, line: 980, baseType: !828, size: 64, offset: 9920)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !535, file: !536, line: 989, baseType: !945, size: 128, offset: 9984)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !946, line: 35, size: 128, elements: !947)
!946 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!947 = !{!948, !949, !950}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !945, file: !946, line: 36, baseType: !97, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !945, file: !946, line: 37, baseType: !428, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !945, file: !946, line: 38, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !946, line: 23, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !535, file: !536, line: 992, baseType: !408, size: 64, offset: 10112)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !535, file: !536, line: 993, baseType: !408, size: 64, offset: 10176)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !535, file: !536, line: 996, baseType: !213, offset: 10240)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !535, file: !536, line: 999, baseType: !453, offset: 10240)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !535, file: !536, line: 1001, baseType: !958, size: 64, offset: 10240)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !536, line: 636, size: 64, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !536, line: 637, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !535, file: !536, line: 1005, baseType: !671, size: 128, offset: 10304)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !535, file: !536, line: 1007, baseType: !534, size: 64, offset: 10432)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !535, file: !536, line: 1009, baseType: !965, size: 64, offset: 10496)
