; ModuleID = '../bcout/drivers/platform/x86/intel_speed_select_if/isst_if_mbox_msr.llvm.bc'
source_filename = "drivers/platform/x86/intel_speed_select_if/isst_if_mbox_msr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_isst_if_mbox_init6:\09\09\09"
module asm ".long\09isst_if_mbox_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.notifier_block = type { i32 (%struct.notifier_block*, i64, i8*)*, %struct.notifier_block*, i32 }
%struct.x86_cpu_id = type { i16, i16, i16, i16, i16, i64 }
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_isst_if_mbox_init293", scope: !2, file: !3, line: 204, type: !84, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !32, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/platform/x86/intel_speed_select_if/isst_if_mbox_msr.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !9, !10, !15, !30, !31}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !8, line: 76, flags: DIFlagFwdDecl)
!8 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !11, line: 23, baseType: !12)
!11 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !13, line: 31, baseType: !14)
!13 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isst_if_mbox_cmd", file: !17, line: 110, size: 192, elements: !18)
!17 = !DIFile(filename: "./include/uapi/linux/isst_if.h", directory: "/home/lizy2001/genbc/linux")
!18 = !{!19, !22, !23, !24, !25, !28, !29}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "logical_cpu", scope: !16, file: !17, line: 111, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !13, line: 27, baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "parameter", scope: !16, file: !17, line: 112, baseType: !20, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "req_data", scope: !16, file: !17, line: 113, baseType: !20, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "resp_data", scope: !16, file: !17, line: 114, baseType: !20, size: 32, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !16, file: !17, line: 115, baseType: !26, size: 16, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !13, line: 24, baseType: !27)
!27 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sub_command", scope: !16, file: !17, line: 116, baseType: !26, size: 16, offset: 144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !16, file: !17, line: 117, baseType: !20, size: 32, offset: 160)
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !11, line: 21, baseType: !20)
!32 = !{!0, !33, !40, !47, !52, !57, !73}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "__exitcall_isst_if_mbox_exit", scope: !2, file: !3, line: 211, type: !35, isLocal: true, isDefinition: true)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !36, line: 117, baseType: !37)
!36 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{null}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file294", scope: !2, file: !3, line: 213, type: !42, isLocal: true, isDefinition: true, align: 8)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 656, elements: !45)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !{!46}
!46 = !DISubrange(count: 82)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license295", scope: !2, file: !3, line: 213, type: !49, isLocal: true, isDefinition: true, align: 8)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 256, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 32)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description296", scope: !2, file: !3, line: 214, type: !54, isLocal: true, isDefinition: true, align: 8)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 584, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 73)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "isst_if_cpu_ids", scope: !2, file: !3, line: 163, type: !59, isLocal: true, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 384, elements: !71)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x86_cpu_id", file: !62, line: 666, size: 192, elements: !63)
!62 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!63 = !{!64, !65, !66, !67, !68, !69}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !61, file: !62, line: 667, baseType: !26, size: 16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !61, file: !62, line: 668, baseType: !26, size: 16, offset: 16)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !61, file: !62, line: 669, baseType: !26, size: 16, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "steppings", scope: !61, file: !62, line: 670, baseType: !26, size: 16, offset: 48)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "feature", scope: !61, file: !62, line: 671, baseType: !26, size: 16, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !61, file: !62, line: 672, baseType: !70, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_ulong_t", file: !62, line: 14, baseType: !9)
!71 = !{!72}
!72 = !DISubrange(count: 2)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "isst_pm_nb", scope: !2, file: !3, line: 159, type: !75, isLocal: true, isDefinition: true)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !76, line: 54, size: 192, elements: !77)
!76 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!77 = !{!78, !85, !86}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !75, file: !76, line: 55, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !76, line: 51, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!30, !83, !9, !84}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !75, file: !76, line: 56, baseType: !83, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !75, file: !76, line: 57, baseType: !30, size: 32, offset: 128)
!87 = !{!"rsp"}
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 2}
!91 = !{i32 1, !"Code Model", i32 2}
!92 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!93 = distinct !DISubprogram(name: "isst_if_mbox_init", scope: !3, file: !3, line: 169, type: !94, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!94 = !DISubroutineType(types: !95)
!95 = !{!30}
!96 = !DILocalVariable(name: "cb", scope: !93, file: !3, line: 171, type: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isst_if_cmd_cb", file: !98, line: 55, size: 256, elements: !99)
!98 = !DIFile(filename: "drivers/platform/x86/intel_speed_select_if/isst_if_common.h", directory: "/home/lizy2001/genbc/linux")
!99 = !{!100, !101, !102, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "registered", scope: !97, file: !98, line: 56, baseType: !30, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_size", scope: !97, file: !98, line: 57, baseType: !30, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !97, file: !98, line: 58, baseType: !30, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !97, file: !98, line: 59, baseType: !6, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_callback", scope: !97, file: !98, line: 60, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !109, !113, !30}
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !11, line: 17, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !13, line: 21, baseType: !112)
!112 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!114 = !DILocation(line: 171, column: 24, scope: !93)
!115 = !DILocalVariable(name: "id", scope: !93, file: !3, line: 172, type: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!117 = !DILocation(line: 172, column: 27, scope: !93)
!118 = !DILocalVariable(name: "data", scope: !93, file: !3, line: 173, type: !10)
!119 = !DILocation(line: 173, column: 6, scope: !93)
!120 = !DILocalVariable(name: "ret", scope: !93, file: !3, line: 174, type: !30)
!121 = !DILocation(line: 174, column: 6, scope: !93)
!122 = !DILocation(line: 176, column: 7, scope: !93)
!123 = !DILocation(line: 176, column: 5, scope: !93)
!124 = !DILocation(line: 177, column: 7, scope: !125)
!125 = distinct !DILexicalBlock(scope: !93, file: !3, line: 177, column: 6)
!126 = !DILocation(line: 177, column: 6, scope: !93)
!127 = !DILocation(line: 178, column: 3, scope: !125)
!128 = !DILocation(line: 181, column: 8, scope: !93)
!129 = !DILocation(line: 181, column: 6, scope: !93)
!130 = !DILocation(line: 182, column: 6, scope: !131)
!131 = distinct !DILexicalBlock(scope: !93, file: !3, line: 182, column: 6)
!132 = !DILocation(line: 182, column: 6, scope: !93)
!133 = !DILocation(line: 183, column: 10, scope: !131)
!134 = !DILocation(line: 183, column: 3, scope: !131)
!135 = !DILocation(line: 185, column: 8, scope: !93)
!136 = !DILocation(line: 185, column: 6, scope: !93)
!137 = !DILocation(line: 186, column: 6, scope: !138)
!138 = distinct !DILexicalBlock(scope: !93, file: !3, line: 186, column: 6)
!139 = !DILocation(line: 186, column: 6, scope: !93)
!140 = !DILocation(line: 187, column: 10, scope: !138)
!141 = !DILocation(line: 187, column: 3, scope: !138)
!142 = !DILocation(line: 189, column: 2, scope: !93)
!143 = !DILocation(line: 190, column: 5, scope: !93)
!144 = !DILocation(line: 190, column: 14, scope: !93)
!145 = !DILocation(line: 191, column: 5, scope: !93)
!146 = !DILocation(line: 191, column: 12, scope: !93)
!147 = !DILocation(line: 192, column: 5, scope: !93)
!148 = !DILocation(line: 192, column: 18, scope: !93)
!149 = !DILocation(line: 193, column: 5, scope: !93)
!150 = !DILocation(line: 193, column: 11, scope: !93)
!151 = !DILocation(line: 194, column: 8, scope: !93)
!152 = !DILocation(line: 194, column: 6, scope: !93)
!153 = !DILocation(line: 195, column: 6, scope: !154)
!154 = distinct !DILexicalBlock(scope: !93, file: !3, line: 195, column: 6)
!155 = !DILocation(line: 195, column: 6, scope: !93)
!156 = !DILocation(line: 196, column: 10, scope: !154)
!157 = !DILocation(line: 196, column: 3, scope: !154)
!158 = !DILocation(line: 198, column: 8, scope: !93)
!159 = !DILocation(line: 198, column: 6, scope: !93)
!160 = !DILocation(line: 199, column: 6, scope: !161)
!161 = distinct !DILexicalBlock(scope: !93, file: !3, line: 199, column: 6)
!162 = !DILocation(line: 199, column: 6, scope: !93)
!163 = !DILocation(line: 200, column: 3, scope: !161)
!164 = !DILocation(line: 202, column: 9, scope: !93)
!165 = !DILocation(line: 202, column: 2, scope: !93)
!166 = !DILocation(line: 203, column: 1, scope: !93)
!167 = distinct !DISubprogram(name: "isst_if_mbox_exit", scope: !3, file: !3, line: 206, type: !38, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!168 = !DILocation(line: 208, column: 2, scope: !167)
!169 = !DILocation(line: 209, column: 2, scope: !167)
!170 = !DILocation(line: 210, column: 1, scope: !167)
!171 = distinct !DISubprogram(name: "rdmsrl_safe", scope: !172, file: !172, line: 219, type: !173, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DIFile(filename: "./arch/x86/include/asm/paravirt.h", directory: "/home/lizy2001/genbc/linux")
!173 = !DISubroutineType(types: !174)
!174 = !{!30, !21, !175}
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!176 = !DILocalVariable(name: "msr", arg: 1, scope: !171, file: !172, line: 219, type: !21)
!177 = !DILocation(line: 219, column: 40, scope: !171)
!178 = !DILocalVariable(name: "p", arg: 2, scope: !171, file: !172, line: 219, type: !175)
!179 = !DILocation(line: 219, column: 65, scope: !171)
!180 = !DILocalVariable(name: "err", scope: !171, file: !172, line: 221, type: !30)
!181 = !DILocation(line: 221, column: 6, scope: !171)
!182 = !DILocation(line: 223, column: 30, scope: !171)
!183 = !DILocation(line: 223, column: 7, scope: !171)
!184 = !DILocation(line: 223, column: 3, scope: !171)
!185 = !DILocation(line: 223, column: 5, scope: !171)
!186 = !DILocation(line: 224, column: 9, scope: !171)
!187 = !DILocation(line: 224, column: 2, scope: !171)
!188 = distinct !DISubprogram(name: "isst_if_mbox_proc_cmd", scope: !3, file: !3, line: 106, type: !106, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!189 = !DILocalVariable(name: "cmd_ptr", arg: 1, scope: !188, file: !3, line: 106, type: !109)
!190 = !DILocation(line: 106, column: 39, scope: !188)
!191 = !DILocalVariable(name: "write_only", arg: 2, scope: !188, file: !3, line: 106, type: !113)
!192 = !DILocation(line: 106, column: 53, scope: !188)
!193 = !DILocalVariable(name: "resume", arg: 3, scope: !188, file: !3, line: 106, type: !30)
!194 = !DILocation(line: 106, column: 69, scope: !188)
!195 = !DILocalVariable(name: "action", scope: !188, file: !3, line: 108, type: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msrl_action", file: !3, line: 89, size: 128, elements: !197)
!197 = !{!198, !199}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !196, file: !3, line: 90, baseType: !30, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mbox_cmd", scope: !196, file: !3, line: 91, baseType: !15, size: 64, offset: 64)
!200 = !DILocation(line: 108, column: 21, scope: !188)
!201 = !DILocalVariable(name: "ret", scope: !188, file: !3, line: 109, type: !30)
!202 = !DILocation(line: 109, column: 6, scope: !188)
!203 = !DILocation(line: 111, column: 47, scope: !188)
!204 = !DILocation(line: 111, column: 20, scope: !188)
!205 = !DILocation(line: 111, column: 9, scope: !188)
!206 = !DILocation(line: 111, column: 18, scope: !188)
!207 = !DILocation(line: 113, column: 38, scope: !208)
!208 = distinct !DILexicalBlock(scope: !188, file: !3, line: 113, column: 6)
!209 = !DILocation(line: 113, column: 6, scope: !208)
!210 = !DILocation(line: 113, column: 6, scope: !188)
!211 = !DILocation(line: 114, column: 3, scope: !208)
!212 = !DILocation(line: 116, column: 38, scope: !213)
!213 = distinct !DILexicalBlock(scope: !188, file: !3, line: 116, column: 6)
!214 = !DILocation(line: 116, column: 6, scope: !213)
!215 = !DILocation(line: 116, column: 48, scope: !213)
!216 = !DILocation(line: 117, column: 7, scope: !213)
!217 = !DILocation(line: 116, column: 6, scope: !188)
!218 = !DILocation(line: 118, column: 3, scope: !213)
!219 = !DILocation(line: 127, column: 40, scope: !188)
!220 = !DILocation(line: 127, column: 50, scope: !188)
!221 = !DILocation(line: 128, column: 30, scope: !188)
!222 = !DILocation(line: 127, column: 8, scope: !188)
!223 = !DILocation(line: 127, column: 6, scope: !188)
!224 = !DILocation(line: 129, column: 6, scope: !225)
!225 = distinct !DILexicalBlock(scope: !188, file: !3, line: 129, column: 6)
!226 = !DILocation(line: 129, column: 6, scope: !188)
!227 = !DILocation(line: 130, column: 10, scope: !225)
!228 = !DILocation(line: 130, column: 3, scope: !225)
!229 = !DILocation(line: 132, column: 14, scope: !230)
!230 = distinct !DILexicalBlock(scope: !188, file: !3, line: 132, column: 6)
!231 = !DILocation(line: 132, column: 7, scope: !230)
!232 = !DILocation(line: 132, column: 18, scope: !230)
!233 = !DILocation(line: 132, column: 22, scope: !230)
!234 = !DILocation(line: 132, column: 29, scope: !230)
!235 = !DILocation(line: 132, column: 64, scope: !230)
!236 = !DILocation(line: 132, column: 32, scope: !230)
!237 = !DILocation(line: 132, column: 6, scope: !188)
!238 = !DILocation(line: 133, column: 38, scope: !230)
!239 = !DILocation(line: 133, column: 48, scope: !230)
!240 = !DILocation(line: 133, column: 31, scope: !230)
!241 = !DILocation(line: 134, column: 17, scope: !230)
!242 = !DILocation(line: 134, column: 27, scope: !230)
!243 = !DILocation(line: 134, column: 10, scope: !230)
!244 = !DILocation(line: 135, column: 17, scope: !230)
!245 = !DILocation(line: 135, column: 27, scope: !230)
!246 = !DILocation(line: 136, column: 17, scope: !230)
!247 = !DILocation(line: 136, column: 27, scope: !230)
!248 = !DILocation(line: 137, column: 17, scope: !230)
!249 = !DILocation(line: 137, column: 27, scope: !230)
!250 = !DILocation(line: 137, column: 10, scope: !230)
!251 = !DILocation(line: 133, column: 16, scope: !230)
!252 = !DILocation(line: 133, column: 10, scope: !230)
!253 = !DILocation(line: 133, column: 14, scope: !230)
!254 = !DILocation(line: 133, column: 3, scope: !230)
!255 = !DILocation(line: 138, column: 3, scope: !188)
!256 = !DILocation(line: 138, column: 14, scope: !188)
!257 = !DILocation(line: 140, column: 16, scope: !188)
!258 = !DILocation(line: 140, column: 9, scope: !188)
!259 = !DILocation(line: 140, column: 2, scope: !188)
!260 = !DILocation(line: 141, column: 1, scope: !188)
!261 = distinct !DISubprogram(name: "paravirt_read_msr_safe", scope: !172, file: !172, line: 174, type: !262, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!262 = !DISubroutineType(types: !263)
!263 = !{!10, !21, !113}
!264 = !DILocalVariable(name: "msr", arg: 1, scope: !261, file: !172, line: 174, type: !21)
!265 = !DILocation(line: 174, column: 51, scope: !261)
