; ModuleID = '../bcout/drivers/xen/xenbus/xenbus_dev_frontend.llvm.bc'
source_filename = "drivers/xen/xenbus/xenbus_dev_frontend.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_xenbus_init6:\09\09\09"
module asm ".long\09xenbus_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.module = type opaque
%struct.file = type { %union.anon.1, %struct.path, %struct.inode*, %struct.file_operations*, %struct.spinlock, i32, %struct.atomic64_t, i32, i32, %struct.mutex, i64, %struct.fown_struct, %struct.cred*, %struct.file_ra_state, i64, i8*, %struct.list_head, %struct.list_head, %struct.address_space*, i32, i32 }
%union.anon.1 = type { %struct.callback_head }
%struct.callback_head = type { %struct.callback_head*, void (%struct.callback_head*)* }
%struct.path = type { %struct.vfsmount*, %struct.dentry* }
%struct.vfsmount = type { %struct.dentry*, %struct.super_block*, i32 }

!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!116 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!117 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!118 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!119 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!120 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!121 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!122 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!123 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!124 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!125 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!126 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!127 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!128 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!129 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!130 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!131 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!132 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!133 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!134 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!135 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!136 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!137 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!138 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!139 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!140 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!141 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!142 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!143 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!144 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!145 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xen_domain_type", file: !146, line: 5, baseType: !7, size: 32, elements: !147)
!146 = !DIFile(filename: "./include/xen/xen.h", directory: "/home/lizy2001/genbc/linux")
!147 = !{!148, !149, !150}
!148 = !DIEnumerator(name: "XEN_NATIVE", value: 0, isUnsigned: true)
!149 = !DIEnumerator(name: "XEN_PV_DOMAIN", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "XEN_HVM_DOMAIN", value: 2, isUnsigned: true)
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !152, line: 26, baseType: !7, size: 32, elements: !153)
!152 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!153 = !{!154, !155, !156}
!154 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !158, line: 44, baseType: !7, size: 32, elements: !159)
!158 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!159 = !{!160, !161, !162}
!160 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!161 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!162 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !164, line: 343, baseType: !7, size: 32, elements: !165)
!164 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!165 = !{!166, !167, !168, !169}
!166 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!167 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!168 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!169 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !171, line: 524, baseType: !7, size: 32, elements: !172)
!171 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!172 = !{!173, !174, !175, !176, !177}
!173 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!174 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!175 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!176 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!177 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!178 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !171, line: 502, baseType: !7, size: 32, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!181 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!182 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!183 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!184 = !{!185, !186, !206, !208, !209, !211, !222, !7, !296, !308, !327, !329, !330}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenbus_transaction_holder", file: !3, line: 72, size: 192, elements: !188)
!188 = !{!189, !196, !205}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !187, file: !3, line: 73, baseType: !190, size: 128)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !191, line: 178, size: 128, elements: !192)
!191 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !191, line: 179, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !191, line: 179, baseType: !194, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !187, file: !3, line: 74, baseType: !197, size: 32, offset: 128)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenbus_transaction", file: !198, line: 133, size: 32, elements: !199)
!198 = !DIFile(filename: "./include/xen/xenbus.h", directory: "/home/lizy2001/genbc/linux")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !197, file: !198, line: 135, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !202, line: 21, baseType: !203)
!202 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !204, line: 27, baseType: !7)
!204 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!205 = !DIDerivedType(tag: DW_TAG_member, name: "generation_id", scope: !187, file: !3, line: 75, baseType: !7, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !191, line: 148, baseType: !7)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "read_buffer", file: !3, line: 81, size: 192, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !212, file: !3, line: 82, baseType: !190, size: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cons", scope: !212, file: !3, line: 83, baseType: !7, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !212, file: !3, line: 84, baseType: !7, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !212, file: !3, line: 85, baseType: !218, offset: 192)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, elements: !220)
!219 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!220 = !{!221}
!221 = !DISubrange(count: -1)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenbus_file_priv", file: !3, line: 88, size: 34048, elements: !224)
!224 = !{!225, !256, !257, !258, !259, !274, !275, !276, !283, !297}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "msgbuffer_mutex", scope: !223, file: !3, line: 99, baseType: !226, size: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !227, line: 53, size: 192, elements: !228)
!227 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!228 = !{!229, !239, !255}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !226, file: !227, line: 54, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !231, line: 13, baseType: !232)
!231 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !191, line: 175, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 173, size: 64, elements: !234)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !233, file: !191, line: 174, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !202, line: 22, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !204, line: 30, baseType: !238)
!238 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !226, file: !227, line: 55, baseType: !240, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !241, line: 83, baseType: !242)
!241 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !241, line: 71, elements: !243)
!243 = !{!244}
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !242, file: !241, line: 72, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !242, file: !241, line: 72, elements: !246)
!246 = !{!247}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !245, file: !241, line: 73, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !241, line: 20, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !248, file: !241, line: 21, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !252, line: 25, baseType: !253)
!252 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !252, line: 25, elements: !254)
!254 = !{}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !226, file: !227, line: 59, baseType: !190, size: 128, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "transactions", scope: !223, file: !3, line: 102, baseType: !190, size: 128, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "watches", scope: !223, file: !3, line: 105, baseType: !190, size: 128, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !223, file: !3, line: 108, baseType: !7, size: 32, offset: 448)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !223, file: !3, line: 112, baseType: !260, size: 32768, offset: 480)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !223, file: !3, line: 109, size: 32768, elements: !261)
!261 = !{!262, !270}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !260, file: !3, line: 110, baseType: !263, size: 128)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xsd_sockmsg", file: !6, line: 65, size: 128, elements: !264)
!264 = !{!265, !267, !268, !269}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !263, file: !6, line: 67, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !191, line: 104, baseType: !201)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "req_id", scope: !263, file: !6, line: 68, baseType: !266, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tx_id", scope: !263, file: !6, line: 69, baseType: !266, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !263, file: !6, line: 70, baseType: !266, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !260, file: !3, line: 111, baseType: !271, size: 32768)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 32768, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 4096)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reply_mutex", scope: !223, file: !3, line: 115, baseType: !226, size: 192, offset: 33280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "read_buffers", scope: !223, file: !3, line: 116, baseType: !190, size: 128, offset: 33472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "read_waitq", scope: !223, file: !3, line: 117, baseType: !277, size: 128, offset: 33600)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !278, line: 40, baseType: !279)
!278 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !278, line: 36, size: 128, elements: !280)
!280 = !{!281, !282}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !279, file: !278, line: 37, baseType: !240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !279, file: !278, line: 38, baseType: !190, size: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !223, file: !3, line: 119, baseType: !284, size: 32, offset: 33728)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !285, line: 19, size: 32, elements: !286)
!285 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !284, file: !285, line: 20, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !105, line: 113, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !105, line: 111, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !289, file: !105, line: 112, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !191, line: 168, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 166, size: 32, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !293, file: !191, line: 167, baseType: !296, size: 32)
!296 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "wq", scope: !223, file: !3, line: 121, baseType: !298, size: 256, offset: 33792)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !113, line: 102, size: 256, elements: !299)
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !113, line: 103, baseType: !230, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !298, file: !113, line: 104, baseType: !190, size: 128, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !298, file: !113, line: 105, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !113, line: 21, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "watch_adapter", file: !3, line: 226, size: 512, elements: !310)
!310 = !{!311, !312, !324, !325}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !309, file: !3, line: 227, baseType: !190, size: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "watch", scope: !309, file: !3, line: 228, baseType: !313, size: 256, offset: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xenbus_watch", file: !198, line: 57, size: 256, elements: !314)
!314 = !{!315, !316, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !313, file: !198, line: 59, baseType: !190, size: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !313, file: !198, line: 62, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !313, file: !198, line: 65, baseType: !320, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !323, !317, !317}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "dev_data", scope: !309, file: !3, line: 229, baseType: !222, size: 64, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "token", scope: !309, file: !3, line: 230, baseType: !326, size: 64, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !328, line: 52, baseType: !7)
!328 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!329 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !296)
!332 = !{!0, !333, !335, !337, !3178, !3180, !3182}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_xenbus_init265", scope: !2, file: !3, line: 725, type: !185, isLocal: true, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "xb_dev_generation_id", scope: !2, file: !3, line: 66, type: !7, isLocal: false, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "__key", scope: !339, file: !3, line: 667, type: !541, isLocal: true, isDefinition: true)
!339 = distinct !DISubprogram(name: "xenbus_file_open", scope: !3, file: !3, line: 649, type: !340, scopeLine: 650, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !254)
!340 = !DISubroutineType(types: !341)
!341 = !{!296, !342, !685}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !76, line: 610, size: 4224, elements: !344)
!344 = !{!345, !348, !349, !358, !365, !366, !3110, !3111, !3112, !3113, !3119, !3120, !3121, !3122, !3123, !3124, !3125, !3126, !3127, !3128, !3129, !3130, !3131, !3132, !3133, !3134, !3135, !3136, !3137, !3138, !3143, !3144, !3145, !3146, !3147, !3148, !3149, !3154, !3162, !3163, !3164, !3174, !3175, !3176, !3177}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !343, file: !76, line: 611, baseType: !346, size: 16)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !191, line: 19, baseType: !347)
!347 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !343, file: !76, line: 612, baseType: !347, size: 16, offset: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !343, file: !76, line: 613, baseType: !350, size: 32, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !351, line: 23, baseType: !352)
!351 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 21, size: 32, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !352, file: !351, line: 22, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !191, line: 32, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !357, line: 49, baseType: !7)
!357 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !343, file: !76, line: 614, baseType: !359, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !351, line: 28, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 26, size: 32, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !360, file: !351, line: 27, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !191, line: 33, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !357, line: 50, baseType: !7)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !343, file: !76, line: 615, baseType: !7, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !343, file: !76, line: 622, baseType: !367, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !76, line: 1864, size: 1536, align: 512, elements: !370)
!370 = !{!371, !2984, !2997, !3001, !3007, !3011, !3015, !3019, !3023, !3027, !3031, !3032, !3036, !3040, !3060, !3086, !3090, !3096, !3101, !3105, !3106}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !369, file: !76, line: 1865, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !342, !375, !7}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !377, line: 89, size: 1536, elements: !378)
!377 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!378 = !{!379, !380, !390, !398, !399, !418, !419, !423, !435, !2968, !2969, !2970, !2971, !2976, !2977, !2978}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !376, file: !377, line: 91, baseType: !7, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !376, file: !377, line: 92, baseType: !381, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !382, line: 277, baseType: !383)
!382 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !382, line: 277, size: 32, elements: !384)
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !383, file: !382, line: 277, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !382, line: 70, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !382, line: 65, size: 32, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !387, file: !382, line: 66, baseType: !7, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !376, file: !377, line: 93, baseType: !391, size: 128, offset: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !392, line: 38, size: 128, elements: !393)
!392 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!393 = !{!394, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !392, line: 39, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !391, file: !392, line: 39, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !376, file: !377, line: 94, baseType: !375, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !376, file: !377, line: 95, baseType: !400, size: 128, offset: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !377, line: 47, size: 128, elements: !401)
!401 = !{!402, !414}
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !400, file: !377, line: 48, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !400, file: !377, line: 48, size: 64, elements: !404)
!404 = !{!405, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !377, line: 49, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !377, line: 49, size: 64, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !406, file: !377, line: 50, baseType: !201, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !406, file: !377, line: 50, baseType: !201, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !403, file: !377, line: 52, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !202, line: 23, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !204, line: 31, baseType: !413)
!413 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !377, line: 54, baseType: !415, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !376, file: !377, line: 96, baseType: !342, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "d_iname", scope: !376, file: !377, line: 98, baseType: !420, size: 256, offset: 448)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 256, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "d_lockref", scope: !376, file: !377, line: 101, baseType: !424, size: 32, offset: 704)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lockref", file: !425, line: 25, size: 32, elements: !426)
!425 = !DIFile(filename: "./include/linux/lockref.h", directory: "/home/lizy2001/genbc/linux")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, scope: !424, file: !425, line: 26, baseType: !428, size: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !424, file: !425, line: 26, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, scope: !428, file: !425, line: 30, baseType: !431, size: 32)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !428, file: !425, line: 30, size: 32, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !425, line: 31, baseType: !240)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !431, file: !425, line: 32, baseType: !296, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "d_op", scope: !376, file: !377, line: 102, baseType: !436, size: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry_operations", file: !377, line: 135, size: 1024, align: 512, elements: !439)
!439 = !{!440, !444, !445, !452, !458, !462, !466, !470, !471, !475, !479, !2958, !2962}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "d_revalidate", scope: !438, file: !377, line: 136, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!296, !375, !7}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "d_weak_revalidate", scope: !438, file: !377, line: 137, baseType: !441, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !438, file: !377, line: 138, baseType: !446, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!296, !449, !451}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "d_compare", scope: !438, file: !377, line: 139, baseType: !453, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!296, !449, !7, !317, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "d_delete", scope: !438, file: !377, line: 141, baseType: !459, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!296, !449}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "d_init", scope: !438, file: !377, line: 142, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DISubroutineType(types: !465)
!465 = !{!296, !375}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "d_release", scope: !438, file: !377, line: 143, baseType: !467, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !375}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "d_prune", scope: !438, file: !377, line: 144, baseType: !467, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "d_iput", scope: !438, file: !377, line: 145, baseType: !472, size: 64, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !375, !342}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "d_dname", scope: !438, file: !377, line: 146, baseType: !476, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DISubroutineType(types: !478)
!478 = !{!326, !375, !326, !296}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "d_automount", scope: !438, file: !377, line: 147, baseType: !480, size: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !2957}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !485, line: 71, size: 192, elements: !486)
!485 = !DIFile(filename: "./include/linux/mount.h", directory: "/home/lizy2001/genbc/linux")
!486 = !{!487, !488, !2956}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_root", scope: !484, file: !485, line: 72, baseType: !375, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_sb", scope: !484, file: !485, line: 73, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !76, line: 1416, size: 9472, elements: !491)
!491 = !{!492, !493, !496, !497, !498, !501, !552, !2620, !2702, !2787, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2803, !2807, !2808, !2811, !2812, !2815, !2816, !2817, !2858, !2885, !2886, !2887, !2888, !2889, !2890, !2893, !2895, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2923, !2924, !2925, !2926, !2927, !2930, !2931, !2932, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !490, file: !76, line: 1417, baseType: !190, size: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !490, file: !76, line: 1418, baseType: !494, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !191, line: 16, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !191, line: 13, baseType: !201)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !490, file: !76, line: 1419, baseType: !417, size: 8, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !490, file: !76, line: 1420, baseType: !329, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !490, file: !76, line: 1421, baseType: !499, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !191, line: 46, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !357, line: 88, baseType: !238)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !490, file: !76, line: 1422, baseType: !502, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !76, line: 2228, size: 576, elements: !504)
!504 = !{!505, !506, !507, !513, !517, !521, !525, !529, !530, !540, !543, !544, !545, !549, !550, !551}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !503, file: !76, line: 2229, baseType: !317, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !503, file: !76, line: 2230, baseType: !296, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !503, file: !76, line: 2238, baseType: !508, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{!296, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !76, line: 69, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !503, file: !76, line: 2239, baseType: !514, size: 64, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !76, line: 70, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !503, file: !76, line: 2240, baseType: !518, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!375, !502, !296, !317, !185}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !503, file: !76, line: 2242, baseType: !522, size: 64, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !489}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !503, file: !76, line: 2243, baseType: !526, size: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !528, line: 76, flags: DIFlagFwdDecl)
!528 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !76, line: 2244, baseType: !502, size: 64, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !503, file: !76, line: 2245, baseType: !531, size: 64, offset: 512)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !191, line: 182, size: 64, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !531, file: !191, line: 183, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !191, line: 186, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !191, line: 187, baseType: !534, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !535, file: !191, line: 187, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !503, file: !76, line: 2247, baseType: !541, offset: 576)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !542, line: 187, elements: !254)
!542 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!543 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !503, file: !76, line: 2248, baseType: !541, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !503, file: !76, line: 2249, baseType: !541, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !503, file: !76, line: 2250, baseType: !546, offset: 576)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 3)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !503, file: !76, line: 2252, baseType: !541, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !503, file: !76, line: 2253, baseType: !541, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !503, file: !76, line: 2254, baseType: !541, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !490, file: !76, line: 1423, baseType: !553, size: 64, offset: 384)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !76, line: 1935, size: 1472, elements: !556)
!556 = !{!557, !561, !565, !566, !570, !576, !580, !581, !582, !586, !590, !591, !592, !593, !599, !604, !605, !612, !613, !614, !615, !2604, !2619}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !555, file: !76, line: 1936, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!342, !489}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !555, file: !76, line: 1937, baseType: !562, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !342}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !555, file: !76, line: 1938, baseType: !562, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !555, file: !76, line: 1940, baseType: !567, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !342, !296}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !555, file: !76, line: 1941, baseType: !571, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{!296, !342, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !76, line: 289, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !555, file: !76, line: 1942, baseType: !577, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!296, !342}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !555, file: !76, line: 1943, baseType: !562, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !555, file: !76, line: 1944, baseType: !522, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !555, file: !76, line: 1945, baseType: !583, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!296, !489, !296}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !555, file: !76, line: 1946, baseType: !587, size: 64, offset: 576)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!296, !489}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !555, file: !76, line: 1947, baseType: !587, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !555, file: !76, line: 1948, baseType: !587, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !555, file: !76, line: 1949, baseType: !587, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !555, file: !76, line: 1950, baseType: !594, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{!296, !375, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !76, line: 57, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !555, file: !76, line: 1951, baseType: !600, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{!296, !489, !603, !326}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !555, file: !76, line: 1952, baseType: !522, size: 64, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !555, file: !76, line: 1954, baseType: !606, size: 64, offset: 1024)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!296, !609, !375}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !611, line: 539, flags: DIFlagFwdDecl)
!611 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!612 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !555, file: !76, line: 1955, baseType: !606, size: 64, offset: 1088)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !555, file: !76, line: 1956, baseType: !606, size: 64, offset: 1152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !555, file: !76, line: 1957, baseType: !606, size: 64, offset: 1216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !555, file: !76, line: 1963, baseType: !616, size: 64, offset: 1280)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!296, !489, !619, !208}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !621, line: 68, size: 512, align: 128, elements: !622)
!621 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!622 = !{!623, !624, !2596, !2603}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !620, file: !621, line: 69, baseType: !329, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !620, file: !621, line: 77, baseType: !625, size: 320, offset: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !620, file: !621, line: 77, size: 320, elements: !626)
!626 = !{!627, !2470, !2475, !2501, !2509, !2515, !2527, !2595}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !621, line: 78, baseType: !628, size: 320)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !621, line: 78, size: 320, elements: !629)
!629 = !{!630, !631, !2468, !2469}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !628, file: !621, line: 84, baseType: !190, size: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !628, file: !621, line: 86, baseType: !632, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !76, line: 451, size: 1216, align: 64, elements: !634)
!634 = !{!635, !636, !643, !644, !645, !660, !669, !670, !671, !672, !2463, !2464, !2465, !2466, !2467}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !633, file: !76, line: 452, baseType: !342, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !633, file: !76, line: 453, baseType: !637, size: 128, offset: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !638, line: 292, size: 128, elements: !639)
!638 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !637, file: !638, line: 293, baseType: !240)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !637, file: !638, line: 295, baseType: !208, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !637, file: !638, line: 296, baseType: !185, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !633, file: !76, line: 454, baseType: !208, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !633, file: !76, line: 455, baseType: !292, size: 32, offset: 224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !633, file: !76, line: 460, baseType: !646, size: 128, offset: 256)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !647, line: 125, size: 128, elements: !648)
!647 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!648 = !{!649, !659}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !646, file: !647, line: 126, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !647, line: 31, size: 64, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !650, file: !647, line: 32, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !647, line: 24, size: 192, align: 64, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !654, file: !647, line: 25, baseType: !329, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !654, file: !647, line: 26, baseType: !653, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !654, file: !647, line: 27, baseType: !653, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !646, file: !647, line: 127, baseType: !653, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !633, file: !76, line: 461, baseType: !661, size: 256, offset: 384)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !662, line: 35, size: 256, elements: !663)
!662 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!663 = !{!664, !665, !666, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !661, file: !662, line: 36, baseType: !230, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !661, file: !662, line: 42, baseType: !230, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !661, file: !662, line: 46, baseType: !667, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !241, line: 29, baseType: !248)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !661, file: !662, line: 47, baseType: !190, size: 128, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !633, file: !76, line: 462, baseType: !329, size: 64, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !633, file: !76, line: 463, baseType: !329, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !633, file: !76, line: 464, baseType: !329, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !633, file: !76, line: 465, baseType: !673, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !76, line: 367, size: 1408, elements: !676)
!676 = !{!677, !681, !2376, !2380, !2384, !2388, !2400, !2405, !2409, !2414, !2418, !2422, !2426, !2427, !2431, !2437, !2438, !2439, !2443, !2448, !2452, !2459}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !675, file: !76, line: 368, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!296, !619, !574}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !675, file: !76, line: 369, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!296, !685, !619}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !76, line: 916, size: 1856, align: 32, elements: !687)
!687 = !{!688, !706, !712, !713, !2340, !2341, !2342, !2343, !2344, !2346, !2347, !2348, !2357, !2358, !2367, !2368, !2369, !2370, !2371, !2372, !2375}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !686, file: !76, line: 920, baseType: !689, size: 128)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !686, file: !76, line: 917, size: 128, elements: !690)
!690 = !{!691, !697}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !689, file: !76, line: 918, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !693, line: 58, size: 64, elements: !694)
!693 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !693, line: 59, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !689, file: !76, line: 919, baseType: !698, size: 128, align: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !191, line: 216, size: 128, align: 64, elements: !699)
!699 = !{!700, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !191, line: 217, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !698, file: !191, line: 218, baseType: !703, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !701}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !686, file: !76, line: 921, baseType: !707, size: 128, offset: 128)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !708, line: 8, size: 128, elements: !709)
!708 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !707, file: !708, line: 9, baseType: !483, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !707, file: !708, line: 10, baseType: !375, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "f_inode", scope: !686, file: !76, line: 922, baseType: !342, size: 64, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "f_op", scope: !686, file: !76, line: 923, baseType: !714, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_operations", file: !76, line: 1822, size: 2048, elements: !717)
!717 = !{!718, !719, !723, !734, !738, !822, !823, !829, !842, !843, !858, !862, !863, !2174, !2175, !2177, !2182, !2183, !2187, !2191, !2300, !2304, !2305, !2309, !2310, !2314, !2318, !2323, !2327, !2331, !2335, !2339}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !716, file: !76, line: 1823, baseType: !526, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "llseek", scope: !716, file: !76, line: 1824, baseType: !720, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!499, !685, !499, !296}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !716, file: !76, line: 1825, baseType: !724, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!727, !685, !326, !730, !733}
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !191, line: 60, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !357, line: 73, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !357, line: 15, baseType: !114)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !191, line: 55, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !357, line: 72, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !357, line: 16, baseType: !329)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !716, file: !76, line: 1826, baseType: !735, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!727, !685, !317, !730, !733}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "read_iter", scope: !716, file: !76, line: 1827, baseType: !739, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!727, !742, !781}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !76, line: 320, size: 384, elements: !744)
!744 = !{!745, !746, !747, !751, !752, !753, !756, !757}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !743, file: !76, line: 321, baseType: !685, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !743, file: !76, line: 326, baseType: !499, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !743, file: !76, line: 327, baseType: !748, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !742, !114, !114}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !743, file: !76, line: 328, baseType: !185, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !743, file: !76, line: 329, baseType: !296, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !743, file: !76, line: 330, baseType: !754, size: 16, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !202, line: 19, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !204, line: 24, baseType: !347)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !743, file: !76, line: 331, baseType: !754, size: 16, offset: 304)
!757 = !DIDerivedType(tag: DW_TAG_member, scope: !743, file: !76, line: 332, baseType: !758, size: 64, offset: 320)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !743, file: !76, line: 332, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !758, file: !76, line: 333, baseType: !7, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !758, file: !76, line: 334, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !764, line: 569, size: 448, elements: !765)
!764 = !DIFile(filename: "./include/linux/pagemap.h", directory: "/home/lizy2001/genbc/linux")
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !763, file: !764, line: 570, baseType: !619, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bit_nr", scope: !763, file: !764, line: 571, baseType: !296, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !763, file: !764, line: 572, baseType: !769, size: 320, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_entry_t", file: !278, line: 14, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_entry", file: !278, line: 29, size: 320, elements: !771)
!771 = !{!772, !773, !774, !780}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !278, line: 30, baseType: !7, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !770, file: !278, line: 31, baseType: !185, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !770, file: !278, line: 32, baseType: !775, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_func_t", file: !278, line: 16, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!296, !779, !7, !296, !185}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !770, file: !278, line: 33, baseType: !190, size: 128, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !783, line: 29, size: 320, elements: !784)
!783 = !DIFile(filename: "./include/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!784 = !{!785, !786, !787, !788, !813}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !783, line: 35, baseType: !7, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "iov_offset", scope: !782, file: !783, line: 36, baseType: !730, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !782, file: !783, line: 37, baseType: !730, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !783, line: 38, baseType: !789, size: 64, offset: 192)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !782, file: !783, line: 38, size: 64, elements: !790)
!790 = !{!791, !799, !806, !810}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "iov", scope: !789, file: !783, line: 39, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", file: !795, line: 17, size: 128, elements: !796)
!795 = !DIFile(filename: "./include/uapi/linux/uio.h", directory: "/home/lizy2001/genbc/linux")
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !794, file: !795, line: 19, baseType: !185, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !794, file: !795, line: 20, baseType: !731, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "kvec", scope: !789, file: !783, line: 40, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kvec", file: !783, line: 15, size: 128, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !802, file: !783, line: 16, baseType: !185, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !802, file: !783, line: 17, baseType: !730, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bvec", scope: !789, file: !783, line: 41, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_vec", file: !783, line: 41, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pipe", scope: !789, file: !783, line: 42, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "pipe_inode_info", file: !783, line: 13, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, scope: !782, file: !783, line: 44, baseType: !814, size: 64, offset: 256)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !782, file: !783, line: 44, size: 64, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nr_segs", scope: !814, file: !783, line: 45, baseType: !329, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, scope: !814, file: !783, line: 46, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !783, line: 46, size: 64, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !818, file: !783, line: 47, baseType: !7, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "start_head", scope: !818, file: !783, line: 48, baseType: !7, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "write_iter", scope: !716, file: !76, line: 1828, baseType: !739, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "iopoll", scope: !716, file: !76, line: 1829, baseType: !824, size: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!296, !742, !827}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !191, line: 30, baseType: !828)
!828 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "iterate", scope: !716, file: !76, line: 1830, baseType: !830, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!296, !685, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dir_context", file: !76, line: 1776, size: 128, elements: !835)
!835 = !{!836, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "actor", scope: !834, file: !76, line: 1777, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "filldir_t", file: !76, line: 1773, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!296, !833, !317, !296, !499, !411, !7}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !834, file: !76, line: 1778, baseType: !499, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "iterate_shared", scope: !716, file: !76, line: 1831, baseType: !830, size: 64, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !716, file: !76, line: 1832, baseType: !844, size: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{!327, !685, !847}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !849, line: 43, size: 128, elements: !850)
!849 = !DIFile(filename: "./include/linux/poll.h", directory: "/home/lizy2001/genbc/linux")
!850 = !{!851, !857}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_qproc", scope: !848, file: !849, line: 44, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "poll_queue_proc", file: !849, line: 37, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !685, !856, !847}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_key", scope: !848, file: !849, line: 45, baseType: !327, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "unlocked_ioctl", scope: !716, file: !76, line: 1833, baseType: !859, size: 64, offset: 640)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!114, !685, !7, !329}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "compat_ioctl", scope: !716, file: !76, line: 1834, baseType: !859, size: 64, offset: 704)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !716, file: !76, line: 1835, baseType: !864, size: 64, offset: 768)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!296, !685, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !621, line: 305, size: 1472, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !2067, !2073, !2074, !2079, !2080, !2083, !2168, !2169, !2170, !2171, !2172}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !868, file: !621, line: 308, baseType: !329, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !868, file: !621, line: 309, baseType: !329, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !868, file: !621, line: 313, baseType: !867, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !868, file: !621, line: 313, baseType: !867, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !868, file: !621, line: 315, baseType: !654, size: 192, align: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !868, file: !621, line: 323, baseType: !329, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !868, file: !621, line: 327, baseType: !877, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !621, line: 388, size: 7296, elements: !879)
!879 = !{!880, !2065}
!880 = !DIDerivedType(tag: DW_TAG_member, scope: !878, file: !621, line: 389, baseType: !881, size: 7296)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !621, line: 389, size: 7296, elements: !882)
!882 = !{!883, !884, !885, !886, !890, !891, !892, !893, !894, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !936, !944, !947, !971, !972, !2049, !2050, !2053, !2054, !2055, !2058, !2059, !2060, !2063, !2064}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !881, file: !621, line: 390, baseType: !867, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !881, file: !621, line: 391, baseType: !650, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !881, file: !621, line: 392, baseType: !411, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !881, file: !621, line: 394, baseType: !887, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{!329, !685, !329, !329, !329, !329}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !881, file: !621, line: 398, baseType: !329, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !881, file: !621, line: 399, baseType: !329, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !881, file: !621, line: 405, baseType: !329, size: 64, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !881, file: !621, line: 406, baseType: !329, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !881, file: !621, line: 407, baseType: !895, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !611, line: 286, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !611, line: 286, size: 64, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !897, file: !611, line: 286, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !901, line: 18, baseType: !329)
!901 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!902 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !881, file: !621, line: 416, baseType: !292, size: 32, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !881, file: !621, line: 428, baseType: !292, size: 32, offset: 608)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !881, file: !621, line: 437, baseType: !292, size: 32, offset: 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !881, file: !621, line: 447, baseType: !292, size: 32, offset: 672)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !881, file: !621, line: 450, baseType: !230, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !881, file: !621, line: 452, baseType: !296, size: 32, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !881, file: !621, line: 454, baseType: !240, offset: 800)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !881, file: !621, line: 457, baseType: !661, size: 256, offset: 832)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !881, file: !621, line: 459, baseType: !190, size: 128, offset: 1088)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !881, file: !621, line: 466, baseType: !329, size: 64, offset: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !881, file: !621, line: 467, baseType: !329, size: 64, offset: 1280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !881, file: !621, line: 469, baseType: !329, size: 64, offset: 1344)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !881, file: !621, line: 470, baseType: !329, size: 64, offset: 1408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !881, file: !621, line: 471, baseType: !232, size: 64, offset: 1472)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !881, file: !621, line: 472, baseType: !329, size: 64, offset: 1536)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !881, file: !621, line: 473, baseType: !329, size: 64, offset: 1600)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !881, file: !621, line: 474, baseType: !329, size: 64, offset: 1664)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !881, file: !621, line: 475, baseType: !329, size: 64, offset: 1728)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !881, file: !621, line: 477, baseType: !240, offset: 1792)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !881, file: !621, line: 478, baseType: !329, size: 64, offset: 1792)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !881, file: !621, line: 478, baseType: !329, size: 64, offset: 1856)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !881, file: !621, line: 478, baseType: !329, size: 64, offset: 1920)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !881, file: !621, line: 478, baseType: !329, size: 64, offset: 1984)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !881, file: !621, line: 479, baseType: !329, size: 64, offset: 2048)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !881, file: !621, line: 479, baseType: !329, size: 64, offset: 2112)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !881, file: !621, line: 479, baseType: !329, size: 64, offset: 2176)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !881, file: !621, line: 480, baseType: !329, size: 64, offset: 2240)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !881, file: !621, line: 480, baseType: !329, size: 64, offset: 2304)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !881, file: !621, line: 480, baseType: !329, size: 64, offset: 2368)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !881, file: !621, line: 480, baseType: !329, size: 64, offset: 2432)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !881, file: !621, line: 482, baseType: !933, size: 2816, offset: 2496)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 2816, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 44)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !881, file: !621, line: 488, baseType: !937, size: 256, offset: 5312)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !938, line: 60, size: 256, elements: !939)
!938 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !937, file: !938, line: 61, baseType: !941, size: 256)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 256, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 4)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !881, file: !621, line: 490, baseType: !945, size: 64, offset: 5568)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !621, line: 490, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !881, file: !621, line: 493, baseType: !948, size: 896, offset: 5632)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !949, line: 53, baseType: !950)
!949 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !949, line: 13, size: 896, elements: !951)
!951 = !{!952, !953, !954, !955, !958, !959, !960, !961, !965, !966, !967}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !950, file: !949, line: 18, baseType: !411, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !950, file: !949, line: 28, baseType: !232, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !950, file: !949, line: 31, baseType: !661, size: 256, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !950, file: !949, line: 32, baseType: !956, size: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !949, line: 32, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !950, file: !949, line: 37, baseType: !347, size: 16, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !950, file: !949, line: 40, baseType: !226, size: 192, offset: 512)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !950, file: !949, line: 41, baseType: !185, size: 64, offset: 704)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !950, file: !949, line: 42, baseType: !962, size: 64, offset: 768)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !949, line: 42, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !950, file: !949, line: 44, baseType: !292, size: 32, offset: 832)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !950, file: !949, line: 50, baseType: !754, size: 16, offset: 864)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !950, file: !949, line: 51, baseType: !968, size: 16, offset: 880)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !202, line: 18, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !204, line: 23, baseType: !970)
!970 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !881, file: !621, line: 495, baseType: !329, size: 64, offset: 6528)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !881, file: !621, line: 497, baseType: !973, size: 64, offset: 6592)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !621, line: 381, size: 384, elements: !975)
!975 = !{!976, !977, !2048}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !974, file: !621, line: 382, baseType: !292, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !974, file: !621, line: 383, baseType: !978, size: 128, offset: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !621, line: 376, size: 128, elements: !979)
!979 = !{!980, !2046}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !978, file: !621, line: 377, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !983, line: 640, size: 48640, elements: !984)
!983 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!984 = !{!985, !991, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1006, !1024, !1035, !1120, !1121, !1122, !1133, !1134, !1136, !1137, !1138, !1139, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1223, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1255, !1257, !1258, !1259, !1271, !1272, !1273, !1274, !1275, !1276, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1300, !1305, !1491, !1492, !1493, !1494, !1498, !1501, !1504, !1507, !1510, !1513, !1614, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1662, !1663, !1664, !1665, !1666, !1671, !1672, !1673, !1676, !1677, !1680, !1683, !1686, !1689, !1723, !1726, !1727, !1806, !1807, !1810, !1811, !1814, !1815, !1816, !1820, !1821, !1822, !1835, !1836, !1837, !1847, !1852, !1853, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !982, file: !983, line: 646, baseType: !986, size: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !987, line: 56, size: 128, elements: !988)
!987 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !987, line: 57, baseType: !329, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !986, file: !987, line: 58, baseType: !201, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !982, file: !983, line: 649, baseType: !992, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !982, file: !983, line: 657, baseType: !185, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !982, file: !983, line: 658, baseType: !288, size: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !982, file: !983, line: 660, baseType: !7, size: 32, offset: 288)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !982, file: !983, line: 661, baseType: !7, size: 32, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !982, file: !983, line: 684, baseType: !296, size: 32, offset: 352)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !982, file: !983, line: 686, baseType: !296, size: 32, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !982, file: !983, line: 687, baseType: !296, size: 32, offset: 416)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !982, file: !983, line: 688, baseType: !296, size: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !982, file: !983, line: 689, baseType: !7, size: 32, offset: 480)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !982, file: !983, line: 691, baseType: !1003, size: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !983, line: 691, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !982, file: !983, line: 692, baseType: !1007, size: 832, offset: 576)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !983, line: 451, size: 832, elements: !1008)
!1008 = !{!1009, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !1007, file: !983, line: 453, baseType: !1010, size: 128)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !983, line: 325, size: 128, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1010, file: !983, line: 326, baseType: !329, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !1010, file: !983, line: 327, baseType: !201, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !1007, file: !983, line: 454, baseType: !654, size: 192, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !1007, file: !983, line: 455, baseType: !190, size: 128, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !1007, file: !983, line: 456, baseType: !7, size: 32, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !1007, file: !983, line: 458, baseType: !411, size: 64, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !1007, file: !983, line: 459, baseType: !411, size: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !1007, file: !983, line: 460, baseType: !411, size: 64, offset: 640)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !1007, file: !983, line: 461, baseType: !411, size: 64, offset: 704)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !1007, file: !983, line: 463, baseType: !411, size: 64, offset: 768)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !1007, file: !983, line: 465, baseType: !1023, offset: 832)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !983, line: 415, elements: !254)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !982, file: !983, line: 693, baseType: !1025, size: 384, offset: 1408)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !983, line: 489, size: 384, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !1025, file: !983, line: 490, baseType: !190, size: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1025, file: !983, line: 491, baseType: !329, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !1025, file: !983, line: 492, baseType: !329, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !1025, file: !983, line: 493, baseType: !7, size: 32, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !1025, file: !983, line: 494, baseType: !347, size: 16, offset: 288)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !1025, file: !983, line: 495, baseType: !347, size: 16, offset: 304)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !1025, file: !983, line: 497, baseType: !1034, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !982, file: !983, line: 697, baseType: !1036, size: 1792, offset: 1792)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !983, line: 507, size: 1792, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1117, !1118}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1036, file: !983, line: 508, baseType: !654, size: 192, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !1036, file: !983, line: 515, baseType: !411, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !1036, file: !983, line: 516, baseType: !411, size: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !1036, file: !983, line: 517, baseType: !411, size: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !1036, file: !983, line: 518, baseType: !411, size: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !1036, file: !983, line: 519, baseType: !411, size: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !1036, file: !983, line: 526, baseType: !236, size: 64, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !1036, file: !983, line: 527, baseType: !411, size: 64, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !983, line: 528, baseType: !7, size: 32, offset: 640)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !1036, file: !983, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !1036, file: !983, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !1036, file: !983, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !1036, file: !983, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !1036, file: !983, line: 563, baseType: !1052, size: 512, offset: 704)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !52, line: 118, size: 512, elements: !1053)
!1053 = !{!1054, !1062, !1063, !1068, !1111, !1114, !1115, !1116}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1052, file: !52, line: 119, baseType: !1055, size: 256)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !1056, line: 9, size: 256, elements: !1057)
!1056 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1055, file: !1056, line: 10, baseType: !654, size: 192, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !1055, file: !1056, line: 11, baseType: !1060, size: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !1061, line: 29, baseType: !236)
!1061 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !1052, file: !52, line: 120, baseType: !1060, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !1052, file: !52, line: 121, baseType: !1064, size: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!51, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1052, file: !52, line: 122, baseType: !1069, size: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !52, line: 159, size: 512, align: 512, elements: !1071)
!1071 = !{!1072, !1092, !1093, !1096, !1101, !1102, !1106, !1110}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !1070, file: !52, line: 160, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !52, line: 214, size: 4608, align: 512, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1074, file: !52, line: 215, baseType: !667)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !1074, file: !52, line: 216, baseType: !7, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !1074, file: !52, line: 217, baseType: !7, size: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !1074, file: !52, line: 218, baseType: !7, size: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !1074, file: !52, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !1074, file: !52, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !1074, file: !52, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !1074, file: !52, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !1074, file: !52, line: 233, baseType: !1060, size: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !1074, file: !52, line: 234, baseType: !1067, size: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !1074, file: !52, line: 235, baseType: !1060, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !1074, file: !52, line: 236, baseType: !1067, size: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !1074, file: !52, line: 237, baseType: !1089, size: 4096, offset: 512)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 4096, elements: !1090)
!1090 = !{!1091}
!1091 = !DISubrange(count: 8)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1070, file: !52, line: 161, baseType: !7, size: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !1070, file: !52, line: 162, baseType: !1094, size: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !191, line: 27, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !357, line: 96, baseType: !296)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1070, file: !52, line: 163, baseType: !1097, size: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !382, line: 276, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !382, line: 276, size: 32, elements: !1099)
!1099 = !{!1100}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !1098, file: !382, line: 276, baseType: !386, size: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !1070, file: !52, line: 164, baseType: !1067, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1070, file: !52, line: 165, baseType: !1103, size: 128, offset: 256)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !1056, line: 14, size: 128, elements: !1104)
!1104 = !{!1105}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1103, file: !1056, line: 15, baseType: !646, size: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !1070, file: !52, line: 166, baseType: !1107, size: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!1060}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1070, file: !52, line: 167, baseType: !1060, size: 64, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1052, file: !52, line: 123, baseType: !1112, size: 8, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !202, line: 17, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !204, line: 21, baseType: !417)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !1052, file: !52, line: 124, baseType: !1112, size: 8, offset: 456)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !1052, file: !52, line: 125, baseType: !1112, size: 8, offset: 464)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !1052, file: !52, line: 126, baseType: !1112, size: 8, offset: 472)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !1036, file: !983, line: 572, baseType: !1052, size: 512, offset: 1216)
