; ModuleID = '../bcout/drivers/net/ethernet/mellanox/mlxsw/core.llvm.bc'
source_filename = "drivers/net/ethernet/mellanox/mlxsw/core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_mlxsw_core_module_init6:\09\09\09"
module asm ".long\09mlxsw_core_module_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.mlxsw_reg_info = type { i16, i16, i8* }
%struct.workqueue_struct = type opaque

!263 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!264 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!265 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!266 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !255, line: 602, baseType: !7, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274}
!269 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!271 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!272 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!273 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!274 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !255, line: 615, baseType: !7, size: 32, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!278 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!279 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!280 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !255, line: 626, baseType: !7, size: 32, elements: !282)
!282 = !{!283, !284, !285, !286, !287}
!283 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !255, line: 638, baseType: !7, size: 32, elements: !289)
!289 = !{!290, !291}
!290 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!292 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !255, line: 647, baseType: !7, size: 32, elements: !293)
!293 = !{!294, !295}
!294 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !297, line: 54, baseType: !7, size: 32, elements: !298)
!297 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!298 = !{!299, !300, !301, !302}
!299 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!301 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!302 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!303 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !77, line: 423, baseType: !7, size: 32, elements: !304)
!304 = !{!305, !306, !307, !308}
!305 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!306 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!307 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!308 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !310, file: !77, line: 2085, baseType: !7, size: 32, elements: !7382)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !77, line: 1858, size: 15808, elements: !311)
!311 = !{!312, !317, !340, !357, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !374, !382, !383, !384, !385, !386, !387, !388, !389, !390, !416, !426, !427, !428, !433, !434, !438, !441, !6601, !7115, !7119, !7159, !7160, !7161, !7162, !7163, !7164, !7165, !7166, !7167, !7168, !7169, !7170, !7171, !7172, !7173, !7174, !7175, !7176, !7177, !7178, !7179, !7180, !7181, !7182, !7183, !7184, !7185, !7190, !7191, !7192, !7193, !7194, !7195, !7196, !7199, !7202, !7205, !7208, !7211, !7212, !7225, !7226, !7227, !7228, !7229, !7230, !7237, !7238, !7272, !7273, !7274, !7275, !7276, !7277, !7278, !7279, !7280, !7283, !7284, !7285, !7286, !7287, !7288, !7289, !7290, !7291, !7296, !7297, !7298, !7299, !7336, !7337, !7339, !7340, !7344, !7345, !7346, !7347, !7353, !7355, !7358, !7361, !7363, !7364, !7365, !7366, !7367, !7371, !7374}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !77, line: 1859, baseType: !313, size: 128)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 128, elements: !315)
!314 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!315 = !{!316}
!316 = !DISubrange(count: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !310, file: !77, line: 1860, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !77, line: 938, size: 384, elements: !320)
!320 = !{!321, !329, !335, !337}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !319, file: !77, line: 939, baseType: !322, size: 128)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !323, line: 186, size: 128, elements: !324)
!323 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !322, file: !323, line: 187, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !322, file: !323, line: 187, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !319, file: !77, line: 940, baseType: !330, size: 128, offset: 128)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !323, line: 178, size: 128, elements: !331)
!331 = !{!332, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !323, line: 179, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !330, file: !323, line: 179, baseType: !333, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !319, file: !77, line: 941, baseType: !336, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !319, file: !77, line: 942, baseType: !338, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !310, file: !77, line: 1861, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !77, line: 930, size: 128, elements: !343)
!343 = !{!344, !353}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !342, file: !77, line: 931, baseType: !345, size: 128, align: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !323, line: 216, size: 128, align: 64, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !323, line: 217, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !345, file: !323, line: 218, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !348}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !342, file: !77, line: 932, baseType: !354, offset: 128)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: -1)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !310, file: !77, line: 1866, baseType: !358, size: 64, offset: 256)
!358 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !310, file: !77, line: 1867, baseType: !358, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !310, file: !77, line: 1868, baseType: !358, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !310, file: !77, line: 1869, baseType: !78, size: 32, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !77, line: 1877, baseType: !358, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !310, file: !77, line: 1879, baseType: !330, size: 128, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !310, file: !77, line: 1880, baseType: !330, size: 128, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !310, file: !77, line: 1881, baseType: !330, size: 128, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !310, file: !77, line: 1882, baseType: !330, size: 128, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !310, file: !77, line: 1883, baseType: !330, size: 128, offset: 1088)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !310, file: !77, line: 1884, baseType: !330, size: 128, offset: 1216)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !310, file: !77, line: 1889, baseType: !370, size: 256, offset: 1344)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !310, file: !77, line: 1886, size: 256, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !370, file: !77, line: 1887, baseType: !330, size: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !370, file: !77, line: 1888, baseType: !330, size: 128, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !310, file: !77, line: 1891, baseType: !375, size: 64, offset: 1600)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !376, line: 12, baseType: !377)
!376 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !378, line: 23, baseType: !379)
!378 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !380, line: 31, baseType: !381)
!380 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!381 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !310, file: !77, line: 1892, baseType: !375, size: 64, offset: 1664)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !310, file: !77, line: 1893, baseType: !375, size: 64, offset: 1728)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !310, file: !77, line: 1894, baseType: !375, size: 64, offset: 1792)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !310, file: !77, line: 1895, baseType: !375, size: 64, offset: 1856)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !310, file: !77, line: 1896, baseType: !375, size: 64, offset: 1920)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !310, file: !77, line: 1897, baseType: !375, size: 64, offset: 1984)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !310, file: !77, line: 1899, baseType: !78, size: 32, offset: 2048)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !310, file: !77, line: 1900, baseType: !78, size: 32, offset: 2080)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !310, file: !77, line: 1902, baseType: !391, size: 1472, offset: 2112)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !77, line: 169, size: 1472, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !391, file: !77, line: 170, baseType: !358, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !391, file: !77, line: 171, baseType: !358, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !391, file: !77, line: 172, baseType: !358, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !391, file: !77, line: 173, baseType: !358, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !391, file: !77, line: 174, baseType: !358, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !391, file: !77, line: 175, baseType: !358, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !391, file: !77, line: 176, baseType: !358, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !391, file: !77, line: 177, baseType: !358, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !391, file: !77, line: 178, baseType: !358, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !391, file: !77, line: 179, baseType: !358, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !391, file: !77, line: 180, baseType: !358, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !391, file: !77, line: 181, baseType: !358, size: 64, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !391, file: !77, line: 182, baseType: !358, size: 64, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !391, file: !77, line: 183, baseType: !358, size: 64, offset: 832)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !391, file: !77, line: 184, baseType: !358, size: 64, offset: 896)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !391, file: !77, line: 185, baseType: !358, size: 64, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !391, file: !77, line: 186, baseType: !358, size: 64, offset: 1024)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !391, file: !77, line: 187, baseType: !358, size: 64, offset: 1088)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !391, file: !77, line: 188, baseType: !358, size: 64, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !391, file: !77, line: 189, baseType: !358, size: 64, offset: 1216)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !391, file: !77, line: 190, baseType: !358, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !391, file: !77, line: 191, baseType: !358, size: 64, offset: 1344)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !391, file: !77, line: 192, baseType: !358, size: 64, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !310, file: !77, line: 1904, baseType: !417, size: 64, offset: 3584)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !418, line: 13, baseType: !419)
!418 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !323, line: 175, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 173, size: 64, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !420, file: !323, line: 174, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !378, line: 22, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !380, line: 30, baseType: !425)
!425 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !310, file: !77, line: 1905, baseType: !417, size: 64, offset: 3648)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !310, file: !77, line: 1906, baseType: !417, size: 64, offset: 3712)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !310, file: !77, line: 1909, baseType: !429, size: 32, offset: 3776)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !323, line: 168, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 166, size: 32, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !430, file: !323, line: 167, baseType: !78, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !310, file: !77, line: 1910, baseType: !429, size: 32, offset: 3808)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !310, file: !77, line: 1913, baseType: !435, size: 64, offset: 3840)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !77, line: 1913, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !310, file: !77, line: 1914, baseType: !439, size: 64, offset: 3904)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !77, line: 1914, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !310, file: !77, line: 1916, baseType: !442, size: 64, offset: 3968)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !77, line: 1283, size: 4416, elements: !445)
!445 = !{!446, !450, !454, !455, !456, !619, !623, !628, !632, !633, !638, !639, !762, !767, !771, !777, !781, !813, !821, !825, !830, !834, !835, !841, !845, !849, !853, !854, !876, !880, !895, !906, !910, !919, !923, !924, !928, !949, !953, !957, !961, !965, !972, !976, !994, !998, !1048, !1052, !1057, !1061, !1065, !1069, !1079, !1080, !1089, !1095, !1096, !1100, !1104, !1108, !1112, !1113, !1117, !1118, !5524, !5544, !5548, !6591, !6597}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !444, file: !77, line: 1284, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!78, !336}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !444, file: !77, line: 1285, baseType: !451, size: 64, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !336}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !444, file: !77, line: 1286, baseType: !447, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !444, file: !77, line: 1287, baseType: !447, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !444, file: !77, line: 1288, baseType: !457, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!460, !461, !336}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !77, line: 120, baseType: !76)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !463, line: 713, size: 1600, elements: !464)
!463 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!464 = !{!465, !487, !495, !502, !506, !518, !519, !520, !523, !524, !525, !531, !532, !533, !534, !535, !536, !537, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !577, !578, !579, !580, !582, !583, !588, !593, !598, !599, !600, !601, !602, !603, !604, !605, !606, !608, !609, !611, !612, !613}
!465 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 714, baseType: !466, size: 192)
!466 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 714, size: 192, elements: !467)
!467 = !{!468, !478, !486}
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !466, file: !463, line: 715, baseType: !469, size: 192)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !466, file: !463, line: 715, size: 192, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !463, line: 717, baseType: !461, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !469, file: !463, line: 718, baseType: !461, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !463, line: 720, baseType: !474, size: 64, offset: 128)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !469, file: !463, line: 720, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !474, file: !463, line: 721, baseType: !336, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !474, file: !463, line: 726, baseType: !358, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !466, file: !463, line: 729, baseType: !479, size: 192, align: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !480, line: 24, size: 192, align: 64, elements: !481)
!480 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!481 = !{!482, !483, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !479, file: !480, line: 25, baseType: !358, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !479, file: !480, line: 26, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !479, file: !480, line: 27, baseType: !484, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !466, file: !463, line: 730, baseType: !330, size: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 733, baseType: !488, size: 64, offset: 192)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 733, size: 64, elements: !489)
!489 = !{!490, !494}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !488, file: !463, line: 734, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !493, line: 19, flags: DIFlagFwdDecl)
!493 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !488, file: !463, line: 735, baseType: !78, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 738, baseType: !496, size: 64, offset: 256)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 738, size: 64, elements: !497)
!497 = !{!498, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !496, file: !463, line: 739, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !500, line: 29, baseType: !423)
!500 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!501 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !496, file: !463, line: 740, baseType: !377, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !462, file: !463, line: 748, baseType: !503, size: 384, align: 64, offset: 320)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 384, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 48)
!506 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 750, baseType: !507, size: 128, offset: 704)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 750, size: 128, elements: !508)
!508 = !{!509, !517}
!509 = !DIDerivedType(tag: DW_TAG_member, scope: !507, file: !463, line: 751, baseType: !510, size: 128)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !463, line: 751, size: 128, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !510, file: !463, line: 752, baseType: !358, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !510, file: !463, line: 753, baseType: !514, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !461}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !507, file: !463, line: 755, baseType: !330, size: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !462, file: !463, line: 761, baseType: !7, size: 32, offset: 832)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !462, file: !463, line: 762, baseType: !7, size: 32, offset: 864)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !462, file: !463, line: 763, baseType: !521, size: 16, offset: 896)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !380, line: 24, baseType: !522)
!522 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !462, file: !463, line: 764, baseType: !521, size: 16, offset: 912)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !462, file: !463, line: 769, baseType: !521, size: 16, offset: 928)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !462, file: !463, line: 780, baseType: !526, offset: 944)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, elements: !529)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !380, line: 21, baseType: !528)
!528 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!529 = !{!530}
!530 = !DISubrange(count: 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !462, file: !463, line: 782, baseType: !527, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !462, file: !463, line: 783, baseType: !527, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !462, file: !463, line: 784, baseType: !527, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !462, file: !463, line: 785, baseType: !527, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !462, file: !463, line: 786, baseType: !527, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !462, file: !463, line: 787, baseType: !527, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !462, file: !463, line: 795, baseType: !538, offset: 960)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, elements: !529)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !380, line: 27, baseType: !7)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !462, file: !463, line: 807, baseType: !526, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !462, file: !463, line: 809, baseType: !527, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !462, file: !463, line: 810, baseType: !527, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !462, file: !463, line: 811, baseType: !527, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !462, file: !463, line: 812, baseType: !527, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !462, file: !463, line: 813, baseType: !527, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !462, file: !463, line: 815, baseType: !527, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !462, file: !463, line: 816, baseType: !527, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !462, file: !463, line: 817, baseType: !527, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !462, file: !463, line: 818, baseType: !527, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !462, file: !463, line: 819, baseType: !527, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !462, file: !463, line: 821, baseType: !527, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !462, file: !463, line: 822, baseType: !527, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !462, file: !463, line: 823, baseType: !527, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !462, file: !463, line: 832, baseType: !526, offset: 976)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !462, file: !463, line: 834, baseType: !527, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !462, file: !463, line: 835, baseType: !527, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !462, file: !463, line: 836, baseType: !527, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !462, file: !463, line: 837, baseType: !527, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !462, file: !463, line: 838, baseType: !527, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !462, file: !463, line: 840, baseType: !527, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !462, file: !463, line: 843, baseType: !527, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !462, file: !463, line: 844, baseType: !527, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !462, file: !463, line: 845, baseType: !527, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !462, file: !463, line: 847, baseType: !527, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !462, file: !463, line: 848, baseType: !527, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!566 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 866, baseType: !567, size: 32, offset: 992)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 866, size: 32, elements: !568)
!568 = !{!569, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !567, file: !463, line: 867, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !571, line: 37, baseType: !539)
!571 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!572 = !DIDerivedType(tag: DW_TAG_member, scope: !567, file: !463, line: 868, baseType: !573, size: 32)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !567, file: !463, line: 868, size: 32, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !573, file: !463, line: 869, baseType: !521, size: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !573, file: !463, line: 870, baseType: !521, size: 16, offset: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !462, file: !463, line: 873, baseType: !539, size: 32, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !462, file: !463, line: 874, baseType: !78, size: 32, offset: 1056)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !462, file: !463, line: 875, baseType: !539, size: 32, offset: 1088)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !462, file: !463, line: 876, baseType: !581, size: 16, offset: 1120)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !571, line: 30, baseType: !521)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !462, file: !463, line: 877, baseType: !521, size: 16, offset: 1136)
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 879, baseType: !584, size: 32, offset: 1152)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 879, size: 32, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !584, file: !463, line: 880, baseType: !7, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !584, file: !463, line: 881, baseType: !7, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 888, baseType: !589, size: 32, offset: 1184)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 888, size: 32, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !589, file: !463, line: 889, baseType: !539, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !589, file: !463, line: 890, baseType: !539, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !463, line: 893, baseType: !594, size: 16, offset: 1216)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !463, line: 893, size: 16, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !594, file: !463, line: 894, baseType: !581, size: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !594, file: !463, line: 895, baseType: !527, size: 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !462, file: !463, line: 898, baseType: !521, size: 16, offset: 1232)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !462, file: !463, line: 899, baseType: !521, size: 16, offset: 1248)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !462, file: !463, line: 900, baseType: !521, size: 16, offset: 1264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !462, file: !463, line: 902, baseType: !581, size: 16, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !462, file: !463, line: 903, baseType: !521, size: 16, offset: 1296)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !462, file: !463, line: 904, baseType: !521, size: 16, offset: 1312)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !462, file: !463, line: 905, baseType: !521, size: 16, offset: 1328)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !462, file: !463, line: 908, baseType: !538, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !462, file: !463, line: 912, baseType: !607, size: 32, offset: 1344)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !463, line: 606, baseType: !7)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !462, file: !463, line: 913, baseType: !607, size: 32, offset: 1376)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !462, file: !463, line: 914, baseType: !610, size: 64, offset: 1408)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !462, file: !463, line: 915, baseType: !610, size: 64, offset: 1472)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !462, file: !463, line: 916, baseType: !7, size: 32, offset: 1536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !462, file: !463, line: 917, baseType: !614, size: 32, offset: 1568)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !615, line: 113, baseType: !616)
!615 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !615, line: 111, size: 32, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !616, file: !615, line: 112, baseType: !429, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !444, file: !77, line: 1290, baseType: !620, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!375, !461, !336, !375}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !444, file: !77, line: 1293, baseType: !624, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{!627, !336, !461, !336}
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !378, line: 19, baseType: !521)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !444, file: !77, line: 1296, baseType: !629, size: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !336, !78}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !444, file: !77, line: 1298, baseType: !451, size: 64, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !444, file: !77, line: 1299, baseType: !634, size: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!78, !336, !637}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !444, file: !77, line: 1301, baseType: !447, size: 64, offset: 640)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !444, file: !77, line: 1302, baseType: !640, size: 64, offset: 704)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!78, !336, !643, !78}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !645, line: 234, size: 320, elements: !646)
!645 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!646 = !{!647, !651}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !644, file: !645, line: 239, baseType: !648, size: 128)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !645, line: 236, size: 128, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !648, file: !645, line: 238, baseType: !313, size: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !644, file: !645, line: 255, baseType: !652, size: 192, offset: 128)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !645, line: 241, size: 192, elements: !653)
!653 = !{!654, !666, !667, !668, !669, !670, !672, !673, !674, !683, !684, !685, !686}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !652, file: !645, line: 242, baseType: !655, size: 128)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !656, line: 32, size: 128, elements: !657)
!656 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!657 = !{!658, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !655, file: !656, line: 33, baseType: !659, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !656, line: 26, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !661, line: 10, baseType: !522)
!661 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !655, file: !656, line: 34, baseType: !663, size: 112, offset: 16)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 112, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 14)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !652, file: !645, line: 243, baseType: !655, size: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !652, file: !645, line: 244, baseType: !655, size: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !652, file: !645, line: 245, baseType: !655, size: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !652, file: !645, line: 246, baseType: !655, size: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !652, file: !645, line: 247, baseType: !671, size: 16)
!671 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !652, file: !645, line: 248, baseType: !78, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !652, file: !645, line: 249, baseType: !78, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !652, file: !645, line: 250, baseType: !675, size: 192)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !645, line: 196, size: 192, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !675, file: !645, line: 197, baseType: !358, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !675, file: !645, line: 198, baseType: !358, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !675, file: !645, line: 199, baseType: !522, size: 16, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !675, file: !645, line: 200, baseType: !528, size: 8, offset: 144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !675, file: !645, line: 201, baseType: !528, size: 8, offset: 152)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !675, file: !645, line: 202, baseType: !528, size: 8, offset: 160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !652, file: !645, line: 251, baseType: !313, size: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !652, file: !645, line: 252, baseType: !313, size: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !652, file: !645, line: 253, baseType: !637, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !652, file: !645, line: 254, baseType: !687, size: 128)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !645, line: 207, size: 128, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !645, line: 208, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !687, file: !645, line: 209, baseType: !7, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !687, file: !645, line: 222, baseType: !692, size: 64, offset: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !687, file: !645, line: 210, size: 64, elements: !693)
!693 = !{!694, !702, !709, !721, !727, !734, !745, !753}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !692, file: !645, line: 212, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !697, line: 56, baseType: !698)
!697 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 53, size: 32, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !698, file: !697, line: 54, baseType: !522, size: 16)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !698, file: !697, line: 55, baseType: !522, size: 16, offset: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !692, file: !645, line: 213, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !697, line: 80, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 77, size: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !705, file: !697, line: 78, baseType: !7, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !705, file: !697, line: 79, baseType: !7, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !692, file: !645, line: 214, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !697, line: 66, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 58, size: 192, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !712, file: !697, line: 59, baseType: !7, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !712, file: !697, line: 60, baseType: !7, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !712, file: !697, line: 61, baseType: !7, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !712, file: !697, line: 62, baseType: !7, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !712, file: !697, line: 63, baseType: !7, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !712, file: !697, line: 64, baseType: !522, size: 16, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !712, file: !697, line: 65, baseType: !522, size: 16, offset: 176)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !692, file: !645, line: 215, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !697, line: 70, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 68, size: 32, elements: !725)
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !724, file: !697, line: 69, baseType: !7, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !692, file: !645, line: 216, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !697, line: 75, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 72, size: 160, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !730, file: !697, line: 73, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !730, file: !697, line: 74, baseType: !313, size: 128, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !692, file: !645, line: 217, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !697, line: 89, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 82, size: 192, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !737, file: !697, line: 83, baseType: !522, size: 16)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !737, file: !697, line: 84, baseType: !7, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !737, file: !697, line: 85, baseType: !7, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !737, file: !697, line: 86, baseType: !7, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !737, file: !697, line: 87, baseType: !7, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !737, file: !697, line: 88, baseType: !7, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !692, file: !645, line: 220, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !697, line: 44, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 40, size: 96, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !748, file: !697, line: 41, baseType: !7, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !748, file: !697, line: 42, baseType: !7, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !748, file: !697, line: 43, baseType: !522, size: 16, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !692, file: !645, line: 221, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !697, line: 51, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 46, size: 128, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !756, file: !697, line: 47, baseType: !7, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !756, file: !697, line: 48, baseType: !7, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !756, file: !697, line: 49, baseType: !522, size: 16, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !756, file: !697, line: 50, baseType: !7, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !444, file: !77, line: 1304, baseType: !763, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!78, !336, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !444, file: !77, line: 1306, baseType: !768, size: 64, offset: 832)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{!78, !336, !78}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !444, file: !77, line: 1308, baseType: !772, size: 64, offset: 896)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!78, !336, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !77, line: 206, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !444, file: !77, line: 1310, baseType: !778, size: 64, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !336, !7}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !444, file: !77, line: 1313, baseType: !782, size: 64, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !336, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !787, line: 214, size: 1536, elements: !788)
!787 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !786, file: !787, line: 215, baseType: !379, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !786, file: !787, line: 216, baseType: !379, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !786, file: !787, line: 217, baseType: !379, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !786, file: !787, line: 218, baseType: !379, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !786, file: !787, line: 219, baseType: !379, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !786, file: !787, line: 220, baseType: !379, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !786, file: !787, line: 221, baseType: !379, size: 64, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !786, file: !787, line: 222, baseType: !379, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !786, file: !787, line: 223, baseType: !379, size: 64, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !786, file: !787, line: 224, baseType: !379, size: 64, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !786, file: !787, line: 227, baseType: !379, size: 64, offset: 640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !786, file: !787, line: 228, baseType: !379, size: 64, offset: 704)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !786, file: !787, line: 229, baseType: !379, size: 64, offset: 768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !786, file: !787, line: 230, baseType: !379, size: 64, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !786, file: !787, line: 231, baseType: !379, size: 64, offset: 896)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !786, file: !787, line: 232, baseType: !379, size: 64, offset: 960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !786, file: !787, line: 235, baseType: !379, size: 64, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !786, file: !787, line: 236, baseType: !379, size: 64, offset: 1088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !786, file: !787, line: 237, baseType: !379, size: 64, offset: 1152)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !786, file: !787, line: 238, baseType: !379, size: 64, offset: 1216)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !786, file: !787, line: 239, baseType: !379, size: 64, offset: 1280)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !786, file: !787, line: 242, baseType: !379, size: 64, offset: 1344)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !786, file: !787, line: 243, baseType: !379, size: 64, offset: 1408)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !786, file: !787, line: 244, baseType: !379, size: 64, offset: 1472)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !444, file: !77, line: 1315, baseType: !814, size: 64, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !819, !78}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !323, line: 30, baseType: !818)
!818 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !444, file: !77, line: 1316, baseType: !822, size: 64, offset: 1152)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!78, !78, !819, !637}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !444, file: !77, line: 1319, baseType: !826, size: 64, offset: 1216)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!829, !336}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !444, file: !77, line: 1321, baseType: !831, size: 64, offset: 1280)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!78, !336, !581, !627}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !444, file: !77, line: 1323, baseType: !831, size: 64, offset: 1344)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !444, file: !77, line: 1331, baseType: !836, size: 64, offset: 1408)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!78, !336, !78, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !378, line: 17, baseType: !527)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !444, file: !77, line: 1333, baseType: !842, size: 64, offset: 1472)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!78, !336, !78, !627, !840, !581}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !444, file: !77, line: 1336, baseType: !846, size: 64, offset: 1536)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!78, !336, !78, !78, !78}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !444, file: !77, line: 1339, baseType: !850, size: 64, offset: 1600)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!78, !336, !78, !817}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !444, file: !77, line: 1341, baseType: !850, size: 64, offset: 1664)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !444, file: !77, line: 1343, baseType: !855, size: 64, offset: 1728)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!78, !336, !78, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !860, line: 20, size: 576, elements: !861)
!860 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!861 = !{!862, !863, !867, !868, !869, !870, !871, !872, !873, !874, !875}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !859, file: !860, line: 21, baseType: !539, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !859, file: !860, line: 22, baseType: !864, size: 256, offset: 32)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 256, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !859, file: !860, line: 23, baseType: !539, size: 32, offset: 288)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !859, file: !860, line: 24, baseType: !539, size: 32, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !859, file: !860, line: 25, baseType: !539, size: 32, offset: 352)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !859, file: !860, line: 26, baseType: !539, size: 32, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !859, file: !860, line: 27, baseType: !539, size: 32, offset: 416)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !859, file: !860, line: 28, baseType: !539, size: 32, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !859, file: !860, line: 29, baseType: !539, size: 32, offset: 480)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !859, file: !860, line: 30, baseType: !539, size: 32, offset: 512)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !859, file: !860, line: 31, baseType: !581, size: 16, offset: 544)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !444, file: !77, line: 1346, baseType: !877, size: 64, offset: 1792)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!78, !336, !78, !78}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !444, file: !77, line: 1348, baseType: !881, size: 64, offset: 1856)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!78, !336, !78, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !860, line: 9, size: 512, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !885, file: !860, line: 10, baseType: !379, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !885, file: !860, line: 11, baseType: !379, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !885, file: !860, line: 12, baseType: !379, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !885, file: !860, line: 13, baseType: !379, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !885, file: !860, line: 14, baseType: !379, size: 64, offset: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !885, file: !860, line: 15, baseType: !379, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !885, file: !860, line: 16, baseType: !379, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !885, file: !860, line: 17, baseType: !379, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !444, file: !77, line: 1352, baseType: !896, size: 64, offset: 1920)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!78, !336, !78, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !902, line: 213, size: 32, elements: !903)
!902 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !901, file: !902, line: 214, baseType: !521, size: 16)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !901, file: !902, line: 215, baseType: !521, size: 16, offset: 16)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !444, file: !77, line: 1355, baseType: !907, size: 64, offset: 1984)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!78, !336, !78, !461}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !444, file: !77, line: 1357, baseType: !911, size: 64, offset: 2048)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!78, !336, !78, !914, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !787, line: 956, size: 128, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !915, file: !787, line: 957, baseType: !539, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !915, file: !787, line: 958, baseType: !379, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !444, file: !77, line: 1361, baseType: !920, size: 64, offset: 2112)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!78, !336, !78, !377, !78}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !444, file: !77, line: 1364, baseType: !850, size: 64, offset: 2176)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !444, file: !77, line: 1367, baseType: !925, size: 64, offset: 2240)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!78, !336, !83, !637}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !444, file: !77, line: 1400, baseType: !929, size: 64, offset: 2304)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!78, !336, !336, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !934, line: 75, size: 384, elements: !935)
!934 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!935 = !{!936, !937, !940, !944, !948}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !933, file: !934, line: 76, baseType: !338, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !933, file: !934, line: 77, baseType: !938, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !933, file: !934, line: 78, baseType: !941, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !934, line: 78, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !933, file: !934, line: 79, baseType: !945, size: 160, offset: 192)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 160, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 20)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !933, file: !934, line: 80, baseType: !840, size: 8, offset: 352)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !444, file: !77, line: 1403, baseType: !950, size: 64, offset: 2368)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!78, !336, !336}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !444, file: !77, line: 1405, baseType: !954, size: 64, offset: 2432)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{!336, !336, !461, !817}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !444, file: !77, line: 1408, baseType: !958, size: 64, offset: 2496)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!375, !336, !375}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !444, file: !77, line: 1410, baseType: !962, size: 64, offset: 2560)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!78, !336, !375}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !444, file: !77, line: 1412, baseType: !966, size: 64, offset: 2624)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!78, !336, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !971, line: 35, flags: DIFlagFwdDecl)
!971 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !444, file: !77, line: 1414, baseType: !973, size: 64, offset: 2688)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !336, !969}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !444, file: !77, line: 1417, baseType: !977, size: 64, offset: 2752)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!78, !980, !899, !336, !992, !627, !627, !932}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !982, line: 8, size: 96, elements: !983)
!982 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!983 = !{!984, !985, !986, !987, !989, !990, !991}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !981, file: !982, line: 9, baseType: !527, size: 8)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !981, file: !982, line: 10, baseType: !527, size: 8, offset: 8)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !981, file: !982, line: 11, baseType: !521, size: 16, offset: 16)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !981, file: !982, line: 12, baseType: !988, size: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !380, line: 26, baseType: !78)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !981, file: !982, line: 13, baseType: !521, size: 16, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !981, file: !982, line: 14, baseType: !527, size: 8, offset: 80)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !981, file: !982, line: 15, baseType: !527, size: 8, offset: 88)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !444, file: !77, line: 1424, baseType: !995, size: 64, offset: 2816)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!78, !980, !899, !336, !992, !627}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !444, file: !77, line: 1429, baseType: !999, size: 64, offset: 2880)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!78, !461, !1002, !336, !336, !1047}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !934, line: 203, size: 1024, elements: !1004)
!1004 = !{!1005, !1006, !1016, !1020, !1024, !1025, !1029, !1030, !1031, !1032, !1034, !1035, !1036, !1037}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1003, file: !934, line: 204, baseType: !461, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1003, file: !934, line: 205, baseType: !1007, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !902, line: 44, size: 128, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1009, file: !902, line: 45, baseType: !539, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1009, file: !902, line: 46, baseType: !521, size: 16, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1009, file: !902, line: 47, baseType: !521, size: 16, offset: 48)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1009, file: !902, line: 48, baseType: !539, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1009, file: !902, line: 49, baseType: !539, size: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1003, file: !934, line: 206, baseType: !1017, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!78, !461, !1002}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1003, file: !934, line: 208, baseType: !1021, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!78, !1002}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1003, file: !934, line: 209, baseType: !637, size: 64, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1003, file: !934, line: 211, baseType: !1026, size: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1028, line: 76, flags: DIFlagFwdDecl)
!1028 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1003, file: !934, line: 212, baseType: !932, size: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1003, file: !934, line: 213, baseType: !627, size: 16, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1003, file: !934, line: 214, baseType: !627, size: 16, offset: 464)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1003, file: !934, line: 215, baseType: !1033, size: 32, offset: 480)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !378, line: 21, baseType: !539)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1003, file: !934, line: 216, baseType: !7, size: 32, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1003, file: !934, line: 216, baseType: !7, size: 32, offset: 544)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1003, file: !934, line: 217, baseType: !817, size: 8, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_member, scope: !1003, file: !934, line: 218, baseType: !1038, size: 384, offset: 640)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1003, file: !934, line: 218, size: 384, elements: !1039)
!1039 = !{!1040, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1038, file: !934, line: 219, baseType: !1041, size: 384)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 384, elements: !504)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1038, file: !934, line: 224, baseType: !1043, size: 384)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 384, elements: !1045)
!1044 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1045 = !{!1046}
!1046 = !DISubrange(count: 6)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !444, file: !77, line: 1434, baseType: !1049, size: 64, offset: 2944)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!78, !461, !899, !336, !992, !627, !1033, !1033, !932}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !444, file: !77, line: 1440, baseType: !1053, size: 64, offset: 3008)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!78, !336, !1056, !627, !932}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !444, file: !77, line: 1444, baseType: !1058, size: 64, offset: 3072)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!78, !461, !1033, !1033, !336, !1033, !78}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !444, file: !77, line: 1449, baseType: !1062, size: 64, offset: 3136)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!78, !336, !1056, !627}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !444, file: !77, line: 1452, baseType: !1066, size: 64, offset: 3200)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!78, !336, !817}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !444, file: !77, line: 1454, baseType: !1070, size: 64, offset: 3264)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!78, !336, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !77, line: 820, size: 264, elements: !1075)
!1075 = !{!1076, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1074, file: !77, line: 821, baseType: !1077, size: 256)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 256, elements: !865)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1074, file: !77, line: 822, baseType: !528, size: 8, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !444, file: !77, line: 1456, baseType: !1070, size: 64, offset: 3328)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !444, file: !77, line: 1458, baseType: !1081, size: 64, offset: 3392)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!78, !336, !1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !323, line: 55, baseType: !1086)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1087, line: 72, baseType: !1088)
!1087 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1087, line: 16, baseType: !358)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !444, file: !77, line: 1460, baseType: !1090, size: 64, offset: 3456)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{null, !336, !1093}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !77, line: 67, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !444, file: !77, line: 1462, baseType: !1090, size: 64, offset: 3520)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !444, file: !77, line: 1464, baseType: !1097, size: 64, offset: 3584)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!637, !336, !336}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !444, file: !77, line: 1466, baseType: !1101, size: 64, offset: 3648)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{null, !336, !637}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !444, file: !77, line: 1469, baseType: !1105, size: 64, offset: 3712)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!78, !336, !78, !1033}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !444, file: !77, line: 1472, baseType: !1109, size: 64, offset: 3776)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!78, !819}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !444, file: !77, line: 1473, baseType: !1066, size: 64, offset: 3840)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !444, file: !77, line: 1475, baseType: !1114, size: 64, offset: 3904)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!78, !336, !461}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !444, file: !77, line: 1477, baseType: !629, size: 64, offset: 3968)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !444, file: !77, line: 1479, baseType: !1119, size: 64, offset: 4032)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!78, !336, !1122}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !77, line: 894, size: 256, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1123, file: !77, line: 895, baseType: !103, size: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, scope: !1123, file: !77, line: 896, baseType: !1127, size: 192, offset: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1123, file: !77, line: 896, size: 192, elements: !1128)
!1128 = !{!1129, !1138, !5517}
!1129 = !DIDerivedType(tag: DW_TAG_member, scope: !1127, file: !77, line: 898, baseType: !1130, size: 192)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1127, file: !77, line: 898, size: 192, elements: !1131)
!1131 = !{!1132, !1133, !1137}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1130, file: !77, line: 899, baseType: !1033, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1130, file: !77, line: 900, baseType: !1134, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1136, line: 11, flags: DIFlagFwdDecl)
!1136 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1130, file: !77, line: 901, baseType: !932, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, scope: !1127, file: !77, line: 904, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1127, file: !77, line: 904, size: 64, elements: !1140)
!1140 = !{!1141}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1139, file: !77, line: 905, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !111, line: 222, size: 2560, elements: !1144)
!1144 = !{!1145, !5496, !5497, !5515, !5516}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1143, file: !111, line: 223, baseType: !1146, size: 2048)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !111, line: 141, size: 2048, elements: !1147)
!1147 = !{!1148, !5470, !5471, !5472, !5473, !5474, !5475, !5476, !5477, !5478, !5479, !5480, !5481, !5482, !5487, !5488, !5489, !5490, !5491, !5492, !5493, !5494, !5495}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1146, file: !111, line: 145, baseType: !1149, size: 64, align: 512)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !111, line: 54, size: 2368, elements: !1152)
!1152 = !{!1153, !1352, !1357, !5142, !5146, !5150, !5151, !5155, !5161, !5162, !5163, !5164, !5165, !5169, !5173, !5177, !5178, !5179, !5183, !5184, !5196, !5200, !5204, !5216, !5405, !5409, !5413, !5418, !5422, !5426, !5430, !5436, !5440, !5447, !5451, !5453, !5454}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1151, file: !111, line: 56, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!78, !1157}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !142, line: 483, size: 960, align: 64, elements: !1159)
!1159 = !{!1160, !1176, !1187, !1198, !1222, !1228, !1236, !1253, !1266, !1272, !1281, !1286, !1294, !1306, !1326, !1333, !1337, !1341, !1346}
!1160 = !DIDerivedType(tag: DW_TAG_member, scope: !1158, file: !142, line: 484, baseType: !1161, size: 512)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1158, file: !142, line: 484, size: 512, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1161, file: !142, line: 485, baseType: !539, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1161, file: !142, line: 486, baseType: !539, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1161, file: !142, line: 487, baseType: !539, size: 32, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1161, file: !142, line: 488, baseType: !539, size: 32, offset: 96)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1161, file: !142, line: 489, baseType: !539, size: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1161, file: !142, line: 492, baseType: !539, size: 32, offset: 160)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1161, file: !142, line: 493, baseType: !539, size: 32, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1161, file: !142, line: 496, baseType: !313, size: 128, offset: 224)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1161, file: !142, line: 497, baseType: !539, size: 32, offset: 352)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1161, file: !142, line: 498, baseType: !539, size: 32, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1161, file: !142, line: 499, baseType: !539, size: 32, offset: 416)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1161, file: !142, line: 500, baseType: !539, size: 32, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1161, file: !142, line: 501, baseType: !539, size: 32, offset: 480)
!1176 = !DIDerivedType(tag: DW_TAG_member, scope: !1158, file: !142, line: 507, baseType: !1177, size: 256)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1158, file: !142, line: 507, size: 256, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1186}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1177, file: !142, line: 508, baseType: !539, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1177, file: !142, line: 509, baseType: !379, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, scope: !1177, file: !142, line: 510, baseType: !1182, size: 64, offset: 128)
!1182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1177, file: !142, line: 510, size: 64, elements: !1183)
!1183 = !{!1184, !1185}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1182, file: !142, line: 511, baseType: !379, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1182, file: !142, line: 512, baseType: !379, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !142, line: 514, baseType: !379, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1158, file: !142, line: 532, baseType: !1188, size: 448)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1158, file: !142, line: 517, size: 448, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1188, file: !142, line: 518, baseType: !379, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1188, file: !142, line: 521, baseType: !379, size: 64, align: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1188, file: !142, line: 522, baseType: !379, size: 64, align: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1188, file: !142, line: 523, baseType: !379, size: 64, align: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1188, file: !142, line: 524, baseType: !539, size: 32, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1188, file: !142, line: 529, baseType: !539, size: 32, offset: 288)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1188, file: !142, line: 530, baseType: !379, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1188, file: !142, line: 531, baseType: !379, size: 64, offset: 384)
!1198 = !DIDerivedType(tag: DW_TAG_member, scope: !1158, file: !142, line: 534, baseType: !1199, size: 960)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1158, file: !142, line: 534, size: 960, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1199, file: !142, line: 535, baseType: !539, size: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1199, file: !142, line: 536, baseType: !539, size: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1199, file: !142, line: 537, baseType: !379, size: 64, align: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1199, file: !142, line: 538, baseType: !379, size: 64, align: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1199, file: !142, line: 539, baseType: !539, size: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1199, file: !142, line: 540, baseType: !539, size: 32, offset: 224)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1199, file: !142, line: 541, baseType: !379, size: 64, align: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1199, file: !142, line: 542, baseType: !539, size: 32, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1199, file: !142, line: 543, baseType: !539, size: 32, offset: 352)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1199, file: !142, line: 544, baseType: !313, size: 128, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1199, file: !142, line: 545, baseType: !539, size: 32, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1199, file: !142, line: 550, baseType: !539, size: 32, offset: 544)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1199, file: !142, line: 551, baseType: !539, size: 32, offset: 576)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1199, file: !142, line: 552, baseType: !539, size: 32, offset: 608)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1199, file: !142, line: 553, baseType: !379, size: 64, align: 64, offset: 640)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1199, file: !142, line: 554, baseType: !539, size: 32, offset: 704)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !1199, file: !142, line: 555, baseType: !539, size: 32, offset: 736)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !1199, file: !142, line: 556, baseType: !379, size: 64, align: 64, offset: 768)
