; ModuleID = '../bcout/drivers/net/ethernet/mellanox/mlxsw/pci.llvm.bc'
source_filename = "drivers/net/ethernet/mellanox/mlxsw/pci.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_mlxsw_pci_module_init6:\09\09\09"
module asm ".long\09mlxsw_pci_module_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.mlxsw_bus = type { i8*, i32 (i8*, %struct.mlxsw_core*, %struct.mlxsw_config_profile*, %struct.mlxsw_res*)*, void (i8*)*, i1 (i8*, %struct.mlxsw_tx_info*)*, i32 (i8*, %struct.sk_buff*, %struct.mlxsw_tx_info*)*, i32 (i8*, i16, i8, i32, i1, i8*, i64, i8*, i64, i8*)*, i32 (i8*)*, i32 (i8*)*, i8 }
%struct.mlxsw_core = type opaque
%struct.mlxsw_config_profile = type { i16, i8, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i8, i16, i16, i16, i8, i16, i8, i32, i8, i8, [8 x %struct.mlxsw_swid_config] }
%struct.mlxsw_swid_config = type { i8, i8, i8 }
%struct.mlxsw_res = type { [50 x i8], [50 x i64] }
%struct.mlxsw_tx_info = type { i8, i8 }
%struct.sk_buff = type { %union.anon.40, %union.anon.43, %union.anon.44, [48 x i8], %union.anon.45, i32, i32, i16, i16, i16, [0 x i8], i8, [0 x i32], [0 x i8], i16, [0 x i8], i16, %union.anon.47, i32, i32, i32, i16, i16, %union.anon.49, %union.anon.50, %union.anon.51, i16, i16, i16, i16, i16, i16, i16, [0 x i32], i32, i32, i8*, i8*, i32, %struct.refcount_struct }

!272 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!273 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!274 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!275 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !264, line: 602, baseType: !7, size: 32, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283}
!278 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!280 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!281 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!282 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!283 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !264, line: 615, baseType: !7, size: 32, elements: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!289 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !264, line: 626, baseType: !7, size: 32, elements: !291)
!291 = !{!292, !293, !294, !295, !296}
!292 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!295 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!296 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !264, line: 638, baseType: !7, size: 32, elements: !298)
!298 = !{!299, !300}
!299 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!300 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !264, line: 647, baseType: !7, size: 32, elements: !302)
!302 = !{!303, !304}
!303 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!304 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!305 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !306, line: 54, baseType: !7, size: 32, elements: !307)
!306 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!307 = !{!308, !309, !310, !311}
!308 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !31, line: 423, baseType: !7, size: 32, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!317 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !319, file: !31, line: 2085, baseType: !7, size: 32, elements: !7396)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !31, line: 1858, size: 15808, elements: !320)
!320 = !{!321, !326, !349, !366, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !383, !391, !392, !393, !394, !395, !396, !397, !398, !399, !425, !435, !436, !437, !442, !443, !447, !450, !6615, !7129, !7133, !7173, !7174, !7175, !7176, !7177, !7178, !7179, !7180, !7181, !7182, !7183, !7184, !7185, !7186, !7187, !7188, !7189, !7190, !7191, !7192, !7193, !7194, !7195, !7196, !7197, !7198, !7199, !7204, !7205, !7206, !7207, !7208, !7209, !7210, !7213, !7216, !7219, !7222, !7225, !7226, !7239, !7240, !7241, !7242, !7243, !7244, !7251, !7252, !7286, !7287, !7288, !7289, !7290, !7291, !7292, !7293, !7294, !7297, !7298, !7299, !7300, !7301, !7302, !7303, !7304, !7305, !7310, !7311, !7312, !7313, !7350, !7351, !7353, !7354, !7358, !7359, !7360, !7361, !7367, !7369, !7372, !7375, !7377, !7378, !7379, !7380, !7381, !7385, !7388}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !319, file: !31, line: 1859, baseType: !322, size: 128)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 128, elements: !324)
!323 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!324 = !{!325}
!325 = !DISubrange(count: 16)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !319, file: !31, line: 1860, baseType: !327, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !31, line: 938, size: 384, elements: !329)
!329 = !{!330, !338, !344, !346}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !328, file: !31, line: 939, baseType: !331, size: 128)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !332, line: 186, size: 128, elements: !333)
!332 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !332, line: 187, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !331, file: !332, line: 187, baseType: !337, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !328, file: !31, line: 940, baseType: !339, size: 128, offset: 128)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !332, line: 178, size: 128, elements: !340)
!340 = !{!341, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !332, line: 179, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !339, file: !332, line: 179, baseType: !342, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !328, file: !31, line: 941, baseType: !345, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !31, line: 942, baseType: !347, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !319, file: !31, line: 1861, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !31, line: 930, size: 128, elements: !352)
!352 = !{!353, !362}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !351, file: !31, line: 931, baseType: !354, size: 128, align: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !332, line: 216, size: 128, align: 64, elements: !355)
!355 = !{!356, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !332, line: 217, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !354, file: !332, line: 218, baseType: !359, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !357}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !351, file: !31, line: 932, baseType: !363, offset: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: -1)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !319, file: !31, line: 1866, baseType: !367, size: 64, offset: 256)
!367 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !319, file: !31, line: 1867, baseType: !367, size: 64, offset: 320)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !319, file: !31, line: 1868, baseType: !367, size: 64, offset: 384)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !319, file: !31, line: 1869, baseType: !32, size: 32, offset: 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !319, file: !31, line: 1877, baseType: !367, size: 64, offset: 512)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !319, file: !31, line: 1879, baseType: !339, size: 128, offset: 576)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !319, file: !31, line: 1880, baseType: !339, size: 128, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !319, file: !31, line: 1881, baseType: !339, size: 128, offset: 832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !319, file: !31, line: 1882, baseType: !339, size: 128, offset: 960)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !319, file: !31, line: 1883, baseType: !339, size: 128, offset: 1088)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !319, file: !31, line: 1884, baseType: !339, size: 128, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !319, file: !31, line: 1889, baseType: !379, size: 256, offset: 1344)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !319, file: !31, line: 1886, size: 256, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !379, file: !31, line: 1887, baseType: !339, size: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !379, file: !31, line: 1888, baseType: !339, size: 128, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !319, file: !31, line: 1891, baseType: !384, size: 64, offset: 1600)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !385, line: 12, baseType: !386)
!385 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !387, line: 23, baseType: !388)
!387 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !389, line: 31, baseType: !390)
!389 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!390 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !319, file: !31, line: 1892, baseType: !384, size: 64, offset: 1664)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !319, file: !31, line: 1893, baseType: !384, size: 64, offset: 1728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !319, file: !31, line: 1894, baseType: !384, size: 64, offset: 1792)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !319, file: !31, line: 1895, baseType: !384, size: 64, offset: 1856)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !319, file: !31, line: 1896, baseType: !384, size: 64, offset: 1920)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !319, file: !31, line: 1897, baseType: !384, size: 64, offset: 1984)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !319, file: !31, line: 1899, baseType: !32, size: 32, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !319, file: !31, line: 1900, baseType: !32, size: 32, offset: 2080)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !319, file: !31, line: 1902, baseType: !400, size: 1472, offset: 2112)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !31, line: 169, size: 1472, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !400, file: !31, line: 170, baseType: !367, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !400, file: !31, line: 171, baseType: !367, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !400, file: !31, line: 172, baseType: !367, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !400, file: !31, line: 173, baseType: !367, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !400, file: !31, line: 174, baseType: !367, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !400, file: !31, line: 175, baseType: !367, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !400, file: !31, line: 176, baseType: !367, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !400, file: !31, line: 177, baseType: !367, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !400, file: !31, line: 178, baseType: !367, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !400, file: !31, line: 179, baseType: !367, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !400, file: !31, line: 180, baseType: !367, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !400, file: !31, line: 181, baseType: !367, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !400, file: !31, line: 182, baseType: !367, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !400, file: !31, line: 183, baseType: !367, size: 64, offset: 832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !400, file: !31, line: 184, baseType: !367, size: 64, offset: 896)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !400, file: !31, line: 185, baseType: !367, size: 64, offset: 960)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !400, file: !31, line: 186, baseType: !367, size: 64, offset: 1024)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !400, file: !31, line: 187, baseType: !367, size: 64, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !400, file: !31, line: 188, baseType: !367, size: 64, offset: 1152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !400, file: !31, line: 189, baseType: !367, size: 64, offset: 1216)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !400, file: !31, line: 190, baseType: !367, size: 64, offset: 1280)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !400, file: !31, line: 191, baseType: !367, size: 64, offset: 1344)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !400, file: !31, line: 192, baseType: !367, size: 64, offset: 1408)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !319, file: !31, line: 1904, baseType: !426, size: 64, offset: 3584)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !427, line: 13, baseType: !428)
!427 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !332, line: 175, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 173, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !429, file: !332, line: 174, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !387, line: 22, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !389, line: 30, baseType: !434)
!434 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !319, file: !31, line: 1905, baseType: !426, size: 64, offset: 3648)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !319, file: !31, line: 1906, baseType: !426, size: 64, offset: 3712)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !319, file: !31, line: 1909, baseType: !438, size: 32, offset: 3776)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 168, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 166, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !439, file: !332, line: 167, baseType: !32, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !319, file: !31, line: 1910, baseType: !438, size: 32, offset: 3808)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !319, file: !31, line: 1913, baseType: !444, size: 64, offset: 3840)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !31, line: 1913, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !319, file: !31, line: 1914, baseType: !448, size: 64, offset: 3904)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !31, line: 1914, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !319, file: !31, line: 1916, baseType: !451, size: 64, offset: 3968)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !31, line: 1283, size: 4416, elements: !454)
!454 = !{!455, !459, !463, !464, !465, !628, !632, !637, !641, !642, !647, !648, !771, !776, !780, !786, !790, !822, !830, !834, !839, !843, !844, !850, !854, !858, !862, !863, !885, !889, !904, !915, !919, !928, !932, !933, !937, !958, !962, !966, !970, !974, !981, !985, !1003, !1007, !1057, !1061, !1066, !1070, !1074, !1078, !1088, !1089, !1098, !1104, !1105, !1109, !1113, !1117, !1121, !1122, !1126, !1127, !5534, !5554, !5558, !6605, !6611}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !453, file: !31, line: 1284, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DISubroutineType(types: !458)
!458 = !{!32, !345}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !453, file: !31, line: 1285, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !345}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !453, file: !31, line: 1286, baseType: !456, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !453, file: !31, line: 1287, baseType: !456, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !453, file: !31, line: 1288, baseType: !466, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !470, !345}
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !31, line: 120, baseType: !30)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !472, line: 713, size: 1600, elements: !473)
!472 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!473 = !{!474, !496, !504, !511, !515, !527, !528, !529, !532, !533, !534, !540, !541, !542, !543, !544, !545, !546, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !586, !587, !588, !589, !591, !592, !597, !602, !607, !608, !609, !610, !611, !612, !613, !614, !615, !617, !618, !620, !621, !622}
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 714, baseType: !475, size: 192)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 714, size: 192, elements: !476)
!476 = !{!477, !487, !495}
!477 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !472, line: 715, baseType: !478, size: 192)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !472, line: 715, size: 192, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !472, line: 717, baseType: !470, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !478, file: !472, line: 718, baseType: !470, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !478, file: !472, line: 720, baseType: !483, size: 64, offset: 128)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !478, file: !472, line: 720, size: 64, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !483, file: !472, line: 721, baseType: !345, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !483, file: !472, line: 726, baseType: !367, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !475, file: !472, line: 729, baseType: !488, size: 192, align: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !489, line: 24, size: 192, align: 64, elements: !490)
!489 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!490 = !{!491, !492, !494}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !488, file: !489, line: 25, baseType: !367, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !488, file: !489, line: 26, baseType: !493, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !488, file: !489, line: 27, baseType: !493, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !475, file: !472, line: 730, baseType: !339, size: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 733, baseType: !497, size: 64, offset: 192)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 733, size: 64, elements: !498)
!498 = !{!499, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !497, file: !472, line: 734, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !502, line: 19, flags: DIFlagFwdDecl)
!502 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !497, file: !472, line: 735, baseType: !32, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 738, baseType: !505, size: 64, offset: 256)
!505 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 738, size: 64, elements: !506)
!506 = !{!507, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !505, file: !472, line: 739, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !509, line: 29, baseType: !432)
!509 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!510 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !505, file: !472, line: 740, baseType: !386, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !471, file: !472, line: 748, baseType: !512, size: 384, align: 64, offset: 320)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 384, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 48)
!515 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 750, baseType: !516, size: 128, offset: 704)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 750, size: 128, elements: !517)
!517 = !{!518, !526}
!518 = !DIDerivedType(tag: DW_TAG_member, scope: !516, file: !472, line: 751, baseType: !519, size: 128)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !516, file: !472, line: 751, size: 128, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !519, file: !472, line: 752, baseType: !367, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !519, file: !472, line: 753, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !470}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !516, file: !472, line: 755, baseType: !339, size: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !471, file: !472, line: 761, baseType: !7, size: 32, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !471, file: !472, line: 762, baseType: !7, size: 32, offset: 864)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !471, file: !472, line: 763, baseType: !530, size: 16, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !389, line: 24, baseType: !531)
!531 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !471, file: !472, line: 764, baseType: !530, size: 16, offset: 912)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !471, file: !472, line: 769, baseType: !530, size: 16, offset: 928)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !471, file: !472, line: 780, baseType: !535, offset: 944)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, elements: !538)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !389, line: 21, baseType: !537)
!537 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!538 = !{!539}
!539 = !DISubrange(count: 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !471, file: !472, line: 782, baseType: !536, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !471, file: !472, line: 783, baseType: !536, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !471, file: !472, line: 784, baseType: !536, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !471, file: !472, line: 785, baseType: !536, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !471, file: !472, line: 786, baseType: !536, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !471, file: !472, line: 787, baseType: !536, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !471, file: !472, line: 795, baseType: !547, offset: 960)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, elements: !538)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !389, line: 27, baseType: !7)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !471, file: !472, line: 807, baseType: !535, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !471, file: !472, line: 809, baseType: !536, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !471, file: !472, line: 810, baseType: !536, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !471, file: !472, line: 811, baseType: !536, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !471, file: !472, line: 812, baseType: !536, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !471, file: !472, line: 813, baseType: !536, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !471, file: !472, line: 815, baseType: !536, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !471, file: !472, line: 816, baseType: !536, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !471, file: !472, line: 817, baseType: !536, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !471, file: !472, line: 818, baseType: !536, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !471, file: !472, line: 819, baseType: !536, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !471, file: !472, line: 821, baseType: !536, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !471, file: !472, line: 822, baseType: !536, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !471, file: !472, line: 823, baseType: !536, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !471, file: !472, line: 832, baseType: !535, offset: 976)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !471, file: !472, line: 834, baseType: !536, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !471, file: !472, line: 835, baseType: !536, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !471, file: !472, line: 836, baseType: !536, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !471, file: !472, line: 837, baseType: !536, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !471, file: !472, line: 838, baseType: !536, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !471, file: !472, line: 840, baseType: !536, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !471, file: !472, line: 843, baseType: !536, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !471, file: !472, line: 844, baseType: !536, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !471, file: !472, line: 845, baseType: !536, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !471, file: !472, line: 847, baseType: !536, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !471, file: !472, line: 848, baseType: !536, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!575 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 866, baseType: !576, size: 32, offset: 992)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 866, size: 32, elements: !577)
!577 = !{!578, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !576, file: !472, line: 867, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !580, line: 37, baseType: !548)
!580 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!581 = !DIDerivedType(tag: DW_TAG_member, scope: !576, file: !472, line: 868, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !472, line: 868, size: 32, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !582, file: !472, line: 869, baseType: !530, size: 16)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !582, file: !472, line: 870, baseType: !530, size: 16, offset: 16)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !471, file: !472, line: 873, baseType: !548, size: 32, offset: 1024)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !471, file: !472, line: 874, baseType: !32, size: 32, offset: 1056)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !471, file: !472, line: 875, baseType: !548, size: 32, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !471, file: !472, line: 876, baseType: !590, size: 16, offset: 1120)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !580, line: 30, baseType: !530)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !471, file: !472, line: 877, baseType: !530, size: 16, offset: 1136)
!592 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 879, baseType: !593, size: 32, offset: 1152)
!593 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 879, size: 32, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !593, file: !472, line: 880, baseType: !7, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !593, file: !472, line: 881, baseType: !7, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 888, baseType: !598, size: 32, offset: 1184)
!598 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 888, size: 32, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !598, file: !472, line: 889, baseType: !548, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !598, file: !472, line: 890, baseType: !548, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, scope: !471, file: !472, line: 893, baseType: !603, size: 16, offset: 1216)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !471, file: !472, line: 893, size: 16, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !603, file: !472, line: 894, baseType: !590, size: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !603, file: !472, line: 895, baseType: !536, size: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !471, file: !472, line: 898, baseType: !530, size: 16, offset: 1232)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !471, file: !472, line: 899, baseType: !530, size: 16, offset: 1248)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !471, file: !472, line: 900, baseType: !530, size: 16, offset: 1264)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !471, file: !472, line: 902, baseType: !590, size: 16, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !471, file: !472, line: 903, baseType: !530, size: 16, offset: 1296)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !471, file: !472, line: 904, baseType: !530, size: 16, offset: 1312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !471, file: !472, line: 905, baseType: !530, size: 16, offset: 1328)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !471, file: !472, line: 908, baseType: !547, offset: 1344)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !471, file: !472, line: 912, baseType: !616, size: 32, offset: 1344)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !472, line: 606, baseType: !7)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !471, file: !472, line: 913, baseType: !616, size: 32, offset: 1376)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !471, file: !472, line: 914, baseType: !619, size: 64, offset: 1408)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !472, line: 915, baseType: !619, size: 64, offset: 1472)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !471, file: !472, line: 916, baseType: !7, size: 32, offset: 1536)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !471, file: !472, line: 917, baseType: !623, size: 32, offset: 1568)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !624, line: 113, baseType: !625)
!624 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !624, line: 111, size: 32, elements: !626)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !625, file: !624, line: 112, baseType: !438, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !453, file: !31, line: 1290, baseType: !629, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!384, !470, !345, !384}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !453, file: !31, line: 1293, baseType: !633, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !345, !470, !345}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !387, line: 19, baseType: !530)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !453, file: !31, line: 1296, baseType: !638, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !345, !32}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !453, file: !31, line: 1298, baseType: !460, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !453, file: !31, line: 1299, baseType: !643, size: 64, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!32, !345, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !453, file: !31, line: 1301, baseType: !456, size: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !453, file: !31, line: 1302, baseType: !649, size: 64, offset: 704)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!32, !345, !652, !32}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !654, line: 234, size: 320, elements: !655)
!654 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!655 = !{!656, !660}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !653, file: !654, line: 239, baseType: !657, size: 128)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !653, file: !654, line: 236, size: 128, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !657, file: !654, line: 238, baseType: !322, size: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !653, file: !654, line: 255, baseType: !661, size: 192, offset: 128)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !653, file: !654, line: 241, size: 192, elements: !662)
!662 = !{!663, !675, !676, !677, !678, !679, !681, !682, !683, !692, !693, !694, !695}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !661, file: !654, line: 242, baseType: !664, size: 128)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !665, line: 32, size: 128, elements: !666)
!665 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!666 = !{!667, !671}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !664, file: !665, line: 33, baseType: !668, size: 16)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !665, line: 26, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !670, line: 10, baseType: !531)
!670 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !664, file: !665, line: 34, baseType: !672, size: 112, offset: 16)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 112, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 14)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !661, file: !654, line: 243, baseType: !664, size: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !661, file: !654, line: 244, baseType: !664, size: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !661, file: !654, line: 245, baseType: !664, size: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !661, file: !654, line: 246, baseType: !664, size: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !661, file: !654, line: 247, baseType: !680, size: 16)
!680 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !661, file: !654, line: 248, baseType: !32, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !661, file: !654, line: 249, baseType: !32, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !661, file: !654, line: 250, baseType: !684, size: 192)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !654, line: 196, size: 192, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !684, file: !654, line: 197, baseType: !367, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !684, file: !654, line: 198, baseType: !367, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !684, file: !654, line: 199, baseType: !531, size: 16, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !684, file: !654, line: 200, baseType: !537, size: 8, offset: 144)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !684, file: !654, line: 201, baseType: !537, size: 8, offset: 152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !684, file: !654, line: 202, baseType: !537, size: 8, offset: 160)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !661, file: !654, line: 251, baseType: !322, size: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !661, file: !654, line: 252, baseType: !322, size: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !661, file: !654, line: 253, baseType: !646, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !661, file: !654, line: 254, baseType: !696, size: 128)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !654, line: 207, size: 128, elements: !697)
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !654, line: 208, baseType: !7, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !696, file: !654, line: 209, baseType: !7, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !696, file: !654, line: 222, baseType: !701, size: 64, offset: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !696, file: !654, line: 210, size: 64, elements: !702)
!702 = !{!703, !711, !718, !730, !736, !743, !754, !762}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !701, file: !654, line: 212, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !706, line: 56, baseType: !707)
!706 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 53, size: 32, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !707, file: !706, line: 54, baseType: !531, size: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !707, file: !706, line: 55, baseType: !531, size: 16, offset: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !701, file: !654, line: 213, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !706, line: 80, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 77, size: 64, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !714, file: !706, line: 78, baseType: !7, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !714, file: !706, line: 79, baseType: !7, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !701, file: !654, line: 214, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !706, line: 66, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 58, size: 192, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !721, file: !706, line: 59, baseType: !7, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !721, file: !706, line: 60, baseType: !7, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !721, file: !706, line: 61, baseType: !7, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !721, file: !706, line: 62, baseType: !7, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !721, file: !706, line: 63, baseType: !7, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !721, file: !706, line: 64, baseType: !531, size: 16, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !721, file: !706, line: 65, baseType: !531, size: 16, offset: 176)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !701, file: !654, line: 215, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !706, line: 70, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 68, size: 32, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !733, file: !706, line: 69, baseType: !7, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !701, file: !654, line: 216, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !706, line: 75, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 72, size: 160, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !739, file: !706, line: 73, baseType: !7, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !739, file: !706, line: 74, baseType: !322, size: 128, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !701, file: !654, line: 217, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !706, line: 89, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 82, size: 192, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !746, file: !706, line: 83, baseType: !531, size: 16)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !746, file: !706, line: 84, baseType: !7, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !746, file: !706, line: 85, baseType: !7, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !746, file: !706, line: 86, baseType: !7, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !746, file: !706, line: 87, baseType: !7, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !746, file: !706, line: 88, baseType: !7, size: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !701, file: !654, line: 220, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !706, line: 44, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 40, size: 96, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !757, file: !706, line: 41, baseType: !7, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !757, file: !706, line: 42, baseType: !7, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !757, file: !706, line: 43, baseType: !531, size: 16, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !701, file: !654, line: 221, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !706, line: 51, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !706, line: 46, size: 128, elements: !766)
!766 = !{!767, !768, !769, !770}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !765, file: !706, line: 47, baseType: !7, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !765, file: !706, line: 48, baseType: !7, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !765, file: !706, line: 49, baseType: !531, size: 16, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !765, file: !706, line: 50, baseType: !7, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !453, file: !31, line: 1304, baseType: !772, size: 64, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!32, !345, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !453, file: !31, line: 1306, baseType: !777, size: 64, offset: 832)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!32, !345, !32}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !453, file: !31, line: 1308, baseType: !781, size: 64, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!32, !345, !784}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !31, line: 206, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !453, file: !31, line: 1310, baseType: !787, size: 64, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !345, !7}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !453, file: !31, line: 1313, baseType: !791, size: 64, offset: 1024)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !345, !794}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !796, line: 214, size: 1536, elements: !797)
!796 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !795, file: !796, line: 215, baseType: !388, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !795, file: !796, line: 216, baseType: !388, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !795, file: !796, line: 217, baseType: !388, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !795, file: !796, line: 218, baseType: !388, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !795, file: !796, line: 219, baseType: !388, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !795, file: !796, line: 220, baseType: !388, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !795, file: !796, line: 221, baseType: !388, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !795, file: !796, line: 222, baseType: !388, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !795, file: !796, line: 223, baseType: !388, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !795, file: !796, line: 224, baseType: !388, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !795, file: !796, line: 227, baseType: !388, size: 64, offset: 640)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !795, file: !796, line: 228, baseType: !388, size: 64, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !795, file: !796, line: 229, baseType: !388, size: 64, offset: 768)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !795, file: !796, line: 230, baseType: !388, size: 64, offset: 832)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !795, file: !796, line: 231, baseType: !388, size: 64, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !795, file: !796, line: 232, baseType: !388, size: 64, offset: 960)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !795, file: !796, line: 235, baseType: !388, size: 64, offset: 1024)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !795, file: !796, line: 236, baseType: !388, size: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !795, file: !796, line: 237, baseType: !388, size: 64, offset: 1152)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !795, file: !796, line: 238, baseType: !388, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !795, file: !796, line: 239, baseType: !388, size: 64, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !795, file: !796, line: 242, baseType: !388, size: 64, offset: 1344)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !795, file: !796, line: 243, baseType: !388, size: 64, offset: 1408)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !795, file: !796, line: 244, baseType: !388, size: 64, offset: 1472)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !453, file: !31, line: 1315, baseType: !823, size: 64, offset: 1088)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !828, !32}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !332, line: 30, baseType: !827)
!827 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !453, file: !31, line: 1316, baseType: !831, size: 64, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!32, !32, !828, !646}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !453, file: !31, line: 1319, baseType: !835, size: 64, offset: 1216)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!838, !345}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !453, file: !31, line: 1321, baseType: !840, size: 64, offset: 1280)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!32, !345, !590, !636}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !453, file: !31, line: 1323, baseType: !840, size: 64, offset: 1344)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !453, file: !31, line: 1331, baseType: !845, size: 64, offset: 1408)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!32, !345, !32, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !387, line: 17, baseType: !536)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !453, file: !31, line: 1333, baseType: !851, size: 64, offset: 1472)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!32, !345, !32, !636, !849, !590}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !453, file: !31, line: 1336, baseType: !855, size: 64, offset: 1536)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!32, !345, !32, !32, !32}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !453, file: !31, line: 1339, baseType: !859, size: 64, offset: 1600)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!32, !345, !32, !826}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !453, file: !31, line: 1341, baseType: !859, size: 64, offset: 1664)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !453, file: !31, line: 1343, baseType: !864, size: 64, offset: 1728)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!32, !345, !32, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !869, line: 20, size: 576, elements: !870)
!869 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!870 = !{!871, !872, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !868, file: !869, line: 21, baseType: !548, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !868, file: !869, line: 22, baseType: !873, size: 256, offset: 32)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 256, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !868, file: !869, line: 23, baseType: !548, size: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !868, file: !869, line: 24, baseType: !548, size: 32, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !868, file: !869, line: 25, baseType: !548, size: 32, offset: 352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !868, file: !869, line: 26, baseType: !548, size: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !868, file: !869, line: 27, baseType: !548, size: 32, offset: 416)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !868, file: !869, line: 28, baseType: !548, size: 32, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !868, file: !869, line: 29, baseType: !548, size: 32, offset: 480)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !868, file: !869, line: 30, baseType: !548, size: 32, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !868, file: !869, line: 31, baseType: !590, size: 16, offset: 544)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !453, file: !31, line: 1346, baseType: !886, size: 64, offset: 1792)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!32, !345, !32, !32}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !453, file: !31, line: 1348, baseType: !890, size: 64, offset: 1856)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!32, !345, !32, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !869, line: 9, size: 512, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !894, file: !869, line: 10, baseType: !388, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !894, file: !869, line: 11, baseType: !388, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !894, file: !869, line: 12, baseType: !388, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !894, file: !869, line: 13, baseType: !388, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !894, file: !869, line: 14, baseType: !388, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !894, file: !869, line: 15, baseType: !388, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !894, file: !869, line: 16, baseType: !388, size: 64, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !894, file: !869, line: 17, baseType: !388, size: 64, offset: 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !453, file: !31, line: 1352, baseType: !905, size: 64, offset: 1920)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!32, !345, !32, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !911, line: 213, size: 32, elements: !912)
!911 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !910, file: !911, line: 214, baseType: !530, size: 16)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !910, file: !911, line: 215, baseType: !530, size: 16, offset: 16)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !453, file: !31, line: 1355, baseType: !916, size: 64, offset: 1984)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!32, !345, !32, !470}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !453, file: !31, line: 1357, baseType: !920, size: 64, offset: 2048)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!32, !345, !32, !923, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !796, line: 956, size: 128, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !924, file: !796, line: 957, baseType: !548, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !924, file: !796, line: 958, baseType: !388, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !453, file: !31, line: 1361, baseType: !929, size: 64, offset: 2112)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!32, !345, !32, !386, !32}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !453, file: !31, line: 1364, baseType: !859, size: 64, offset: 2176)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !453, file: !31, line: 1367, baseType: !934, size: 64, offset: 2240)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!32, !345, !37, !646}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !453, file: !31, line: 1400, baseType: !938, size: 64, offset: 2304)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!32, !345, !345, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !943, line: 75, size: 384, elements: !944)
!943 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!944 = !{!945, !946, !949, !953, !957}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !942, file: !943, line: 76, baseType: !347, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !942, file: !943, line: 77, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !942, file: !943, line: 78, baseType: !950, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !943, line: 78, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !942, file: !943, line: 79, baseType: !954, size: 160, offset: 192)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 160, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 20)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !942, file: !943, line: 80, baseType: !849, size: 8, offset: 352)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !453, file: !31, line: 1403, baseType: !959, size: 64, offset: 2368)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!32, !345, !345}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !453, file: !31, line: 1405, baseType: !963, size: 64, offset: 2432)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!345, !345, !470, !826}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !453, file: !31, line: 1408, baseType: !967, size: 64, offset: 2496)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!384, !345, !384}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !453, file: !31, line: 1410, baseType: !971, size: 64, offset: 2560)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!32, !345, !384}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !453, file: !31, line: 1412, baseType: !975, size: 64, offset: 2624)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!32, !345, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !980, line: 35, flags: DIFlagFwdDecl)
!980 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !453, file: !31, line: 1414, baseType: !982, size: 64, offset: 2688)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !345, !978}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !453, file: !31, line: 1417, baseType: !986, size: 64, offset: 2752)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!32, !989, !908, !345, !1001, !636, !636, !941}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !991, line: 8, size: 96, elements: !992)
!991 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!992 = !{!993, !994, !995, !996, !998, !999, !1000}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !990, file: !991, line: 9, baseType: !536, size: 8)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !990, file: !991, line: 10, baseType: !536, size: 8, offset: 8)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !990, file: !991, line: 11, baseType: !530, size: 16, offset: 16)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !990, file: !991, line: 12, baseType: !997, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !389, line: 26, baseType: !32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !990, file: !991, line: 13, baseType: !530, size: 16, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !990, file: !991, line: 14, baseType: !536, size: 8, offset: 80)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !990, file: !991, line: 15, baseType: !536, size: 8, offset: 88)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !453, file: !31, line: 1424, baseType: !1004, size: 64, offset: 2816)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!32, !989, !908, !345, !1001, !636}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !453, file: !31, line: 1429, baseType: !1008, size: 64, offset: 2880)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!32, !470, !1011, !345, !345, !1056}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !943, line: 203, size: 1024, elements: !1013)
!1013 = !{!1014, !1015, !1025, !1029, !1033, !1034, !1038, !1039, !1040, !1041, !1043, !1044, !1045, !1046}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1012, file: !943, line: 204, baseType: !470, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1012, file: !943, line: 205, baseType: !1016, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !911, line: 44, size: 128, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1018, file: !911, line: 45, baseType: !548, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1018, file: !911, line: 46, baseType: !530, size: 16, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1018, file: !911, line: 47, baseType: !530, size: 16, offset: 48)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1018, file: !911, line: 48, baseType: !548, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1018, file: !911, line: 49, baseType: !548, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1012, file: !943, line: 206, baseType: !1026, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!32, !470, !1011}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1012, file: !943, line: 208, baseType: !1030, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!32, !1011}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1012, file: !943, line: 209, baseType: !646, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1012, file: !943, line: 211, baseType: !1035, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1037, line: 76, flags: DIFlagFwdDecl)
!1037 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1012, file: !943, line: 212, baseType: !941, size: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1012, file: !943, line: 213, baseType: !636, size: 16, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1012, file: !943, line: 214, baseType: !636, size: 16, offset: 464)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1012, file: !943, line: 215, baseType: !1042, size: 32, offset: 480)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !387, line: 21, baseType: !548)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1012, file: !943, line: 216, baseType: !7, size: 32, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1012, file: !943, line: 216, baseType: !7, size: 32, offset: 544)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1012, file: !943, line: 217, baseType: !826, size: 8, offset: 576)
!1046 = !DIDerivedType(tag: DW_TAG_member, scope: !1012, file: !943, line: 218, baseType: !1047, size: 384, offset: 640)
!1047 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1012, file: !943, line: 218, size: 384, elements: !1048)
!1048 = !{!1049, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1047, file: !943, line: 219, baseType: !1050, size: 384)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 384, elements: !513)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1047, file: !943, line: 224, baseType: !1052, size: 384)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 384, elements: !1054)
!1053 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1054 = !{!1055}
!1055 = !DISubrange(count: 6)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !453, file: !31, line: 1434, baseType: !1058, size: 64, offset: 2944)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!32, !470, !908, !345, !1001, !636, !1042, !1042, !941}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !453, file: !31, line: 1440, baseType: !1062, size: 64, offset: 3008)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!32, !345, !1065, !636, !941}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !453, file: !31, line: 1444, baseType: !1067, size: 64, offset: 3072)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!32, !470, !1042, !1042, !345, !1042, !32}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !453, file: !31, line: 1449, baseType: !1071, size: 64, offset: 3136)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!32, !345, !1065, !636}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !453, file: !31, line: 1452, baseType: !1075, size: 64, offset: 3200)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!32, !345, !826}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !453, file: !31, line: 1454, baseType: !1079, size: 64, offset: 3264)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!32, !345, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !31, line: 820, size: 264, elements: !1084)
!1084 = !{!1085, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1083, file: !31, line: 821, baseType: !1086, size: 256)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 256, elements: !874)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1083, file: !31, line: 822, baseType: !537, size: 8, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !453, file: !31, line: 1456, baseType: !1079, size: 64, offset: 3328)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !453, file: !31, line: 1458, baseType: !1090, size: 64, offset: 3392)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!32, !345, !1093, !1094}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !332, line: 55, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1096, line: 72, baseType: !1097)
!1096 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1096, line: 16, baseType: !367)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !453, file: !31, line: 1460, baseType: !1099, size: 64, offset: 3456)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{null, !345, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !31, line: 67, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !453, file: !31, line: 1462, baseType: !1099, size: 64, offset: 3520)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !453, file: !31, line: 1464, baseType: !1106, size: 64, offset: 3584)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!646, !345, !345}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !453, file: !31, line: 1466, baseType: !1110, size: 64, offset: 3648)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{null, !345, !646}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !453, file: !31, line: 1469, baseType: !1114, size: 64, offset: 3712)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!32, !345, !32, !1042}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !453, file: !31, line: 1472, baseType: !1118, size: 64, offset: 3776)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!32, !828}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !453, file: !31, line: 1473, baseType: !1075, size: 64, offset: 3840)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !453, file: !31, line: 1475, baseType: !1123, size: 64, offset: 3904)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!32, !345, !470}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !453, file: !31, line: 1477, baseType: !638, size: 64, offset: 3968)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !453, file: !31, line: 1479, baseType: !1128, size: 64, offset: 4032)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!32, !345, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !31, line: 894, size: 256, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1132, file: !31, line: 895, baseType: !57, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, scope: !1132, file: !31, line: 896, baseType: !1136, size: 192, offset: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1132, file: !31, line: 896, size: 192, elements: !1137)
!1137 = !{!1138, !1147, !5527}
!1138 = !DIDerivedType(tag: DW_TAG_member, scope: !1136, file: !31, line: 898, baseType: !1139, size: 192)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1136, file: !31, line: 898, size: 192, elements: !1140)
!1140 = !{!1141, !1142, !1146}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1139, file: !31, line: 899, baseType: !1042, size: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1139, file: !31, line: 900, baseType: !1143, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1145, line: 11, flags: DIFlagFwdDecl)
!1145 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1139, file: !31, line: 901, baseType: !941, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, scope: !1136, file: !31, line: 904, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1136, file: !31, line: 904, size: 64, elements: !1149)
!1149 = !{!1150}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1148, file: !31, line: 905, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !65, line: 222, size: 2560, elements: !1153)
!1153 = !{!1154, !5506, !5507, !5525, !5526}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1152, file: !65, line: 223, baseType: !1155, size: 2048)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !65, line: 141, size: 2048, elements: !1156)
!1156 = !{!1157, !5480, !5481, !5482, !5483, !5484, !5485, !5486, !5487, !5488, !5489, !5490, !5491, !5492, !5497, !5498, !5499, !5500, !5501, !5502, !5503, !5504, !5505}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1155, file: !65, line: 145, baseType: !1158, size: 64, align: 512)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !65, line: 54, size: 2368, elements: !1161)
!1161 = !{!1162, !1361, !1366, !5152, !5156, !5160, !5161, !5165, !5171, !5172, !5173, !5174, !5175, !5179, !5183, !5187, !5188, !5189, !5193, !5194, !5206, !5210, !5214, !5226, !5415, !5419, !5423, !5428, !5432, !5436, !5440, !5446, !5450, !5457, !5461, !5463, !5464}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1160, file: !65, line: 56, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!32, !1166}
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !96, line: 483, size: 960, align: 64, elements: !1168)
!1168 = !{!1169, !1185, !1196, !1207, !1231, !1237, !1245, !1262, !1275, !1281, !1290, !1295, !1303, !1315, !1335, !1342, !1346, !1350, !1355}
!1169 = !DIDerivedType(tag: DW_TAG_member, scope: !1167, file: !96, line: 484, baseType: !1170, size: 512)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1167, file: !96, line: 484, size: 512, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1170, file: !96, line: 485, baseType: !548, size: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1170, file: !96, line: 486, baseType: !548, size: 32, offset: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1170, file: !96, line: 487, baseType: !548, size: 32, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1170, file: !96, line: 488, baseType: !548, size: 32, offset: 96)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1170, file: !96, line: 489, baseType: !548, size: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1170, file: !96, line: 492, baseType: !548, size: 32, offset: 160)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1170, file: !96, line: 493, baseType: !548, size: 32, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1170, file: !96, line: 496, baseType: !322, size: 128, offset: 224)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1170, file: !96, line: 497, baseType: !548, size: 32, offset: 352)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1170, file: !96, line: 498, baseType: !548, size: 32, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1170, file: !96, line: 499, baseType: !548, size: 32, offset: 416)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1170, file: !96, line: 500, baseType: !548, size: 32, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1170, file: !96, line: 501, baseType: !548, size: 32, offset: 480)
!1185 = !DIDerivedType(tag: DW_TAG_member, scope: !1167, file: !96, line: 507, baseType: !1186, size: 256)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1167, file: !96, line: 507, size: 256, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1195}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1186, file: !96, line: 508, baseType: !548, size: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1186, file: !96, line: 509, baseType: !388, size: 64, align: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, scope: !1186, file: !96, line: 510, baseType: !1191, size: 64, offset: 128)
!1191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1186, file: !96, line: 510, size: 64, elements: !1192)
!1192 = !{!1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1191, file: !96, line: 511, baseType: !388, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1191, file: !96, line: 512, baseType: !388, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1186, file: !96, line: 514, baseType: !388, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1167, file: !96, line: 532, baseType: !1197, size: 448)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1167, file: !96, line: 517, size: 448, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1197, file: !96, line: 518, baseType: !388, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1197, file: !96, line: 521, baseType: !388, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1197, file: !96, line: 522, baseType: !388, size: 64, align: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1197, file: !96, line: 523, baseType: !388, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1197, file: !96, line: 524, baseType: !548, size: 32, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1197, file: !96, line: 529, baseType: !548, size: 32, offset: 288)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1197, file: !96, line: 530, baseType: !388, size: 64, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1197, file: !96, line: 531, baseType: !388, size: 64, offset: 384)
!1207 = !DIDerivedType(tag: DW_TAG_member, scope: !1167, file: !96, line: 534, baseType: !1208, size: 960)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1167, file: !96, line: 534, size: 960, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1208, file: !96, line: 535, baseType: !548, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1208, file: !96, line: 536, baseType: !548, size: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1208, file: !96, line: 537, baseType: !388, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1208, file: !96, line: 538, baseType: !388, size: 64, align: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1208, file: !96, line: 539, baseType: !548, size: 32, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1208, file: !96, line: 540, baseType: !548, size: 32, offset: 224)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1208, file: !96, line: 541, baseType: !388, size: 64, align: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1208, file: !96, line: 542, baseType: !548, size: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1208, file: !96, line: 543, baseType: !548, size: 32, offset: 352)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1208, file: !96, line: 544, baseType: !322, size: 128, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1208, file: !96, line: 545, baseType: !548, size: 32, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1208, file: !96, line: 550, baseType: !548, size: 32, offset: 544)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1208, file: !96, line: 551, baseType: !548, size: 32, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1208, file: !96, line: 552, baseType: !548, size: 32, offset: 608)
