; ModuleID = '../bcout/drivers/net/ethernet/mellanox/mlxsw/spectrum_acl_flex_keys.llvm.bc'
source_filename = "drivers/net/ethernet/mellanox/mlxsw/spectrum_acl_flex_keys.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.mlxsw_afk_block = type { i16, %struct.mlxsw_afk_element_inst*, i32 }
%struct.mlxsw_afk_element_inst = type { i32, i32, %struct.mlxsw_item, i32, i8 }
%struct.mlxsw_item = type { i16, i16, i16, i8, i8, i8, %union.anon, i8* }
%union.anon = type { i16 }
%struct.mlxsw_afk_ops = type { %struct.mlxsw_afk_block*, i32, void (i8*, i32, i8*)*, void (i8*, i32)* }
%struct.mlxsw_sp2_afk_block_layout = type { i16, %struct.mlxsw_item }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mlxsw_sp1_afk_blocks", scope: !2, file: !3, line: 84, type: !200, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !39, globals: !47, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxsw/spectrum_acl_flex_keys.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mlxsw_afk_element", file: !6, line: 12, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxsw/core_acl_flex_keys.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34}
!9 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SRC_SYS_PORT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DMAC_32_47", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DMAC_0_31", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SMAC_32_47", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SMAC_0_31", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_ETHERTYPE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_IP_PROTO", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SRC_IP_96_127", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SRC_IP_64_95", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SRC_IP_32_63", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SRC_IP_0_31", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DST_IP_96_127", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DST_IP_64_95", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DST_IP_32_63", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DST_IP_0_31", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_DST_L4_PORT", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_SRC_L4_PORT", value: 16, isUnsigned: true)
!26 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_VID", value: 17, isUnsigned: true)
!27 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_PCP", value: 18, isUnsigned: true)
!28 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_TCP_FLAGS", value: 19, isUnsigned: true)
!29 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_IP_TTL_", value: 20, isUnsigned: true)
!30 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_IP_ECN", value: 21, isUnsigned: true)
!31 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_IP_DSCP", value: 22, isUnsigned: true)
!32 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_VIRT_ROUTER_8_10", value: 23, isUnsigned: true)
!33 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_VIRT_ROUTER_0_7", value: 24, isUnsigned: true)
!34 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_MAX", value: 25, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mlxsw_afk_element_type", file: !6, line: 41, baseType: !7, size: 32, elements: !36)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_TYPE_U32", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "MLXSW_AFK_ELEMENT_TYPE_BUF", value: 1, isUnsigned: true)
!39 = !{!40, !43, !41, !46}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be64", file: !42, line: 34, baseType: !43)
!42 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !44, line: 31, baseType: !45)
!44 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!45 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !{!48, !106, !0, !108, !113, !115, !120, !122, !124, !126, !131, !136, !138, !140, !142, !147, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "mlxsw_sp1_afk_ops", scope: !2, file: !3, line: 118, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxsw_afk_ops", file: !6, line: 174, size: 256, elements: !52)
!52 = !{!53, !96, !97, !102}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !51, file: !6, line: 175, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxsw_afk_block", file: !6, line: 114, size: 192, elements: !57)
!57 = !{!58, !63, !95}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !56, file: !6, line: 115, baseType: !59, size: 16)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !60, line: 19, baseType: !61)
!60 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !44, line: 24, baseType: !62)
!62 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "instances", scope: !56, file: !6, line: 116, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxsw_afk_element_inst", file: !6, line: 74, size: 320, elements: !66)
!66 = !{!67, !68, !69, !93, !94}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "element", scope: !65, file: !6, line: 75, baseType: !5, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !6, line: 76, baseType: !35, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !65, file: !6, line: 77, baseType: !70, size: 192, offset: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxsw_item", file: !71, line: 11, size: 192, elements: !72)
!71 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxsw/item.h", directory: "/home/lizy2001/genbc/linux")
!72 = !{!73, !74, !76, !77, !79, !80, !84, !89}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !70, file: !71, line: 12, baseType: !62, size: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !70, file: !71, line: 13, baseType: !75, size: 16, offset: 16)
!75 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "in_step_offset", scope: !70, file: !71, line: 14, baseType: !62, size: 16, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !70, file: !71, line: 15, baseType: !78, size: 8, offset: 48)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "element_size", scope: !70, file: !71, line: 16, baseType: !78, size: 8, offset: 56)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "no_real_shift", scope: !70, file: !71, line: 17, baseType: !81, size: 8, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !82, line: 30, baseType: !83)
!82 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!83 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !71, line: 21, baseType: !85, size: 16, offset: 80)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !70, file: !71, line: 18, size: 16, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !85, file: !71, line: 19, baseType: !78, size: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !85, file: !71, line: 20, baseType: !62, size: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !70, file: !71, line: 22, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "u32_key_diff", scope: !65, file: !6, line: 78, baseType: !46, size: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "avoid_size_check", scope: !65, file: !6, line: 81, baseType: !81, size: 8, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "instances_count", scope: !56, file: !6, line: 117, baseType: !7, size: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_count", scope: !51, file: !6, line: 176, baseType: !7, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "encode_block", scope: !51, file: !6, line: 177, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !46, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "clear_block", scope: !51, file: !6, line: 178, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !101, !46}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "mlxsw_sp2_afk_ops", scope: !2, file: !3, line: 308, type: !50, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_l2_dmac", scope: !2, file: !3, line: 10, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1600, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 5)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_l2_smac", scope: !2, file: !3, line: 18, type: !110, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_l2_smac_ex", scope: !2, file: !3, line: 26, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 960, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_sip", scope: !2, file: !3, line: 32, type: !117, isLocal: true, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_dip", scope: !2, file: !3, line: 38, type: !117, isLocal: true, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4", scope: !2, file: !3, line: 44, type: !110, isLocal: true, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_ex", scope: !2, file: !3, line: 52, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 1280, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 4)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_dip", scope: !2, file: !3, line: 59, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 640, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 2)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_ex1", scope: !2, file: !3, line: 64, type: !117, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_sip", scope: !2, file: !3, line: 70, type: !133, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_sip_ex", scope: !2, file: !3, line: 75, type: !133, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_packet_type", scope: !2, file: !3, line: 80, type: !144, isLocal: true, isDefinition: true)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 320, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 1)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "mlxsw_sp2_afk_blocks", scope: !2, file: !3, line: 208, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 3456, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 18)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_mac_0", scope: !2, file: !3, line: 125, type: !144, isLocal: true, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_mac_1", scope: !2, file: !3, line: 129, type: !144, isLocal: true, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_mac_2", scope: !2, file: !3, line: 133, type: !133, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_mac_3", scope: !2, file: !3, line: 138, type: !117, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_mac_4", scope: !2, file: !3, line: 144, type: !117, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_mac_5", scope: !2, file: !3, line: 150, type: !133, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_0", scope: !2, file: !3, line: 155, type: !144, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_1", scope: !2, file: !3, line: 159, type: !144, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_2", scope: !2, file: !3, line: 163, type: !128, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv4_4", scope: !2, file: !3, line: 170, type: !133, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_0", scope: !2, file: !3, line: 175, type: !144, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_1", scope: !2, file: !3, line: 179, type: !144, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_2", scope: !2, file: !3, line: 183, type: !144, isLocal: true, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_3", scope: !2, file: !3, line: 187, type: !144, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_4", scope: !2, file: !3, line: 191, type: !144, isLocal: true, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_ipv6_5", scope: !2, file: !3, line: 195, type: !144, isLocal: true, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_l4_0", scope: !2, file: !3, line: 199, type: !133, isLocal: true, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "mlxsw_sp_afk_element_info_l4_2", scope: !2, file: !3, line: 204, type: !144, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "mlxsw_sp2_afk_block_value_item", scope: !2, file: !3, line: 239, type: !70, isLocal: true, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "mlxsw_sp2_afk_blocks_layout", scope: !2, file: !3, line: 266, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 3072, elements: !198)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxsw_sp2_afk_block_layout", file: !3, line: 251, size: 256, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !194, file: !3, line: 252, baseType: !62, size: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "item", scope: !194, file: !3, line: 253, baseType: !70, size: 192, offset: 64)
!198 = !{!199}
!199 = !DISubrange(count: 12)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2304, elements: !198)
!201 = !{i32 7, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{i32 1, !"wchar_size", i32 2}
!204 = !{i32 1, !"Code Model", i32 2}
!205 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!206 = distinct !DISubprogram(name: "mlxsw_sp1_afk_encode_block", scope: !3, file: !3, line: 101, type: !99, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !207)
!207 = !{}
!208 = !DILocalVariable(name: "output", arg: 1, scope: !206, file: !3, line: 101, type: !101)
!209 = !DILocation(line: 101, column: 46, scope: !206)
!210 = !DILocalVariable(name: "block_index", arg: 2, scope: !206, file: !3, line: 101, type: !46)
!211 = !DILocation(line: 101, column: 58, scope: !206)
!212 = !DILocalVariable(name: "block", arg: 3, scope: !206, file: !3, line: 102, type: !101)
!213 = !DILocation(line: 102, column: 18, scope: !206)
!214 = !DILocalVariable(name: "offset", scope: !206, file: !3, line: 104, type: !7)
!215 = !DILocation(line: 104, column: 15, scope: !206)
!216 = !DILocation(line: 104, column: 24, scope: !206)
!217 = !DILocation(line: 104, column: 36, scope: !206)
!218 = !DILocalVariable(name: "output_indexed", scope: !206, file: !3, line: 105, type: !101)
!219 = !DILocation(line: 105, column: 8, scope: !206)
!220 = !DILocation(line: 105, column: 25, scope: !206)
!221 = !DILocation(line: 105, column: 34, scope: !206)
!222 = !DILocation(line: 105, column: 32, scope: !206)
!223 = !DILocation(line: 107, column: 9, scope: !206)
!224 = !DILocation(line: 107, column: 25, scope: !206)
!225 = !DILocation(line: 107, column: 2, scope: !206)
!226 = !DILocation(line: 108, column: 1, scope: !206)
!227 = distinct !DISubprogram(name: "mlxsw_sp1_afk_clear_block", scope: !3, file: !3, line: 110, type: !104, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !207)
!228 = !DILocalVariable(name: "output", arg: 1, scope: !227, file: !3, line: 110, type: !101)
!229 = !DILocation(line: 110, column: 45, scope: !227)
!230 = !DILocalVariable(name: "block_index", arg: 2, scope: !227, file: !3, line: 110, type: !46)
!231 = !DILocation(line: 110, column: 57, scope: !227)
!232 = !DILocalVariable(name: "offset", scope: !227, file: !3, line: 112, type: !7)
!233 = !DILocation(line: 112, column: 15, scope: !227)
!234 = !DILocation(line: 112, column: 24, scope: !227)
!235 = !DILocation(line: 112, column: 36, scope: !227)
!236 = !DILocalVariable(name: "output_indexed", scope: !227, file: !3, line: 113, type: !101)
!237 = !DILocation(line: 113, column: 8, scope: !227)
!238 = !DILocation(line: 113, column: 25, scope: !227)
!239 = !DILocation(line: 113, column: 34, scope: !227)
!240 = !DILocation(line: 113, column: 32, scope: !227)
!241 = !DILocation(line: 115, column: 9, scope: !227)
!242 = !DILocation(line: 115, column: 2, scope: !227)
!243 = !DILocation(line: 116, column: 1, scope: !227)
!244 = distinct !DISubprogram(name: "mlxsw_sp2_afk_encode_block", scope: !3, file: !3, line: 295, type: !99, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !207)
!245 = !DILocalVariable(name: "output", arg: 1, scope: !244, file: !3, line: 295, type: !101)
!246 = !DILocation(line: 295, column: 46, scope: !244)
!247 = !DILocalVariable(name: "block_index", arg: 2, scope: !244, file: !3, line: 295, type: !46)
!248 = !DILocation(line: 295, column: 58, scope: !244)
!249 = !DILocalVariable(name: "block", arg: 3, scope: !244, file: !3, line: 296, type: !101)
!250 = !DILocation(line: 296, column: 18, scope: !244)
