; ModuleID = '../bcout/drivers/clk/clk-divider.llvm.bc'
source_filename = "drivers/clk/clk-divider.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.clk_ops = type { i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i64 (%struct.clk_hw*, i64)*, i64 (%struct.clk_hw*, i64, i64*)*, i32 (%struct.clk_hw*, %struct.clk_rate_request*)*, i32 (%struct.clk_hw*, i8)*, i8 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i64, i64)*, i32 (%struct.clk_hw*, i64, i64, i8)*, i64 (%struct.clk_hw*, i64)*, i32 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i32)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, void (%struct.clk_hw*, %struct.dentry*)* }
%struct.clk_hw = type { %struct.clk_core*, %struct.clk*, %struct.clk_init_data* }
%struct.clk_core = type opaque
%struct.clk = type opaque
%struct.clk_init_data = type { i8*, %struct.clk_ops*, i8**, %struct.clk_parent_data*, %struct.clk_hw**, i8, i64 }
%struct.clk_parent_data = type { %struct.clk_hw*, i8*, i8*, i32 }
%struct.clk_rate_request = type { i64, i64, i64, i64, %struct.clk_hw* }
%struct.clk_duty = type { i32, i32 }
%struct.dentry = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "clk_divider_ops", scope: !2, file: !3, line: 453, type: !58, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !196, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/clk-divider.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !6, line: 26, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 10, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !18, line: 305, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!24 = !{!25, !26, !30, !7, !32, !33, !34, !65, !192, !194, !83}
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !27, line: 23, baseType: !28)
!27 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !29, line: 31, baseType: !25)
!29 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 107, baseType: !26)
!31 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !31, line: 148, baseType: !7)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_divider", file: !36, line: 596, size: 448, elements: !37)
!36 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!37 = !{!38, !164, !165, !166, !167, !168, !175}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !35, file: !36, line: 597, baseType: !39, size: 192)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !36, line: 312, size: 192, elements: !40)
!40 = !{!41, !44, !47}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !39, file: !36, line: 313, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !36, line: 38, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !39, file: !36, line: 314, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !36, line: 36, flags: DIFlagFwdDecl)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !39, file: !36, line: 315, baseType: !48, size: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !36, line: 285, size: 448, elements: !51)
!51 = !{!52, !56, !146, !149, !160, !162, !163}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !36, line: 286, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !50, file: !36, line: 287, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !36, line: 220, size: 1600, elements: !60)
!60 = !{!61, !67, !71, !72, !73, !74, !75, !76, !77, !78, !79, !84, !90, !102, !109, !113, !117, !121, !122, !123, !127, !136, !137, !138, !139}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !59, file: !36, line: 221, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !66}
!65 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !59, file: !36, line: 222, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !66}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !59, file: !36, line: 223, baseType: !62, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !59, file: !36, line: 224, baseType: !68, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !59, file: !36, line: 225, baseType: !62, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !59, file: !36, line: 226, baseType: !68, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !59, file: !36, line: 227, baseType: !62, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !59, file: !36, line: 228, baseType: !68, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !59, file: !36, line: 229, baseType: !62, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !59, file: !36, line: 230, baseType: !68, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !59, file: !36, line: 231, baseType: !80, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !66, !83}
!83 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !59, file: !36, line: 233, baseType: !85, size: 64, offset: 704)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !66, !83, !89}
!88 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !59, file: !36, line: 235, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!65, !66, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !36, line: 55, size: 320, elements: !96)
!96 = !{!97, !98, !99, !100, !101}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !95, file: !36, line: 56, baseType: !83, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !95, file: !36, line: 57, baseType: !83, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !95, file: !36, line: 58, baseType: !83, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !95, file: !36, line: 59, baseType: !83, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !95, file: !36, line: 60, baseType: !66, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !59, file: !36, line: 237, baseType: !103, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!65, !66, !106}
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !27, line: 17, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !29, line: 21, baseType: !108)
!108 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !59, file: !36, line: 238, baseType: !110, size: 64, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!106, !66}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !59, file: !36, line: 239, baseType: !114, size: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!65, !66, !83, !83}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !59, file: !36, line: 241, baseType: !118, size: 64, offset: 1024)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!65, !66, !83, !83, !106}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !59, file: !36, line: 244, baseType: !80, size: 64, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !59, file: !36, line: 246, baseType: !62, size: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !59, file: !36, line: 247, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!65, !66, !65}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !59, file: !36, line: 248, baseType: !128, size: 64, offset: 1280)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!65, !66, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !36, line: 69, size: 64, elements: !133)
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !132, file: !36, line: 70, baseType: !7, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !132, file: !36, line: 71, baseType: !7, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !59, file: !36, line: 250, baseType: !128, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !59, file: !36, line: 252, baseType: !62, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !59, file: !36, line: 253, baseType: !68, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !59, file: !36, line: 254, baseType: !140, size: 64, offset: 1536)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !66, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !145, line: 21, flags: DIFlagFwdDecl)
!145 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !50, file: !36, line: 289, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !50, file: !36, line: 290, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !36, line: 264, size: 256, elements: !153)
!153 = !{!154, !157, !158, !159}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !152, file: !36, line: 265, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !152, file: !36, line: 266, baseType: !53, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !152, file: !36, line: 267, baseType: !53, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !152, file: !36, line: 268, baseType: !65, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !50, file: !36, line: 291, baseType: !161, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !50, file: !36, line: 292, baseType: !106, size: 8, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !36, line: 293, baseType: !83, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !35, file: !36, line: 598, baseType: !33, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !35, file: !36, line: 599, baseType: !106, size: 8, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !35, file: !36, line: 600, baseType: !106, size: 8, offset: 264)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !35, file: !36, line: 601, baseType: !106, size: 8, offset: 272)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !35, file: !36, line: 602, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_div_table", file: !36, line: 551, size: 64, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !36, line: 552, baseType: !7, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "div", scope: !171, file: !36, line: 553, baseType: !7, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !35, file: !36, line: 603, baseType: !176, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !178, line: 83, baseType: !179)
!178 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !178, line: 71, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !178, line: 72, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !179, file: !178, line: 72, elements: !183)
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !182, file: !178, line: 73, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !178, line: 20, elements: !186)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !185, file: !178, line: 21, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !189, line: 25, baseType: !190)
!189 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !189, line: 25, elements: !191)
!191 = !{}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !27, line: 21, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !29, line: 27, baseType: !7)
!196 = !{!0, !197}
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "clk_divider_ro_ops", scope: !2, file: !3, line: 460, type: !58, isLocal: false, isDefinition: true)
!199 = !{!"rsp"}
!200 = !{i32 7, !"Dwarf Version", i32 4}
!201 = !{i32 2, !"Debug Info Version", i32 3}
!202 = !{i32 1, !"wchar_size", i32 2}
!203 = !{i32 1, !"Code Model", i32 2}
!204 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!205 = distinct !DISubprogram(name: "divider_recalc_rate", scope: !3, file: !3, line: 129, type: !206, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!206 = !DISubroutineType(types: !207)
!207 = !{!83, !66, !83, !7, !169, !83, !83}
!208 = !DILocalVariable(name: "hw", arg: 1, scope: !205, file: !3, line: 129, type: !66)
!209 = !DILocation(line: 129, column: 50, scope: !205)
!210 = !DILocalVariable(name: "parent_rate", arg: 2, scope: !205, file: !3, line: 129, type: !83)
!211 = !DILocation(line: 129, column: 68, scope: !205)
!212 = !DILocalVariable(name: "val", arg: 3, scope: !205, file: !3, line: 130, type: !7)
!213 = !DILocation(line: 130, column: 20, scope: !205)
!214 = !DILocalVariable(name: "table", arg: 4, scope: !205, file: !3, line: 131, type: !169)
!215 = !DILocation(line: 131, column: 35, scope: !205)
!216 = !DILocalVariable(name: "flags", arg: 5, scope: !205, file: !3, line: 132, type: !83)
!217 = !DILocation(line: 132, column: 21, scope: !205)
!218 = !DILocalVariable(name: "width", arg: 6, scope: !205, file: !3, line: 132, type: !83)
!219 = !DILocation(line: 132, column: 42, scope: !205)
!220 = !DILocalVariable(name: "div", scope: !205, file: !3, line: 134, type: !7)
!221 = !DILocation(line: 134, column: 15, scope: !205)
!222 = !DILocation(line: 136, column: 17, scope: !205)
!223 = !DILocation(line: 136, column: 24, scope: !205)
!224 = !DILocation(line: 136, column: 29, scope: !205)
!225 = !DILocation(line: 136, column: 36, scope: !205)
!226 = !DILocation(line: 136, column: 8, scope: !205)
!227 = !DILocation(line: 136, column: 6, scope: !205)
!228 = !DILocation(line: 137, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !205, file: !3, line: 137, column: 6)
!230 = !DILocation(line: 137, column: 6, scope: !205)
!231 = !DILocalVariable(name: "__ret_warn_on", scope: !232, file: !3, line: 138, type: !65)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 138, column: 3)
!233 = distinct !DILexicalBlock(scope: !229, file: !3, line: 137, column: 12)
!234 = !DILocation(line: 138, column: 3, scope: !232)
!235 = !DILocation(line: 138, column: 3, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !3, line: 138, column: 3)
!237 = !DILocation(line: 138, column: 3, scope: !238)
!238 = distinct !DILexicalBlock(scope: !236, file: !3, line: 138, column: 3)
!239 = !DILocation(line: 138, column: 3, scope: !240)
!240 = distinct !DILexicalBlock(scope: !238, file: !3, line: 138, column: 3)
!241 = !DILocation(line: 138, column: 3, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !3, line: 138, column: 3)
!243 = !DILocation(line: 138, column: 3, scope: !244)
!244 = distinct !DILexicalBlock(scope: !242, file: !3, line: 138, column: 3)
!245 = !DILocation(line: 138, column: 3, scope: !246)
!246 = distinct !DILexicalBlock(scope: !242, file: !3, line: 138, column: 3)
!247 = !{i32 -2143979911, i32 -2143979882, i32 -2143979836, i32 -2143979778, i32 -2143979724, i32 -2143979670, i32 -2143979615, i32 -2143979584}
!248 = !DILocation(line: 138, column: 3, scope: !249)
!249 = distinct !DILexicalBlock(scope: !242, file: !3, line: 138, column: 3)
!250 = !{i32 -2143979166, i32 -2143979159, i32 -2143979107, i32 -2143979076, i32 -2143979046}
!251 = !DILocation(line: 138, column: 3, scope: !252)
!252 = distinct !DILexicalBlock(scope: !242, file: !3, line: 138, column: 3)
!253 = !DILocation(line: 138, column: 3, scope: !254)
!254 = distinct !DILexicalBlock(scope: !238, file: !3, line: 138, column: 3)
!255 = !DILocation(line: 141, column: 10, scope: !233)
!256 = !DILocation(line: 141, column: 3, scope: !233)
!257 = !DILocalVariable(name: "_tmp", scope: !258, file: !3, line: 144, type: !25)
!258 = distinct !DILexicalBlock(scope: !205, file: !3, line: 144, column: 9)
!259 = !DILocation(line: 144, column: 9, scope: !258)
!260 = !DILocalVariable(name: "__base", scope: !261, file: !3, line: 144, type: !262)
!261 = distinct !DILexicalBlock(scope: !258, file: !3, line: 144, column: 9)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 104, baseType: !194)
!263 = !DILocation(line: 144, column: 9, scope: !261)
!264 = !DILocalVariable(name: "__rem", scope: !261, file: !3, line: 144, type: !262)
!265 = !DILocation(line: 144, column: 2, scope: !205)
!266 = !DILocation(line: 145, column: 1, scope: !205)
!267 = distinct !DISubprogram(name: "_get_div", scope: !3, file: !3, line: 90, type: !268, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!268 = !DISubroutineType(types: !269)
!269 = !{!7, !169, !7, !83, !106}
!270 = !DILocalVariable(name: "table", arg: 1, scope: !267, file: !3, line: 90, type: !169)
!271 = !DILocation(line: 90, column: 58, scope: !267)
!272 = !DILocalVariable(name: "val", arg: 2, scope: !267, file: !3, line: 91, type: !7)
!273 = !DILocation(line: 91, column: 22, scope: !267)
!274 = !DILocalVariable(name: "flags", arg: 3, scope: !267, file: !3, line: 91, type: !83)
!275 = !DILocation(line: 91, column: 41, scope: !267)
!276 = !DILocalVariable(name: "width", arg: 4, scope: !267, file: !3, line: 91, type: !106)
!277 = !DILocation(line: 91, column: 51, scope: !267)
!278 = !DILocation(line: 93, column: 6, scope: !279)
!279 = distinct !DILexicalBlock(scope: !267, file: !3, line: 93, column: 6)
!280 = !DILocation(line: 93, column: 12, scope: !279)
!281 = !DILocation(line: 93, column: 6, scope: !267)
!282 = !DILocation(line: 94, column: 10, scope: !279)
!283 = !DILocation(line: 94, column: 3, scope: !279)
!284 = !DILocation(line: 95, column: 6, scope: !285)
!285 = distinct !DILexicalBlock(scope: !267, file: !3, line: 95, column: 6)
!286 = !DILocation(line: 95, column: 12, scope: !285)
!287 = !DILocation(line: 95, column: 6, scope: !267)
!288 = !DILocation(line: 96, column: 15, scope: !285)
!289 = !DILocation(line: 96, column: 12, scope: !285)
!290 = !DILocation(line: 96, column: 3, scope: !285)
!291 = !DILocation(line: 97, column: 6, scope: !292)
!292 = distinct !DILexicalBlock(scope: !267, file: !3, line: 97, column: 6)
!293 = !DILocation(line: 97, column: 12, scope: !292)
!294 = !DILocation(line: 97, column: 6, scope: !267)
!295 = !DILocation(line: 98, column: 10, scope: !292)
!296 = !DILocation(line: 98, column: 16, scope: !292)
!297 = !DILocation(line: 98, column: 22, scope: !292)
!298 = !DILocation(line: 98, column: 42, scope: !292)
!299 = !DILocation(line: 98, column: 3, scope: !292)
!300 = !DILocation(line: 99, column: 6, scope: !301)
!301 = distinct !DILexicalBlock(scope: !267, file: !3, line: 99, column: 6)
!302 = !DILocation(line: 99, column: 6, scope: !267)
!303 = !DILocation(line: 100, column: 25, scope: !301)
!304 = !DILocation(line: 100, column: 32, scope: !301)
!305 = !DILocation(line: 100, column: 10, scope: !301)
!306 = !DILocation(line: 100, column: 3, scope: !301)
!307 = !DILocation(line: 101, column: 9, scope: !267)
!308 = !DILocation(line: 101, column: 13, scope: !267)
!309 = !DILocation(line: 101, column: 2, scope: !267)
!310 = !DILocation(line: 102, column: 1, scope: !267)
!311 = distinct !DISubprogram(name: "divider_round_rate_parent", scope: !3, file: !3, line: 345, type: !312, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!312 = !DISubroutineType(types: !313)
!313 = !{!88, !66, !66, !83, !89, !169, !106, !83}
!314 = !DILocalVariable(name: "hw", arg: 1, scope: !311, file: !3, line: 345, type: !66)
!315 = !DILocation(line: 345, column: 47, scope: !311)
!316 = !DILocalVariable(name: "parent", arg: 2, scope: !311, file: !3, line: 345, type: !66)
!317 = !DILocation(line: 345, column: 66, scope: !311)
!318 = !DILocalVariable(name: "rate", arg: 3, scope: !311, file: !3, line: 346, type: !83)
!319 = !DILocation(line: 346, column: 25, scope: !311)
!320 = !DILocalVariable(name: "prate", arg: 4, scope: !311, file: !3, line: 346, type: !89)
!321 = !DILocation(line: 346, column: 46, scope: !311)
!322 = !DILocalVariable(name: "table", arg: 5, scope: !311, file: !3, line: 347, type: !169)
!323 = !DILocation(line: 347, column: 39, scope: !311)
!324 = !DILocalVariable(name: "width", arg: 6, scope: !311, file: !3, line: 348, type: !106)
!325 = !DILocation(line: 348, column: 14, scope: !311)
!326 = !DILocalVariable(name: "flags", arg: 7, scope: !311, file: !3, line: 348, type: !83)
!327 = !DILocation(line: 348, column: 35, scope: !311)
!328 = !DILocalVariable(name: "div", scope: !311, file: !3, line: 350, type: !65)
!329 = !DILocation(line: 350, column: 6, scope: !311)
!330 = !DILocation(line: 352, column: 28, scope: !311)
!331 = !DILocation(line: 352, column: 32, scope: !311)
!332 = !DILocation(line: 352, column: 40, scope: !311)
!333 = !DILocation(line: 352, column: 46, scope: !311)
!334 = !DILocation(line: 352, column: 53, scope: !311)
!335 = !DILocation(line: 352, column: 60, scope: !311)
!336 = !DILocation(line: 352, column: 67, scope: !311)
!337 = !DILocation(line: 352, column: 8, scope: !311)
!338 = !DILocation(line: 352, column: 6, scope: !311)
!339 = !DILocalVariable(name: "_tmp", scope: !340, file: !3, line: 354, type: !25)
!340 = distinct !DILexicalBlock(scope: !311, file: !3, line: 354, column: 9)
!341 = !DILocation(line: 354, column: 9, scope: !340)
!342 = !DILocalVariable(name: "__base", scope: !343, file: !3, line: 354, type: !262)
!343 = distinct !DILexicalBlock(scope: !340, file: !3, line: 354, column: 9)
!344 = !DILocation(line: 354, column: 9, scope: !343)
!345 = !DILocalVariable(name: "__rem", scope: !343, file: !3, line: 354, type: !262)
!346 = !DILocation(line: 354, column: 2, scope: !311)
!347 = distinct !DISubprogram(name: "clk_divider_bestdiv", scope: !3, file: !3, line: 288, type: !348, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!348 = !DISubroutineType(types: !349)
!349 = !{!65, !66, !66, !83, !89, !169, !106, !83}
!350 = !DILocalVariable(name: "hw", arg: 1, scope: !347, file: !3, line: 288, type: !66)
!351 = !DILocation(line: 288, column: 47, scope: !347)
!352 = !DILocalVariable(name: "parent", arg: 2, scope: !347, file: !3, line: 288, type: !66)
!353 = !DILocation(line: 288, column: 66, scope: !347)
!354 = !DILocalVariable(name: "rate", arg: 3, scope: !347, file: !3, line: 289, type: !83)
!355 = !DILocation(line: 289, column: 25, scope: !347)
!356 = !DILocalVariable(name: "best_parent_rate", arg: 4, scope: !347, file: !3, line: 290, type: !89)
!357 = !DILocation(line: 290, column: 26, scope: !347)
!358 = !DILocalVariable(name: "table", arg: 5, scope: !347, file: !3, line: 291, type: !169)
!359 = !DILocation(line: 291, column: 39, scope: !347)
!360 = !DILocalVariable(name: "width", arg: 6, scope: !347, file: !3, line: 291, type: !106)
!361 = !DILocation(line: 291, column: 49, scope: !347)
!362 = !DILocalVariable(name: "flags", arg: 7, scope: !347, file: !3, line: 292, type: !83)
!363 = !DILocation(line: 292, column: 25, scope: !347)
!364 = !DILocalVariable(name: "i", scope: !347, file: !3, line: 294, type: !65)
!365 = !DILocation(line: 294, column: 6, scope: !347)
!366 = !DILocalVariable(name: "bestdiv", scope: !347, file: !3, line: 294, type: !65)
!367 = !DILocation(line: 294, column: 9, scope: !347)
!368 = !DILocalVariable(name: "parent_rate", scope: !347, file: !3, line: 295, type: !83)
!369 = !DILocation(line: 295, column: 16, scope: !347)
!370 = !DILocalVariable(name: "best", scope: !347, file: !3, line: 295, type: !83)
!371 = !DILocation(line: 295, column: 29, scope: !347)
!372 = !DILocalVariable(name: "now", scope: !347, file: !3, line: 295, type: !83)
!373 = !DILocation(line: 295, column: 39, scope: !347)
!374 = !DILocalVariable(name: "maxdiv", scope: !347, file: !3, line: 295, type: !83)
!375 = !DILocation(line: 295, column: 44, scope: !347)
!376 = !DILocalVariable(name: "parent_rate_saved", scope: !347, file: !3, line: 296, type: !83)
!377 = !DILocation(line: 296, column: 16, scope: !347)
!378 = !DILocation(line: 296, column: 37, scope: !347)
!379 = !DILocation(line: 296, column: 36, scope: !347)
!380 = !DILocation(line: 298, column: 7, scope: !381)
!381 = distinct !DILexicalBlock(scope: !347, file: !3, line: 298, column: 6)
!382 = !DILocation(line: 298, column: 6, scope: !347)
!383 = !DILocation(line: 299, column: 8, scope: !381)
!384 = !DILocation(line: 299, column: 3, scope: !381)
!385 = !DILocation(line: 301, column: 23, scope: !347)
!386 = !DILocation(line: 301, column: 30, scope: !347)
!387 = !DILocation(line: 301, column: 37, scope: !347)
!388 = !DILocation(line: 301, column: 11, scope: !347)
!389 = !DILocation(line: 301, column: 9, scope: !347)
!390 = !DILocation(line: 303, column: 25, scope: !391)
!391 = distinct !DILexicalBlock(scope: !347, file: !3, line: 303, column: 6)
!392 = !DILocation(line: 303, column: 8, scope: !391)
!393 = !DILocation(line: 303, column: 29, scope: !391)
!394 = !DILocation(line: 303, column: 6, scope: !347)
!395 = !DILocation(line: 304, column: 18, scope: !396)
!396 = distinct !DILexicalBlock(scope: !391, file: !3, line: 303, column: 53)
!397 = !DILocation(line: 304, column: 17, scope: !396)
!398 = !DILocation(line: 304, column: 15, scope: !396)
!399 = !DILocation(line: 305, column: 24, scope: !396)
!400 = !DILocation(line: 305, column: 31, scope: !396)
!401 = !DILocation(line: 305, column: 44, scope: !396)
!402 = !DILocation(line: 305, column: 50, scope: !396)
!403 = !DILocation(line: 305, column: 13, scope: !396)
!404 = !DILocation(line: 305, column: 11, scope: !396)
!405 = !DILocation(line: 306, column: 13, scope: !396)
!406 = !DILocation(line: 306, column: 21, scope: !396)
!407 = !DILocation(line: 306, column: 32, scope: !396)
!408 = !DILocation(line: 306, column: 11, scope: !396)
!409 = !DILocation(line: 307, column: 13, scope: !396)
!410 = !DILocation(line: 307, column: 23, scope: !396)
!411 = !DILocation(line: 307, column: 21, scope: !396)
!412 = !DILocation(line: 307, column: 32, scope: !396)
!413 = !DILocation(line: 307, column: 41, scope: !396)
!414 = !DILocation(line: 307, column: 11, scope: !396)
!415 = !DILocation(line: 308, column: 10, scope: !396)
!416 = !DILocation(line: 308, column: 3, scope: !396)
!417 = !DILocalVariable(name: "__UNIQUE_ID___x108", scope: !418, file: !3, line: 315, type: !83)
!418 = distinct !DILexicalBlock(scope: !347, file: !3, line: 315, column: 11)
!419 = !DILocation(line: 315, column: 11, scope: !418)
!420 = !DILocalVariable(name: "__UNIQUE_ID___y109", scope: !418, file: !3, line: 315, type: !83)
!421 = !DILocation(line: 315, column: 9, scope: !347)
!422 = !DILocation(line: 317, column: 21, scope: !423)
!423 = distinct !DILexicalBlock(scope: !347, file: !3, line: 317, column: 2)
!424 = !DILocation(line: 317, column: 31, scope: !423)
!425 = !DILocation(line: 317, column: 11, scope: !423)
!426 = !DILocation(line: 317, column: 9, scope: !423)
!427 = !DILocation(line: 317, column: 7, scope: !423)
!428 = !DILocation(line: 317, column: 39, scope: !429)
!429 = distinct !DILexicalBlock(scope: !423, file: !3, line: 317, column: 2)
!430 = !DILocation(line: 317, column: 44, scope: !429)
!431 = !DILocation(line: 317, column: 41, scope: !429)
!432 = !DILocation(line: 317, column: 2, scope: !423)
!433 = !DILocation(line: 319, column: 7, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 319, column: 7)
!435 = distinct !DILexicalBlock(scope: !429, file: !3, line: 318, column: 43)
!436 = !DILocation(line: 319, column: 14, scope: !434)
!437 = !DILocation(line: 319, column: 12, scope: !434)
!438 = !DILocation(line: 319, column: 19, scope: !434)
!439 = !DILocation(line: 319, column: 16, scope: !434)
!440 = !DILocation(line: 319, column: 7, scope: !435)
!441 = !DILocation(line: 325, column: 24, scope: !442)
!442 = distinct !DILexicalBlock(scope: !434, file: !3, line: 319, column: 38)
!443 = !DILocation(line: 325, column: 5, scope: !442)
!444 = !DILocation(line: 325, column: 22, scope: !442)
!445 = !DILocation(line: 326, column: 11, scope: !442)
!446 = !DILocation(line: 326, column: 4, scope: !442)
!447 = !DILocation(line: 328, column: 35, scope: !435)
!448 = !DILocation(line: 328, column: 43, scope: !435)
!449 = !DILocation(line: 328, column: 50, scope: !435)
!450 = !DILocation(line: 328, column: 48, scope: !435)
!451 = !DILocation(line: 328, column: 17, scope: !435)
!452 = !DILocation(line: 328, column: 15, scope: !435)
!453 = !DILocalVariable(name: "_tmp", scope: !454, file: !3, line: 329, type: !25)
!454 = distinct !DILexicalBlock(scope: !435, file: !3, line: 329, column: 9)
!455 = !DILocation(line: 329, column: 9, scope: !454)
!456 = !DILocalVariable(name: "__base", scope: !457, file: !3, line: 329, type: !262)
!457 = distinct !DILexicalBlock(scope: !454, file: !3, line: 329, column: 9)
!458 = !DILocation(line: 329, column: 9, scope: !457)
!459 = !DILocalVariable(name: "__rem", scope: !457, file: !3, line: 329, type: !262)
!460 = !DILocation(line: 329, column: 7, scope: !435)
!461 = !DILocation(line: 330, column: 20, scope: !462)
!462 = distinct !DILexicalBlock(scope: !435, file: !3, line: 330, column: 7)
!463 = !DILocation(line: 330, column: 26, scope: !462)
!464 = !DILocation(line: 330, column: 31, scope: !462)
!465 = !DILocation(line: 330, column: 37, scope: !462)
!466 = !DILocation(line: 330, column: 7, scope: !462)
!467 = !DILocation(line: 330, column: 7, scope: !435)
!468 = !DILocation(line: 331, column: 14, scope: !469)
!469 = distinct !DILexicalBlock(scope: !462, file: !3, line: 330, column: 45)
!470 = !DILocation(line: 331, column: 12, scope: !469)
!471 = !DILocation(line: 332, column: 11, scope: !469)
!472 = !DILocation(line: 332, column: 9, scope: !469)
!473 = !DILocation(line: 333, column: 24, scope: !469)
!474 = !DILocation(line: 333, column: 5, scope: !469)
!475 = !DILocation(line: 333, column: 22, scope: !469)
!476 = !DILocation(line: 334, column: 3, scope: !469)
!477 = !DILocation(line: 335, column: 2, scope: !435)
!478 = !DILocation(line: 318, column: 25, scope: !429)
!479 = !DILocation(line: 318, column: 32, scope: !429)
!480 = !DILocation(line: 318, column: 35, scope: !429)
!481 = !DILocation(line: 318, column: 15, scope: !429)
!482 = !DILocation(line: 318, column: 13, scope: !429)
!483 = !DILocation(line: 317, column: 2, scope: !429)
!484 = distinct !{!484, !432, !485}
!485 = !DILocation(line: 335, column: 2, scope: !423)
!486 = !DILocation(line: 337, column: 7, scope: !487)
!487 = distinct !DILexicalBlock(scope: !347, file: !3, line: 337, column: 6)
!488 = !DILocation(line: 337, column: 6, scope: !347)
!489 = !DILocation(line: 338, column: 25, scope: !490)
!490 = distinct !DILexicalBlock(scope: !487, file: !3, line: 337, column: 16)
!491 = !DILocation(line: 338, column: 32, scope: !490)
!492 = !DILocation(line: 338, column: 39, scope: !490)
!493 = !DILocation(line: 338, column: 13, scope: !490)
!494 = !DILocation(line: 338, column: 11, scope: !490)
!495 = !DILocation(line: 339, column: 41, scope: !490)
!496 = !DILocation(line: 339, column: 23, scope: !490)
!497 = !DILocation(line: 339, column: 4, scope: !490)
!498 = !DILocation(line: 339, column: 21, scope: !490)
!499 = !DILocation(line: 340, column: 2, scope: !490)
!500 = !DILocation(line: 342, column: 9, scope: !347)
!501 = !DILocation(line: 342, column: 2, scope: !347)
!502 = !DILocation(line: 343, column: 1, scope: !347)
!503 = distinct !DISubprogram(name: "divider_ro_round_rate_parent", scope: !3, file: !3, line: 358, type: !504, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!504 = !DISubroutineType(types: !505)
!505 = !{!88, !66, !66, !83, !89, !169, !106, !83, !7}
!506 = !DILocalVariable(name: "hw", arg: 1, scope: !503, file: !3, line: 358, type: !66)
!507 = !DILocation(line: 358, column: 50, scope: !503)
!508 = !DILocalVariable(name: "parent", arg: 2, scope: !503, file: !3, line: 358, type: !66)
!509 = !DILocation(line: 358, column: 69, scope: !503)
!510 = !DILocalVariable(name: "rate", arg: 3, scope: !503, file: !3, line: 359, type: !83)
!511 = !DILocation(line: 359, column: 21, scope: !503)
!512 = !DILocalVariable(name: "prate", arg: 4, scope: !503, file: !3, line: 359, type: !89)
!513 = !DILocation(line: 359, column: 42, scope: !503)
!514 = !DILocalVariable(name: "table", arg: 5, scope: !503, file: !3, line: 360, type: !169)
!515 = !DILocation(line: 360, column: 35, scope: !503)
!516 = !DILocalVariable(name: "width", arg: 6, scope: !503, file: !3, line: 360, type: !106)
!517 = !DILocation(line: 360, column: 45, scope: !503)
!518 = !DILocalVariable(name: "flags", arg: 7, scope: !503, file: !3, line: 361, type: !83)
!519 = !DILocation(line: 361, column: 21, scope: !503)
!520 = !DILocalVariable(name: "val", arg: 8, scope: !503, file: !3, line: 361, type: !7)
!521 = !DILocation(line: 361, column: 41, scope: !503)
!522 = !DILocalVariable(name: "div", scope: !503, file: !3, line: 363, type: !65)
!523 = !DILocation(line: 363, column: 6, scope: !503)
!524 = !DILocation(line: 365, column: 17, scope: !503)
!525 = !DILocation(line: 365, column: 24, scope: !503)
!526 = !DILocation(line: 365, column: 29, scope: !503)
!527 = !DILocation(line: 365, column: 36, scope: !503)
!528 = !DILocation(line: 365, column: 8, scope: !503)
!529 = !DILocation(line: 365, column: 6, scope: !503)
!530 = !DILocation(line: 368, column: 23, scope: !531)
!531 = distinct !DILexicalBlock(scope: !503, file: !3, line: 368, column: 6)
!532 = !DILocation(line: 368, column: 6, scope: !531)
!533 = !DILocation(line: 368, column: 27, scope: !531)
!534 = !DILocation(line: 368, column: 6, scope: !503)
!535 = !DILocation(line: 369, column: 8, scope: !536)
!536 = distinct !DILexicalBlock(scope: !537, file: !3, line: 369, column: 7)
!537 = distinct !DILexicalBlock(scope: !531, file: !3, line: 368, column: 50)
!538 = !DILocation(line: 369, column: 7, scope: !537)
!539 = !DILocation(line: 370, column: 4, scope: !536)
!540 = !DILocation(line: 372, column: 30, scope: !537)
!541 = !DILocation(line: 372, column: 38, scope: !537)
!542 = !DILocation(line: 372, column: 45, scope: !537)
!543 = !DILocation(line: 372, column: 43, scope: !537)
!544 = !DILocation(line: 372, column: 12, scope: !537)
!545 = !DILocation(line: 372, column: 4, scope: !537)
!546 = !DILocation(line: 372, column: 10, scope: !537)
!547 = !DILocation(line: 373, column: 2, scope: !537)
!548 = !DILocalVariable(name: "_tmp", scope: !549, file: !3, line: 375, type: !25)
!549 = distinct !DILexicalBlock(scope: !503, file: !3, line: 375, column: 9)
!550 = !DILocation(line: 375, column: 9, scope: !549)
!551 = !DILocalVariable(name: "__base", scope: !552, file: !3, line: 375, type: !262)
!552 = distinct !DILexicalBlock(scope: !549, file: !3, line: 375, column: 9)
!553 = !DILocation(line: 375, column: 9, scope: !552)
!554 = !DILocalVariable(name: "__rem", scope: !552, file: !3, line: 375, type: !262)
!555 = !DILocation(line: 375, column: 2, scope: !503)
!556 = !DILocation(line: 376, column: 1, scope: !503)
!557 = distinct !DISubprogram(name: "divider_get_val", scope: !3, file: !3, line: 401, type: !558, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!558 = !DISubroutineType(types: !559)
!559 = !{!65, !83, !83, !169, !106, !83}
!560 = !DILocalVariable(name: "rate", arg: 1, scope: !557, file: !3, line: 401, type: !83)
!561 = !DILocation(line: 401, column: 35, scope: !557)
!562 = !DILocalVariable(name: "parent_rate", arg: 2, scope: !557, file: !3, line: 401, type: !83)
!563 = !DILocation(line: 401, column: 55, scope: !557)
!564 = !DILocalVariable(name: "table", arg: 3, scope: !557, file: !3, line: 402, type: !169)
!565 = !DILocation(line: 402, column: 35, scope: !557)
!566 = !DILocalVariable(name: "width", arg: 4, scope: !557, file: !3, line: 402, type: !106)
!567 = !DILocation(line: 402, column: 45, scope: !557)
!568 = !DILocalVariable(name: "flags", arg: 5, scope: !557, file: !3, line: 403, type: !83)
!569 = !DILocation(line: 403, column: 21, scope: !557)
!570 = !DILocalVariable(name: "div", scope: !557, file: !3, line: 405, type: !7)
!571 = !DILocation(line: 405, column: 15, scope: !557)
!572 = !DILocalVariable(name: "value", scope: !557, file: !3, line: 405, type: !7)
!573 = !DILocation(line: 405, column: 20, scope: !557)
!574 = !DILocalVariable(name: "_tmp", scope: !575, file: !3, line: 407, type: !25)
!575 = distinct !DILexicalBlock(scope: !557, file: !3, line: 407, column: 8)
!576 = !DILocation(line: 407, column: 8, scope: !575)
!577 = !DILocalVariable(name: "__base", scope: !578, file: !3, line: 407, type: !262)
!578 = distinct !DILexicalBlock(scope: !575, file: !3, line: 407, column: 8)
!579 = !DILocation(line: 407, column: 8, scope: !578)
!580 = !DILocalVariable(name: "__rem", scope: !578, file: !3, line: 407, type: !262)
!581 = !DILocation(line: 407, column: 8, scope: !557)
!582 = !DILocation(line: 407, column: 6, scope: !557)
!583 = !DILocation(line: 409, column: 21, scope: !584)
!584 = distinct !DILexicalBlock(scope: !557, file: !3, line: 409, column: 6)
!585 = !DILocation(line: 409, column: 28, scope: !584)
!586 = !DILocation(line: 409, column: 33, scope: !584)
!587 = !DILocation(line: 409, column: 7, scope: !584)
!588 = !DILocation(line: 409, column: 6, scope: !557)
!589 = !DILocation(line: 410, column: 3, scope: !584)
!590 = !DILocation(line: 412, column: 19, scope: !557)
!591 = !DILocation(line: 412, column: 26, scope: !557)
!592 = !DILocation(line: 412, column: 31, scope: !557)
!593 = !DILocation(line: 412, column: 38, scope: !557)
!594 = !DILocation(line: 412, column: 10, scope: !557)
!595 = !DILocation(line: 412, column: 8, scope: !557)
!596 = !DILocalVariable(name: "__UNIQUE_ID___x111", scope: !597, file: !3, line: 414, type: !7)
!597 = distinct !DILexicalBlock(scope: !557, file: !3, line: 414, column: 9)
!598 = !DILocation(line: 414, column: 9, scope: !597)
!599 = !DILocalVariable(name: "__UNIQUE_ID___y112", scope: !597, file: !3, line: 414, type: !7)
!600 = !DILocation(line: 414, column: 2, scope: !557)
!601 = !DILocation(line: 415, column: 1, scope: !557)
!602 = distinct !DISubprogram(name: "_is_valid_div", scope: !3, file: !3, line: 172, type: !603, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !169, !7, !83}
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !31, line: 30, baseType: !606)
!606 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!607 = !DILocalVariable(name: "table", arg: 1, scope: !602, file: !3, line: 172, type: !169)
!608 = !DILocation(line: 172, column: 55, scope: !602)
!609 = !DILocalVariable(name: "div", arg: 2, scope: !602, file: !3, line: 172, type: !7)
!610 = !DILocation(line: 172, column: 75, scope: !602)
!611 = !DILocalVariable(name: "flags", arg: 3, scope: !602, file: !3, line: 173, type: !83)
!612 = !DILocation(line: 173, column: 20, scope: !602)
!613 = !DILocation(line: 175, column: 6, scope: !614)
!614 = distinct !DILexicalBlock(scope: !602, file: !3, line: 175, column: 6)
!615 = !DILocation(line: 175, column: 12, scope: !614)
!616 = !DILocation(line: 175, column: 6, scope: !602)
!617 = !DILocation(line: 176, column: 24, scope: !614)
!618 = !DILocation(line: 176, column: 10, scope: !614)
!619 = !DILocation(line: 176, column: 3, scope: !614)
!620 = !DILocation(line: 177, column: 6, scope: !621)
!621 = distinct !DILexicalBlock(scope: !602, file: !3, line: 177, column: 6)
!622 = !DILocation(line: 177, column: 6, scope: !602)
!623 = !DILocation(line: 178, column: 30, scope: !621)
!624 = !DILocation(line: 178, column: 37, scope: !621)
!625 = !DILocation(line: 178, column: 10, scope: !621)
!626 = !DILocation(line: 178, column: 3, scope: !621)
!627 = !DILocation(line: 179, column: 2, scope: !602)
!628 = !DILocation(line: 180, column: 1, scope: !602)
!629 = distinct !DISubprogram(name: "_get_val", scope: !3, file: !3, line: 115, type: !268, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!630 = !DILocalVariable(name: "word", arg: 1, scope: !631, file: !632, line: 233, type: !83)
!631 = distinct !DISubprogram(name: "__ffs", scope: !632, file: !632, line: 233, type: !633, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!632 = !DIFile(filename: "./arch/x86/include/asm/bitops.h", directory: "/home/lizy2001/genbc/linux")
!633 = !DISubroutineType(types: !634)
!634 = !{!83, !83}
!635 = !DILocation(line: 233, column: 58, scope: !631, inlinedAt: !636)
!636 = distinct !DILocation(line: 121, column: 10, scope: !637)
!637 = distinct !DILexicalBlock(scope: !629, file: !3, line: 120, column: 6)
!638 = !DILocalVariable(name: "table", arg: 1, scope: !629, file: !3, line: 115, type: !169)
!639 = !DILocation(line: 115, column: 58, scope: !629)
!640 = !DILocalVariable(name: "div", arg: 2, scope: !629, file: !3, line: 116, type: !7)
!641 = !DILocation(line: 116, column: 22, scope: !629)
!642 = !DILocalVariable(name: "flags", arg: 3, scope: !629, file: !3, line: 116, type: !83)
!643 = !DILocation(line: 116, column: 41, scope: !629)
!644 = !DILocalVariable(name: "width", arg: 4, scope: !629, file: !3, line: 116, type: !106)
!645 = !DILocation(line: 116, column: 51, scope: !629)
!646 = !DILocation(line: 118, column: 6, scope: !647)
!647 = distinct !DILexicalBlock(scope: !629, file: !3, line: 118, column: 6)
!648 = !DILocation(line: 118, column: 12, scope: !647)
!649 = !DILocation(line: 118, column: 6, scope: !629)
!650 = !DILocation(line: 119, column: 10, scope: !647)
!651 = !DILocation(line: 119, column: 3, scope: !647)
!652 = !DILocation(line: 120, column: 6, scope: !637)
!653 = !DILocation(line: 120, column: 12, scope: !637)
!654 = !DILocation(line: 120, column: 6, scope: !629)
!655 = !DILocation(line: 121, column: 16, scope: !637)
!656 = !DILocation(line: 237, column: 11, scope: !631, inlinedAt: !636)
!657 = !DILocation(line: 235, column: 2, scope: !631, inlinedAt: !636)
!658 = !{i32 293990}
!659 = !DILocation(line: 238, column: 9, scope: !631, inlinedAt: !636)
!660 = !DILocation(line: 121, column: 10, scope: !637)
!661 = !DILocation(line: 121, column: 3, scope: !637)
!662 = !DILocation(line: 122, column: 6, scope: !663)
!663 = distinct !DILexicalBlock(scope: !629, file: !3, line: 122, column: 6)
!664 = !DILocation(line: 122, column: 12, scope: !663)
!665 = !DILocation(line: 122, column: 6, scope: !629)
!666 = !DILocation(line: 123, column: 11, scope: !663)
!667 = !DILocation(line: 123, column: 18, scope: !663)
!668 = !DILocation(line: 123, column: 38, scope: !663)
!669 = !DILocation(line: 123, column: 15, scope: !663)
!670 = !DILocation(line: 123, column: 10, scope: !663)
!671 = !DILocation(line: 123, column: 49, scope: !663)
!672 = !DILocation(line: 123, column: 3, scope: !663)
!673 = !DILocation(line: 124, column: 6, scope: !674)
!674 = distinct !DILexicalBlock(scope: !629, file: !3, line: 124, column: 6)
!675 = !DILocation(line: 124, column: 6, scope: !629)
!676 = !DILocation(line: 125, column: 26, scope: !674)
!677 = !DILocation(line: 125, column: 33, scope: !674)
!678 = !DILocation(line: 125, column: 11, scope: !674)
!679 = !DILocation(line: 125, column: 3, scope: !674)
!680 = !DILocation(line: 126, column: 9, scope: !629)
!681 = !DILocation(line: 126, column: 13, scope: !629)
!682 = !DILocation(line: 126, column: 2, scope: !629)
!683 = !DILocation(line: 127, column: 1, scope: !629)
!684 = distinct !DISubprogram(name: "clk_divider_recalc_rate", scope: !3, file: !3, line: 148, type: !81, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!685 = !DILocalVariable(name: "hw", arg: 1, scope: !684, file: !3, line: 148, type: !66)
!686 = !DILocation(line: 148, column: 61, scope: !684)
!687 = !DILocalVariable(name: "parent_rate", arg: 2, scope: !684, file: !3, line: 149, type: !83)
!688 = !DILocation(line: 149, column: 17, scope: !684)
!689 = !DILocalVariable(name: "divider", scope: !684, file: !3, line: 151, type: !34)
!690 = !DILocation(line: 151, column: 22, scope: !684)
!691 = !DILocalVariable(name: "__mptr", scope: !692, file: !3, line: 151, type: !33)
!692 = distinct !DILexicalBlock(scope: !684, file: !3, line: 151, column: 32)
!693 = !DILocation(line: 151, column: 32, scope: !692)
!694 = !DILocation(line: 151, column: 32, scope: !695)
!695 = distinct !DILexicalBlock(scope: !692, file: !3, line: 151, column: 32)
!696 = !DILocalVariable(name: "val", scope: !684, file: !3, line: 152, type: !7)
!697 = !DILocation(line: 152, column: 15, scope: !684)
!698 = !DILocation(line: 154, column: 22, scope: !684)
!699 = !DILocation(line: 154, column: 8, scope: !684)
!700 = !DILocation(line: 154, column: 34, scope: !684)
!701 = !DILocation(line: 154, column: 43, scope: !684)
!702 = !DILocation(line: 154, column: 31, scope: !684)
!703 = !DILocation(line: 154, column: 6, scope: !684)
!704 = !DILocation(line: 155, column: 9, scope: !684)
!705 = !DILocation(line: 155, column: 6, scope: !684)
!706 = !DILocation(line: 157, column: 29, scope: !684)
!707 = !DILocation(line: 157, column: 33, scope: !684)
!708 = !DILocation(line: 157, column: 46, scope: !684)
!709 = !DILocation(line: 157, column: 51, scope: !684)
!710 = !DILocation(line: 157, column: 60, scope: !684)
!711 = !DILocation(line: 158, column: 8, scope: !684)
!712 = !DILocation(line: 158, column: 17, scope: !684)
!713 = !DILocation(line: 158, column: 24, scope: !684)
!714 = !DILocation(line: 158, column: 33, scope: !684)
!715 = !DILocation(line: 157, column: 9, scope: !684)
!716 = !DILocation(line: 157, column: 2, scope: !684)
!717 = distinct !DISubprogram(name: "clk_divider_round_rate", scope: !3, file: !3, line: 380, type: !86, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!718 = !DILocalVariable(name: "hw", arg: 1, scope: !717, file: !3, line: 380, type: !66)
!719 = !DILocation(line: 380, column: 51, scope: !717)
!720 = !DILocalVariable(name: "rate", arg: 2, scope: !717, file: !3, line: 380, type: !83)
!721 = !DILocation(line: 380, column: 69, scope: !717)
!722 = !DILocalVariable(name: "prate", arg: 3, scope: !717, file: !3, line: 381, type: !89)
!723 = !DILocation(line: 381, column: 20, scope: !717)
!724 = !DILocalVariable(name: "divider", scope: !717, file: !3, line: 383, type: !34)
!725 = !DILocation(line: 383, column: 22, scope: !717)
!726 = !DILocalVariable(name: "__mptr", scope: !727, file: !3, line: 383, type: !33)
!727 = distinct !DILexicalBlock(scope: !717, file: !3, line: 383, column: 32)
!728 = !DILocation(line: 383, column: 32, scope: !727)
!729 = !DILocation(line: 383, column: 32, scope: !730)
!730 = distinct !DILexicalBlock(scope: !727, file: !3, line: 383, column: 32)
!731 = !DILocation(line: 386, column: 6, scope: !732)
!732 = distinct !DILexicalBlock(scope: !717, file: !3, line: 386, column: 6)
!733 = !DILocation(line: 386, column: 15, scope: !732)
!734 = !DILocation(line: 386, column: 21, scope: !732)
!735 = !DILocation(line: 386, column: 6, scope: !717)
!736 = !DILocalVariable(name: "val", scope: !737, file: !3, line: 387, type: !194)
!737 = distinct !DILexicalBlock(scope: !732, file: !3, line: 386, column: 46)
!738 = !DILocation(line: 387, column: 7, scope: !737)
!739 = !DILocation(line: 389, column: 23, scope: !737)
!740 = !DILocation(line: 389, column: 9, scope: !737)
!741 = !DILocation(line: 389, column: 35, scope: !737)
!742 = !DILocation(line: 389, column: 44, scope: !737)
!743 = !DILocation(line: 389, column: 32, scope: !737)
!744 = !DILocation(line: 389, column: 7, scope: !737)
!745 = !DILocation(line: 390, column: 10, scope: !737)
!746 = !DILocation(line: 390, column: 7, scope: !737)
!747 = !DILocation(line: 392, column: 32, scope: !737)
!748 = !DILocation(line: 392, column: 36, scope: !737)
!749 = !DILocation(line: 392, column: 42, scope: !737)
!750 = !DILocation(line: 392, column: 49, scope: !737)
!751 = !DILocation(line: 392, column: 58, scope: !737)
!752 = !DILocation(line: 393, column: 11, scope: !737)
!753 = !DILocation(line: 393, column: 20, scope: !737)
!754 = !DILocation(line: 393, column: 27, scope: !737)
!755 = !DILocation(line: 393, column: 36, scope: !737)
!756 = !DILocation(line: 394, column: 11, scope: !737)
!757 = !DILocation(line: 392, column: 10, scope: !737)
!758 = !DILocation(line: 392, column: 3, scope: !737)
!759 = !DILocation(line: 397, column: 28, scope: !717)
!760 = !DILocation(line: 397, column: 32, scope: !717)
!761 = !DILocation(line: 397, column: 38, scope: !717)
!762 = !DILocation(line: 397, column: 45, scope: !717)
!763 = !DILocation(line: 397, column: 54, scope: !717)
!764 = !DILocation(line: 398, column: 7, scope: !717)
!765 = !DILocation(line: 398, column: 16, scope: !717)
!766 = !DILocation(line: 398, column: 23, scope: !717)
!767 = !DILocation(line: 398, column: 32, scope: !717)
!768 = !DILocation(line: 397, column: 9, scope: !717)
!769 = !DILocation(line: 397, column: 2, scope: !717)
!770 = !DILocation(line: 399, column: 1, scope: !717)
!771 = distinct !DISubprogram(name: "clk_divider_set_rate", scope: !3, file: !3, line: 418, type: !115, scopeLine: 420, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!772 = !DILocalVariable(name: "lock", arg: 1, scope: !773, file: !774, line: 407, type: !176)
!773 = distinct !DISubprogram(name: "spin_unlock_irqrestore", scope: !774, file: !774, line: 407, type: !775, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!774 = !DIFile(filename: "./include/linux/spinlock.h", directory: "/home/lizy2001/genbc/linux")
!775 = !DISubroutineType(types: !776)
!776 = !{null, !176, !83}
!777 = !DILocation(line: 407, column: 64, scope: !773, inlinedAt: !778)
!778 = distinct !DILocation(line: 446, column: 3, scope: !779)
!779 = distinct !DILexicalBlock(scope: !771, file: !3, line: 445, column: 6)
!780 = !DILocalVariable(name: "flags", arg: 2, scope: !773, file: !774, line: 407, type: !83)
!781 = !DILocation(line: 407, column: 84, scope: !773, inlinedAt: !778)
!782 = !DILocalVariable(name: "lock", arg: 1, scope: !783, file: !774, line: 327, type: !176)
!783 = distinct !DISubprogram(name: "spinlock_check", scope: !774, file: !774, line: 327, type: !784, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !191)
!784 = !DISubroutineType(types: !785)
!785 = !{!786, !176}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !178, line: 29, baseType: !185)
!788 = !DILocation(line: 327, column: 67, scope: !783, inlinedAt: !789)
!789 = distinct !DILocation(line: 432, column: 3, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 432, column: 3)
!791 = distinct !DILexicalBlock(scope: !792, file: !3, line: 432, column: 3)
!792 = distinct !DILexicalBlock(scope: !793, file: !3, line: 432, column: 3)
!793 = distinct !DILexicalBlock(scope: !794, file: !3, line: 432, column: 3)
!794 = distinct !DILexicalBlock(scope: !795, file: !3, line: 432, column: 3)
!795 = distinct !DILexicalBlock(scope: !771, file: !3, line: 431, column: 6)
!796 = !DILocalVariable(name: "hw", arg: 1, scope: !771, file: !3, line: 418, type: !66)
!797 = !DILocation(line: 418, column: 48, scope: !771)
!798 = !DILocalVariable(name: "rate", arg: 2, scope: !771, file: !3, line: 418, type: !83)
!799 = !DILocation(line: 418, column: 66, scope: !771)
!800 = !DILocalVariable(name: "parent_rate", arg: 3, scope: !771, file: !3, line: 419, type: !83)
!801 = !DILocation(line: 419, column: 19, scope: !771)
!802 = !DILocalVariable(name: "divider", scope: !771, file: !3, line: 421, type: !34)
!803 = !DILocation(line: 421, column: 22, scope: !771)
!804 = !DILocalVariable(name: "__mptr", scope: !805, file: !3, line: 421, type: !33)
!805 = distinct !DILexicalBlock(scope: !771, file: !3, line: 421, column: 32)
!806 = !DILocation(line: 421, column: 32, scope: !805)
!807 = !DILocation(line: 421, column: 32, scope: !808)
!808 = distinct !DILexicalBlock(scope: !805, file: !3, line: 421, column: 32)
!809 = !DILocalVariable(name: "value", scope: !771, file: !3, line: 422, type: !65)
!810 = !DILocation(line: 422, column: 6, scope: !771)
!811 = !DILocalVariable(name: "flags", scope: !771, file: !3, line: 423, type: !83)
!812 = !DILocation(line: 423, column: 16, scope: !771)
!813 = !DILocalVariable(name: "val", scope: !771, file: !3, line: 424, type: !194)
!814 = !DILocation(line: 424, column: 6, scope: !771)
!815 = !DILocation(line: 426, column: 26, scope: !771)
!816 = !DILocation(line: 426, column: 32, scope: !771)
!817 = !DILocation(line: 426, column: 45, scope: !771)
!818 = !DILocation(line: 426, column: 54, scope: !771)
!819 = !DILocation(line: 427, column: 5, scope: !771)
!820 = !DILocation(line: 427, column: 14, scope: !771)
!821 = !DILocation(line: 427, column: 21, scope: !771)
!822 = !DILocation(line: 427, column: 30, scope: !771)
!823 = !DILocation(line: 426, column: 10, scope: !771)
!824 = !DILocation(line: 426, column: 8, scope: !771)
!825 = !DILocation(line: 428, column: 6, scope: !826)
!826 = distinct !DILexicalBlock(scope: !771, file: !3, line: 428, column: 6)
!827 = !DILocation(line: 428, column: 12, scope: !826)
!828 = !DILocation(line: 428, column: 6, scope: !771)
!829 = !DILocation(line: 429, column: 10, scope: !826)
!830 = !DILocation(line: 429, column: 3, scope: !826)
!831 = !DILocation(line: 431, column: 6, scope: !795)
!832 = !DILocation(line: 431, column: 15, scope: !795)
!833 = !DILocation(line: 431, column: 6, scope: !771)
!834 = !DILocation(line: 432, column: 3, scope: !795)
!835 = !DILocation(line: 432, column: 3, scope: !794)
!836 = !DILocalVariable(name: "__dummy", scope: !837, file: !3, line: 432, type: !83)
!837 = distinct !DILexicalBlock(scope: !793, file: !3, line: 432, column: 3)
!838 = !DILocation(line: 432, column: 3, scope: !837)
!839 = !DILocalVariable(name: "__dummy2", scope: !837, file: !3, line: 432, type: !83)
!840 = !DILocation(line: 432, column: 3, scope: !793)
!841 = !DILocation(line: 432, column: 3, scope: !792)
!842 = !DILocation(line: 432, column: 3, scope: !843)
!843 = distinct !DILexicalBlock(scope: !792, file: !3, line: 432, column: 3)
!844 = !DILocalVariable(name: "__dummy", scope: !845, file: !3, line: 432, type: !83)
!845 = distinct !DILexicalBlock(scope: !846, file: !3, line: 432, column: 3)
!846 = distinct !DILexicalBlock(scope: !843, file: !3, line: 432, column: 3)
!847 = !DILocation(line: 432, column: 3, scope: !845)
!848 = !DILocalVariable(name: "__dummy2", scope: !845, file: !3, line: 432, type: !83)
!849 = !DILocation(line: 432, column: 3, scope: !846)
!850 = !DILocation(line: 432, column: 3, scope: !791)
!851 = !{i32 -2143955415}
!852 = !DILocation(line: 432, column: 3, scope: !790)
!853 = !DILocation(line: 329, column: 10, scope: !783, inlinedAt: !789)
!854 = !DILocation(line: 329, column: 16, scope: !783, inlinedAt: !789)
!855 = !DILocation(line: 436, column: 6, scope: !856)
!856 = distinct !DILexicalBlock(scope: !771, file: !3, line: 436, column: 6)
!857 = !DILocation(line: 436, column: 15, scope: !856)
!858 = !DILocation(line: 436, column: 21, scope: !856)
!859 = !DILocation(line: 436, column: 6, scope: !771)
!860 = !DILocation(line: 437, column: 9, scope: !861)
!861 = distinct !DILexicalBlock(scope: !856, file: !3, line: 436, column: 48)
!862 = !DILocation(line: 437, column: 42, scope: !861)
!863 = !DILocation(line: 437, column: 51, scope: !861)
!864 = !DILocation(line: 437, column: 57, scope: !861)
!865 = !DILocation(line: 437, column: 38, scope: !861)
!866 = !DILocation(line: 437, column: 7, scope: !861)
!867 = !DILocation(line: 438, column: 2, scope: !861)
!868 = !DILocation(line: 439, column: 23, scope: !869)
!869 = distinct !DILexicalBlock(scope: !856, file: !3, line: 438, column: 9)
!870 = !DILocation(line: 439, column: 9, scope: !869)
!871 = !DILocation(line: 439, column: 7, scope: !869)
!872 = !DILocation(line: 440, column: 12, scope: !869)
!873 = !DILocation(line: 440, column: 44, scope: !869)
!874 = !DILocation(line: 440, column: 53, scope: !869)
!875 = !DILocation(line: 440, column: 41, scope: !869)
!876 = !DILocation(line: 440, column: 10, scope: !869)
!877 = !DILocation(line: 440, column: 7, scope: !869)
!878 = !DILocation(line: 442, column: 14, scope: !771)
!879 = !DILocation(line: 442, column: 23, scope: !771)
!880 = !DILocation(line: 442, column: 32, scope: !771)
!881 = !DILocation(line: 442, column: 20, scope: !771)
!882 = !DILocation(line: 442, column: 6, scope: !771)
!883 = !DILocation(line: 443, column: 17, scope: !771)
!884 = !DILocation(line: 443, column: 26, scope: !771)
!885 = !DILocation(line: 443, column: 2, scope: !771)
!886 = !DILocation(line: 445, column: 6, scope: !779)
!887 = !DILocation(line: 445, column: 15, scope: !779)
!888 = !DILocation(line: 445, column: 6, scope: !771)
!889 = !DILocation(line: 446, column: 26, scope: !779)
!890 = !DILocation(line: 446, column: 35, scope: !779)
!891 = !DILocation(line: 446, column: 41, scope: !779)
!892 = !DILocalVariable(name: "__dummy", scope: !893, file: !774, line: 409, type: !83)
!893 = distinct !DILexicalBlock(scope: !894, file: !774, line: 409, column: 2)
!894 = distinct !DILexicalBlock(scope: !773, file: !774, line: 409, column: 2)
!895 = !DILocation(line: 409, column: 2, scope: !893, inlinedAt: !778)
!896 = !DILocalVariable(name: "__dummy2", scope: !893, file: !774, line: 409, type: !83)
!897 = !DILocalVariable(name: "__dummy", scope: !898, file: !774, line: 409, type: !83)
!898 = distinct !DILexicalBlock(scope: !899, file: !774, line: 409, column: 2)
!899 = distinct !DILexicalBlock(scope: !900, file: !774, line: 409, column: 2)
!900 = distinct !DILexicalBlock(scope: !901, file: !774, line: 409, column: 2)
!901 = distinct !DILexicalBlock(scope: !894, file: !774, line: 409, column: 2)
!902 = !DILocation(line: 409, column: 2, scope: !898, inlinedAt: !778)
!903 = !DILocalVariable(name: "__dummy2", scope: !898, file: !774, line: 409, type: !83)
!904 = !DILocation(line: 409, column: 2, scope: !899, inlinedAt: !778)
!905 = !DILocation(line: 409, column: 2, scope: !906, inlinedAt: !778)
!906 = distinct !DILexicalBlock(scope: !901, file: !774, line: 409, column: 2)
!907 = !{i32 -2145371708}
!908 = !DILocation(line: 409, column: 2, scope: !909, inlinedAt: !778)
!909 = distinct !DILexicalBlock(scope: !906, file: !774, line: 409, column: 2)
!910 = !DILocation(line: 446, column: 3, scope: !779)
!911 = !DILocation(line: 450, column: 2, scope: !771)
!912 = !DILocation(line: 451, column: 1, scope: !771)
!913 = distinct !DISubprogram(name: "__clk_hw_register_divider", scope: !3, file: !3, line: 466, type: !914, scopeLine: 472, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !191)
!914 = !DISubroutineType(types: !915)
!915 = !{!66, !916, !919, !53, !53, !155, !150, !83, !33, !106, !106, !106, !169, !176}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !918, line: 15, flags: DIFlagFwdDecl)
!918 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !921, line: 51, size: 1344, elements: !922)
!921 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!922 = !{!923, !924, !926, !927, !1024, !1633, !1634, !1635, !1636, !1637, !1638, !1639}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !921, line: 52, baseType: !53, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !920, file: !921, line: 53, baseType: !925, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !921, line: 28, baseType: !194)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !920, file: !921, line: 54, baseType: !53, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !920, file: !921, line: 55, baseType: !928, size: 192, offset: 192)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !918, line: 17, size: 192, elements: !929)
!929 = !{!930, !932, !1023}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !928, file: !918, line: 18, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !928, file: !918, line: 19, baseType: !933, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !918, line: 110, size: 1152, elements: !936)
!936 = !{!937, !941, !945, !951, !959, !963, !971, !976, !980, !981, !985, !989, !993, !1006, !1007, !1008, !1009, !1019}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !935, file: !918, line: 111, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!931, !931}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !935, file: !918, line: 112, baseType: !942, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !931}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !935, file: !918, line: 113, baseType: !946, size: 64, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!605, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !935, file: !918, line: 114, baseType: !952, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!955, !949, !957}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "property_present", scope: !935, file: !918, line: 116, baseType: !960, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!605, !949, !53}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_int_array", scope: !935, file: !918, line: 118, baseType: !964, size: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!65, !949, !53, !7, !33, !967}
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 55, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !969, line: 72, baseType: !970)
!969 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !969, line: 16, baseType: !83)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_string_array", scope: !935, file: !918, line: 123, baseType: !972, size: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!65, !949, !53, !975, !967}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "get_name", scope: !935, file: !918, line: 126, baseType: !977, size: 64, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!53, !949}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "get_name_prefix", scope: !935, file: !918, line: 127, baseType: !977, size: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !935, file: !918, line: 128, baseType: !982, size: 64, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!931, !949}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_child_node", scope: !935, file: !918, line: 130, baseType: !986, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!931, !949, !931}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "get_named_child_node", scope: !935, file: !918, line: 133, baseType: !990, size: 64, offset: 704)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!931, !949, !53}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get_reference_args", scope: !935, file: !918, line: 135, baseType: !994, size: 64, offset: 768)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!65, !949, !53, !53, !7, !7, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_reference_args", file: !918, line: 43, size: 640, elements: !999)
!999 = !{!1000, !1001, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !998, file: !918, line: 44, baseType: !931, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !998, file: !918, line: 45, baseType: !7, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !998, file: !918, line: 46, baseType: !1003, size: 512, offset: 128)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_next_endpoint", scope: !935, file: !918, line: 140, baseType: !986, size: 64, offset: 832)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_remote_endpoint", scope: !935, file: !918, line: 143, baseType: !982, size: 64, offset: 896)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_port_parent", scope: !935, file: !918, line: 145, baseType: !938, size: 64, offset: 960)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "graph_parse_endpoint", scope: !935, file: !918, line: 146, baseType: !1010, size: 64, offset: 1024)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!65, !949, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_endpoint", file: !918, line: 29, size: 128, elements: !1015)
!1015 = !{!1016, !1017, !1018}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !1014, file: !918, line: 30, baseType: !7, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1014, file: !918, line: 31, baseType: !7, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "local_fwnode", scope: !1014, file: !918, line: 32, baseType: !949, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "add_links", scope: !935, file: !918, line: 148, baseType: !1020, size: 64, offset: 1088)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!65, !949, !916}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !928, file: !918, line: 20, baseType: !916, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !920, file: !921, line: 57, baseType: !1025, size: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "property", file: !921, line: 31, size: 704, elements: !1027)
!1027 = !{!1028, !1030, !1031, !1032, !1033}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !921, line: 32, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1026, file: !921, line: 33, baseType: !65, size: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1026, file: !921, line: 34, baseType: !33, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !921, line: 35, baseType: !1025, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !1026, file: !921, line: 43, baseType: !1034, size: 448, offset: 256)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !1035, line: 168, size: 448, elements: !1036)
!1035 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!1036 = !{!1037, !1044, !1045, !1046, !1628, !1629}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !1034, file: !1035, line: 169, baseType: !1038, size: 128)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !1035, line: 30, size: 128, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !1035, line: 31, baseType: !53, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1038, file: !1035, line: 32, baseType: !1042, size: 16, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !31, line: 19, baseType: !1043)
!1043 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1034, file: !1035, line: 170, baseType: !967, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1034, file: !1035, line: 171, baseType: !33, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1034, file: !1035, line: 172, baseType: !1047, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !1053, !1056, !1151, !1029, !1361, !967}
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !31, line: 60, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !969, line: 73, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !969, line: 15, baseType: !88)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !1055, line: 526, flags: DIFlagFwdDecl)
!1055 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !1058, line: 64, size: 512, elements: !1059)
!1058 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!1059 = !{!1060, !1061, !1067, !1068, !1112, !1209, !1613, !1623, !1624, !1625, !1626, !1627}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1057, file: !1058, line: 65, baseType: !53, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !1057, file: !1058, line: 66, baseType: !1062, size: 128, offset: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !31, line: 178, size: 128, elements: !1063)
!1063 = !{!1064, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1062, file: !31, line: 179, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1062, file: !31, line: 179, baseType: !1065, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1057, file: !1058, line: 67, baseType: !1056, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !1057, file: !1058, line: 68, baseType: !1069, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !1058, line: 192, size: 704, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1070, file: !1058, line: 193, baseType: !1062, size: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !1070, file: !1058, line: 194, baseType: !177, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !1070, file: !1058, line: 195, baseType: !1057, size: 512, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !1070, file: !1058, line: 196, baseType: !1076, size: 64, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !1058, line: 156, size: 192, elements: !1079)
!1079 = !{!1080, !1085, !1090}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1078, file: !1058, line: 157, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!65, !1069, !1056}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !1058, line: 158, baseType: !1086, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!53, !1069, !1056}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !1078, file: !1058, line: 159, baseType: !1091, size: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!65, !1069, !1056, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !1058, line: 148, size: 20736, elements: !1097)
!1097 = !{!1098, !1102, !1106, !1107, !1111}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !1096, file: !1058, line: 149, baseType: !1099, size: 192)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 192, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 3)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !1096, file: !1058, line: 150, baseType: !1103, size: 4096, offset: 192)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 4096, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !1096, file: !1058, line: 151, baseType: !65, size: 32, offset: 4288)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1096, file: !1058, line: 152, baseType: !1108, size: 16384, offset: 4320)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 16384, elements: !1109)
!1109 = !{!1110}
!1110 = !DISubrange(count: 2048)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1096, file: !1058, line: 153, baseType: !65, size: 32, offset: 20704)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !1057, file: !1058, line: 69, baseType: !1113, size: 64, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !1058, line: 138, size: 448, elements: !1115)
!1115 = !{!1116, !1120, !1134, !1136, !1155, !1186, !1190}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !1114, file: !1058, line: 139, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{null, !1056}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !1114, file: !1058, line: 140, baseType: !1121, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !1035, line: 230, size: 128, elements: !1124)
!1124 = !{!1125, !1130}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !1123, file: !1035, line: 231, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1050, !1056, !1129, !1029}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !1123, file: !1035, line: 232, baseType: !1131, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!1050, !1056, !1129, !53, !967}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !1114, file: !1058, line: 141, baseType: !1135, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !1114, file: !1058, line: 142, baseType: !1137, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !1035, line: 84, size: 320, elements: !1141)
!1141 = !{!1142, !1143, !1147, !1152, !1153}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1140, file: !1035, line: 85, baseType: !53, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !1140, file: !1035, line: 86, baseType: !1144, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1042, !1056, !1129, !65}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !1140, file: !1035, line: 88, baseType: !1148, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1042, !1056, !1151, !65}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !1140, file: !1035, line: 90, baseType: !1135, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "bin_attrs", scope: !1140, file: !1035, line: 91, baseType: !1154, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !1114, file: !1058, line: 143, baseType: !1156, size: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1159, !1056}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !6, line: 39, size: 384, elements: !1162)
!1162 = !{!1163, !1164, !1168, !1172, !1178, !1182}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1161, file: !6, line: 40, baseType: !5, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !1161, file: !6, line: 41, baseType: !1165, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!605}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !1161, file: !6, line: 42, baseType: !1169, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!33}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !1161, file: !6, line: 43, baseType: !1173, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!955, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !6, line: 19, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !1161, file: !6, line: 44, baseType: !1179, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!955}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !1161, file: !6, line: 45, baseType: !1183, size: 64, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null, !33}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !1114, file: !1058, line: 144, baseType: !1187, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!955, !1056}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !1114, file: !1058, line: 145, baseType: !1191, size: 64, offset: 384)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{null, !1056, !1194, !1202}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !1196, line: 23, baseType: !1197)
!1196 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1196, line: 21, size: 32, elements: !1198)
!1198 = !{!1199}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1197, file: !1196, line: 22, baseType: !1200, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !31, line: 32, baseType: !1201)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !969, line: 49, baseType: !7)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !1196, line: 28, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1196, line: 26, size: 32, elements: !1205)
!1205 = !{!1206}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1204, file: !1196, line: 27, baseType: !1207, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !31, line: 33, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !969, line: 50, baseType: !7)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !1057, file: !1058, line: 70, baseType: !1210, size: 64, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !145, line: 123, size: 1024, elements: !1212)
!1212 = !{!1213, !1218, !1219, !1220, !1221, !1229, !1230, !1231, !1606, !1607, !1608, !1609, !1610}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1211, file: !145, line: 124, baseType: !1214, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !31, line: 168, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 166, size: 32, elements: !1216)
!1216 = !{!1217}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !1215, file: !31, line: 167, baseType: !65, size: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1211, file: !145, line: 125, baseType: !1214, size: 32, offset: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1211, file: !145, line: 135, baseType: !1210, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1211, file: !145, line: 136, baseType: !53, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !1211, file: !145, line: 138, baseType: !1222, size: 192, align: 64, offset: 192)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1223, line: 24, size: 192, align: 64, elements: !1224)
!1223 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1224 = !{!1225, !1226, !1228}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1222, file: !1223, line: 25, baseType: !83, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1222, file: !1223, line: 26, baseType: !1227, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1222, file: !1223, line: 27, baseType: !1227, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !1211, file: !145, line: 140, baseType: !955, size: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1211, file: !145, line: 141, baseType: !7, size: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, scope: !1211, file: !145, line: 142, baseType: !1232, size: 256, offset: 512)
!1232 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1211, file: !145, line: 142, size: 256, elements: !1233)
!1233 = !{!1234, !1297, !1301}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1232, file: !145, line: 143, baseType: !1235, size: 192)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !145, line: 91, size: 192, elements: !1236)
!1236 = !{!1237, !1238, !1242}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !1235, file: !145, line: 92, baseType: !83, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !1235, file: !145, line: 94, baseType: !1239, size: 64, offset: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1223, line: 31, size: 64, elements: !1240)
!1240 = !{!1241}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1239, file: !1223, line: 32, baseType: !1227, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !1235, file: !145, line: 100, baseType: !1243, size: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !145, line: 180, size: 704, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1261, !1262, !1263, !1289, !1290}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !1244, file: !145, line: 182, baseType: !1210, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1244, file: !145, line: 183, baseType: !7, size: 32, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !1244, file: !145, line: 186, baseType: !1249, size: 192, offset: 128)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !1250, line: 19, size: 192, elements: !1251)
!1250 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!1251 = !{!1252, !1259, !1260}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !1249, file: !1250, line: 20, baseType: !1253, size: 128)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1254, line: 292, size: 128, elements: !1255)
!1254 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1255 = !{!1256, !1257, !1258}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1253, file: !1254, line: 293, baseType: !177)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1253, file: !1254, line: 295, baseType: !32, size: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1253, file: !1254, line: 296, baseType: !33, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !1249, file: !1250, line: 21, baseType: !7, size: 32, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !1249, file: !1250, line: 22, baseType: !7, size: 32, offset: 160)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !1244, file: !145, line: 187, baseType: !194, size: 32, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !1244, file: !145, line: 188, baseType: !194, size: 32, offset: 352)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !1244, file: !145, line: 189, baseType: !1264, size: 64, offset: 384)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !145, line: 168, size: 320, elements: !1266)
!1266 = !{!1267, !1273, !1277, !1281, !1285}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1265, file: !145, line: 169, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!65, !1271, !1243}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !1055, line: 539, flags: DIFlagFwdDecl)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !1265, file: !145, line: 171, baseType: !1274, size: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!65, !1210, !53, !1042}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !1265, file: !145, line: 173, baseType: !1278, size: 64, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!65, !1210}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !1265, file: !145, line: 174, baseType: !1282, size: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!65, !1210, !1210, !53}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1265, file: !145, line: 176, baseType: !1286, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DISubroutineType(types: !1288)
!1288 = !{!65, !1271, !1210, !1243}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !1244, file: !145, line: 192, baseType: !1062, size: 128, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !1244, file: !145, line: 194, baseType: !1291, size: 128, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !1292, line: 40, baseType: !1293)
