; ModuleID = '../bcout/drivers/clk/clk-fractional-divider.llvm.bc'
source_filename = "drivers/clk/clk-fractional-divider.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.clk_hw = type { %struct.clk_core*, %struct.clk*, %struct.clk_init_data* }
%struct.clk_core = type opaque
%struct.clk = type opaque
%struct.clk_init_data = type { i8*, %struct.clk_ops*, i8**, %struct.clk_parent_data*, %struct.clk_hw**, i8, i64 }
%struct.clk_ops = type { {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, i64 (%struct.clk_hw*, i64)*, i64 (%struct.clk_hw*, i64, i64*)*, i32 (%struct.clk_hw*, %struct.clk_rate_request*)*, i32 (%struct.clk_hw*, i8)*, i8 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i64, i64)*, i32 (%struct.clk_hw*, i64, i64, i8)*, i64 (%struct.clk_hw*, i64)*, {}*, i32 (%struct.clk_hw*, i32)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, {}*, void (%struct.clk_hw*)*, void (%struct.clk_hw*, %struct.dentry*)* }
%struct.clk_parent_data = type { %struct.clk_hw*, i8*, i8*, i32 }
%struct.clk_rate_request = type { i64, i64, i64, i64, %struct.clk_hw* }
%struct.clk_duty = type { i32, i32 }
%struct.dentry = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }

!1 = distinct !DIGlobalVariable(name: "clk_fractional_divider_ops", scope: !2, file: !3, line: 148, type: !86, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !230, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/clk-fractional-divider.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !51, line: 305, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!57 = !{!58, !60, !61, !62, !224, !227, !110, !228}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !59, line: 148, baseType: !7)
!59 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_fractional_divider", file: !64, line: 940, size: 576, elements: !65)
!64 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!65 = !{!66, !193, !194, !195, !196, !199, !200, !201, !202, !203, !207}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !63, file: !64, line: 941, baseType: !67, size: 192)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !64, line: 312, size: 192, elements: !68)
!68 = !{!69, !72, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !67, file: !64, line: 313, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !64, line: 38, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !67, file: !64, line: 314, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !64, line: 36, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !67, file: !64, line: 315, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !64, line: 285, size: 448, elements: !79)
!79 = !{!80, !84, !175, !178, !189, !191, !192}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !64, line: 286, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !78, file: !64, line: 287, baseType: !85, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !64, line: 220, size: 1600, elements: !88)
!88 = !{!89, !94, !98, !99, !100, !101, !102, !103, !104, !105, !106, !111, !117, !129, !138, !142, !146, !150, !151, !152, !156, !165, !166, !167, !168}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !87, file: !64, line: 221, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!60, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !87, file: !64, line: 222, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !93}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !87, file: !64, line: 223, baseType: !90, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !87, file: !64, line: 224, baseType: !95, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !87, file: !64, line: 225, baseType: !90, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !87, file: !64, line: 226, baseType: !95, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !87, file: !64, line: 227, baseType: !90, size: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !87, file: !64, line: 228, baseType: !95, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !87, file: !64, line: 229, baseType: !90, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !87, file: !64, line: 230, baseType: !95, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !87, file: !64, line: 231, baseType: !107, size: 64, offset: 640)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!110, !93, !110}
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !87, file: !64, line: 233, baseType: !112, size: 64, offset: 704)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!115, !93, !110, !116}
!115 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !87, file: !64, line: 235, baseType: !118, size: 64, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!60, !93, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !64, line: 55, size: 320, elements: !123)
!123 = !{!124, !125, !126, !127, !128}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !122, file: !64, line: 56, baseType: !110, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !122, file: !64, line: 57, baseType: !110, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !122, file: !64, line: 58, baseType: !110, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !122, file: !64, line: 59, baseType: !110, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !122, file: !64, line: 60, baseType: !93, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !87, file: !64, line: 237, baseType: !130, size: 64, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!60, !93, !133}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !134, line: 17, baseType: !135)
!134 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !136, line: 21, baseType: !137)
!136 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!137 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !87, file: !64, line: 238, baseType: !139, size: 64, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!133, !93}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !87, file: !64, line: 239, baseType: !143, size: 64, offset: 960)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!60, !93, !110, !110}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !87, file: !64, line: 241, baseType: !147, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!60, !93, !110, !110, !133}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !87, file: !64, line: 244, baseType: !107, size: 64, offset: 1088)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !87, file: !64, line: 246, baseType: !90, size: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !87, file: !64, line: 247, baseType: !153, size: 64, offset: 1216)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!60, !93, !60}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !87, file: !64, line: 248, baseType: !157, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!60, !93, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !64, line: 69, size: 64, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !161, file: !64, line: 70, baseType: !7, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !161, file: !64, line: 71, baseType: !7, size: 32, offset: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !87, file: !64, line: 250, baseType: !157, size: 64, offset: 1344)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !87, file: !64, line: 252, baseType: !90, size: 64, offset: 1408)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !87, file: !64, line: 253, baseType: !95, size: 64, offset: 1472)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !87, file: !64, line: 254, baseType: !169, size: 64, offset: 1536)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !93, !172}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !174, line: 21, flags: DIFlagFwdDecl)
!174 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !78, file: !64, line: 289, baseType: !176, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !78, file: !64, line: 290, baseType: !179, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !64, line: 264, size: 256, elements: !182)
!182 = !{!183, !186, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !181, file: !64, line: 265, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !181, file: !64, line: 266, baseType: !81, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !64, line: 267, baseType: !81, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !181, file: !64, line: 268, baseType: !60, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !78, file: !64, line: 291, baseType: !190, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !78, file: !64, line: 292, baseType: !133, size: 8, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !64, line: 293, baseType: !110, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !63, file: !64, line: 942, baseType: !61, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mshift", scope: !63, file: !64, line: 943, baseType: !133, size: 8, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mwidth", scope: !63, file: !64, line: 944, baseType: !133, size: 8, offset: 264)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mmask", scope: !63, file: !64, line: 945, baseType: !197, size: 32, offset: 288)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !134, line: 21, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !136, line: 27, baseType: !7)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "nshift", scope: !63, file: !64, line: 946, baseType: !133, size: 8, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nwidth", scope: !63, file: !64, line: 947, baseType: !133, size: 8, offset: 328)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nmask", scope: !63, file: !64, line: 948, baseType: !197, size: 32, offset: 352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !64, line: 949, baseType: !133, size: 8, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "approximation", scope: !63, file: !64, line: 950, baseType: !204, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !93, !110, !116, !116, !116}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !63, file: !64, line: 953, baseType: !208, size: 64, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !210, line: 83, baseType: !211)
!210 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !210, line: 71, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, scope: !211, file: !210, line: 72, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !211, file: !210, line: 72, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !214, file: !210, line: 73, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !210, line: 20, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !217, file: !210, line: 21, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !221, line: 25, baseType: !222)
!221 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 25, elements: !223)
!223 = !{}
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !134, line: 23, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !136, line: 31, baseType: !226)
!226 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !59, line: 107, baseType: !224)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!230 = !{!0}
!231 = !{!"rsp"}
!232 = !{i32 7, !"Dwarf Version", i32 4}
!233 = !{i32 2, !"Debug Info Version", i32 3}
!234 = !{i32 1, !"wchar_size", i32 2}
!235 = !{i32 1, !"Code Model", i32 2}
!236 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!237 = distinct !DISubprogram(name: "clk_fd_recalc_rate", scope: !3, file: !3, line: 33, type: !108, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!238 = !DILocalVariable(name: "lock", arg: 1, scope: !239, file: !240, line: 407, type: !208)
!239 = distinct !DISubprogram(name: "spin_unlock_irqrestore", scope: !240, file: !240, line: 407, type: !241, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!240 = !DIFile(filename: "./include/linux/spinlock.h", directory: "/home/lizy2001/genbc/linux")
!241 = !DISubroutineType(types: !242)
!242 = !{null, !208, !110}
!243 = !DILocation(line: 407, column: 64, scope: !239, inlinedAt: !244)
!244 = distinct !DILocation(line: 50, column: 3, scope: !245)
!245 = distinct !DILexicalBlock(scope: !237, file: !3, line: 49, column: 6)
!246 = !DILocalVariable(name: "flags", arg: 2, scope: !239, file: !240, line: 407, type: !110)
!247 = !DILocation(line: 407, column: 84, scope: !239, inlinedAt: !244)
!248 = !DILocalVariable(name: "lock", arg: 1, scope: !249, file: !240, line: 327, type: !208)
!249 = distinct !DISubprogram(name: "spinlock_check", scope: !240, file: !240, line: 327, type: !250, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !208}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !210, line: 29, baseType: !217)
!254 = !DILocation(line: 327, column: 67, scope: !249, inlinedAt: !255)
!255 = distinct !DILocation(line: 43, column: 3, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !3, line: 43, column: 3)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 43, column: 3)
!258 = distinct !DILexicalBlock(scope: !259, file: !3, line: 43, column: 3)
!259 = distinct !DILexicalBlock(scope: !260, file: !3, line: 43, column: 3)
!260 = distinct !DILexicalBlock(scope: !261, file: !3, line: 43, column: 3)
!261 = distinct !DILexicalBlock(scope: !237, file: !3, line: 42, column: 6)
!262 = !DILocalVariable(name: "hw", arg: 1, scope: !237, file: !3, line: 33, type: !93)
!263 = !DILocation(line: 33, column: 56, scope: !237)
!264 = !DILocalVariable(name: "parent_rate", arg: 2, scope: !237, file: !3, line: 34, type: !110)
!265 = !DILocation(line: 34, column: 20, scope: !237)
!266 = !DILocalVariable(name: "fd", scope: !237, file: !3, line: 36, type: !62)
!267 = !DILocation(line: 36, column: 33, scope: !237)
!268 = !DILocalVariable(name: "__mptr", scope: !269, file: !3, line: 36, type: !61)
!269 = distinct !DILexicalBlock(scope: !237, file: !3, line: 36, column: 38)
!270 = !DILocation(line: 36, column: 38, scope: !269)
!271 = !DILocation(line: 36, column: 38, scope: !272)
!272 = distinct !DILexicalBlock(scope: !269, file: !3, line: 36, column: 38)
!273 = !DILocalVariable(name: "flags", scope: !237, file: !3, line: 37, type: !110)
!274 = !DILocation(line: 37, column: 16, scope: !237)
!275 = !DILocalVariable(name: "m", scope: !237, file: !3, line: 38, type: !110)
!276 = !DILocation(line: 38, column: 16, scope: !237)
!277 = !DILocalVariable(name: "n", scope: !237, file: !3, line: 38, type: !110)
!278 = !DILocation(line: 38, column: 19, scope: !237)
!279 = !DILocalVariable(name: "val", scope: !237, file: !3, line: 39, type: !197)
!280 = !DILocation(line: 39, column: 6, scope: !237)
!281 = !DILocalVariable(name: "ret", scope: !237, file: !3, line: 40, type: !224)
!282 = !DILocation(line: 40, column: 6, scope: !237)
!283 = !DILocation(line: 42, column: 6, scope: !261)
!284 = !DILocation(line: 42, column: 10, scope: !261)
!285 = !DILocation(line: 42, column: 6, scope: !237)
!286 = !DILocation(line: 43, column: 3, scope: !261)
!287 = !DILocation(line: 43, column: 3, scope: !260)
!288 = !DILocalVariable(name: "__dummy", scope: !289, file: !3, line: 43, type: !110)
!289 = distinct !DILexicalBlock(scope: !259, file: !3, line: 43, column: 3)
!290 = !DILocation(line: 43, column: 3, scope: !289)
!291 = !DILocalVariable(name: "__dummy2", scope: !289, file: !3, line: 43, type: !110)
!292 = !DILocation(line: 43, column: 3, scope: !259)
!293 = !DILocation(line: 43, column: 3, scope: !258)
!294 = !DILocation(line: 43, column: 3, scope: !295)
!295 = distinct !DILexicalBlock(scope: !258, file: !3, line: 43, column: 3)
!296 = !DILocalVariable(name: "__dummy", scope: !297, file: !3, line: 43, type: !110)
!297 = distinct !DILexicalBlock(scope: !298, file: !3, line: 43, column: 3)
!298 = distinct !DILexicalBlock(scope: !295, file: !3, line: 43, column: 3)
!299 = !DILocation(line: 43, column: 3, scope: !297)
!300 = !DILocalVariable(name: "__dummy2", scope: !297, file: !3, line: 43, type: !110)
!301 = !DILocation(line: 43, column: 3, scope: !298)
!302 = !DILocation(line: 43, column: 3, scope: !257)
!303 = !{i32 -2143311945}
!304 = !DILocation(line: 43, column: 3, scope: !256)
!305 = !DILocation(line: 329, column: 10, scope: !249, inlinedAt: !255)
!306 = !DILocation(line: 329, column: 16, scope: !249, inlinedAt: !255)
!307 = !DILocation(line: 47, column: 21, scope: !237)
!308 = !DILocation(line: 47, column: 8, scope: !237)
!309 = !DILocation(line: 47, column: 6, scope: !237)
!310 = !DILocation(line: 49, column: 6, scope: !245)
!311 = !DILocation(line: 49, column: 10, scope: !245)
!312 = !DILocation(line: 49, column: 6, scope: !237)
!313 = !DILocation(line: 50, column: 26, scope: !245)
!314 = !DILocation(line: 50, column: 30, scope: !245)
!315 = !DILocation(line: 50, column: 36, scope: !245)
!316 = !DILocalVariable(name: "__dummy", scope: !317, file: !240, line: 409, type: !110)
!317 = distinct !DILexicalBlock(scope: !318, file: !240, line: 409, column: 2)
!318 = distinct !DILexicalBlock(scope: !239, file: !240, line: 409, column: 2)
!319 = !DILocation(line: 409, column: 2, scope: !317, inlinedAt: !244)
!320 = !DILocalVariable(name: "__dummy2", scope: !317, file: !240, line: 409, type: !110)
!321 = !DILocalVariable(name: "__dummy", scope: !322, file: !240, line: 409, type: !110)
!322 = distinct !DILexicalBlock(scope: !323, file: !240, line: 409, column: 2)
!323 = distinct !DILexicalBlock(scope: !324, file: !240, line: 409, column: 2)
!324 = distinct !DILexicalBlock(scope: !325, file: !240, line: 409, column: 2)
!325 = distinct !DILexicalBlock(scope: !318, file: !240, line: 409, column: 2)
!326 = !DILocation(line: 409, column: 2, scope: !322, inlinedAt: !244)
!327 = !DILocalVariable(name: "__dummy2", scope: !322, file: !240, line: 409, type: !110)
!328 = !DILocation(line: 409, column: 2, scope: !323, inlinedAt: !244)
!329 = !DILocation(line: 409, column: 2, scope: !330, inlinedAt: !244)
!330 = distinct !DILexicalBlock(scope: !325, file: !240, line: 409, column: 2)
!331 = !{i32 -2145381387}
!332 = !DILocation(line: 409, column: 2, scope: !333, inlinedAt: !244)
!333 = distinct !DILexicalBlock(scope: !330, file: !240, line: 409, column: 2)
!334 = !DILocation(line: 50, column: 3, scope: !245)
!335 = !DILocation(line: 54, column: 7, scope: !237)
!336 = !DILocation(line: 54, column: 13, scope: !237)
!337 = !DILocation(line: 54, column: 17, scope: !237)
!338 = !DILocation(line: 54, column: 11, scope: !237)
!339 = !DILocation(line: 54, column: 27, scope: !237)
!340 = !DILocation(line: 54, column: 31, scope: !237)
!341 = !DILocation(line: 54, column: 24, scope: !237)
!342 = !DILocation(line: 54, column: 6, scope: !237)
!343 = !DILocation(line: 54, column: 4, scope: !237)
!344 = !DILocation(line: 55, column: 7, scope: !237)
!345 = !DILocation(line: 55, column: 13, scope: !237)
!346 = !DILocation(line: 55, column: 17, scope: !237)
!347 = !DILocation(line: 55, column: 11, scope: !237)
!348 = !DILocation(line: 55, column: 27, scope: !237)
!349 = !DILocation(line: 55, column: 31, scope: !237)
!350 = !DILocation(line: 55, column: 24, scope: !237)
!351 = !DILocation(line: 55, column: 6, scope: !237)
!352 = !DILocation(line: 55, column: 4, scope: !237)
!353 = !DILocation(line: 57, column: 6, scope: !354)
!354 = distinct !DILexicalBlock(scope: !237, file: !3, line: 57, column: 6)
!355 = !DILocation(line: 57, column: 10, scope: !354)
!356 = !DILocation(line: 57, column: 16, scope: !354)
!357 = !DILocation(line: 57, column: 6, scope: !237)
!358 = !DILocation(line: 58, column: 4, scope: !359)
!359 = distinct !DILexicalBlock(scope: !354, file: !3, line: 57, column: 47)
!360 = !DILocation(line: 59, column: 4, scope: !359)
!361 = !DILocation(line: 60, column: 2, scope: !359)
!362 = !DILocation(line: 62, column: 7, scope: !363)
!363 = distinct !DILexicalBlock(scope: !237, file: !3, line: 62, column: 6)
!364 = !DILocation(line: 62, column: 9, scope: !363)
!365 = !DILocation(line: 62, column: 13, scope: !363)
!366 = !DILocation(line: 62, column: 6, scope: !237)
!367 = !DILocation(line: 63, column: 10, scope: !363)
!368 = !DILocation(line: 63, column: 3, scope: !363)
!369 = !DILocation(line: 65, column: 13, scope: !237)
!370 = !DILocation(line: 65, column: 27, scope: !237)
!371 = !DILocation(line: 65, column: 25, scope: !237)
!372 = !DILocation(line: 65, column: 6, scope: !237)
!373 = !DILocalVariable(name: "__base", scope: !374, file: !3, line: 66, type: !375)
!374 = distinct !DILexicalBlock(scope: !237, file: !3, line: 66, column: 2)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 104, baseType: !197)
!376 = !DILocation(line: 66, column: 2, scope: !374)
!377 = !DILocalVariable(name: "__rem", scope: !374, file: !3, line: 66, type: !375)
!378 = !DILocation(line: 68, column: 9, scope: !237)
!379 = !DILocation(line: 68, column: 2, scope: !237)
!380 = !DILocation(line: 69, column: 1, scope: !237)
!381 = distinct !DISubprogram(name: "clk_fd_round_rate", scope: !3, file: !3, line: 92, type: !113, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!382 = !DILocalVariable(name: "hw", arg: 1, scope: !381, file: !3, line: 92, type: !93)
!383 = !DILocation(line: 92, column: 46, scope: !381)
!384 = !DILocalVariable(name: "rate", arg: 2, scope: !381, file: !3, line: 92, type: !110)
!385 = !DILocation(line: 92, column: 64, scope: !381)
!386 = !DILocalVariable(name: "parent_rate", arg: 3, scope: !381, file: !3, line: 93, type: !116)
!387 = !DILocation(line: 93, column: 25, scope: !381)
!388 = !DILocalVariable(name: "fd", scope: !381, file: !3, line: 95, type: !62)
!389 = !DILocation(line: 95, column: 33, scope: !381)
!390 = !DILocalVariable(name: "__mptr", scope: !391, file: !3, line: 95, type: !61)
!391 = distinct !DILexicalBlock(scope: !381, file: !3, line: 95, column: 38)
!392 = !DILocation(line: 95, column: 38, scope: !391)
!393 = !DILocation(line: 95, column: 38, scope: !394)
!394 = distinct !DILexicalBlock(scope: !391, file: !3, line: 95, column: 38)
!395 = !DILocalVariable(name: "m", scope: !381, file: !3, line: 96, type: !110)
!396 = !DILocation(line: 96, column: 16, scope: !381)
!397 = !DILocalVariable(name: "n", scope: !381, file: !3, line: 96, type: !110)
!398 = !DILocation(line: 96, column: 19, scope: !381)
!399 = !DILocalVariable(name: "ret", scope: !381, file: !3, line: 97, type: !224)
!400 = !DILocation(line: 97, column: 6, scope: !381)
!401 = !DILocation(line: 99, column: 7, scope: !402)
!402 = distinct !DILexicalBlock(scope: !381, file: !3, line: 99, column: 6)
!403 = !DILocation(line: 99, column: 12, scope: !402)
!404 = !DILocation(line: 99, column: 17, scope: !402)
!405 = !DILocation(line: 99, column: 48, scope: !402)
!406 = !DILocation(line: 99, column: 51, scope: !402)
!407 = !DILocation(line: 99, column: 60, scope: !402)
!408 = !DILocation(line: 99, column: 59, scope: !402)
!409 = !DILocation(line: 99, column: 56, scope: !402)
!410 = !DILocation(line: 99, column: 6, scope: !381)
!411 = !DILocation(line: 100, column: 11, scope: !402)
!412 = !DILocation(line: 100, column: 10, scope: !402)
!413 = !DILocation(line: 100, column: 3, scope: !402)
!414 = !DILocation(line: 102, column: 6, scope: !415)
!415 = distinct !DILexicalBlock(scope: !381, file: !3, line: 102, column: 6)
!416 = !DILocation(line: 102, column: 10, scope: !415)
!417 = !DILocation(line: 102, column: 6, scope: !381)
!418 = !DILocation(line: 103, column: 3, scope: !415)
!419 = !DILocation(line: 103, column: 7, scope: !415)
!420 = !DILocation(line: 103, column: 21, scope: !415)
!421 = !DILocation(line: 103, column: 25, scope: !415)
!422 = !DILocation(line: 103, column: 31, scope: !415)
!423 = !DILocation(line: 105, column: 32, scope: !415)
!424 = !DILocation(line: 105, column: 36, scope: !415)
!425 = !DILocation(line: 105, column: 42, scope: !415)
!426 = !DILocation(line: 105, column: 3, scope: !415)
!427 = !DILocation(line: 107, column: 14, scope: !381)
!428 = !DILocation(line: 107, column: 13, scope: !381)
!429 = !DILocation(line: 107, column: 28, scope: !381)
!430 = !DILocation(line: 107, column: 26, scope: !381)
!431 = !DILocation(line: 107, column: 6, scope: !381)
!432 = !DILocalVariable(name: "__base", scope: !433, file: !3, line: 108, type: !375)
!433 = distinct !DILexicalBlock(scope: !381, file: !3, line: 108, column: 2)
!434 = !DILocation(line: 108, column: 2, scope: !433)
!435 = !DILocalVariable(name: "__rem", scope: !433, file: !3, line: 108, type: !375)
!436 = !DILocation(line: 110, column: 9, scope: !381)
!437 = !DILocation(line: 110, column: 2, scope: !381)
!438 = !DILocation(line: 111, column: 1, scope: !381)
!439 = distinct !DISubprogram(name: "clk_fd_set_rate", scope: !3, file: !3, line: 113, type: !144, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !223)
!440 = !DILocation(line: 407, column: 64, scope: !239, inlinedAt: !441)
!441 = distinct !DILocation(line: 141, column: 3, scope: !442)
!442 = distinct !DILexicalBlock(scope: !439, file: !3, line: 140, column: 6)
!443 = !DILocation(line: 407, column: 84, scope: !239, inlinedAt: !441)
!444 = !DILocation(line: 327, column: 67, scope: !249, inlinedAt: !445)
!445 = distinct !DILocation(line: 131, column: 3, scope: !446)
!446 = distinct !DILexicalBlock(scope: !447, file: !3, line: 131, column: 3)
!447 = distinct !DILexicalBlock(scope: !448, file: !3, line: 131, column: 3)
!448 = distinct !DILexicalBlock(scope: !449, file: !3, line: 131, column: 3)
!449 = distinct !DILexicalBlock(scope: !450, file: !3, line: 131, column: 3)
!450 = distinct !DILexicalBlock(scope: !451, file: !3, line: 131, column: 3)
!451 = distinct !DILexicalBlock(scope: !439, file: !3, line: 130, column: 6)
!452 = !DILocalVariable(name: "hw", arg: 1, scope: !439, file: !3, line: 113, type: !93)
!453 = !DILocation(line: 113, column: 43, scope: !439)
!454 = !DILocalVariable(name: "rate", arg: 2, scope: !439, file: !3, line: 113, type: !110)
!455 = !DILocation(line: 113, column: 61, scope: !439)
!456 = !DILocalVariable(name: "parent_rate", arg: 3, scope: !439, file: !3, line: 114, type: !110)
!457 = !DILocation(line: 114, column: 21, scope: !439)
!458 = !DILocalVariable(name: "fd", scope: !439, file: !3, line: 116, type: !62)
!459 = !DILocation(line: 116, column: 33, scope: !439)
!460 = !DILocalVariable(name: "__mptr", scope: !461, file: !3, line: 116, type: !61)
!461 = distinct !DILexicalBlock(scope: !439, file: !3, line: 116, column: 38)
!462 = !DILocation(line: 116, column: 38, scope: !461)
!463 = !DILocation(line: 116, column: 38, scope: !464)
!464 = distinct !DILexicalBlock(scope: !461, file: !3, line: 116, column: 38)
!465 = !DILocalVariable(name: "flags", scope: !439, file: !3, line: 117, type: !110)
!466 = !DILocation(line: 117, column: 16, scope: !439)
!467 = !DILocalVariable(name: "m", scope: !439, file: !3, line: 118, type: !110)
!468 = !DILocation(line: 118, column: 16, scope: !439)
!469 = !DILocalVariable(name: "n", scope: !439, file: !3, line: 118, type: !110)
!470 = !DILocation(line: 118, column: 19, scope: !439)
!471 = !DILocalVariable(name: "val", scope: !439, file: !3, line: 119, type: !197)
!472 = !DILocation(line: 119, column: 6, scope: !439)
!473 = !DILocation(line: 121, column: 30, scope: !439)
!474 = !DILocation(line: 121, column: 36, scope: !439)
!475 = !DILocation(line: 122, column: 4, scope: !439)
!476 = !DILocation(line: 122, column: 32, scope: !439)
!477 = !DILocation(line: 121, column: 2, scope: !439)
!478 = !DILocation(line: 125, column: 6, scope: !479)
!479 = distinct !DILexicalBlock(scope: !439, file: !3, line: 125, column: 6)
!480 = !DILocation(line: 125, column: 10, scope: !479)
!481 = !DILocation(line: 125, column: 16, scope: !479)
!482 = !DILocation(line: 125, column: 6, scope: !439)
!483 = !DILocation(line: 126, column: 4, scope: !484)
!484 = distinct !DILexicalBlock(scope: !479, file: !3, line: 125, column: 47)
!485 = !DILocation(line: 127, column: 4, scope: !484)
!486 = !DILocation(line: 128, column: 2, scope: !484)
!487 = !DILocation(line: 130, column: 6, scope: !451)
!488 = !DILocation(line: 130, column: 10, scope: !451)
!489 = !DILocation(line: 130, column: 6, scope: !439)
!490 = !DILocation(line: 131, column: 3, scope: !451)
!491 = !DILocation(line: 131, column: 3, scope: !450)
!492 = !DILocalVariable(name: "__dummy", scope: !493, file: !3, line: 131, type: !110)
!493 = distinct !DILexicalBlock(scope: !449, file: !3, line: 131, column: 3)
!494 = !DILocation(line: 131, column: 3, scope: !493)
!495 = !DILocalVariable(name: "__dummy2", scope: !493, file: !3, line: 131, type: !110)
!496 = !DILocation(line: 131, column: 3, scope: !449)
!497 = !DILocation(line: 131, column: 3, scope: !448)
!498 = !DILocation(line: 131, column: 3, scope: !499)
!499 = distinct !DILexicalBlock(scope: !448, file: !3, line: 131, column: 3)
!500 = !DILocalVariable(name: "__dummy", scope: !501, file: !3, line: 131, type: !110)
!501 = distinct !DILexicalBlock(scope: !502, file: !3, line: 131, column: 3)
!502 = distinct !DILexicalBlock(scope: !499, file: !3, line: 131, column: 3)
!503 = !DILocation(line: 131, column: 3, scope: !501)
!504 = !DILocalVariable(name: "__dummy2", scope: !501, file: !3, line: 131, type: !110)
!505 = !DILocation(line: 131, column: 3, scope: !502)
!506 = !DILocation(line: 131, column: 3, scope: !447)
!507 = !{i32 -2143303046}
!508 = !DILocation(line: 131, column: 3, scope: !446)
!509 = !DILocation(line: 329, column: 10, scope: !249, inlinedAt: !445)
!510 = !DILocation(line: 329, column: 16, scope: !249, inlinedAt: !445)
!511 = !DILocation(line: 135, column: 21, scope: !439)
!512 = !DILocation(line: 135, column: 8, scope: !439)
!513 = !DILocation(line: 135, column: 6, scope: !439)
!514 = !DILocation(line: 136, column: 11, scope: !439)
!515 = !DILocation(line: 136, column: 15, scope: !439)
!516 = !DILocation(line: 136, column: 23, scope: !439)
!517 = !DILocation(line: 136, column: 27, scope: !439)
!518 = !DILocation(line: 136, column: 21, scope: !439)
!519 = !DILocation(line: 136, column: 9, scope: !439)
!520 = !DILocation(line: 136, column: 6, scope: !439)
!521 = !DILocation(line: 137, column: 10, scope: !439)
!522 = !DILocation(line: 137, column: 15, scope: !439)
!523 = !DILocation(line: 137, column: 19, scope: !439)
!524 = !DILocation(line: 137, column: 12, scope: !439)
!525 = !DILocation(line: 137, column: 30, scope: !439)
!526 = !DILocation(line: 137, column: 35, scope: !439)
!527 = !DILocation(line: 137, column: 39, scope: !439)
!528 = !DILocation(line: 137, column: 32, scope: !439)
!529 = !DILocation(line: 137, column: 27, scope: !439)
!530 = !DILocation(line: 137, column: 6, scope: !439)
!531 = !DILocation(line: 138, column: 16, scope: !439)
!532 = !DILocation(line: 138, column: 20, scope: !439)
!533 = !DILocation(line: 138, column: 2, scope: !439)
!534 = !DILocation(line: 140, column: 6, scope: !442)
!535 = !DILocation(line: 140, column: 10, scope: !442)
!536 = !DILocation(line: 140, column: 6, scope: !439)
!537 = !DILocation(line: 141, column: 26, scope: !442)
!538 = !DILocation(line: 141, column: 30, scope: !442)
!539 = !DILocation(line: 141, column: 36, scope: !442)
!540 = !DILocation(line: 409, column: 2, scope: !317, inlinedAt: !441)
!541 = !DILocation(line: 409, column: 2, scope: !322, inlinedAt: !441)
!542 = !DILocation(line: 409, column: 2, scope: !323, inlinedAt: !441)
!543 = !DILocation(line: 409, column: 2, scope: !330, inlinedAt: !441)
!544 = !DILocation(line: 409, column: 2, scope: !333, inlinedAt: !441)
!545 = !DILocation(line: 141, column: 3, scope: !442)
!546 = !DILocation(line: 145, column: 2, scope: !439)
!547 = distinct !DISubprogram(name: "clk_hw_register_fractional_divider", scope: !3, file: !3, line: 155, type: !548, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !223)
!548 = !DISubroutineType(types: !549)
!549 = !{!93, !550, !81, !81, !110, !61, !133, !133, !133, !133, !133, !208}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !552)
!552 = !{!553, !2028, !2029, !2032, !2033, !2084, !2181, !2182, !2183, !2184, !2185, !2194, !2299, !2312, !2315, !2316, !2320, !2322, !2323, !2324, !2328, !2334, !2335, !2338, !2453, !2454, !2457, !2458, !2459, !2460, !2492, !2493, !2494, !2497, !2500, !2501, !2502, !2503}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !551, file: !30, line: 462, baseType: !554, size: 512)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !555, line: 64, size: 512, elements: !556)
!555 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!556 = !{!557, !558, !564, !566, !611, !1866, !2018, !2023, !2024, !2025, !2026, !2027}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !554, file: !555, line: 65, baseType: !81, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !554, file: !555, line: 66, baseType: !559, size: 128, offset: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !59, line: 178, size: 128, elements: !560)
!560 = !{!561, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !559, file: !59, line: 179, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !559, file: !59, line: 179, baseType: !562, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !554, file: !555, line: 67, baseType: !565, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !554, file: !555, line: 68, baseType: !567, size: 64, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !555, line: 192, size: 704, elements: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !568, file: !555, line: 193, baseType: !559, size: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !568, file: !555, line: 194, baseType: !209, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !568, file: !555, line: 195, baseType: !554, size: 512, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !568, file: !555, line: 196, baseType: !574, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !555, line: 156, size: 192, elements: !577)
!577 = !{!578, !583, !588}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !576, file: !555, line: 157, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!60, !567, !565}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !576, file: !555, line: 158, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!81, !567, !565}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !576, file: !555, line: 159, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!60, !567, !565, !593}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !555, line: 148, size: 20736, elements: !595)
!595 = !{!596, !601, !605, !606, !610}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !594, file: !555, line: 149, baseType: !597, size: 192)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 192, elements: !599)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!599 = !{!600}
!600 = !DISubrange(count: 3)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !594, file: !555, line: 150, baseType: !602, size: 4096, offset: 192)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 4096, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !594, file: !555, line: 151, baseType: !60, size: 32, offset: 4288)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !594, file: !555, line: 152, baseType: !607, size: 16384, offset: 4320)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 16384, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 2048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !594, file: !555, line: 153, baseType: !60, size: 32, offset: 20704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !554, file: !555, line: 69, baseType: !612, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !555, line: 138, size: 448, elements: !614)
!614 = !{!615, !619, !647, !649, !1813, !1844, !1848}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !613, file: !555, line: 139, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !565}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !613, file: !555, line: 140, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !623, line: 230, size: 128, elements: !624)
!623 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!624 = !{!625, !640}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !622, file: !623, line: 231, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!629, !565, !633, !598}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !59, line: 60, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !631, line: 73, baseType: !632)
!631 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !631, line: 15, baseType: !115)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !623, line: 30, size: 128, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !634, file: !623, line: 31, baseType: !81, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !634, file: !623, line: 32, baseType: !638, size: 16, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !59, line: 19, baseType: !639)
!639 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !622, file: !623, line: 232, baseType: !641, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!629, !565, !633, !81, !644}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 55, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !631, line: 72, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !631, line: 16, baseType: !110)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !613, file: !555, line: 141, baseType: !648, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !613, file: !555, line: 142, baseType: !650, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !623, line: 84, size: 320, elements: !654)
!654 = !{!655, !656, !660, !1810, !1811}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !623, line: 85, baseType: !81, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !653, file: !623, line: 86, baseType: !657, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!638, !565, !633, !60}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !653, file: !623, line: 88, baseType: !661, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!638, !565, !664, !60}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !623, line: 168, size: 448, elements: !666)
!666 = !{!667, !668, !669, !670, !680, !681}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !665, file: !623, line: 169, baseType: !634, size: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !623, line: 170, baseType: !644, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !665, file: !623, line: 171, baseType: !61, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !665, file: !623, line: 172, baseType: !671, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{!629, !674, !565, !664, !598, !677, !644}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !676, line: 526, flags: DIFlagFwdDecl)
!676 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !59, line: 46, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !631, line: 88, baseType: !679)
!679 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !665, file: !623, line: 174, baseType: !671, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !665, file: !623, line: 176, baseType: !682, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!60, !674, !565, !664, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !687, line: 305, size: 1472, elements: !688)
!687 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!688 = !{!689, !690, !691, !692, !693, !701, !702, !1784, !1790, !1791, !1796, !1797, !1800, !1804, !1805, !1806, !1807, !1808}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !686, file: !687, line: 308, baseType: !110, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !686, file: !687, line: 309, baseType: !110, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !686, file: !687, line: 313, baseType: !685, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !686, file: !687, line: 313, baseType: !685, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !686, file: !687, line: 315, baseType: !694, size: 192, align: 64, offset: 256)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !695, line: 24, size: 192, align: 64, elements: !696)
!695 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!696 = !{!697, !698, !700}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !694, file: !695, line: 25, baseType: !110, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !694, file: !695, line: 26, baseType: !699, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !694, file: !695, line: 27, baseType: !699, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !686, file: !687, line: 323, baseType: !110, size: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !686, file: !687, line: 327, baseType: !703, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !687, line: 388, size: 7296, elements: !705)
!705 = !{!706, !1780}
!706 = !DIDerivedType(tag: DW_TAG_member, scope: !704, file: !687, line: 389, baseType: !707, size: 7296)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !687, line: 389, size: 7296, elements: !708)
!708 = !{!709, !710, !714, !715, !719, !720, !721, !722, !723, !731, !736, !737, !738, !739, !748, !749, !750, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !784, !792, !795, !843, !844, !1751, !1752, !1755, !1758, !1759, !1762, !1763, !1764, !1767, !1779}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !707, file: !687, line: 390, baseType: !685, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !707, file: !687, line: 391, baseType: !711, size: 64, offset: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !695, line: 31, size: 64, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !711, file: !695, line: 32, baseType: !699, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !707, file: !687, line: 392, baseType: !224, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !707, file: !687, line: 394, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!110, !674, !110, !110, !110, !110}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !707, file: !687, line: 398, baseType: !110, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !707, file: !687, line: 399, baseType: !110, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !707, file: !687, line: 405, baseType: !110, size: 64, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !707, file: !687, line: 406, baseType: !110, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !707, file: !687, line: 407, baseType: !724, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !676, line: 286, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 286, size: 64, elements: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !726, file: !676, line: 286, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !730, line: 18, baseType: !110)
!730 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!731 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !707, file: !687, line: 416, baseType: !732, size: 32, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !59, line: 168, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 166, size: 32, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !733, file: !59, line: 167, baseType: !60, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !707, file: !687, line: 428, baseType: !732, size: 32, offset: 608)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !707, file: !687, line: 437, baseType: !732, size: 32, offset: 640)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !707, file: !687, line: 447, baseType: !732, size: 32, offset: 672)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !707, file: !687, line: 450, baseType: !740, size: 64, offset: 704)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !741, line: 13, baseType: !742)
!741 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !59, line: 175, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 173, size: 64, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !743, file: !59, line: 174, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !134, line: 22, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !136, line: 30, baseType: !679)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !707, file: !687, line: 452, baseType: !60, size: 32, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !707, file: !687, line: 454, baseType: !209, offset: 800)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !707, file: !687, line: 457, baseType: !751, size: 256, offset: 832)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !752, line: 35, size: 256, elements: !753)
!752 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!753 = !{!754, !755, !756, !757}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !751, file: !752, line: 36, baseType: !740, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !751, file: !752, line: 42, baseType: !740, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !751, file: !752, line: 46, baseType: !253, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !751, file: !752, line: 47, baseType: !559, size: 128, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !707, file: !687, line: 459, baseType: !559, size: 128, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !707, file: !687, line: 466, baseType: !110, size: 64, offset: 1216)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !707, file: !687, line: 467, baseType: !110, size: 64, offset: 1280)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !707, file: !687, line: 469, baseType: !110, size: 64, offset: 1344)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !707, file: !687, line: 470, baseType: !110, size: 64, offset: 1408)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !707, file: !687, line: 471, baseType: !742, size: 64, offset: 1472)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !707, file: !687, line: 472, baseType: !110, size: 64, offset: 1536)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !707, file: !687, line: 473, baseType: !110, size: 64, offset: 1600)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !707, file: !687, line: 474, baseType: !110, size: 64, offset: 1664)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !707, file: !687, line: 475, baseType: !110, size: 64, offset: 1728)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !707, file: !687, line: 477, baseType: !209, offset: 1792)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !707, file: !687, line: 478, baseType: !110, size: 64, offset: 1792)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !707, file: !687, line: 478, baseType: !110, size: 64, offset: 1856)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !707, file: !687, line: 478, baseType: !110, size: 64, offset: 1920)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !707, file: !687, line: 478, baseType: !110, size: 64, offset: 1984)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !707, file: !687, line: 479, baseType: !110, size: 64, offset: 2048)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !707, file: !687, line: 479, baseType: !110, size: 64, offset: 2112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !707, file: !687, line: 479, baseType: !110, size: 64, offset: 2176)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !707, file: !687, line: 480, baseType: !110, size: 64, offset: 2240)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !707, file: !687, line: 480, baseType: !110, size: 64, offset: 2304)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !707, file: !687, line: 480, baseType: !110, size: 64, offset: 2368)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !707, file: !687, line: 480, baseType: !110, size: 64, offset: 2432)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !707, file: !687, line: 482, baseType: !781, size: 2816, offset: 2496)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 2816, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 44)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !707, file: !687, line: 488, baseType: !785, size: 256, offset: 5312)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !786, line: 60, size: 256, elements: !787)
!786 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !785, file: !786, line: 61, baseType: !789, size: 256)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 256, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 4)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !707, file: !687, line: 490, baseType: !793, size: 64, offset: 5568)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !687, line: 490, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !707, file: !687, line: 493, baseType: !796, size: 896, offset: 5632)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !797, line: 53, baseType: !798)
!797 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !797, line: 13, size: 896, elements: !799)
!799 = !{!800, !801, !802, !803, !806, !807, !814, !815, !835, !836, !839}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !798, file: !797, line: 18, baseType: !224, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !798, file: !797, line: 28, baseType: !742, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !798, file: !797, line: 31, baseType: !751, size: 256, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !798, file: !797, line: 32, baseType: !804, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !797, line: 32, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !798, file: !797, line: 37, baseType: !639, size: 16, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !798, file: !797, line: 40, baseType: !808, size: 192, offset: 512)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !809, line: 53, size: 192, elements: !810)
!809 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !808, file: !809, line: 54, baseType: !740, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !808, file: !809, line: 55, baseType: !209, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !808, file: !809, line: 59, baseType: !559, size: 128, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !798, file: !797, line: 41, baseType: !61, size: 64, offset: 704)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !798, file: !797, line: 42, baseType: !816, size: 64, offset: 768)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !819, line: 13, size: 896, elements: !820)
!819 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !818, file: !819, line: 14, baseType: !61, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !818, file: !819, line: 15, baseType: !110, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !818, file: !819, line: 17, baseType: !110, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !818, file: !819, line: 17, baseType: !110, size: 64, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !818, file: !819, line: 19, baseType: !115, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !818, file: !819, line: 21, baseType: !115, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !818, file: !819, line: 22, baseType: !115, size: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !818, file: !819, line: 23, baseType: !115, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !818, file: !819, line: 24, baseType: !115, size: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !818, file: !819, line: 25, baseType: !115, size: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !818, file: !819, line: 26, baseType: !115, size: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !818, file: !819, line: 27, baseType: !115, size: 64, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !818, file: !819, line: 28, baseType: !115, size: 64, offset: 768)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !818, file: !819, line: 29, baseType: !115, size: 64, offset: 832)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !798, file: !797, line: 44, baseType: !732, size: 32, offset: 832)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !798, file: !797, line: 50, baseType: !837, size: 16, offset: 864)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !134, line: 19, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !136, line: 24, baseType: !639)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !798, file: !797, line: 51, baseType: !840, size: 16, offset: 880)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !134, line: 18, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !136, line: 23, baseType: !842)
!842 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !687, line: 495, baseType: !110, size: 64, offset: 6528)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !707, file: !687, line: 497, baseType: !845, size: 64, offset: 6592)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !687, line: 381, size: 384, elements: !847)
!847 = !{!848, !849, !1750}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !846, file: !687, line: 382, baseType: !732, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !846, file: !687, line: 383, baseType: !850, size: 128, offset: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !687, line: 376, size: 128, elements: !851)
!851 = !{!852, !1748}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !850, file: !687, line: 377, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !855, line: 640, size: 48640, elements: !856)
!855 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!856 = !{!857, !863, !865, !866, !872, !873, !874, !875, !876, !877, !878, !879, !883, !901, !912, !1004, !1005, !1006, !1017, !1018, !1020, !1021, !1022, !1023, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1102, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1158, !1160, !1161, !1162, !1174, !1176, !1177, !1178, !1179, !1180, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1204, !1209, !1214, !1215, !1216, !1219, !1223, !1226, !1229, !1232, !1235, !1239, !1242, !1245, !1251, !1252, !1253, !1259, !1260, !1261, !1262, !1263, !1272, !1273, !1274, !1275, !1276, !1281, !1282, !1283, !1286, !1287, !1290, !1293, !1296, !1299, !1302, !1305, !1306, !1386, !1389, !1392, !1393, !1396, !1397, !1398, !1404, !1405, !1406, !1419, !1420, !1421, !1433, !1438, !1441, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !854, file: !855, line: 646, baseType: !858, size: 128)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !859, line: 56, size: 128, elements: !860)
!859 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !858, file: !859, line: 57, baseType: !110, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !858, file: !859, line: 58, baseType: !197, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !854, file: !855, line: 649, baseType: !864, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !854, file: !855, line: 657, baseType: !61, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !854, file: !855, line: 658, baseType: !867, size: 32, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !868, line: 113, baseType: !869)
!868 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !868, line: 111, size: 32, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !869, file: !868, line: 112, baseType: !732, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !855, line: 660, baseType: !7, size: 32, offset: 288)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !854, file: !855, line: 661, baseType: !7, size: 32, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !854, file: !855, line: 684, baseType: !60, size: 32, offset: 352)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !854, file: !855, line: 686, baseType: !60, size: 32, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !854, file: !855, line: 687, baseType: !60, size: 32, offset: 416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !854, file: !855, line: 688, baseType: !60, size: 32, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !854, file: !855, line: 689, baseType: !7, size: 32, offset: 480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !854, file: !855, line: 691, baseType: !880, size: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !855, line: 691, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !854, file: !855, line: 692, baseType: !884, size: 832, offset: 576)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !855, line: 451, size: 832, elements: !885)
!885 = !{!886, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !884, file: !855, line: 453, baseType: !887, size: 128)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !855, line: 325, size: 128, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !887, file: !855, line: 326, baseType: !110, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !887, file: !855, line: 327, baseType: !197, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !884, file: !855, line: 454, baseType: !694, size: 192, align: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !884, file: !855, line: 455, baseType: !559, size: 128, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !884, file: !855, line: 456, baseType: !7, size: 32, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !884, file: !855, line: 458, baseType: !224, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !884, file: !855, line: 459, baseType: !224, size: 64, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !884, file: !855, line: 460, baseType: !224, size: 64, offset: 640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !884, file: !855, line: 461, baseType: !224, size: 64, offset: 704)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !884, file: !855, line: 463, baseType: !224, size: 64, offset: 768)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !884, file: !855, line: 465, baseType: !900, offset: 832)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !855, line: 415, elements: !223)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !854, file: !855, line: 693, baseType: !902, size: 384, offset: 1408)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !855, line: 489, size: 384, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !902, file: !855, line: 490, baseType: !559, size: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !902, file: !855, line: 491, baseType: !110, size: 64, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !902, file: !855, line: 492, baseType: !110, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !902, file: !855, line: 493, baseType: !7, size: 32, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !902, file: !855, line: 494, baseType: !639, size: 16, offset: 288)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !902, file: !855, line: 495, baseType: !639, size: 16, offset: 304)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !902, file: !855, line: 497, baseType: !911, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !854, file: !855, line: 697, baseType: !913, size: 1792, offset: 1792)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !855, line: 507, size: 1792, elements: !914)
!914 = !{!915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !1001, !1002}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !913, file: !855, line: 508, baseType: !694, size: 192, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !913, file: !855, line: 515, baseType: !224, size: 64, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !913, file: !855, line: 516, baseType: !224, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !913, file: !855, line: 517, baseType: !224, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !913, file: !855, line: 518, baseType: !224, size: 64, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !913, file: !855, line: 519, baseType: !224, size: 64, offset: 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !913, file: !855, line: 526, baseType: !746, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !913, file: !855, line: 527, baseType: !224, size: 64, offset: 576)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !913, file: !855, line: 528, baseType: !7, size: 32, offset: 640)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !913, file: !855, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !913, file: !855, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !913, file: !855, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !913, file: !855, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !913, file: !855, line: 563, baseType: !929, size: 512, offset: 704)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !930)
!930 = !{!931, !939, !940, !945, !997, !998, !999, !1000}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !929, file: !6, line: 119, baseType: !932, size: 256)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !933, line: 9, size: 256, elements: !934)
!933 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !932, file: !933, line: 10, baseType: !694, size: 192, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !932, file: !933, line: 11, baseType: !937, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !938, line: 29, baseType: !746)
!938 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !929, file: !6, line: 120, baseType: !937, size: 64, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !929, file: !6, line: 121, baseType: !941, size: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!5, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !929, file: !6, line: 122, baseType: !946, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !948)
!948 = !{!949, !969, !970, !973, !983, !984, !992, !996}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !947, file: !6, line: 160, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !952)
!952 = !{!953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !951, file: !6, line: 215, baseType: !253)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !951, file: !6, line: 216, baseType: !7, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !951, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !951, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !951, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !951, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !951, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !951, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !951, file: !6, line: 233, baseType: !937, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !951, file: !6, line: 234, baseType: !944, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !951, file: !6, line: 235, baseType: !937, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !951, file: !6, line: 236, baseType: !944, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !951, file: !6, line: 237, baseType: !966, size: 4096, offset: 512)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 4096, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 8)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !947, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !947, file: !6, line: 162, baseType: !971, size: 32, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !59, line: 27, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !631, line: 96, baseType: !60)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !947, file: !6, line: 163, baseType: !974, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !975, line: 276, baseType: !976)
!975 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !975, line: 276, size: 32, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !976, file: !975, line: 276, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !975, line: 70, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !975, line: 65, size: 32, elements: !981)
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !980, file: !975, line: 66, baseType: !7, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !947, file: !6, line: 164, baseType: !944, size: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !947, file: !6, line: 165, baseType: !985, size: 128, offset: 256)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !933, line: 14, size: 128, elements: !986)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !985, file: !933, line: 15, baseType: !988, size: 128)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !695, line: 125, size: 128, elements: !989)
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !988, file: !695, line: 126, baseType: !711, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !988, file: !695, line: 127, baseType: !699, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !947, file: !6, line: 166, baseType: !993, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!937}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !947, file: !6, line: 167, baseType: !937, size: 64, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !929, file: !6, line: 123, baseType: !133, size: 8, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !929, file: !6, line: 124, baseType: !133, size: 8, offset: 456)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !929, file: !6, line: 125, baseType: !133, size: 8, offset: 464)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !929, file: !6, line: 126, baseType: !133, size: 8, offset: 472)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !913, file: !855, line: 572, baseType: !929, size: 512, offset: 1216)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !913, file: !855, line: 580, baseType: !1003, size: 64, offset: 1728)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !854, file: !855, line: 721, baseType: !7, size: 32, offset: 3584)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !854, file: !855, line: 722, baseType: !60, size: 32, offset: 3616)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !854, file: !855, line: 723, baseType: !1007, size: 64, offset: 3648)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !1010, line: 17, baseType: !1011)
!1010 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !1010, line: 17, size: 64, elements: !1012)
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1011, file: !1010, line: 17, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 1)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !854, file: !855, line: 724, baseType: !1009, size: 64, offset: 3712)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !854, file: !855, line: 749, baseType: !1019, offset: 3776)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !855, line: 290, elements: !223)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !854, file: !855, line: 751, baseType: !559, size: 128, offset: 3776)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !854, file: !855, line: 757, baseType: !703, size: 64, offset: 3904)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !854, file: !855, line: 758, baseType: !703, size: 64, offset: 3968)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !854, file: !855, line: 761, baseType: !1024, size: 320, offset: 4032)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !786, line: 34, size: 320, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !1024, file: !786, line: 35, baseType: !224, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !1024, file: !786, line: 36, baseType: !1028, size: 256, offset: 64)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 256, elements: !790)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !854, file: !855, line: 766, baseType: !60, size: 32, offset: 4352)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !854, file: !855, line: 767, baseType: !60, size: 32, offset: 4384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !854, file: !855, line: 768, baseType: !60, size: 32, offset: 4416)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !854, file: !855, line: 770, baseType: !60, size: 32, offset: 4448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !854, file: !855, line: 772, baseType: !110, size: 64, offset: 4480)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !854, file: !855, line: 775, baseType: !7, size: 32, offset: 4544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !854, file: !855, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !854, file: !855, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !854, file: !855, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !854, file: !855, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !854, file: !855, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !854, file: !855, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !854, file: !855, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !854, file: !855, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !854, file: !855, line: 831, baseType: !110, size: 64, offset: 4672)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !854, file: !855, line: 833, baseType: !1045, size: 384, offset: 4736)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !1046)
!1046 = !{!1047, !1052}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !1045, file: !12, line: 26, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!115, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, scope: !1045, file: !12, line: 27, baseType: !1053, size: 320, offset: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1045, file: !12, line: 27, size: 320, elements: !1054)
!1054 = !{!1055, !1065, !1092}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !1053, file: !12, line: 36, baseType: !1056, size: 320)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1053, file: !12, line: 29, size: 320, elements: !1057)
!1057 = !{!1058, !1060, !1061, !1062, !1063, !1064}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !1056, file: !12, line: 30, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1056, file: !12, line: 31, baseType: !197, size: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1056, file: !12, line: 32, baseType: !197, size: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !1056, file: !12, line: 33, baseType: !197, size: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !1056, file: !12, line: 34, baseType: !224, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !1056, file: !12, line: 35, baseType: !1059, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !1053, file: !12, line: 46, baseType: !1066, size: 192)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1053, file: !12, line: 38, size: 192, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1091}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !1066, file: !12, line: 39, baseType: !971, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1066, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, scope: !1066, file: !12, line: 41, baseType: !1071, size: 64, offset: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1066, file: !12, line: 41, size: 64, elements: !1072)
!1072 = !{!1073, !1081}
