; ModuleID = '../bcout/drivers/clk/clk-multiplier.llvm.bc'
source_filename = "drivers/clk/clk-multiplier.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.clk_hw = type { %struct.clk_core*, %struct.clk*, %struct.clk_init_data* }
%struct.clk_core = type opaque
%struct.clk = type opaque
%struct.clk_init_data = type { i8*, %struct.clk_ops*, i8**, %struct.clk_parent_data*, %struct.clk_hw**, i8, i64 }
%struct.clk_ops = type { {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, i64 (%struct.clk_hw*, i64)*, i64 (%struct.clk_hw*, i64, i64*)*, i32 (%struct.clk_hw*, %struct.clk_rate_request*)*, i32 (%struct.clk_hw*, i8)*, i8 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i64, i64)*, i32 (%struct.clk_hw*, i64, i64, i8)*, i64 (%struct.clk_hw*, i64)*, {}*, i32 (%struct.clk_hw*, i32)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, {}*, void (%struct.clk_hw*)*, void (%struct.clk_hw*, %struct.dentry*)* }
%struct.clk_parent_data = type { %struct.clk_hw*, i8*, i8*, i32 }
%struct.clk_rate_request = type { i64, i64, i64, i64, %struct.clk_hw* }
%struct.clk_duty = type { i32, i32 }
%struct.dentry = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "clk_multiplier_ops", scope: !2, file: !3, line: 151, type: !31, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !162, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/clk-multiplier.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !7, !38, !160, !56}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_multiplier", file: !9, line: 996, size: 384, elements: !10)
!9 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!10 = !{!11, !140, !141, !142, !143, !144}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !8, file: !9, line: 997, baseType: !12, size: 192)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !9, line: 312, size: 192, elements: !13)
!13 = !{!14, !17, !20}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !12, file: !9, line: 313, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !9, line: 38, flags: DIFlagFwdDecl)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !12, file: !9, line: 314, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !9, line: 36, flags: DIFlagFwdDecl)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !12, file: !9, line: 315, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !9, line: 285, size: 448, elements: !24)
!24 = !{!25, !29, !122, !125, !136, !138, !139}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !9, line: 286, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !23, file: !9, line: 287, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !9, line: 220, size: 1600, elements: !33)
!33 = !{!34, !40, !44, !45, !46, !47, !48, !49, !50, !51, !52, !57, !63, !75, !84, !88, !92, !96, !97, !98, !102, !112, !113, !114, !115}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !32, file: !9, line: 221, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39}
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !32, file: !9, line: 222, baseType: !41, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !39}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !32, file: !9, line: 223, baseType: !35, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !32, file: !9, line: 224, baseType: !41, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !32, file: !9, line: 225, baseType: !35, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !32, file: !9, line: 226, baseType: !41, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !32, file: !9, line: 227, baseType: !35, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !32, file: !9, line: 228, baseType: !41, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !32, file: !9, line: 229, baseType: !35, size: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !32, file: !9, line: 230, baseType: !41, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !32, file: !9, line: 231, baseType: !53, size: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !39, !56}
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !32, file: !9, line: 233, baseType: !58, size: 64, offset: 704)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !39, !56, !62}
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !32, file: !9, line: 235, baseType: !64, size: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!38, !39, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !9, line: 55, size: 320, elements: !69)
!69 = !{!70, !71, !72, !73, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !68, file: !9, line: 56, baseType: !56, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !68, file: !9, line: 57, baseType: !56, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !68, file: !9, line: 58, baseType: !56, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !68, file: !9, line: 59, baseType: !56, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !68, file: !9, line: 60, baseType: !39, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !32, file: !9, line: 237, baseType: !76, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!38, !39, !79}
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !80, line: 17, baseType: !81)
!80 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !82, line: 21, baseType: !83)
!82 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !32, file: !9, line: 238, baseType: !85, size: 64, offset: 896)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!79, !39}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !32, file: !9, line: 239, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!38, !39, !56, !56}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !32, file: !9, line: 241, baseType: !93, size: 64, offset: 1024)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!38, !39, !56, !56, !79}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !32, file: !9, line: 244, baseType: !53, size: 64, offset: 1088)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !32, file: !9, line: 246, baseType: !35, size: 64, offset: 1152)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !32, file: !9, line: 247, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!38, !39, !38}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !32, file: !9, line: 248, baseType: !103, size: 64, offset: 1280)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!38, !39, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !9, line: 69, size: 64, elements: !108)
!108 = !{!109, !111}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !107, file: !9, line: 70, baseType: !110, size: 32)
!110 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !107, file: !9, line: 71, baseType: !110, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !32, file: !9, line: 250, baseType: !103, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !32, file: !9, line: 252, baseType: !35, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !32, file: !9, line: 253, baseType: !41, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !32, file: !9, line: 254, baseType: !116, size: 64, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !39, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !121, line: 21, flags: DIFlagFwdDecl)
!121 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!122 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !23, file: !9, line: 289, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !23, file: !9, line: 290, baseType: !126, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !9, line: 264, size: 256, elements: !129)
!129 = !{!130, !133, !134, !135}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !128, file: !9, line: 265, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !128, file: !9, line: 266, baseType: !26, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !9, line: 267, baseType: !26, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !128, file: !9, line: 268, baseType: !38, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !23, file: !9, line: 291, baseType: !137, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !23, file: !9, line: 292, baseType: !79, size: 8, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !23, file: !9, line: 293, baseType: !56, size: 64, offset: 384)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !8, file: !9, line: 998, baseType: !6, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !8, file: !9, line: 999, baseType: !79, size: 8, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !8, file: !9, line: 1000, baseType: !79, size: 8, offset: 264)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !8, file: !9, line: 1001, baseType: !79, size: 8, offset: 272)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !8, file: !9, line: 1002, baseType: !145, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !147, line: 83, baseType: !148)
!147 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !147, line: 71, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !147, line: 72, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !147, line: 72, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !151, file: !147, line: 73, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !147, line: 20, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !154, file: !147, line: 21, baseType: !157)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !158, line: 25, baseType: !159)
!158 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !158, line: 25, elements: !4)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!162 = !{!0}
!163 = !{!"rsp"}
!164 = !{i32 7, !"Dwarf Version", i32 4}
!165 = !{i32 2, !"Debug Info Version", i32 3}
!166 = !{i32 1, !"wchar_size", i32 2}
!167 = !{i32 1, !"Code Model", i32 2}
!168 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!169 = distinct !DISubprogram(name: "clk_multiplier_recalc_rate", scope: !3, file: !3, line: 41, type: !54, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!170 = !DILocalVariable(name: "hw", arg: 1, scope: !169, file: !3, line: 41, type: !39)
!171 = !DILocation(line: 41, column: 64, scope: !169)
!172 = !DILocalVariable(name: "parent_rate", arg: 2, scope: !169, file: !3, line: 42, type: !56)
!173 = !DILocation(line: 42, column: 21, scope: !169)
!174 = !DILocalVariable(name: "mult", scope: !169, file: !3, line: 44, type: !7)
!175 = !DILocation(line: 44, column: 25, scope: !169)
!176 = !DILocalVariable(name: "__mptr", scope: !177, file: !3, line: 44, type: !6)
!177 = distinct !DILexicalBlock(scope: !169, file: !3, line: 44, column: 32)
!178 = !DILocation(line: 44, column: 32, scope: !177)
!179 = !DILocation(line: 44, column: 32, scope: !180)
!180 = distinct !DILexicalBlock(scope: !177, file: !3, line: 44, column: 32)
!181 = !DILocalVariable(name: "val", scope: !169, file: !3, line: 45, type: !56)
!182 = !DILocation(line: 45, column: 16, scope: !169)
!183 = !DILocation(line: 47, column: 23, scope: !169)
!184 = !DILocation(line: 47, column: 8, scope: !169)
!185 = !DILocation(line: 47, column: 32, scope: !169)
!186 = !DILocation(line: 47, column: 38, scope: !169)
!187 = !DILocation(line: 47, column: 29, scope: !169)
!188 = !DILocation(line: 47, column: 6, scope: !169)
!189 = !DILocation(line: 48, column: 9, scope: !169)
!190 = !DILocation(line: 48, column: 6, scope: !169)
!191 = !DILocation(line: 50, column: 7, scope: !192)
!192 = distinct !DILexicalBlock(scope: !169, file: !3, line: 50, column: 6)
!193 = !DILocation(line: 50, column: 11, scope: !192)
!194 = !DILocation(line: 50, column: 14, scope: !192)
!195 = !DILocation(line: 50, column: 20, scope: !192)
!196 = !DILocation(line: 50, column: 26, scope: !192)
!197 = !DILocation(line: 50, column: 6, scope: !169)
!198 = !DILocation(line: 51, column: 7, scope: !192)
!199 = !DILocation(line: 51, column: 3, scope: !192)
!200 = !DILocation(line: 53, column: 9, scope: !169)
