; ModuleID = '../bcout/drivers/clk/clk-gate.llvm.bc'
source_filename = "drivers/clk/clk-gate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.clk_hw = type { %struct.clk_core*, %struct.clk*, %struct.clk_init_data* }
%struct.clk_core = type opaque
%struct.clk = type opaque
%struct.clk_init_data = type { i8*, %struct.clk_ops*, i8**, %struct.clk_parent_data*, %struct.clk_hw**, i8, i64 }
%struct.clk_ops = type { {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, {}*, void (%struct.clk_hw*)*, i64 (%struct.clk_hw*, i64)*, i64 (%struct.clk_hw*, i64, i64*)*, i32 (%struct.clk_hw*, %struct.clk_rate_request*)*, i32 (%struct.clk_hw*, i8)*, i8 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i64, i64)*, i32 (%struct.clk_hw*, i64, i64, i8)*, i64 (%struct.clk_hw*, i64)*, {}*, i32 (%struct.clk_hw*, i32)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, {}*, void (%struct.clk_hw*)*, void (%struct.clk_hw*, %struct.dentry*)* }
%struct.clk_parent_data = type { %struct.clk_hw*, i8*, i8*, i32 }
%struct.clk_rate_request = type { i64, i64, i64, i64, %struct.clk_hw* }
%struct.clk_duty = type { i32, i32 }
%struct.dentry = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "clk_gate_ops", scope: !2, file: !3, line: 119, type: !45, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !177, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/clk-gate.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !6, line: 26, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !13, line: 305, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!19 = !{!20, !21, !173, !175, !70}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_gate", file: !23, line: 471, size: 384, elements: !24)
!23 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!24 = !{!25, !153, !154, !155, !156}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !22, file: !23, line: 472, baseType: !26, size: 192)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !23, line: 312, size: 192, elements: !27)
!27 = !{!28, !31, !34}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !26, file: !23, line: 313, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !23, line: 38, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !26, file: !23, line: 314, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !23, line: 36, flags: DIFlagFwdDecl)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !26, file: !23, line: 315, baseType: !35, size: 64, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !23, line: 285, size: 448, elements: !38)
!38 = !{!39, !43, !135, !138, !149, !151, !152}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !23, line: 286, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !37, file: !23, line: 287, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !23, line: 220, size: 1600, elements: !47)
!47 = !{!48, !54, !58, !59, !60, !61, !62, !63, !64, !65, !66, !71, !77, !89, !98, !102, !106, !110, !111, !112, !116, !125, !126, !127, !128}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !46, file: !23, line: 221, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !53}
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !46, file: !23, line: 222, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !53}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !46, file: !23, line: 223, baseType: !49, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !46, file: !23, line: 224, baseType: !55, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !46, file: !23, line: 225, baseType: !49, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !46, file: !23, line: 226, baseType: !55, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !46, file: !23, line: 227, baseType: !49, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !46, file: !23, line: 228, baseType: !55, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !46, file: !23, line: 229, baseType: !49, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !46, file: !23, line: 230, baseType: !55, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !46, file: !23, line: 231, baseType: !67, size: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !53, !70}
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !46, file: !23, line: 233, baseType: !72, size: 64, offset: 704)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !53, !70, !76}
!75 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !46, file: !23, line: 235, baseType: !78, size: 64, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!52, !53, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !23, line: 55, size: 320, elements: !83)
!83 = !{!84, !85, !86, !87, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !82, file: !23, line: 56, baseType: !70, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !82, file: !23, line: 57, baseType: !70, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !82, file: !23, line: 58, baseType: !70, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !82, file: !23, line: 59, baseType: !70, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !82, file: !23, line: 60, baseType: !53, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !46, file: !23, line: 237, baseType: !90, size: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!52, !53, !93}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !94, line: 17, baseType: !95)
!94 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !96, line: 21, baseType: !97)
!96 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!97 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !46, file: !23, line: 238, baseType: !99, size: 64, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!93, !53}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !46, file: !23, line: 239, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!52, !53, !70, !70}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !46, file: !23, line: 241, baseType: !107, size: 64, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!52, !53, !70, !70, !93}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !46, file: !23, line: 244, baseType: !67, size: 64, offset: 1088)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !46, file: !23, line: 246, baseType: !49, size: 64, offset: 1152)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !46, file: !23, line: 247, baseType: !113, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!52, !53, !52}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !46, file: !23, line: 248, baseType: !117, size: 64, offset: 1280)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!52, !53, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !23, line: 69, size: 64, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !121, file: !23, line: 70, baseType: !7, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !121, file: !23, line: 71, baseType: !7, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !46, file: !23, line: 250, baseType: !117, size: 64, offset: 1344)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !46, file: !23, line: 252, baseType: !49, size: 64, offset: 1408)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !46, file: !23, line: 253, baseType: !55, size: 64, offset: 1472)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !46, file: !23, line: 254, baseType: !129, size: 64, offset: 1536)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !53, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !134, line: 21, flags: DIFlagFwdDecl)
!134 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !37, file: !23, line: 289, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !37, file: !23, line: 290, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !23, line: 264, size: 256, elements: !142)
!142 = !{!143, !146, !147, !148}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !141, file: !23, line: 265, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !141, file: !23, line: 266, baseType: !40, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !23, line: 267, baseType: !40, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !141, file: !23, line: 268, baseType: !52, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !37, file: !23, line: 291, baseType: !150, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !37, file: !23, line: 292, baseType: !93, size: 8, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !23, line: 293, baseType: !70, size: 64, offset: 384)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !22, file: !23, line: 473, baseType: !20, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bit_idx", scope: !22, file: !23, line: 474, baseType: !93, size: 8, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !22, file: !23, line: 475, baseType: !93, size: 8, offset: 264)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !22, file: !23, line: 476, baseType: !157, size: 64, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !159, line: 83, baseType: !160)
!159 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !159, line: 71, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !159, line: 72, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !159, line: 72, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !163, file: !159, line: 73, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !159, line: 20, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !166, file: !159, line: 21, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !170, line: 25, baseType: !171)
!170 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 25, elements: !172)
!172 = !{}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !174, line: 148, baseType: !7)
!174 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!177 = !{!0}
!178 = !{!"rsp"}
!179 = !{i32 7, !"Dwarf Version", i32 4}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{i32 1, !"wchar_size", i32 2}
!182 = !{i32 1, !"Code Model", i32 2}
!183 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!184 = distinct !DISubprogram(name: "clk_gate_is_enabled", scope: !3, file: !3, line: 102, type: !50, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !172)
!185 = !DILocalVariable(name: "hw", arg: 1, scope: !184, file: !3, line: 102, type: !53)
!186 = !DILocation(line: 102, column: 40, scope: !184)
!187 = !DILocalVariable(name: "reg", scope: !184, file: !3, line: 104, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !94, line: 21, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !96, line: 27, baseType: !7)
!190 = !DILocation(line: 104, column: 6, scope: !184)
!191 = !DILocalVariable(name: "gate", scope: !184, file: !3, line: 105, type: !21)
!192 = !DILocation(line: 105, column: 19, scope: !184)
!193 = !DILocalVariable(name: "__mptr", scope: !194, file: !3, line: 105, type: !20)
!194 = distinct !DILexicalBlock(scope: !184, file: !3, line: 105, column: 26)
!195 = !DILocation(line: 105, column: 26, scope: !194)
!196 = !DILocation(line: 105, column: 26, scope: !197)
!197 = distinct !DILexicalBlock(scope: !194, file: !3, line: 105, column: 26)
!198 = !DILocation(line: 107, column: 23, scope: !184)
!199 = !DILocation(line: 107, column: 8, scope: !184)
!200 = !DILocation(line: 107, column: 6, scope: !184)
!201 = !DILocation(line: 110, column: 6, scope: !202)
!202 = distinct !DILexicalBlock(scope: !184, file: !3, line: 110, column: 6)
!203 = !DILocation(line: 110, column: 12, scope: !202)
!204 = !DILocation(line: 110, column: 18, scope: !202)
!205 = !DILocation(line: 110, column: 6, scope: !184)
!206 = !DILocation(line: 111, column: 10, scope: !202)
!207 = !DILocation(line: 111, column: 7, scope: !202)
!208 = !DILocation(line: 111, column: 3, scope: !202)
!209 = !DILocation(line: 113, column: 9, scope: !184)
!210 = !DILocation(line: 113, column: 6, scope: !184)
!211 = !DILocation(line: 115, column: 9, scope: !184)
!212 = !DILocation(line: 115, column: 2, scope: !184)
!213 = distinct !DISubprogram(name: "clk_gate_readl", scope: !3, file: !3, line: 26, type: !214, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !172)
!214 = !DISubroutineType(types: !215)
!215 = !{!188, !21}
!216 = !DILocalVariable(name: "gate", arg: 1, scope: !213, file: !3, line: 26, type: !21)
!217 = !DILocation(line: 26, column: 51, scope: !213)
!218 = !DILocation(line: 28, column: 6, scope: !219)
!219 = distinct !DILexicalBlock(scope: !213, file: !3, line: 28, column: 6)
!220 = !DILocation(line: 28, column: 12, scope: !219)
!221 = !DILocation(line: 28, column: 18, scope: !219)
!222 = !DILocation(line: 28, column: 6, scope: !213)
!223 = !DILocation(line: 29, column: 21, scope: !219)
!224 = !DILocation(line: 29, column: 27, scope: !219)
!225 = !DILocation(line: 29, column: 10, scope: !219)
!226 = !DILocation(line: 29, column: 3, scope: !219)
!227 = !DILocation(line: 31, column: 15, scope: !213)
!228 = !DILocation(line: 31, column: 21, scope: !213)
!229 = !DILocation(line: 31, column: 9, scope: !213)
!230 = !DILocation(line: 31, column: 2, scope: !213)
!231 = !DILocation(line: 32, column: 1, scope: !213)
!232 = distinct !DISubprogram(name: "clk_gate_enable", scope: !3, file: !3, line: 90, type: !50, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !172)
!233 = !DILocalVariable(name: "hw", arg: 1, scope: !232, file: !3, line: 90, type: !53)
!234 = !DILocation(line: 90, column: 43, scope: !232)
!235 = !DILocation(line: 92, column: 21, scope: !232)
!236 = !DILocation(line: 92, column: 2, scope: !232)
!237 = !DILocation(line: 94, column: 2, scope: !232)
!238 = distinct !DISubprogram(name: "clk_gate_disable", scope: !3, file: !3, line: 97, type: !56, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !172)
!239 = !DILocalVariable(name: "hw", arg: 1, scope: !238, file: !3, line: 97, type: !53)
!240 = !DILocation(line: 97, column: 45, scope: !238)
!241 = !DILocation(line: 99, column: 21, scope: !238)
!242 = !DILocation(line: 99, column: 2, scope: !238)
!243 = !DILocation(line: 100, column: 1, scope: !238)
!244 = distinct !DISubprogram(name: "__clk_hw_register_gate", scope: !3, file: !3, line: 126, type: !245, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !172)
!245 = !DISubroutineType(types: !246)
!246 = !{!53, !247, !250, !40, !40, !144, !139, !70, !20, !93, !93, !157}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !249, line: 15, flags: DIFlagFwdDecl)
!249 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !252, line: 51, size: 1344, elements: !253)
!252 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!253 = !{!254, !255, !257, !258, !360, !970, !971, !972, !973, !974, !975, !976}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !251, file: !252, line: 52, baseType: !40, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !251, file: !252, line: 53, baseType: !256, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !252, line: 28, baseType: !188)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !251, file: !252, line: 54, baseType: !40, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !251, file: !252, line: 55, baseType: !259, size: 192, offset: 192)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !249, line: 17, size: 192, elements: !260)
!260 = !{!261, !263, !359}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !259, file: !249, line: 18, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !259, file: !249, line: 19, baseType: !264, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !249, line: 110, size: 1152, elements: !267)
!267 = !{!268, !272, !276, !284, !292, !296, !304, !309, !313, !314, !318, !322, !326, !342, !343, !344, !345, !355}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !266, file: !249, line: 111, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DISubroutineType(types: !271)
!271 = !{!262, !262}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !266, file: !249, line: 112, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !262}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !266, file: !249, line: 113, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !282}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !174, line: 30, baseType: !281)
!281 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !266, file: !249, line: 114, baseType: !285, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !282, !290}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "property_present", scope: !266, file: !249, line: 116, baseType: !293, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!280, !282, !40}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_int_array", scope: !266, file: !249, line: 118, baseType: !297, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!52, !282, !40, !7, !20, !300}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !174, line: 55, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !302, line: 72, baseType: !303)
!302 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !302, line: 16, baseType: !70)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_string_array", scope: !266, file: !249, line: 123, baseType: !305, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!52, !282, !40, !308, !300}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "get_name", scope: !266, file: !249, line: 126, baseType: !310, size: 64, offset: 448)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!40, !282}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "get_name_prefix", scope: !266, file: !249, line: 127, baseType: !310, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !266, file: !249, line: 128, baseType: !315, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!262, !282}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_child_node", scope: !266, file: !249, line: 130, baseType: !319, size: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!262, !282, !262}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "get_named_child_node", scope: !266, file: !249, line: 133, baseType: !323, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!262, !282, !40}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "get_reference_args", scope: !266, file: !249, line: 135, baseType: !327, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DISubroutineType(types: !329)
!329 = !{!52, !282, !40, !40, !7, !7, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_reference_args", file: !249, line: 43, size: 640, elements: !332)
!332 = !{!333, !334, !335}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !331, file: !249, line: 44, baseType: !262, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !331, file: !249, line: 45, baseType: !7, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !331, file: !249, line: 46, baseType: !336, size: 512, offset: 128)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 512, elements: !340)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !94, line: 23, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !96, line: 31, baseType: !339)
!339 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!340 = !{!341}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_next_endpoint", scope: !266, file: !249, line: 140, baseType: !319, size: 64, offset: 832)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_remote_endpoint", scope: !266, file: !249, line: 143, baseType: !315, size: 64, offset: 896)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_port_parent", scope: !266, file: !249, line: 145, baseType: !269, size: 64, offset: 960)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "graph_parse_endpoint", scope: !266, file: !249, line: 146, baseType: !346, size: 64, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!52, !282, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_endpoint", file: !249, line: 29, size: 128, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !350, file: !249, line: 30, baseType: !7, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !350, file: !249, line: 31, baseType: !7, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "local_fwnode", scope: !350, file: !249, line: 32, baseType: !282, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "add_links", scope: !266, file: !249, line: 148, baseType: !356, size: 64, offset: 1088)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!52, !282, !247}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !259, file: !249, line: 20, baseType: !247, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !251, file: !252, line: 57, baseType: !361, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "property", file: !252, line: 31, size: 704, elements: !363)
!363 = !{!364, !366, !367, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !362, file: !252, line: 32, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !362, file: !252, line: 33, baseType: !52, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !362, file: !252, line: 34, baseType: !20, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !252, line: 35, baseType: !361, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !362, file: !252, line: 43, baseType: !370, size: 448, offset: 256)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !371, line: 168, size: 448, elements: !372)
!371 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!372 = !{!373, !380, !381, !382, !965, !966}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !370, file: !371, line: 169, baseType: !374, size: 128)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !371, line: 30, size: 128, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !371, line: 31, baseType: !40, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !374, file: !371, line: 32, baseType: !378, size: 16, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !174, line: 19, baseType: !379)
!379 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !371, line: 170, baseType: !300, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !370, file: !371, line: 171, baseType: !20, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !370, file: !371, line: 172, baseType: !383, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!386, !389, !392, !487, !365, !697, !300}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !174, line: 60, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !302, line: 73, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !302, line: 15, baseType: !75)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !391, line: 526, flags: DIFlagFwdDecl)
!391 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !394, line: 64, size: 512, elements: !395)
!394 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!395 = !{!396, !397, !403, !404, !448, !545, !950, !960, !961, !962, !963, !964}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !393, file: !394, line: 65, baseType: !40, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !393, file: !394, line: 66, baseType: !398, size: 128, offset: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !174, line: 178, size: 128, elements: !399)
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !174, line: 179, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !174, line: 179, baseType: !401, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !393, file: !394, line: 67, baseType: !392, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !393, file: !394, line: 68, baseType: !405, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !394, line: 192, size: 704, elements: !407)
!407 = !{!408, !409, !410, !411}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !406, file: !394, line: 193, baseType: !398, size: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !406, file: !394, line: 194, baseType: !158, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !406, file: !394, line: 195, baseType: !393, size: 512, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !406, file: !394, line: 196, baseType: !412, size: 64, offset: 640)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !394, line: 156, size: 192, elements: !415)
!415 = !{!416, !421, !426}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !414, file: !394, line: 157, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{!52, !405, !392}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !414, file: !394, line: 158, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!40, !405, !392}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !414, file: !394, line: 159, baseType: !427, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!52, !405, !392, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !394, line: 148, size: 20736, elements: !433)
!433 = !{!434, !438, !442, !443, !447}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !432, file: !394, line: 149, baseType: !435, size: 192)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 192, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 3)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !432, file: !394, line: 150, baseType: !439, size: 4096, offset: 192)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 4096, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !432, file: !394, line: 151, baseType: !52, size: 32, offset: 4288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !432, file: !394, line: 152, baseType: !444, size: 16384, offset: 4320)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 16384, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 2048)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !432, file: !394, line: 153, baseType: !52, size: 32, offset: 20704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !393, file: !394, line: 69, baseType: !449, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !394, line: 138, size: 448, elements: !451)
!451 = !{!452, !456, !470, !472, !491, !522, !526}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !450, file: !394, line: 139, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !392}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !450, file: !394, line: 140, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !371, line: 230, size: 128, elements: !460)
!460 = !{!461, !466}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !459, file: !371, line: 231, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!386, !392, !465, !365}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !459, file: !371, line: 232, baseType: !467, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!386, !392, !465, !40, !300}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !450, file: !394, line: 141, baseType: !471, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !450, file: !394, line: 142, baseType: !473, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !371, line: 84, size: 320, elements: !477)
!477 = !{!478, !479, !483, !488, !489}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !371, line: 85, baseType: !40, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !476, file: !371, line: 86, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{!378, !392, !465, !52}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !476, file: !371, line: 88, baseType: !484, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!378, !392, !487, !52}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !476, file: !371, line: 90, baseType: !471, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bin_attrs", scope: !476, file: !371, line: 91, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !450, file: !394, line: 143, baseType: !492, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !392}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !6, line: 39, size: 384, elements: !498)
!498 = !{!499, !500, !504, !508, !514, !518}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !497, file: !6, line: 40, baseType: !5, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !497, file: !6, line: 41, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DISubroutineType(types: !503)
!503 = !{!280}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !497, file: !6, line: 42, baseType: !505, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!20}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !497, file: !6, line: 43, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{!288, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !6, line: 19, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !497, file: !6, line: 44, baseType: !515, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{!288}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !497, file: !6, line: 45, baseType: !519, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !20}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !450, file: !394, line: 144, baseType: !523, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{!288, !392}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !450, file: !394, line: 145, baseType: !527, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !392, !530, !538}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !532, line: 23, baseType: !533)
!532 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 21, size: 32, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !533, file: !532, line: 22, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !174, line: 32, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !302, line: 49, baseType: !7)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !532, line: 28, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 26, size: 32, elements: !541)
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !540, file: !532, line: 27, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !174, line: 33, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !302, line: 50, baseType: !7)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !393, file: !394, line: 70, baseType: !546, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !134, line: 123, size: 1024, elements: !548)
!548 = !{!549, !554, !555, !556, !557, !565, !566, !567, !943, !944, !945, !946, !947}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !547, file: !134, line: 124, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !174, line: 168, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 166, size: 32, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !551, file: !174, line: 167, baseType: !52, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !547, file: !134, line: 125, baseType: !550, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !547, file: !134, line: 135, baseType: !546, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !547, file: !134, line: 136, baseType: !40, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !547, file: !134, line: 138, baseType: !558, size: 192, align: 64, offset: 192)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !559, line: 24, size: 192, align: 64, elements: !560)
!559 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!560 = !{!561, !562, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !558, file: !559, line: 25, baseType: !70, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !558, file: !559, line: 26, baseType: !563, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !558, file: !559, line: 27, baseType: !563, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !547, file: !134, line: 140, baseType: !288, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !547, file: !134, line: 141, baseType: !7, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !547, file: !134, line: 142, baseType: !568, size: 256, offset: 512)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !547, file: !134, line: 142, size: 256, elements: !569)
!569 = !{!570, !633, !637}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !568, file: !134, line: 143, baseType: !571, size: 192)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !134, line: 91, size: 192, elements: !572)
!572 = !{!573, !574, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !571, file: !134, line: 92, baseType: !70, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !571, file: !134, line: 94, baseType: !575, size: 64, offset: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !559, line: 31, size: 64, elements: !576)
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !575, file: !559, line: 32, baseType: !563, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !571, file: !134, line: 100, baseType: !579, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !134, line: 180, size: 704, elements: !581)
!581 = !{!582, !583, !584, !597, !598, !599, !625, !626}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !580, file: !134, line: 182, baseType: !546, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !134, line: 183, baseType: !7, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !580, file: !134, line: 186, baseType: !585, size: 192, offset: 128)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !586, line: 19, size: 192, elements: !587)
!586 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!587 = !{!588, !595, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !585, file: !586, line: 20, baseType: !589, size: 128)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !590, line: 292, size: 128, elements: !591)
!590 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !589, file: !590, line: 293, baseType: !158)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !589, file: !590, line: 295, baseType: !173, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !589, file: !590, line: 296, baseType: !20, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !585, file: !586, line: 21, baseType: !7, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !585, file: !586, line: 22, baseType: !7, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !580, file: !134, line: 187, baseType: !188, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !580, file: !134, line: 188, baseType: !188, size: 32, offset: 352)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !580, file: !134, line: 189, baseType: !600, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !134, line: 168, size: 320, elements: !602)
!602 = !{!603, !609, !613, !617, !621}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !601, file: !134, line: 169, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!52, !607, !579}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !391, line: 539, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !601, file: !134, line: 171, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!52, !546, !40, !378}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !601, file: !134, line: 173, baseType: !614, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!52, !546}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !601, file: !134, line: 174, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!52, !546, !546, !40}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !601, file: !134, line: 176, baseType: !622, size: 64, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!52, !607, !546, !579}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !580, file: !134, line: 192, baseType: !398, size: 128, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !580, file: !134, line: 194, baseType: !627, size: 128, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !628, line: 40, baseType: !629)
!628 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !628, line: 36, size: 128, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !629, file: !628, line: 37, baseType: !158)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !629, file: !628, line: 38, baseType: !398, size: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !568, file: !134, line: 144, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_symlink", file: !134, line: 103, size: 64, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "target_kn", scope: !634, file: !134, line: 104, baseType: !546, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !568, file: !134, line: 145, baseType: !638, size: 256)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_attr", file: !134, line: 107, size: 256, elements: !639)
!639 = !{!640, !938, !941, !942}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !638, file: !134, line: 108, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_ops", file: !134, line: 217, size: 768, elements: !644)
!644 = !{!645, !684, !688, !692, !699, !703, !707, !711, !712, !713, !714, !722}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !643, file: !134, line: 222, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!52, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_file", file: !134, line: 197, size: 1088, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !672, !673, !674, !675, !676, !677, !678, !679}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !650, file: !134, line: 199, baseType: !546, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !650, file: !134, line: 200, baseType: !389, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "seq_file", scope: !650, file: !134, line: 201, baseType: !607, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !650, file: !134, line: 202, baseType: !20, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !650, file: !134, line: 205, baseType: !657, size: 192, offset: 256)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !658, line: 53, size: 192, elements: !659)
!658 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!659 = !{!660, !670, !671}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !657, file: !658, line: 54, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !662, line: 13, baseType: !663)
!662 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !174, line: 175, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 173, size: 64, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !664, file: !174, line: 174, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !94, line: 22, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !96, line: 30, baseType: !669)
!669 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !657, file: !658, line: 55, baseType: !158, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !657, file: !658, line: 59, baseType: !398, size: 128, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_mutex", scope: !650, file: !134, line: 206, baseType: !657, size: 192, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !650, file: !134, line: 207, baseType: !52, size: 32, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !650, file: !134, line: 208, baseType: !398, size: 128, offset: 704)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_buf", scope: !650, file: !134, line: 209, baseType: !365, size: 64, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !650, file: !134, line: 211, baseType: !300, size: 64, offset: 896)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mmapped", scope: !650, file: !134, line: 212, baseType: !280, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "released", scope: !650, file: !134, line: 213, baseType: !280, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !650, file: !134, line: 214, baseType: !680, size: 64, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !683, line: 356, flags: DIFlagFwdDecl)
!683 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!684 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !643, file: !134, line: 223, baseType: !685, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !649}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "seq_show", scope: !643, file: !134, line: 236, baseType: !689, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!52, !607, !20}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "seq_start", scope: !643, file: !134, line: 238, baseType: !693, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!20, !607, !696}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !174, line: 46, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !302, line: 88, baseType: !669)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "seq_next", scope: !643, file: !134, line: 239, baseType: !700, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!20, !607, !20, !696}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "seq_stop", scope: !643, file: !134, line: 240, baseType: !704, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !607, !20}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !643, file: !134, line: 242, baseType: !708, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!386, !649, !365, !300, !697}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !643, file: !134, line: 252, baseType: !300, size: 64, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !643, file: !134, line: 259, baseType: !280, size: 8, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !643, file: !134, line: 260, baseType: !708, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !643, file: !134, line: 263, baseType: !715, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!718, !649, !720}
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !719, line: 52, baseType: !7)
!719 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !134, line: 27, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !643, file: !134, line: 266, baseType: !723, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!52, !649, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !683, line: 305, size: 1472, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !915, !921, !922, !927, !928, !931, !932, !933, !934, !935, !936}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !727, file: !683, line: 308, baseType: !70, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !727, file: !683, line: 309, baseType: !70, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !727, file: !683, line: 313, baseType: !726, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !727, file: !683, line: 313, baseType: !726, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !727, file: !683, line: 315, baseType: !558, size: 192, align: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !727, file: !683, line: 323, baseType: !70, size: 64, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !727, file: !683, line: 327, baseType: !736, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !683, line: 388, size: 7296, elements: !738)
!738 = !{!739, !911}
!739 = !DIDerivedType(tag: DW_TAG_member, scope: !737, file: !683, line: 389, baseType: !740, size: 7296)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !737, file: !683, line: 389, size: 7296, elements: !741)
!741 = !{!742, !743, !744, !745, !749, !750, !751, !752, !753, !761, !762, !763, !764, !765, !766, !767, !768, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !803, !811, !814, !856, !857, !882, !883, !886, !889, !890, !893, !894, !895, !898, !910}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !740, file: !683, line: 390, baseType: !726, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !740, file: !683, line: 391, baseType: !575, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !740, file: !683, line: 392, baseType: !337, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !740, file: !683, line: 394, baseType: !746, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!70, !389, !70, !70, !70, !70}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !740, file: !683, line: 398, baseType: !70, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !740, file: !683, line: 399, baseType: !70, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !740, file: !683, line: 405, baseType: !70, size: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !740, file: !683, line: 406, baseType: !70, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !740, file: !683, line: 407, baseType: !754, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !391, line: 286, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 286, size: 64, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !756, file: !391, line: 286, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !760, line: 18, baseType: !70)
!760 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!761 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !740, file: !683, line: 416, baseType: !550, size: 32, offset: 576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !740, file: !683, line: 428, baseType: !550, size: 32, offset: 608)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !740, file: !683, line: 437, baseType: !550, size: 32, offset: 640)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !740, file: !683, line: 447, baseType: !550, size: 32, offset: 672)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !740, file: !683, line: 450, baseType: !661, size: 64, offset: 704)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !740, file: !683, line: 452, baseType: !52, size: 32, offset: 768)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !740, file: !683, line: 454, baseType: !158, offset: 800)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !740, file: !683, line: 457, baseType: !769, size: 256, offset: 832)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !770, line: 35, size: 256, elements: !771)
!770 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!771 = !{!772, !773, !774, !776}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !769, file: !770, line: 36, baseType: !661, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !769, file: !770, line: 42, baseType: !661, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !769, file: !770, line: 46, baseType: !775, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !159, line: 29, baseType: !166)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !769, file: !770, line: 47, baseType: !398, size: 128, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !740, file: !683, line: 459, baseType: !398, size: 128, offset: 1088)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !740, file: !683, line: 466, baseType: !70, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !740, file: !683, line: 467, baseType: !70, size: 64, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !740, file: !683, line: 469, baseType: !70, size: 64, offset: 1344)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !740, file: !683, line: 470, baseType: !70, size: 64, offset: 1408)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !740, file: !683, line: 471, baseType: !663, size: 64, offset: 1472)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !740, file: !683, line: 472, baseType: !70, size: 64, offset: 1536)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !740, file: !683, line: 473, baseType: !70, size: 64, offset: 1600)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !740, file: !683, line: 474, baseType: !70, size: 64, offset: 1664)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !740, file: !683, line: 475, baseType: !70, size: 64, offset: 1728)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !740, file: !683, line: 477, baseType: !158, offset: 1792)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !740, file: !683, line: 478, baseType: !70, size: 64, offset: 1792)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !740, file: !683, line: 478, baseType: !70, size: 64, offset: 1856)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !740, file: !683, line: 478, baseType: !70, size: 64, offset: 1920)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !740, file: !683, line: 478, baseType: !70, size: 64, offset: 1984)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !740, file: !683, line: 479, baseType: !70, size: 64, offset: 2048)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !740, file: !683, line: 479, baseType: !70, size: 64, offset: 2112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !740, file: !683, line: 479, baseType: !70, size: 64, offset: 2176)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !740, file: !683, line: 480, baseType: !70, size: 64, offset: 2240)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !740, file: !683, line: 480, baseType: !70, size: 64, offset: 2304)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !740, file: !683, line: 480, baseType: !70, size: 64, offset: 2368)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !740, file: !683, line: 480, baseType: !70, size: 64, offset: 2432)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !740, file: !683, line: 482, baseType: !800, size: 2816, offset: 2496)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 2816, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 44)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !740, file: !683, line: 488, baseType: !804, size: 256, offset: 5312)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !805, line: 60, size: 256, elements: !806)
!805 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !804, file: !805, line: 61, baseType: !808, size: 256)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 256, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 4)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !740, file: !683, line: 490, baseType: !812, size: 64, offset: 5568)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !683, line: 490, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !740, file: !683, line: 493, baseType: !815, size: 896, offset: 5632)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !816, line: 53, baseType: !817)
!816 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !816, line: 13, size: 896, elements: !818)
!818 = !{!819, !820, !821, !822, !825, !826, !827, !828, !848, !849, !852}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !817, file: !816, line: 18, baseType: !337, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !817, file: !816, line: 28, baseType: !663, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !817, file: !816, line: 31, baseType: !769, size: 256, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !817, file: !816, line: 32, baseType: !823, size: 64, offset: 384)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !816, line: 32, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !817, file: !816, line: 37, baseType: !379, size: 16, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !817, file: !816, line: 40, baseType: !657, size: 192, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !817, file: !816, line: 41, baseType: !20, size: 64, offset: 704)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !817, file: !816, line: 42, baseType: !829, size: 64, offset: 768)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !832, line: 13, size: 896, elements: !833)
!832 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !831, file: !832, line: 14, baseType: !20, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !831, file: !832, line: 15, baseType: !70, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !831, file: !832, line: 17, baseType: !70, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !831, file: !832, line: 17, baseType: !70, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !831, file: !832, line: 19, baseType: !75, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !831, file: !832, line: 21, baseType: !75, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !831, file: !832, line: 22, baseType: !75, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !831, file: !832, line: 23, baseType: !75, size: 64, offset: 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !831, file: !832, line: 24, baseType: !75, size: 64, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !831, file: !832, line: 25, baseType: !75, size: 64, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !831, file: !832, line: 26, baseType: !75, size: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !831, file: !832, line: 27, baseType: !75, size: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !831, file: !832, line: 28, baseType: !75, size: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !831, file: !832, line: 29, baseType: !75, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !817, file: !816, line: 44, baseType: !550, size: 32, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !817, file: !816, line: 50, baseType: !850, size: 16, offset: 864)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !94, line: 19, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !96, line: 24, baseType: !379)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !817, file: !816, line: 51, baseType: !853, size: 16, offset: 880)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !94, line: 18, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !96, line: 23, baseType: !855)
!855 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !740, file: !683, line: 495, baseType: !70, size: 64, offset: 6528)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !740, file: !683, line: 497, baseType: !858, size: 64, offset: 6592)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !683, line: 381, size: 384, elements: !860)
!860 = !{!861, !862, !871}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !859, file: !683, line: 382, baseType: !550, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !859, file: !683, line: 383, baseType: !863, size: 128, offset: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !683, line: 376, size: 128, elements: !864)
!864 = !{!865, !869}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !863, file: !683, line: 377, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !868, line: 9, flags: DIFlagFwdDecl)
!868 = !DIFile(filename: "./arch/x86/include/asm/current.h", directory: "/home/lizy2001/genbc/linux")
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !683, line: 378, baseType: !870, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !859, file: !683, line: 384, baseType: !872, size: 192, offset: 192)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !873, line: 26, size: 192, elements: !874)
!873 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !872, file: !873, line: 27, baseType: !7, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !872, file: !873, line: 28, baseType: !877, size: 128, offset: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !878, line: 43, size: 128, elements: !879)
!878 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !877, file: !878, line: 44, baseType: !775)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !877, file: !878, line: 45, baseType: !398, size: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_lock", scope: !740, file: !683, line: 500, baseType: !158, offset: 6656)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_table", scope: !740, file: !683, line: 501, baseType: !884, size: 64, offset: 6656)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "kioctx_table", file: !683, line: 387, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !740, file: !683, line: 516, baseType: !887, size: 64, offset: 6720)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !683, line: 516, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "exe_file", scope: !740, file: !683, line: 519, baseType: !389, size: 64, offset: 6784)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_subscriptions", scope: !740, file: !683, line: 521, baseType: !891, size: 64, offset: 6848)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmu_notifier_subscriptions", file: !683, line: 521, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_pending", scope: !740, file: !683, line: 545, baseType: !550, size: 32, offset: 6912)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_batched", scope: !740, file: !683, line: 548, baseType: !280, size: 8, offset: 6944)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "uprobes_state", scope: !740, file: !683, line: 550, baseType: !896, offset: 6952)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uprobes_state", file: !897, line: 142, elements: !172)
!897 = !DIFile(filename: "./include/linux/uprobes.h", directory: "/home/lizy2001/genbc/linux")
!898 = !DIDerivedType(tag: DW_TAG_member, name: "async_put_work", scope: !740, file: !683, line: 554, baseType: !899, size: 256, offset: 6976)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !900, line: 102, size: 256, elements: !901)
!900 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!901 = !{!902, !903, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !899, file: !900, line: 103, baseType: !661, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !899, file: !900, line: 104, baseType: !398, size: 128, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !899, file: !900, line: 105, baseType: !905, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !900, line: 21, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pasid", scope: !740, file: !683, line: 557, baseType: !188, size: 32, offset: 7232)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_bitmap", scope: !737, file: !683, line: 565, baseType: !912, offset: 7296)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: -1)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !727, file: !683, line: 333, baseType: !916, size: 64, offset: 576)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !391, line: 284, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !391, line: 284, size: 64, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !917, file: !391, line: 284, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !760, line: 19, baseType: !70)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !727, file: !683, line: 334, baseType: !70, size: 64, offset: 640)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !727, file: !683, line: 343, baseType: !923, size: 256, offset: 704)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !683, line: 340, size: 256, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !923, file: !683, line: 341, baseType: !558, size: 192, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !923, file: !683, line: 342, baseType: !70, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !727, file: !683, line: 351, baseType: !398, size: 128, offset: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !727, file: !683, line: 353, baseType: !929, size: 64, offset: 1088)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !683, line: 353, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !727, file: !683, line: 356, baseType: !680, size: 64, offset: 1152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !727, file: !683, line: 359, baseType: !70, size: 64, offset: 1216)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !727, file: !683, line: 361, baseType: !389, size: 64, offset: 1280)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !727, file: !683, line: 362, baseType: !20, size: 64, offset: 1344)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !727, file: !683, line: 365, baseType: !661, size: 64, offset: 1408)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !727, file: !683, line: 373, baseType: !937, offset: 1472)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !683, line: 296, elements: !172)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !638, file: !134, line: 109, baseType: !939, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_node", file: !134, line: 31, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !134, line: 110, baseType: !697, size: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "notify_next", scope: !638, file: !134, line: 111, baseType: !546, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !547, file: !134, line: 148, baseType: !20, size: 64, offset: 768)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !547, file: !134, line: 154, baseType: !337, size: 64, offset: 832)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !547, file: !134, line: 156, baseType: !379, size: 16, offset: 896)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !547, file: !134, line: 157, baseType: !378, size: 16, offset: 912)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "iattr", scope: !547, file: !134, line: 158, baseType: !948, size: 64, offset: 960)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_iattrs", file: !134, line: 32, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !393, file: !394, line: 71, baseType: !951, size: 32, offset: 448)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !952, line: 19, size: 32, elements: !953)
!952 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !951, file: !952, line: 20, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !956, line: 113, baseType: !957)
!956 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !956, line: 111, size: 32, elements: !958)
!958 = !{!959}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !957, file: !956, line: 112, baseType: !550, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !393, file: !394, line: 75, baseType: !7, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !393, file: !394, line: 76, baseType: !7, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !393, file: !394, line: 77, baseType: !7, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !393, file: !394, line: 78, baseType: !7, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !393, file: !394, line: 79, baseType: !7, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !370, file: !371, line: 174, baseType: !383, size: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !370, file: !371, line: 176, baseType: !967, size: 64, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!52, !389, !392, !487, !726}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "deadprops", scope: !251, file: !252, line: 58, baseType: !361, size: 64, offset: 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !251, file: !252, line: 59, baseType: !250, size: 64, offset: 512)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !251, file: !252, line: 60, baseType: !250, size: 64, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !251, file: !252, line: 61, baseType: !250, size: 64, offset: 640)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !251, file: !252, line: 63, baseType: !393, size: 512, offset: 704)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !251, file: !252, line: 65, baseType: !70, size: 64, offset: 1216)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !251, file: !252, line: 66, baseType: !20, size: 64, offset: 1280)
!977 = !DILocalVariable(name: "dev", arg: 1, scope: !244, file: !3, line: 126, type: !247)
!978 = !DILocation(line: 126, column: 54, scope: !244)
!979 = !DILocalVariable(name: "np", arg: 2, scope: !244, file: !3, line: 127, type: !250)
!980 = !DILocation(line: 127, column: 23, scope: !244)
!981 = !DILocalVariable(name: "name", arg: 3, scope: !244, file: !3, line: 127, type: !40)
!982 = !DILocation(line: 127, column: 39, scope: !244)
!983 = !DILocalVariable(name: "parent_name", arg: 4, scope: !244, file: !3, line: 128, type: !40)
!984 = !DILocation(line: 128, column: 15, scope: !244)
!985 = !DILocalVariable(name: "parent_hw", arg: 5, scope: !244, file: !3, line: 128, type: !144)
!986 = !DILocation(line: 128, column: 49, scope: !244)
!987 = !DILocalVariable(name: "parent_data", arg: 6, scope: !244, file: !3, line: 129, type: !139)
!988 = !DILocation(line: 129, column: 33, scope: !244)
!989 = !DILocalVariable(name: "flags", arg: 7, scope: !244, file: !3, line: 130, type: !70)
!990 = !DILocation(line: 130, column: 17, scope: !244)
!991 = !DILocalVariable(name: "reg", arg: 8, scope: !244, file: !3, line: 131, type: !20)
!992 = !DILocation(line: 131, column: 17, scope: !244)
!993 = !DILocalVariable(name: "bit_idx", arg: 9, scope: !244, file: !3, line: 131, type: !93)
!994 = !DILocation(line: 131, column: 25, scope: !244)
!995 = !DILocalVariable(name: "clk_gate_flags", arg: 10, scope: !244, file: !3, line: 132, type: !93)
!996 = !DILocation(line: 132, column: 6, scope: !244)
!997 = !DILocalVariable(name: "lock", arg: 11, scope: !244, file: !3, line: 132, type: !157)
!998 = !DILocation(line: 132, column: 34, scope: !244)
!999 = !DILocalVariable(name: "gate", scope: !244, file: !3, line: 134, type: !21)
!1000 = !DILocation(line: 134, column: 19, scope: !244)
!1001 = !DILocalVariable(name: "hw", scope: !244, file: !3, line: 135, type: !53)
!1002 = !DILocation(line: 135, column: 17, scope: !244)
!1003 = !DILocalVariable(name: "init", scope: !244, file: !3, line: 136, type: !37)
!1004 = !DILocation(line: 136, column: 23, scope: !244)
!1005 = !DILocalVariable(name: "ret", scope: !244, file: !3, line: 137, type: !52)
!1006 = !DILocation(line: 137, column: 6, scope: !244)
!1007 = !DILocation(line: 139, column: 6, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !244, file: !3, line: 139, column: 6)
!1009 = !DILocation(line: 139, column: 21, scope: !1008)
!1010 = !DILocation(line: 139, column: 6, scope: !244)
!1011 = !DILocation(line: 140, column: 7, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 140, column: 7)
!1013 = distinct !DILexicalBlock(scope: !1008, file: !3, line: 139, column: 45)
!1014 = !DILocation(line: 140, column: 15, scope: !1012)
!1015 = !DILocation(line: 140, column: 7, scope: !1013)
!1016 = !DILocation(line: 141, column: 4, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 140, column: 21)
!1018 = !DILocation(line: 142, column: 11, scope: !1017)
!1019 = !DILocation(line: 142, column: 4, scope: !1017)
!1020 = !DILocation(line: 144, column: 2, scope: !1013)
!1021 = !DILocation(line: 147, column: 9, scope: !244)
!1022 = !DILocation(line: 147, column: 7, scope: !244)
!1023 = !DILocation(line: 148, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !244, file: !3, line: 148, column: 6)
!1025 = !DILocation(line: 148, column: 6, scope: !244)
!1026 = !DILocation(line: 149, column: 10, scope: !1024)
!1027 = !DILocation(line: 149, column: 3, scope: !1024)
!1028 = !DILocation(line: 151, column: 14, scope: !244)
!1029 = !DILocation(line: 151, column: 7, scope: !244)
!1030 = !DILocation(line: 151, column: 12, scope: !244)
!1031 = !DILocation(line: 152, column: 7, scope: !244)
!1032 = !DILocation(line: 152, column: 11, scope: !244)
!1033 = !DILocation(line: 153, column: 15, scope: !244)
!1034 = !DILocation(line: 153, column: 7, scope: !244)
