; ModuleID = '../bcout/drivers/clk/clk-mux.llvm.bc'
source_filename = "drivers/clk/clk-mux.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.clk_ops = type { i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, i64 (%struct.clk_hw*, i64)*, i64 (%struct.clk_hw*, i64, i64*)*, i32 (%struct.clk_hw*, %struct.clk_rate_request*)*, i32 (%struct.clk_hw*, i8)*, i8 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i64, i64)*, i32 (%struct.clk_hw*, i64, i64, i8)*, i64 (%struct.clk_hw*, i64)*, i32 (%struct.clk_hw*)*, i32 (%struct.clk_hw*, i32)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*, %struct.clk_duty*)*, i32 (%struct.clk_hw*)*, void (%struct.clk_hw*)*, void (%struct.clk_hw*, %struct.dentry*)* }
%struct.clk_hw = type { %struct.clk_core*, %struct.clk*, %struct.clk_init_data* }
%struct.clk_core = type opaque
%struct.clk = type opaque
%struct.clk_init_data = type { i8*, %struct.clk_ops*, i8**, %struct.clk_parent_data*, %struct.clk_hw**, i8, i64 }
%struct.clk_parent_data = type { %struct.clk_hw*, i8*, i8*, i32 }
%struct.clk_rate_request = type { i64, i64, i64, i64, %struct.clk_hw* }
%struct.clk_duty = type { i32, i32 }
%struct.dentry = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "clk_mux_ops", scope: !2, file: !3, line: 136, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !182, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/clk-mux.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !6, line: 26, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !13, line: 305, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!19 = !{!20, !22, !23, !72, !180}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !21, line: 148, baseType: !7)
!21 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_mux", file: !25, line: 815, size: 448, elements: !26)
!25 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!26 = !{!27, !155, !156, !160, !161, !162, !163}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !24, file: !25, line: 816, baseType: !28, size: 192)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !25, line: 312, size: 192, elements: !29)
!29 = !{!30, !33, !36}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !28, file: !25, line: 313, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !25, line: 38, flags: DIFlagFwdDecl)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !28, file: !25, line: 314, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !25, line: 36, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !28, file: !25, line: 315, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !25, line: 285, size: 448, elements: !40)
!40 = !{!41, !45, !137, !140, !151, !153, !154}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !39, file: !25, line: 286, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !39, file: !25, line: 287, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !25, line: 220, size: 1600, elements: !49)
!49 = !{!50, !56, !60, !61, !62, !63, !64, !65, !66, !67, !68, !73, !79, !91, !100, !104, !108, !112, !113, !114, !118, !127, !128, !129, !130}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !48, file: !25, line: 221, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !55}
!54 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !48, file: !25, line: 222, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !55}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !48, file: !25, line: 223, baseType: !51, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !48, file: !25, line: 224, baseType: !57, size: 64, offset: 192)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !48, file: !25, line: 225, baseType: !51, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !48, file: !25, line: 226, baseType: !57, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !48, file: !25, line: 227, baseType: !51, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !48, file: !25, line: 228, baseType: !57, size: 64, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !48, file: !25, line: 229, baseType: !51, size: 64, offset: 512)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !48, file: !25, line: 230, baseType: !57, size: 64, offset: 576)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !48, file: !25, line: 231, baseType: !69, size: 64, offset: 640)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !55, !72}
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !48, file: !25, line: 233, baseType: !74, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !55, !72, !78}
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !48, file: !25, line: 235, baseType: !80, size: 64, offset: 768)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!54, !55, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !25, line: 55, size: 320, elements: !85)
!85 = !{!86, !87, !88, !89, !90}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !84, file: !25, line: 56, baseType: !72, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !84, file: !25, line: 57, baseType: !72, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !84, file: !25, line: 58, baseType: !72, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !84, file: !25, line: 59, baseType: !72, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !84, file: !25, line: 60, baseType: !55, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !48, file: !25, line: 237, baseType: !92, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!54, !55, !95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !96, line: 17, baseType: !97)
!96 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !98, line: 21, baseType: !99)
!98 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !48, file: !25, line: 238, baseType: !101, size: 64, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!95, !55}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !48, file: !25, line: 239, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!54, !55, !72, !72}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !48, file: !25, line: 241, baseType: !109, size: 64, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!54, !55, !72, !72, !95}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !48, file: !25, line: 244, baseType: !69, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !48, file: !25, line: 246, baseType: !51, size: 64, offset: 1152)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !48, file: !25, line: 247, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!54, !55, !54}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !48, file: !25, line: 248, baseType: !119, size: 64, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!54, !55, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !25, line: 69, size: 64, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !123, file: !25, line: 70, baseType: !7, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !123, file: !25, line: 71, baseType: !7, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !48, file: !25, line: 250, baseType: !119, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !48, file: !25, line: 252, baseType: !51, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !48, file: !25, line: 253, baseType: !57, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !48, file: !25, line: 254, baseType: !131, size: 64, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !55, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !136, line: 21, flags: DIFlagFwdDecl)
!136 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !39, file: !25, line: 289, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !39, file: !25, line: 290, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !25, line: 264, size: 256, elements: !144)
!144 = !{!145, !148, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !143, file: !25, line: 265, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !143, file: !25, line: 266, baseType: !42, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !25, line: 267, baseType: !42, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !143, file: !25, line: 268, baseType: !54, size: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !39, file: !25, line: 291, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !39, file: !25, line: 292, baseType: !95, size: 8, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !39, file: !25, line: 293, baseType: !72, size: 64, offset: 384)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !24, file: !25, line: 817, baseType: !22, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !24, file: !25, line: 818, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !96, line: 21, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !98, line: 27, baseType: !7)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !24, file: !25, line: 819, baseType: !158, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !24, file: !25, line: 820, baseType: !95, size: 8, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !24, file: !25, line: 821, baseType: !95, size: 8, offset: 360)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !24, file: !25, line: 822, baseType: !164, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !166, line: 83, baseType: !167)
!166 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !166, line: 71, elements: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, scope: !167, file: !166, line: 72, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !167, file: !166, line: 72, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !170, file: !166, line: 73, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !166, line: 20, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !173, file: !166, line: 21, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !177, line: 25, baseType: !178)
!177 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 25, elements: !179)
!179 = !{}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!182 = !{!0, !183}
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "clk_mux_ro_ops", scope: !2, file: !3, line: 143, type: !47, isLocal: false, isDefinition: true)
!185 = !{!"rsp"}
!186 = !{i32 7, !"Dwarf Version", i32 4}
!187 = !{i32 2, !"Debug Info Version", i32 3}
!188 = !{i32 1, !"wchar_size", i32 2}
!189 = !{i32 1, !"Code Model", i32 2}
!190 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!191 = distinct !DISubprogram(name: "clk_mux_val_to_index", scope: !3, file: !3, line: 42, type: !192, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !179)
!192 = !DISubroutineType(types: !193)
!193 = !{!54, !55, !157, !7, !7}
!194 = !DILocalVariable(name: "x", arg: 1, scope: !195, file: !196, line: 283, type: !54)
!195 = distinct !DISubprogram(name: "ffs", scope: !196, file: !196, line: 283, type: !197, scopeLine: 284, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!196 = !DIFile(filename: "./arch/x86/include/asm/bitops.h", directory: "/home/lizy2001/genbc/linux")
!197 = !DISubroutineType(types: !198)
!198 = !{!54, !54}
!199 = !DILocation(line: 283, column: 36, scope: !195, inlinedAt: !200)
!200 = distinct !DILocation(line: 57, column: 9, scope: !201)
!201 = distinct !DILexicalBlock(scope: !191, file: !3, line: 56, column: 6)
!202 = !DILocalVariable(name: "r", scope: !195, file: !196, line: 285, type: !54)
!203 = !DILocation(line: 285, column: 6, scope: !195, inlinedAt: !200)
!204 = !DILocalVariable(name: "hw", arg: 1, scope: !191, file: !3, line: 42, type: !55)
!205 = !DILocation(line: 42, column: 41, scope: !191)
!206 = !DILocalVariable(name: "table", arg: 2, scope: !191, file: !3, line: 42, type: !157)
!207 = !DILocation(line: 42, column: 50, scope: !191)
!208 = !DILocalVariable(name: "flags", arg: 3, scope: !191, file: !3, line: 42, type: !7)
!209 = !DILocation(line: 42, column: 70, scope: !191)
!210 = !DILocalVariable(name: "val", arg: 4, scope: !191, file: !3, line: 43, type: !7)
!211 = !DILocation(line: 43, column: 18, scope: !191)
!212 = !DILocalVariable(name: "num_parents", scope: !191, file: !3, line: 45, type: !54)
!213 = !DILocation(line: 45, column: 6, scope: !191)
!214 = !DILocation(line: 45, column: 43, scope: !191)
!215 = !DILocation(line: 45, column: 20, scope: !191)
!216 = !DILocation(line: 47, column: 6, scope: !217)
!217 = distinct !DILexicalBlock(scope: !191, file: !3, line: 47, column: 6)
!218 = !DILocation(line: 47, column: 6, scope: !191)
!219 = !DILocalVariable(name: "i", scope: !220, file: !3, line: 48, type: !54)
!220 = distinct !DILexicalBlock(scope: !217, file: !3, line: 47, column: 13)
!221 = !DILocation(line: 48, column: 7, scope: !220)
!222 = !DILocation(line: 50, column: 10, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !3, line: 50, column: 3)
!224 = !DILocation(line: 50, column: 8, scope: !223)
!225 = !DILocation(line: 50, column: 15, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !3, line: 50, column: 3)
!227 = !DILocation(line: 50, column: 19, scope: !226)
!228 = !DILocation(line: 50, column: 17, scope: !226)
!229 = !DILocation(line: 50, column: 3, scope: !223)
!230 = !DILocation(line: 51, column: 8, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !3, line: 51, column: 8)
!232 = !DILocation(line: 51, column: 14, scope: !231)
!233 = !DILocation(line: 51, column: 20, scope: !231)
!234 = !DILocation(line: 51, column: 17, scope: !231)
!235 = !DILocation(line: 51, column: 8, scope: !226)
!236 = !DILocation(line: 52, column: 12, scope: !231)
!237 = !DILocation(line: 52, column: 5, scope: !231)
!238 = !DILocation(line: 50, column: 33, scope: !226)
!239 = !DILocation(line: 50, column: 3, scope: !226)
!240 = distinct !{!240, !229, !241}
!241 = !DILocation(line: 52, column: 12, scope: !223)
!242 = !DILocation(line: 53, column: 3, scope: !220)
!243 = !DILocation(line: 56, column: 6, scope: !201)
!244 = !DILocation(line: 56, column: 10, scope: !201)
!245 = !DILocation(line: 56, column: 14, scope: !201)
!246 = !DILocation(line: 56, column: 20, scope: !201)
!247 = !DILocation(line: 56, column: 6, scope: !191)
!248 = !DILocation(line: 57, column: 13, scope: !201)
!249 = !DILocation(line: 299, column: 14, scope: !195, inlinedAt: !200)
!250 = !DILocation(line: 297, column: 2, scope: !195, inlinedAt: !200)
!251 = !{i32 286175}
!252 = !DILocation(line: 310, column: 9, scope: !195, inlinedAt: !200)
!253 = !DILocation(line: 310, column: 11, scope: !195, inlinedAt: !200)
!254 = !DILocation(line: 57, column: 18, scope: !201)
!255 = !DILocation(line: 57, column: 7, scope: !201)
!256 = !DILocation(line: 57, column: 3, scope: !201)
!257 = !DILocation(line: 59, column: 6, scope: !258)
!258 = distinct !DILexicalBlock(scope: !191, file: !3, line: 59, column: 6)
!259 = !DILocation(line: 59, column: 10, scope: !258)
!260 = !DILocation(line: 59, column: 14, scope: !258)
!261 = !DILocation(line: 59, column: 20, scope: !258)
!262 = !DILocation(line: 59, column: 6, scope: !191)
!263 = !DILocation(line: 60, column: 6, scope: !258)
!264 = !DILocation(line: 60, column: 3, scope: !258)
!265 = !DILocation(line: 62, column: 6, scope: !266)
!266 = distinct !DILexicalBlock(scope: !191, file: !3, line: 62, column: 6)
!267 = !DILocation(line: 62, column: 13, scope: !266)
!268 = !DILocation(line: 62, column: 10, scope: !266)
!269 = !DILocation(line: 62, column: 6, scope: !191)
!270 = !DILocation(line: 63, column: 3, scope: !266)
!271 = !DILocation(line: 65, column: 9, scope: !191)
!272 = !DILocation(line: 65, column: 2, scope: !191)
!273 = !DILocation(line: 66, column: 1, scope: !191)
!274 = distinct !DISubprogram(name: "clk_mux_index_to_val", scope: !3, file: !3, line: 69, type: !275, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !179)
!275 = !DISubroutineType(types: !276)
!276 = !{!7, !157, !7, !95}
!277 = !DILocalVariable(name: "table", arg: 1, scope: !274, file: !3, line: 69, type: !157)
!278 = !DILocation(line: 69, column: 40, scope: !274)
!279 = !DILocalVariable(name: "flags", arg: 2, scope: !274, file: !3, line: 69, type: !7)
!280 = !DILocation(line: 69, column: 60, scope: !274)
!281 = !DILocalVariable(name: "index", arg: 3, scope: !274, file: !3, line: 69, type: !95)
!282 = !DILocation(line: 69, column: 70, scope: !274)
!283 = !DILocalVariable(name: "val", scope: !274, file: !3, line: 71, type: !7)
!284 = !DILocation(line: 71, column: 15, scope: !274)
!285 = !DILocation(line: 71, column: 21, scope: !274)
!286 = !DILocation(line: 73, column: 6, scope: !287)
!287 = distinct !DILexicalBlock(scope: !274, file: !3, line: 73, column: 6)
!288 = !DILocation(line: 73, column: 6, scope: !274)
!289 = !DILocation(line: 74, column: 9, scope: !290)
!290 = distinct !DILexicalBlock(scope: !287, file: !3, line: 73, column: 13)
!291 = !DILocation(line: 74, column: 15, scope: !290)
!292 = !DILocation(line: 74, column: 7, scope: !290)
!293 = !DILocation(line: 75, column: 2, scope: !290)
!294 = !DILocation(line: 76, column: 7, scope: !295)
!295 = distinct !DILexicalBlock(scope: !296, file: !3, line: 76, column: 7)
!296 = distinct !DILexicalBlock(scope: !287, file: !3, line: 75, column: 9)
!297 = !DILocation(line: 76, column: 13, scope: !295)
!298 = !DILocation(line: 76, column: 7, scope: !296)
!299 = !DILocation(line: 77, column: 15, scope: !295)
!300 = !DILocation(line: 77, column: 12, scope: !295)
!301 = !DILocation(line: 77, column: 8, scope: !295)
!302 = !DILocation(line: 77, column: 4, scope: !295)
!303 = !DILocation(line: 79, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !296, file: !3, line: 79, column: 7)
!305 = !DILocation(line: 79, column: 13, scope: !304)
!306 = !DILocation(line: 79, column: 7, scope: !296)
!307 = !DILocation(line: 80, column: 7, scope: !304)
!308 = !DILocation(line: 80, column: 4, scope: !304)
!309 = !DILocation(line: 83, column: 9, scope: !274)
!310 = !DILocation(line: 83, column: 2, scope: !274)
!311 = distinct !DISubprogram(name: "clk_mux_determine_rate", scope: !3, file: !3, line: 128, type: !81, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!312 = !DILocalVariable(name: "hw", arg: 1, scope: !311, file: !3, line: 128, type: !55)
!313 = !DILocation(line: 128, column: 50, scope: !311)
!314 = !DILocalVariable(name: "req", arg: 2, scope: !311, file: !3, line: 129, type: !83)
!315 = !DILocation(line: 129, column: 32, scope: !311)
!316 = !DILocalVariable(name: "mux", scope: !311, file: !3, line: 131, type: !23)
!317 = !DILocation(line: 131, column: 18, scope: !311)
!318 = !DILocalVariable(name: "__mptr", scope: !319, file: !3, line: 131, type: !22)
!319 = distinct !DILexicalBlock(scope: !311, file: !3, line: 131, column: 24)
!320 = !DILocation(line: 131, column: 24, scope: !319)
!321 = !DILocation(line: 131, column: 24, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !3, line: 131, column: 24)
!323 = !DILocation(line: 133, column: 38, scope: !311)
!324 = !DILocation(line: 133, column: 42, scope: !311)
!325 = !DILocation(line: 133, column: 47, scope: !311)
!326 = !DILocation(line: 133, column: 52, scope: !311)
!327 = !DILocation(line: 133, column: 9, scope: !311)
!328 = !DILocation(line: 133, column: 2, scope: !311)
!329 = distinct !DISubprogram(name: "clk_mux_set_parent", scope: !3, file: !3, line: 98, type: !93, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!330 = !DILocalVariable(name: "lock", arg: 1, scope: !331, file: !332, line: 407, type: !164)
!331 = distinct !DISubprogram(name: "spin_unlock_irqrestore", scope: !332, file: !332, line: 407, type: !333, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!332 = !DIFile(filename: "./include/linux/spinlock.h", directory: "/home/lizy2001/genbc/linux")
!333 = !DISubroutineType(types: !334)
!334 = !{null, !164, !72}
!335 = !DILocation(line: 407, column: 64, scope: !331, inlinedAt: !336)
!336 = distinct !DILocation(line: 121, column: 3, scope: !337)
!337 = distinct !DILexicalBlock(scope: !329, file: !3, line: 120, column: 6)
!338 = !DILocalVariable(name: "flags", arg: 2, scope: !331, file: !332, line: 407, type: !72)
!339 = !DILocation(line: 407, column: 84, scope: !331, inlinedAt: !336)
!340 = !DILocalVariable(name: "lock", arg: 1, scope: !341, file: !332, line: 327, type: !164)
!341 = distinct !DISubprogram(name: "spinlock_check", scope: !332, file: !332, line: 327, type: !342, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!342 = !DISubroutineType(types: !343)
!343 = !{!344, !164}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !166, line: 29, baseType: !173)
!346 = !DILocation(line: 327, column: 67, scope: !341, inlinedAt: !347)
!347 = distinct !DILocation(line: 106, column: 3, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 106, column: 3)
!349 = distinct !DILexicalBlock(scope: !350, file: !3, line: 106, column: 3)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 106, column: 3)
!351 = distinct !DILexicalBlock(scope: !352, file: !3, line: 106, column: 3)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 106, column: 3)
!353 = distinct !DILexicalBlock(scope: !329, file: !3, line: 105, column: 6)
!354 = !DILocalVariable(name: "hw", arg: 1, scope: !329, file: !3, line: 98, type: !55)
!355 = !DILocation(line: 98, column: 46, scope: !329)
!356 = !DILocalVariable(name: "index", arg: 2, scope: !329, file: !3, line: 98, type: !95)
!357 = !DILocation(line: 98, column: 53, scope: !329)
!358 = !DILocalVariable(name: "mux", scope: !329, file: !3, line: 100, type: !23)
!359 = !DILocation(line: 100, column: 18, scope: !329)
!360 = !DILocalVariable(name: "__mptr", scope: !361, file: !3, line: 100, type: !22)
!361 = distinct !DILexicalBlock(scope: !329, file: !3, line: 100, column: 24)
!362 = !DILocation(line: 100, column: 24, scope: !361)
!363 = !DILocation(line: 100, column: 24, scope: !364)
!364 = distinct !DILexicalBlock(scope: !361, file: !3, line: 100, column: 24)
!365 = !DILocalVariable(name: "val", scope: !329, file: !3, line: 101, type: !158)
!366 = !DILocation(line: 101, column: 6, scope: !329)
!367 = !DILocation(line: 101, column: 33, scope: !329)
!368 = !DILocation(line: 101, column: 38, scope: !329)
!369 = !DILocation(line: 101, column: 45, scope: !329)
!370 = !DILocation(line: 101, column: 50, scope: !329)
!371 = !DILocation(line: 101, column: 57, scope: !329)
!372 = !DILocation(line: 101, column: 12, scope: !329)
!373 = !DILocalVariable(name: "flags", scope: !329, file: !3, line: 102, type: !72)
!374 = !DILocation(line: 102, column: 16, scope: !329)
!375 = !DILocalVariable(name: "reg", scope: !329, file: !3, line: 103, type: !158)
!376 = !DILocation(line: 103, column: 6, scope: !329)
!377 = !DILocation(line: 105, column: 6, scope: !353)
!378 = !DILocation(line: 105, column: 11, scope: !353)
!379 = !DILocation(line: 105, column: 6, scope: !329)
!380 = !DILocation(line: 106, column: 3, scope: !353)
!381 = !DILocation(line: 106, column: 3, scope: !352)
!382 = !DILocalVariable(name: "__dummy", scope: !383, file: !3, line: 106, type: !72)
!383 = distinct !DILexicalBlock(scope: !351, file: !3, line: 106, column: 3)
!384 = !DILocation(line: 106, column: 3, scope: !383)
!385 = !DILocalVariable(name: "__dummy2", scope: !383, file: !3, line: 106, type: !72)
!386 = !DILocation(line: 106, column: 3, scope: !351)
!387 = !DILocation(line: 106, column: 3, scope: !350)
!388 = !DILocation(line: 106, column: 3, scope: !389)
!389 = distinct !DILexicalBlock(scope: !350, file: !3, line: 106, column: 3)
!390 = !DILocalVariable(name: "__dummy", scope: !391, file: !3, line: 106, type: !72)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 106, column: 3)
!392 = distinct !DILexicalBlock(scope: !389, file: !3, line: 106, column: 3)
!393 = !DILocation(line: 106, column: 3, scope: !391)
!394 = !DILocalVariable(name: "__dummy2", scope: !391, file: !3, line: 106, type: !72)
!395 = !DILocation(line: 106, column: 3, scope: !392)
!396 = !DILocation(line: 106, column: 3, scope: !349)
!397 = !{i32 -2143986699}
!398 = !DILocation(line: 106, column: 3, scope: !348)
!399 = !DILocation(line: 329, column: 10, scope: !341, inlinedAt: !347)
!400 = !DILocation(line: 329, column: 16, scope: !341, inlinedAt: !347)
!401 = !DILocation(line: 110, column: 6, scope: !402)
!402 = distinct !DILexicalBlock(scope: !329, file: !3, line: 110, column: 6)
!403 = !DILocation(line: 110, column: 11, scope: !402)
!404 = !DILocation(line: 110, column: 17, scope: !402)
!405 = !DILocation(line: 110, column: 6, scope: !329)
!406 = !DILocation(line: 111, column: 9, scope: !407)
!407 = distinct !DILexicalBlock(scope: !402, file: !3, line: 110, column: 40)
!408 = !DILocation(line: 111, column: 14, scope: !407)
!409 = !DILocation(line: 111, column: 23, scope: !407)
!410 = !DILocation(line: 111, column: 28, scope: !407)
!411 = !DILocation(line: 111, column: 34, scope: !407)
!412 = !DILocation(line: 111, column: 19, scope: !407)
!413 = !DILocation(line: 111, column: 7, scope: !407)
!414 = !DILocation(line: 112, column: 2, scope: !407)
!415 = !DILocation(line: 113, column: 23, scope: !416)
!416 = distinct !DILexicalBlock(scope: !402, file: !3, line: 112, column: 9)
!417 = !DILocation(line: 113, column: 9, scope: !416)
!418 = !DILocation(line: 113, column: 7, scope: !416)
!419 = !DILocation(line: 114, column: 12, scope: !416)
!420 = !DILocation(line: 114, column: 17, scope: !416)
!421 = !DILocation(line: 114, column: 25, scope: !416)
!422 = !DILocation(line: 114, column: 30, scope: !416)
!423 = !DILocation(line: 114, column: 22, scope: !416)
!424 = !DILocation(line: 114, column: 10, scope: !416)
!425 = !DILocation(line: 114, column: 7, scope: !416)
!426 = !DILocation(line: 116, column: 8, scope: !329)
!427 = !DILocation(line: 116, column: 15, scope: !329)
!428 = !DILocation(line: 116, column: 20, scope: !329)
!429 = !DILocation(line: 116, column: 12, scope: !329)
!430 = !DILocation(line: 116, column: 6, scope: !329)
!431 = !DILocation(line: 117, column: 9, scope: !329)
!432 = !DILocation(line: 117, column: 6, scope: !329)
!433 = !DILocation(line: 118, column: 17, scope: !329)
!434 = !DILocation(line: 118, column: 22, scope: !329)
!435 = !DILocation(line: 118, column: 2, scope: !329)
!436 = !DILocation(line: 120, column: 6, scope: !337)
!437 = !DILocation(line: 120, column: 11, scope: !337)
!438 = !DILocation(line: 120, column: 6, scope: !329)
!439 = !DILocation(line: 121, column: 26, scope: !337)
!440 = !DILocation(line: 121, column: 31, scope: !337)
!441 = !DILocation(line: 121, column: 37, scope: !337)
!442 = !DILocalVariable(name: "__dummy", scope: !443, file: !332, line: 409, type: !72)
!443 = distinct !DILexicalBlock(scope: !444, file: !332, line: 409, column: 2)
!444 = distinct !DILexicalBlock(scope: !331, file: !332, line: 409, column: 2)
!445 = !DILocation(line: 409, column: 2, scope: !443, inlinedAt: !336)
!446 = !DILocalVariable(name: "__dummy2", scope: !443, file: !332, line: 409, type: !72)
!447 = !DILocalVariable(name: "__dummy", scope: !448, file: !332, line: 409, type: !72)
!448 = distinct !DILexicalBlock(scope: !449, file: !332, line: 409, column: 2)
!449 = distinct !DILexicalBlock(scope: !450, file: !332, line: 409, column: 2)
!450 = distinct !DILexicalBlock(scope: !451, file: !332, line: 409, column: 2)
!451 = distinct !DILexicalBlock(scope: !444, file: !332, line: 409, column: 2)
!452 = !DILocation(line: 409, column: 2, scope: !448, inlinedAt: !336)
!453 = !DILocalVariable(name: "__dummy2", scope: !448, file: !332, line: 409, type: !72)
!454 = !DILocation(line: 409, column: 2, scope: !449, inlinedAt: !336)
!455 = !DILocation(line: 409, column: 2, scope: !456, inlinedAt: !336)
!456 = distinct !DILexicalBlock(scope: !451, file: !332, line: 409, column: 2)
!457 = !{i32 -2145380992}
!458 = !DILocation(line: 409, column: 2, scope: !459, inlinedAt: !336)
!459 = distinct !DILexicalBlock(scope: !456, file: !332, line: 409, column: 2)
!460 = !DILocation(line: 121, column: 3, scope: !337)
!461 = !DILocation(line: 125, column: 2, scope: !329)
!462 = distinct !DISubprogram(name: "clk_mux_get_parent", scope: !3, file: !3, line: 87, type: !102, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !179)
!463 = !DILocalVariable(name: "hw", arg: 1, scope: !462, file: !3, line: 87, type: !55)
!464 = !DILocation(line: 87, column: 45, scope: !462)
!465 = !DILocalVariable(name: "mux", scope: !462, file: !3, line: 89, type: !23)
!466 = !DILocation(line: 89, column: 18, scope: !462)
!467 = !DILocalVariable(name: "__mptr", scope: !468, file: !3, line: 89, type: !22)
!468 = distinct !DILexicalBlock(scope: !462, file: !3, line: 89, column: 24)
!469 = !DILocation(line: 89, column: 24, scope: !468)
!470 = !DILocation(line: 89, column: 24, scope: !471)
!471 = distinct !DILexicalBlock(scope: !468, file: !3, line: 89, column: 24)
!472 = !DILocalVariable(name: "val", scope: !462, file: !3, line: 90, type: !158)
!473 = !DILocation(line: 90, column: 6, scope: !462)
!474 = !DILocation(line: 92, column: 22, scope: !462)
!475 = !DILocation(line: 92, column: 8, scope: !462)
!476 = !DILocation(line: 92, column: 30, scope: !462)
!477 = !DILocation(line: 92, column: 35, scope: !462)
!478 = !DILocation(line: 92, column: 27, scope: !462)
!479 = !DILocation(line: 92, column: 6, scope: !462)
!480 = !DILocation(line: 93, column: 9, scope: !462)
!481 = !DILocation(line: 93, column: 14, scope: !462)
!482 = !DILocation(line: 93, column: 6, scope: !462)
!483 = !DILocation(line: 95, column: 30, scope: !462)
!484 = !DILocation(line: 95, column: 34, scope: !462)
!485 = !DILocation(line: 95, column: 39, scope: !462)
!486 = !DILocation(line: 95, column: 46, scope: !462)
!487 = !DILocation(line: 95, column: 51, scope: !462)
!488 = !DILocation(line: 95, column: 58, scope: !462)
!489 = !DILocation(line: 95, column: 9, scope: !462)
!490 = !DILocation(line: 95, column: 2, scope: !462)
!491 = distinct !DISubprogram(name: "__clk_hw_register_mux", scope: !3, file: !3, line: 148, type: !492, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !179)
!492 = !DISubroutineType(types: !493)
!493 = !{!55, !494, !497, !42, !95, !138, !152, !141, !72, !22, !95, !158, !95, !157, !164}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !496, line: 15, flags: DIFlagFwdDecl)
!496 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !499, line: 51, size: 1344, elements: !500)
!499 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!500 = !{!501, !502, !504, !505, !607, !1216, !1217, !1218, !1219, !1220, !1221, !1222}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !499, line: 52, baseType: !42, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !498, file: !499, line: 53, baseType: !503, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !499, line: 28, baseType: !158)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !498, file: !499, line: 54, baseType: !42, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !498, file: !499, line: 55, baseType: !506, size: 192, offset: 192)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !496, line: 17, size: 192, elements: !507)
!507 = !{!508, !510, !606}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !506, file: !496, line: 18, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !506, file: !496, line: 19, baseType: !511, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !496, line: 110, size: 1152, elements: !514)
!514 = !{!515, !519, !523, !531, !539, !543, !551, !556, !560, !561, !565, !569, !573, !589, !590, !591, !592, !602}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !513, file: !496, line: 111, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{!509, !509}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !513, file: !496, line: 112, baseType: !520, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !509}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !513, file: !496, line: 113, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DISubroutineType(types: !526)
!526 = !{!527, !529}
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !21, line: 30, baseType: !528)
!528 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !513, file: !496, line: 114, baseType: !532, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !529, !537}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "property_present", scope: !513, file: !496, line: 116, baseType: !540, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!527, !529, !42}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_int_array", scope: !513, file: !496, line: 118, baseType: !544, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!54, !529, !42, !7, !22, !547}
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 55, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !549, line: 72, baseType: !550)
!549 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !549, line: 16, baseType: !72)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_string_array", scope: !513, file: !496, line: 123, baseType: !552, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{!54, !529, !42, !555, !547}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "get_name", scope: !513, file: !496, line: 126, baseType: !557, size: 64, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!42, !529}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "get_name_prefix", scope: !513, file: !496, line: 127, baseType: !557, size: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !513, file: !496, line: 128, baseType: !562, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!509, !529}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_child_node", scope: !513, file: !496, line: 130, baseType: !566, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!509, !529, !509}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "get_named_child_node", scope: !513, file: !496, line: 133, baseType: !570, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!509, !529, !42}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "get_reference_args", scope: !513, file: !496, line: 135, baseType: !574, size: 64, offset: 768)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!54, !529, !42, !42, !7, !7, !577}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_reference_args", file: !496, line: 43, size: 640, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !578, file: !496, line: 44, baseType: !509, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !578, file: !496, line: 45, baseType: !7, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !578, file: !496, line: 46, baseType: !583, size: 512, offset: 128)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 512, elements: !587)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !96, line: 23, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !98, line: 31, baseType: !586)
!586 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!587 = !{!588}
!588 = !DISubrange(count: 8)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_next_endpoint", scope: !513, file: !496, line: 140, baseType: !566, size: 64, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_remote_endpoint", scope: !513, file: !496, line: 143, baseType: !562, size: 64, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_port_parent", scope: !513, file: !496, line: 145, baseType: !516, size: 64, offset: 960)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "graph_parse_endpoint", scope: !513, file: !496, line: 146, baseType: !593, size: 64, offset: 1024)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!54, !529, !596}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_endpoint", file: !496, line: 29, size: 128, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !597, file: !496, line: 30, baseType: !7, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !597, file: !496, line: 31, baseType: !7, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "local_fwnode", scope: !597, file: !496, line: 32, baseType: !529, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "add_links", scope: !513, file: !496, line: 148, baseType: !603, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!54, !529, !494}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !506, file: !496, line: 20, baseType: !494, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !498, file: !499, line: 57, baseType: !608, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "property", file: !499, line: 31, size: 704, elements: !610)
!610 = !{!611, !613, !614, !615, !616}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !609, file: !499, line: 32, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !609, file: !499, line: 33, baseType: !54, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !609, file: !499, line: 34, baseType: !22, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !499, line: 35, baseType: !608, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !609, file: !499, line: 43, baseType: !617, size: 448, offset: 256)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !618, line: 168, size: 448, elements: !619)
!618 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!619 = !{!620, !627, !628, !629, !1211, !1212}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !617, file: !618, line: 169, baseType: !621, size: 128)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !618, line: 30, size: 128, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !618, line: 31, baseType: !42, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !621, file: !618, line: 32, baseType: !625, size: 16, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !21, line: 19, baseType: !626)
!626 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !618, line: 170, baseType: !547, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !617, file: !618, line: 171, baseType: !22, size: 64, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !617, file: !618, line: 172, baseType: !630, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!633, !636, !639, !734, !612, !944, !547}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !21, line: 60, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !549, line: 73, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !549, line: 15, baseType: !77)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !638, line: 526, flags: DIFlagFwdDecl)
!638 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !641, line: 64, size: 512, elements: !642)
!641 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!642 = !{!643, !644, !650, !651, !695, !792, !1196, !1206, !1207, !1208, !1209, !1210}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !640, file: !641, line: 65, baseType: !42, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !640, file: !641, line: 66, baseType: !645, size: 128, offset: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !21, line: 178, size: 128, elements: !646)
!646 = !{!647, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !21, line: 179, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !645, file: !21, line: 179, baseType: !648, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !640, file: !641, line: 67, baseType: !639, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !640, file: !641, line: 68, baseType: !652, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !641, line: 192, size: 704, elements: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !653, file: !641, line: 193, baseType: !645, size: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !653, file: !641, line: 194, baseType: !165, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !653, file: !641, line: 195, baseType: !640, size: 512, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !653, file: !641, line: 196, baseType: !659, size: 64, offset: 640)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !641, line: 156, size: 192, elements: !662)
!662 = !{!663, !668, !673}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !661, file: !641, line: 157, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!54, !652, !639}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !641, line: 158, baseType: !669, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!42, !652, !639}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !661, file: !641, line: 159, baseType: !674, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!54, !652, !639, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !641, line: 148, size: 20736, elements: !680)
!680 = !{!681, !685, !689, !690, !694}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !679, file: !641, line: 149, baseType: !682, size: 192)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 192, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 3)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !679, file: !641, line: 150, baseType: !686, size: 4096, offset: 192)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 4096, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !679, file: !641, line: 151, baseType: !54, size: 32, offset: 4288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !679, file: !641, line: 152, baseType: !691, size: 16384, offset: 4320)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 16384, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 2048)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !679, file: !641, line: 153, baseType: !54, size: 32, offset: 20704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !640, file: !641, line: 69, baseType: !696, size: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !641, line: 138, size: 448, elements: !698)
!698 = !{!699, !703, !717, !719, !738, !769, !773}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !697, file: !641, line: 139, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !639}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !697, file: !641, line: 140, baseType: !704, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !618, line: 230, size: 128, elements: !707)
!707 = !{!708, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !706, file: !618, line: 231, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!633, !639, !712, !612}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !706, file: !618, line: 232, baseType: !714, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!633, !639, !712, !42, !547}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !697, file: !641, line: 141, baseType: !718, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !697, file: !641, line: 142, baseType: !720, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !618, line: 84, size: 320, elements: !724)
!724 = !{!725, !726, !730, !735, !736}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !618, line: 85, baseType: !42, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !723, file: !618, line: 86, baseType: !727, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!625, !639, !712, !54}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !723, file: !618, line: 88, baseType: !731, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!625, !639, !734, !54}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !723, file: !618, line: 90, baseType: !718, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bin_attrs", scope: !723, file: !618, line: 91, baseType: !737, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !697, file: !641, line: 143, baseType: !739, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !639}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !6, line: 39, size: 384, elements: !745)
!745 = !{!746, !747, !751, !755, !761, !765}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !6, line: 40, baseType: !5, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !744, file: !6, line: 41, baseType: !748, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!527}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !744, file: !6, line: 42, baseType: !752, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!22}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !744, file: !6, line: 43, baseType: !756, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!535, !759}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !6, line: 19, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !744, file: !6, line: 44, baseType: !762, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!535}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !744, file: !6, line: 45, baseType: !766, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !22}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !697, file: !641, line: 144, baseType: !770, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!535, !639}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !697, file: !641, line: 145, baseType: !774, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !639, !777, !785}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !779, line: 23, baseType: !780)
!779 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 21, size: 32, elements: !781)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !780, file: !779, line: 22, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !21, line: 32, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !549, line: 49, baseType: !7)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !779, line: 28, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 26, size: 32, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !787, file: !779, line: 27, baseType: !790, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !21, line: 33, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !549, line: 50, baseType: !7)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !640, file: !641, line: 70, baseType: !793, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !136, line: 123, size: 1024, elements: !795)
!795 = !{!796, !801, !802, !803, !804, !812, !813, !814, !1189, !1190, !1191, !1192, !1193}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !794, file: !136, line: 124, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !21, line: 168, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 166, size: 32, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !798, file: !21, line: 167, baseType: !54, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !794, file: !136, line: 125, baseType: !797, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !794, file: !136, line: 135, baseType: !793, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !794, file: !136, line: 136, baseType: !42, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !794, file: !136, line: 138, baseType: !805, size: 192, align: 64, offset: 192)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !806, line: 24, size: 192, align: 64, elements: !807)
!806 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !809, !811}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !805, file: !806, line: 25, baseType: !72, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !805, file: !806, line: 26, baseType: !810, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !805, file: !806, line: 27, baseType: !810, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !794, file: !136, line: 140, baseType: !535, size: 64, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !794, file: !136, line: 141, baseType: !7, size: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, scope: !794, file: !136, line: 142, baseType: !815, size: 256, offset: 512)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !794, file: !136, line: 142, size: 256, elements: !816)
!816 = !{!817, !880, !884}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !815, file: !136, line: 143, baseType: !818, size: 192)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !136, line: 91, size: 192, elements: !819)
!819 = !{!820, !821, !825}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !818, file: !136, line: 92, baseType: !72, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !818, file: !136, line: 94, baseType: !822, size: 64, offset: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !806, line: 31, size: 64, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !822, file: !806, line: 32, baseType: !810, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !818, file: !136, line: 100, baseType: !826, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !136, line: 180, size: 704, elements: !828)
!828 = !{!829, !830, !831, !844, !845, !846, !872, !873}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !827, file: !136, line: 182, baseType: !793, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !827, file: !136, line: 183, baseType: !7, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !827, file: !136, line: 186, baseType: !832, size: 192, offset: 128)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !833, line: 19, size: 192, elements: !834)
!833 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!834 = !{!835, !842, !843}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !832, file: !833, line: 20, baseType: !836, size: 128)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !837, line: 292, size: 128, elements: !838)
!837 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!838 = !{!839, !840, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !836, file: !837, line: 293, baseType: !165)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !836, file: !837, line: 295, baseType: !20, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !836, file: !837, line: 296, baseType: !22, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !832, file: !833, line: 21, baseType: !7, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !832, file: !833, line: 22, baseType: !7, size: 32, offset: 160)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !827, file: !136, line: 187, baseType: !158, size: 32, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !827, file: !136, line: 188, baseType: !158, size: 32, offset: 352)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !827, file: !136, line: 189, baseType: !847, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !136, line: 168, size: 320, elements: !849)
!849 = !{!850, !856, !860, !864, !868}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !848, file: !136, line: 169, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!54, !854, !826}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !638, line: 539, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !848, file: !136, line: 171, baseType: !857, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!54, !793, !42, !625}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !848, file: !136, line: 173, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!54, !793}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !848, file: !136, line: 174, baseType: !865, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!54, !793, !793, !42}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !848, file: !136, line: 176, baseType: !869, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!54, !854, !793, !826}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !827, file: !136, line: 192, baseType: !645, size: 128, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !827, file: !136, line: 194, baseType: !874, size: 128, offset: 576)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !875, line: 40, baseType: !876)
!875 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !875, line: 36, size: 128, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !876, file: !875, line: 37, baseType: !165)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !876, file: !875, line: 38, baseType: !645, size: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !815, file: !136, line: 144, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_symlink", file: !136, line: 103, size: 64, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "target_kn", scope: !881, file: !136, line: 104, baseType: !793, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !815, file: !136, line: 145, baseType: !885, size: 256)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_attr", file: !136, line: 107, size: 256, elements: !886)
!886 = !{!887, !1184, !1187, !1188}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !885, file: !136, line: 108, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_ops", file: !136, line: 217, size: 768, elements: !891)
!891 = !{!892, !931, !935, !939, !946, !950, !954, !958, !959, !960, !961, !969}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !890, file: !136, line: 222, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!54, !896}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_file", file: !136, line: 197, size: 1088, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !919, !920, !921, !922, !923, !924, !925, !926}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !897, file: !136, line: 199, baseType: !793, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !897, file: !136, line: 200, baseType: !636, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "seq_file", scope: !897, file: !136, line: 201, baseType: !854, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !897, file: !136, line: 202, baseType: !22, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !897, file: !136, line: 205, baseType: !904, size: 192, offset: 256)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !905, line: 53, size: 192, elements: !906)
!905 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!906 = !{!907, !917, !918}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !904, file: !905, line: 54, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !909, line: 13, baseType: !910)
!909 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !21, line: 175, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !21, line: 173, size: 64, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !911, file: !21, line: 174, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !96, line: 22, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !98, line: 30, baseType: !916)
!916 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !904, file: !905, line: 55, baseType: !165, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !904, file: !905, line: 59, baseType: !645, size: 128, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_mutex", scope: !897, file: !136, line: 206, baseType: !904, size: 192, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !897, file: !136, line: 207, baseType: !54, size: 32, offset: 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !897, file: !136, line: 208, baseType: !645, size: 128, offset: 704)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_buf", scope: !897, file: !136, line: 209, baseType: !612, size: 64, offset: 832)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !897, file: !136, line: 211, baseType: !547, size: 64, offset: 896)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "mmapped", scope: !897, file: !136, line: 212, baseType: !527, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "released", scope: !897, file: !136, line: 213, baseType: !527, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !897, file: !136, line: 214, baseType: !927, size: 64, offset: 1024)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !930, line: 356, flags: DIFlagFwdDecl)
!930 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!931 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !890, file: !136, line: 223, baseType: !932, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !896}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "seq_show", scope: !890, file: !136, line: 236, baseType: !936, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!54, !854, !22}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "seq_start", scope: !890, file: !136, line: 238, baseType: !940, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!22, !854, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !21, line: 46, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !549, line: 88, baseType: !916)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "seq_next", scope: !890, file: !136, line: 239, baseType: !947, size: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!22, !854, !22, !943}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "seq_stop", scope: !890, file: !136, line: 240, baseType: !951, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !854, !22}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !890, file: !136, line: 242, baseType: !955, size: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!633, !896, !612, !547, !944}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !890, file: !136, line: 252, baseType: !547, size: 64, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !890, file: !136, line: 259, baseType: !527, size: 8, offset: 512)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !890, file: !136, line: 260, baseType: !955, size: 64, offset: 576)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !890, file: !136, line: 263, baseType: !962, size: 64, offset: 640)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!965, !896, !967}
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !966, line: 52, baseType: !7)
!966 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !136, line: 27, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !890, file: !136, line: 266, baseType: !970, size: 64, offset: 704)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!54, !896, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !930, line: 305, size: 1472, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !981, !982, !1161, !1167, !1168, !1173, !1174, !1177, !1178, !1179, !1180, !1181, !1182}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !974, file: !930, line: 308, baseType: !72, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !974, file: !930, line: 309, baseType: !72, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !974, file: !930, line: 313, baseType: !973, size: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !974, file: !930, line: 313, baseType: !973, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !974, file: !930, line: 315, baseType: !805, size: 192, align: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !974, file: !930, line: 323, baseType: !72, size: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !974, file: !930, line: 327, baseType: !983, size: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !930, line: 388, size: 7296, elements: !985)
!985 = !{!986, !1157}
!986 = !DIDerivedType(tag: DW_TAG_member, scope: !984, file: !930, line: 389, baseType: !987, size: 7296)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !984, file: !930, line: 389, size: 7296, elements: !988)
!988 = !{!989, !990, !991, !992, !996, !997, !998, !999, !1000, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1049, !1057, !1060, !1102, !1103, !1128, !1129, !1132, !1135, !1136, !1139, !1140, !1141, !1144, !1156}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !987, file: !930, line: 390, baseType: !973, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !987, file: !930, line: 391, baseType: !822, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !987, file: !930, line: 392, baseType: !584, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !987, file: !930, line: 394, baseType: !993, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!72, !636, !72, !72, !72, !72}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !987, file: !930, line: 398, baseType: !72, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !987, file: !930, line: 399, baseType: !72, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !987, file: !930, line: 405, baseType: !72, size: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !987, file: !930, line: 406, baseType: !72, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !987, file: !930, line: 407, baseType: !1001, size: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !638, line: 286, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 286, size: 64, elements: !1004)
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !1003, file: !638, line: 286, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !1007, line: 18, baseType: !72)
!1007 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !987, file: !930, line: 416, baseType: !797, size: 32, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !987, file: !930, line: 428, baseType: !797, size: 32, offset: 608)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !987, file: !930, line: 437, baseType: !797, size: 32, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !987, file: !930, line: 447, baseType: !797, size: 32, offset: 672)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !987, file: !930, line: 450, baseType: !908, size: 64, offset: 704)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !987, file: !930, line: 452, baseType: !54, size: 32, offset: 768)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !987, file: !930, line: 454, baseType: !165, offset: 800)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !987, file: !930, line: 457, baseType: !1016, size: 256, offset: 832)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1017, line: 35, size: 256, elements: !1018)
!1017 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1018 = !{!1019, !1020, !1021, !1022}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1016, file: !1017, line: 36, baseType: !908, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1016, file: !1017, line: 42, baseType: !908, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1016, file: !1017, line: 46, baseType: !345, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1016, file: !1017, line: 47, baseType: !645, size: 128, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !987, file: !930, line: 459, baseType: !645, size: 128, offset: 1088)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !987, file: !930, line: 466, baseType: !72, size: 64, offset: 1216)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !987, file: !930, line: 467, baseType: !72, size: 64, offset: 1280)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !987, file: !930, line: 469, baseType: !72, size: 64, offset: 1344)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !987, file: !930, line: 470, baseType: !72, size: 64, offset: 1408)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !987, file: !930, line: 471, baseType: !910, size: 64, offset: 1472)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !987, file: !930, line: 472, baseType: !72, size: 64, offset: 1536)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !987, file: !930, line: 473, baseType: !72, size: 64, offset: 1600)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !987, file: !930, line: 474, baseType: !72, size: 64, offset: 1664)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !987, file: !930, line: 475, baseType: !72, size: 64, offset: 1728)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !987, file: !930, line: 477, baseType: !165, offset: 1792)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !987, file: !930, line: 478, baseType: !72, size: 64, offset: 1792)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !987, file: !930, line: 478, baseType: !72, size: 64, offset: 1856)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !987, file: !930, line: 478, baseType: !72, size: 64, offset: 1920)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !987, file: !930, line: 478, baseType: !72, size: 64, offset: 1984)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !987, file: !930, line: 479, baseType: !72, size: 64, offset: 2048)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !987, file: !930, line: 479, baseType: !72, size: 64, offset: 2112)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !987, file: !930, line: 479, baseType: !72, size: 64, offset: 2176)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !987, file: !930, line: 480, baseType: !72, size: 64, offset: 2240)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !987, file: !930, line: 480, baseType: !72, size: 64, offset: 2304)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !987, file: !930, line: 480, baseType: !72, size: 64, offset: 2368)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !987, file: !930, line: 480, baseType: !72, size: 64, offset: 2432)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !987, file: !930, line: 482, baseType: !1046, size: 2816, offset: 2496)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2816, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 44)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !987, file: !930, line: 488, baseType: !1050, size: 256, offset: 5312)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !1051, line: 60, size: 256, elements: !1052)
!1051 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!1052 = !{!1053}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1050, file: !1051, line: 61, baseType: !1054, size: 256)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 256, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 4)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !987, file: !930, line: 490, baseType: !1058, size: 64, offset: 5568)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !930, line: 490, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !987, file: !930, line: 493, baseType: !1061, size: 896, offset: 5632)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !1062, line: 53, baseType: !1063)
!1062 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1062, line: 13, size: 896, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1071, !1072, !1073, !1074, !1094, !1095, !1098}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !1063, file: !1062, line: 18, baseType: !584, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !1063, file: !1062, line: 28, baseType: !910, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !1063, file: !1062, line: 31, baseType: !1016, size: 256, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !1063, file: !1062, line: 32, baseType: !1069, size: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !1062, line: 32, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !1063, file: !1062, line: 37, baseType: !626, size: 16, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1063, file: !1062, line: 40, baseType: !904, size: 192, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !1063, file: !1062, line: 41, baseType: !22, size: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !1063, file: !1062, line: 42, baseType: !1075, size: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !1078, line: 13, size: 896, elements: !1079)
!1078 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1077, file: !1078, line: 14, baseType: !22, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1077, file: !1078, line: 15, baseType: !72, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1077, file: !1078, line: 17, baseType: !72, size: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !1077, file: !1078, line: 17, baseType: !72, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !1077, file: !1078, line: 19, baseType: !77, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !1077, file: !1078, line: 21, baseType: !77, size: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !1077, file: !1078, line: 22, baseType: !77, size: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !1077, file: !1078, line: 23, baseType: !77, size: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !1077, file: !1078, line: 24, baseType: !77, size: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !1077, file: !1078, line: 25, baseType: !77, size: 64, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !1077, file: !1078, line: 26, baseType: !77, size: 64, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !1077, file: !1078, line: 27, baseType: !77, size: 64, offset: 704)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !1077, file: !1078, line: 28, baseType: !77, size: 64, offset: 768)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !1077, file: !1078, line: 29, baseType: !77, size: 64, offset: 832)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !1063, file: !1062, line: 44, baseType: !797, size: 32, offset: 832)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !1063, file: !1062, line: 50, baseType: !1096, size: 16, offset: 864)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !96, line: 19, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !98, line: 24, baseType: !626)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !1063, file: !1062, line: 51, baseType: !1099, size: 16, offset: 880)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !96, line: 18, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !98, line: 23, baseType: !1101)
!1101 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !930, line: 495, baseType: !72, size: 64, offset: 6528)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !987, file: !930, line: 497, baseType: !1104, size: 64, offset: 6592)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !930, line: 381, size: 384, elements: !1106)
!1106 = !{!1107, !1108, !1117}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !1105, file: !930, line: 382, baseType: !797, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !1105, file: !930, line: 383, baseType: !1109, size: 128, offset: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !930, line: 376, size: 128, elements: !1110)
!1110 = !{!1111, !1115}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !1109, file: !930, line: 377, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !1114, line: 9, flags: DIFlagFwdDecl)
!1114 = !DIFile(filename: "./arch/x86/include/asm/current.h", directory: "/home/lizy2001/genbc/linux")
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1109, file: !930, line: 378, baseType: !1116, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !1105, file: !930, line: 384, baseType: !1118, size: 192, offset: 192)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !1119, line: 26, size: 192, elements: !1120)
!1119 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1118, file: !1119, line: 27, baseType: !7, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !1118, file: !1119, line: 28, baseType: !1123, size: 128, offset: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !1124, line: 43, size: 128, elements: !1125)
!1124 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1123, file: !1124, line: 44, baseType: !345)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !1123, file: !1124, line: 45, baseType: !645, size: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_lock", scope: !987, file: !930, line: 500, baseType: !165, offset: 6656)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_table", scope: !987, file: !930, line: 501, baseType: !1130, size: 64, offset: 6656)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "kioctx_table", file: !930, line: 387, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !987, file: !930, line: 516, baseType: !1133, size: 64, offset: 6720)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !930, line: 516, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "exe_file", scope: !987, file: !930, line: 519, baseType: !636, size: 64, offset: 6784)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_subscriptions", scope: !987, file: !930, line: 521, baseType: !1137, size: 64, offset: 6848)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
