; ModuleID = '../bcout/drivers/clk/clkdev.llvm.bc'
source_filename = "drivers/clk/clkdev.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kmem_cache = type opaque
%struct.clk_hw = type { %struct.clk_core*, %struct.clk*, %struct.clk_init_data* }
%struct.clk_core = type opaque
%struct.clk = type opaque
%struct.clk_init_data = type { i8*, %struct.clk_ops*, i8**, %struct.clk_parent_data*, %struct.clk_hw**, i8, i64 }

!1 = distinct !DIGlobalVariable(name: "clocks_mutex", scope: !2, file: !3, line: 25, type: !215, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !62, globals: !212, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clk/clkdev.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50, !55}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 10, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !56, line: 305, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!57 = !{!58, !59, !60, !61}
!58 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!62 = !{!63, !65, !66, !126, !131, !209, !211}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !64, line: 148, baseType: !7)
!64 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_lookup", file: !68, line: 18, size: 384, elements: !69)
!68 = !DIFile(filename: "./include/linux/clkdev.h", directory: "/home/lizy2001/genbc/linux")
!69 = !{!70, !76, !80, !81, !85}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !67, file: !68, line: 19, baseType: !71, size: 128)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !64, line: 178, size: 128, elements: !72)
!72 = !{!73, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !71, file: !64, line: 179, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !71, file: !64, line: 179, baseType: !74, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "dev_id", scope: !67, file: !68, line: 20, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "con_id", scope: !67, file: !68, line: 21, baseType: !77, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !67, file: !68, line: 22, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk", file: !84, line: 17, flags: DIFlagFwdDecl)
!84 = !DIFile(filename: "./include/linux/clk.h", directory: "/home/lizy2001/genbc/linux")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "clk_hw", scope: !67, file: !68, line: 23, baseType: !86, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_hw", file: !88, line: 312, size: 192, elements: !89)
!88 = !DIFile(filename: "./include/linux/clk-provider.h", directory: "/home/lizy2001/genbc/linux")
!89 = !{!90, !93, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !87, file: !88, line: 313, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "clk_core", file: !88, line: 38, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !87, file: !88, line: 314, baseType: !82, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !87, file: !88, line: 315, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_init_data", file: !88, line: 285, size: 448, elements: !98)
!98 = !{!99, !100, !191, !194, !205, !207, !208}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !88, line: 286, baseType: !77, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !97, file: !88, line: 287, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_ops", file: !88, line: 220, size: 1600, elements: !104)
!104 = !{!105, !110, !114, !115, !116, !117, !118, !119, !120, !121, !122, !127, !133, !145, !154, !158, !162, !166, !167, !168, !172, !181, !182, !183, !184}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !103, file: !88, line: 221, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!109, !86}
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare", scope: !103, file: !88, line: 222, baseType: !111, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !86}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "is_prepared", scope: !103, file: !88, line: 223, baseType: !106, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "unprepare_unused", scope: !103, file: !88, line: 224, baseType: !111, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !103, file: !88, line: 225, baseType: !106, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !103, file: !88, line: 226, baseType: !111, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "is_enabled", scope: !103, file: !88, line: 227, baseType: !106, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "disable_unused", scope: !103, file: !88, line: 228, baseType: !111, size: 64, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "save_context", scope: !103, file: !88, line: 229, baseType: !106, size: 64, offset: 512)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "restore_context", scope: !103, file: !88, line: 230, baseType: !111, size: 64, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_rate", scope: !103, file: !88, line: 231, baseType: !123, size: 64, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !86, !126}
!126 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "round_rate", scope: !103, file: !88, line: 233, baseType: !128, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !86, !126, !132}
!131 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "determine_rate", scope: !103, file: !88, line: 235, baseType: !134, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!109, !86, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_rate_request", file: !88, line: 55, size: 320, elements: !139)
!139 = !{!140, !141, !142, !143, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !138, file: !88, line: 56, baseType: !126, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "min_rate", scope: !138, file: !88, line: 57, baseType: !126, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "max_rate", scope: !138, file: !88, line: 58, baseType: !126, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_rate", scope: !138, file: !88, line: 59, baseType: !126, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "best_parent_hw", scope: !138, file: !88, line: 60, baseType: !86, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "set_parent", scope: !103, file: !88, line: 237, baseType: !146, size: 64, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!109, !86, !149}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !150, line: 17, baseType: !151)
!150 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !152, line: 21, baseType: !153)
!152 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !103, file: !88, line: 238, baseType: !155, size: 64, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!149, !86}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !103, file: !88, line: 239, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!109, !86, !126, !126}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate_and_parent", scope: !103, file: !88, line: 241, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!109, !86, !126, !126, !149}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "recalc_accuracy", scope: !103, file: !88, line: 244, baseType: !123, size: 64, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "get_phase", scope: !103, file: !88, line: 246, baseType: !106, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "set_phase", scope: !103, file: !88, line: 247, baseType: !169, size: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{!109, !86, !109}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "get_duty_cycle", scope: !103, file: !88, line: 248, baseType: !173, size: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!109, !86, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_duty", file: !88, line: 69, size: 64, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !177, file: !88, line: 70, baseType: !7, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !177, file: !88, line: 71, baseType: !7, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "set_duty_cycle", scope: !103, file: !88, line: 250, baseType: !173, size: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !103, file: !88, line: 252, baseType: !106, size: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "terminate", scope: !103, file: !88, line: 253, baseType: !111, size: 64, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "debug_init", scope: !103, file: !88, line: 254, baseType: !185, size: 64, offset: 1536)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !86, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !190, line: 21, flags: DIFlagFwdDecl)
!190 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent_names", scope: !97, file: !88, line: 289, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parent_data", scope: !97, file: !88, line: 290, baseType: !195, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clk_parent_data", file: !88, line: 264, size: 256, elements: !198)
!198 = !{!199, !202, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !197, file: !88, line: 265, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !87)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fw_name", scope: !197, file: !88, line: 266, baseType: !77, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !88, line: 267, baseType: !77, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !197, file: !88, line: 268, baseType: !109, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "parent_hws", scope: !97, file: !88, line: 291, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "num_parents", scope: !97, file: !88, line: 292, baseType: !149, size: 8, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !88, line: 293, baseType: !126, size: 64, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !74)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!212 = !{!0, !213}
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "clocks", scope: !2, file: !3, line: 24, type: !71, isLocal: true, isDefinition: true)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !216, line: 53, size: 192, elements: !217)
!216 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!217 = !{!218, !228, !244}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !215, file: !216, line: 54, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !220, line: 13, baseType: !221)
!220 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !64, line: 175, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 173, size: 64, elements: !223)
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !222, file: !64, line: 174, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !150, line: 22, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !152, line: 30, baseType: !227)
!227 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !215, file: !216, line: 55, baseType: !229, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !230, line: 83, baseType: !231)
!230 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !230, line: 71, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, scope: !231, file: !230, line: 72, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !230, line: 72, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !234, file: !230, line: 73, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !230, line: 20, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !237, file: !230, line: 21, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !241, line: 25, baseType: !242)
!241 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 25, elements: !243)
!243 = !{}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !215, file: !216, line: 59, baseType: !71, size: 128, offset: 64)
!245 = !{i32 7, !"Dwarf Version", i32 4}
!246 = !{i32 2, !"Debug Info Version", i32 3}
!247 = !{i32 1, !"wchar_size", i32 2}
!248 = !{i32 1, !"Code Model", i32 2}
!249 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!250 = distinct !DISubprogram(name: "clk_find_hw", scope: !3, file: !3, line: 72, type: !251, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !243)
!251 = !DISubroutineType(types: !252)
!252 = !{!86, !77, !77}
!253 = !DILocalVariable(name: "dev_id", arg: 1, scope: !250, file: !3, line: 72, type: !77)
!254 = !DILocation(line: 72, column: 40, scope: !250)
!255 = !DILocalVariable(name: "con_id", arg: 2, scope: !250, file: !3, line: 72, type: !77)
!256 = !DILocation(line: 72, column: 60, scope: !250)
!257 = !DILocalVariable(name: "cl", scope: !250, file: !3, line: 74, type: !66)
!258 = !DILocation(line: 74, column: 21, scope: !250)
!259 = !DILocalVariable(name: "hw", scope: !250, file: !3, line: 75, type: !86)
!260 = !DILocation(line: 75, column: 17, scope: !250)
!261 = !DILocation(line: 75, column: 22, scope: !250)
!262 = !DILocation(line: 77, column: 2, scope: !250)
!263 = !DILocation(line: 78, column: 16, scope: !250)
!264 = !DILocation(line: 78, column: 24, scope: !250)
!265 = !DILocation(line: 78, column: 7, scope: !250)
!266 = !DILocation(line: 78, column: 5, scope: !250)
!267 = !DILocation(line: 79, column: 6, scope: !268)
!268 = distinct !DILexicalBlock(scope: !250, file: !3, line: 79, column: 6)
!269 = !DILocation(line: 79, column: 6, scope: !250)
!270 = !DILocation(line: 80, column: 8, scope: !268)
!271 = !DILocation(line: 80, column: 12, scope: !268)
!272 = !DILocation(line: 80, column: 6, scope: !268)
!273 = !DILocation(line: 80, column: 3, scope: !268)
!274 = !DILocation(line: 81, column: 2, scope: !250)
!275 = !DILocation(line: 83, column: 9, scope: !250)
!276 = !DILocation(line: 83, column: 2, scope: !250)
!277 = distinct !DISubprogram(name: "ERR_PTR", scope: !278, file: !278, line: 24, type: !279, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !243)
!278 = !DIFile(filename: "./include/linux/err.h", directory: "/home/lizy2001/genbc/linux")
!279 = !DISubroutineType(types: !280)
!280 = !{!65, !131}
!281 = !DILocalVariable(name: "error", arg: 1, scope: !277, file: !278, line: 24, type: !131)
!282 = !DILocation(line: 24, column: 48, scope: !277)
!283 = !DILocation(line: 26, column: 18, scope: !277)
!284 = !DILocation(line: 26, column: 9, scope: !277)
!285 = !DILocation(line: 26, column: 2, scope: !277)
!286 = distinct !DISubprogram(name: "clk_find", scope: !3, file: !3, line: 36, type: !287, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !243)
!287 = !DISubroutineType(types: !288)
!288 = !{!66, !77, !77}
!289 = !DILocalVariable(name: "dev_id", arg: 1, scope: !286, file: !3, line: 36, type: !77)
!290 = !DILocation(line: 36, column: 48, scope: !286)
!291 = !DILocalVariable(name: "con_id", arg: 2, scope: !286, file: !3, line: 36, type: !77)
!292 = !DILocation(line: 36, column: 68, scope: !286)
!293 = !DILocalVariable(name: "p", scope: !286, file: !3, line: 38, type: !66)
!294 = !DILocation(line: 38, column: 21, scope: !286)
!295 = !DILocalVariable(name: "cl", scope: !286, file: !3, line: 38, type: !66)
!296 = !DILocation(line: 38, column: 25, scope: !286)
!297 = !DILocalVariable(name: "match", scope: !286, file: !3, line: 39, type: !109)
!298 = !DILocation(line: 39, column: 6, scope: !286)
!299 = !DILocalVariable(name: "best_found", scope: !286, file: !3, line: 39, type: !109)
!300 = !DILocation(line: 39, column: 13, scope: !286)
!301 = !DILocalVariable(name: "best_possible", scope: !286, file: !3, line: 39, type: !109)
!302 = !DILocation(line: 39, column: 29, scope: !286)
!303 = !DILocation(line: 41, column: 6, scope: !304)
!304 = distinct !DILexicalBlock(scope: !286, file: !3, line: 41, column: 6)
!305 = !DILocation(line: 41, column: 6, scope: !286)
!306 = !DILocation(line: 42, column: 17, scope: !304)
!307 = !DILocation(line: 42, column: 3, scope: !304)
!308 = !DILocation(line: 43, column: 6, scope: !309)
!309 = distinct !DILexicalBlock(scope: !286, file: !3, line: 43, column: 6)
!310 = !DILocation(line: 43, column: 6, scope: !286)
!311 = !DILocation(line: 44, column: 17, scope: !309)
!312 = !DILocation(line: 44, column: 3, scope: !309)
!313 = !DILocation(line: 46, column: 2, scope: !286)
!314 = !DILocation(line: 46, column: 2, scope: !315)
!315 = distinct !DILexicalBlock(scope: !286, file: !3, line: 46, column: 2)
!316 = !DILocalVariable(name: "__mptr", scope: !317, file: !3, line: 48, type: !65)
!317 = distinct !DILexicalBlock(scope: !318, file: !3, line: 48, column: 2)
!318 = distinct !DILexicalBlock(scope: !286, file: !3, line: 48, column: 2)
!319 = !DILocation(line: 48, column: 2, scope: !317)
!320 = !DILocation(line: 48, column: 2, scope: !321)
!321 = distinct !DILexicalBlock(scope: !317, file: !3, line: 48, column: 2)
!322 = !DILocation(line: 48, column: 2, scope: !318)
!323 = !DILocation(line: 48, column: 2, scope: !324)
!324 = distinct !DILexicalBlock(scope: !318, file: !3, line: 48, column: 2)
!325 = !DILocation(line: 49, column: 9, scope: !326)
!326 = distinct !DILexicalBlock(scope: !324, file: !3, line: 48, column: 40)
!327 = !DILocation(line: 50, column: 7, scope: !328)
!328 = distinct !DILexicalBlock(scope: !326, file: !3, line: 50, column: 7)
!329 = !DILocation(line: 50, column: 10, scope: !328)
!330 = !DILocation(line: 50, column: 7, scope: !326)
!331 = !DILocation(line: 51, column: 9, scope: !332)
!332 = distinct !DILexicalBlock(scope: !333, file: !3, line: 51, column: 8)
!333 = distinct !DILexicalBlock(scope: !328, file: !3, line: 50, column: 18)
!334 = !DILocation(line: 51, column: 16, scope: !332)
!335 = !DILocation(line: 51, column: 26, scope: !332)
!336 = !DILocation(line: 51, column: 29, scope: !332)
!337 = !DILocation(line: 51, column: 37, scope: !332)
!338 = !DILocation(line: 51, column: 19, scope: !332)
!339 = !DILocation(line: 51, column: 8, scope: !333)
!340 = !DILocation(line: 52, column: 5, scope: !332)
!341 = !DILocation(line: 53, column: 10, scope: !333)
!342 = !DILocation(line: 54, column: 3, scope: !333)
!343 = !DILocation(line: 55, column: 7, scope: !344)
!344 = distinct !DILexicalBlock(scope: !326, file: !3, line: 55, column: 7)
!345 = !DILocation(line: 55, column: 10, scope: !344)
!346 = !DILocation(line: 55, column: 7, scope: !326)
!347 = !DILocation(line: 56, column: 9, scope: !348)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 56, column: 8)
!349 = distinct !DILexicalBlock(scope: !344, file: !3, line: 55, column: 18)
!350 = !DILocation(line: 56, column: 16, scope: !348)
!351 = !DILocation(line: 56, column: 26, scope: !348)
!352 = !DILocation(line: 56, column: 29, scope: !348)
!353 = !DILocation(line: 56, column: 37, scope: !348)
!354 = !DILocation(line: 56, column: 19, scope: !348)
!355 = !DILocation(line: 56, column: 8, scope: !349)
!356 = !DILocation(line: 57, column: 5, scope: !348)
!357 = !DILocation(line: 58, column: 10, scope: !349)
!358 = !DILocation(line: 59, column: 3, scope: !349)
!359 = !DILocation(line: 61, column: 7, scope: !360)
!360 = distinct !DILexicalBlock(scope: !326, file: !3, line: 61, column: 7)
!361 = !DILocation(line: 61, column: 15, scope: !360)
!362 = !DILocation(line: 61, column: 13, scope: !360)
!363 = !DILocation(line: 61, column: 7, scope: !326)
!364 = !DILocation(line: 62, column: 9, scope: !365)
!365 = distinct !DILexicalBlock(scope: !360, file: !3, line: 61, column: 27)
!366 = !DILocation(line: 62, column: 7, scope: !365)
!367 = !DILocation(line: 63, column: 8, scope: !368)
!368 = distinct !DILexicalBlock(scope: !365, file: !3, line: 63, column: 8)
!369 = !DILocation(line: 63, column: 17, scope: !368)
!370 = !DILocation(line: 63, column: 14, scope: !368)
!371 = !DILocation(line: 63, column: 8, scope: !365)
!372 = !DILocation(line: 64, column: 18, scope: !368)
!373 = !DILocation(line: 64, column: 16, scope: !368)
!374 = !DILocation(line: 64, column: 5, scope: !368)
!375 = !DILocation(line: 66, column: 5, scope: !368)
!376 = !DILocation(line: 67, column: 3, scope: !365)
!377 = !DILocation(line: 68, column: 2, scope: !326)
!378 = !DILocalVariable(name: "__mptr", scope: !379, file: !3, line: 48, type: !65)
!379 = distinct !DILexicalBlock(scope: !324, file: !3, line: 48, column: 2)
!380 = !DILocation(line: 48, column: 2, scope: !379)
!381 = !DILocation(line: 48, column: 2, scope: !382)
!382 = distinct !DILexicalBlock(scope: !379, file: !3, line: 48, column: 2)
!383 = distinct !{!383, !322, !384}
!384 = !DILocation(line: 68, column: 2, scope: !318)
!385 = !DILocation(line: 69, column: 9, scope: !286)
!386 = !DILocation(line: 69, column: 2, scope: !286)
!387 = distinct !DISubprogram(name: "clk_get_sys", scope: !3, file: !3, line: 94, type: !388, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !243)
!388 = !DISubroutineType(types: !389)
!389 = !{!82, !77, !77}
!390 = !DILocalVariable(name: "dev_id", arg: 1, scope: !387, file: !3, line: 94, type: !77)
!391 = !DILocation(line: 94, column: 37, scope: !387)
!392 = !DILocalVariable(name: "con_id", arg: 2, scope: !387, file: !3, line: 94, type: !77)
!393 = !DILocation(line: 94, column: 57, scope: !387)
!394 = !DILocation(line: 96, column: 29, scope: !387)
!395 = !DILocation(line: 96, column: 37, scope: !387)
!396 = !DILocation(line: 96, column: 9, scope: !387)
!397 = !DILocation(line: 96, column: 2, scope: !387)
!398 = distinct !DISubprogram(name: "__clk_get_sys", scope: !3, file: !3, line: 86, type: !399, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !243)
!399 = !DISubroutineType(types: !400)
!400 = !{!82, !401, !77, !77}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !403)
!403 = !{!404, !1853, !1854, !1857, !1858, !1909, !2006, !2007, !2008, !2009, !2010, !2019, !2124, !2137, !2140, !2141, !2145, !2147, !2148, !2149, !2153, !2159, !2160, !2163, !2278, !2279, !2282, !2283, !2284, !2285, !2317, !2318, !2319, !2322, !2325, !2326, !2327, !2328}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !402, file: !30, line: 462, baseType: !405, size: 512)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !406, line: 64, size: 512, elements: !407)
!406 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!407 = !{!408, !409, !410, !412, !457, !1691, !1843, !1848, !1849, !1850, !1851, !1852}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !406, line: 65, baseType: !77, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !405, file: !406, line: 66, baseType: !71, size: 128, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !405, file: !406, line: 67, baseType: !411, size: 64, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !405, file: !406, line: 68, baseType: !413, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !406, line: 192, size: 704, elements: !415)
!415 = !{!416, !417, !418, !419}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !414, file: !406, line: 193, baseType: !71, size: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !414, file: !406, line: 194, baseType: !229, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !414, file: !406, line: 195, baseType: !405, size: 512, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !414, file: !406, line: 196, baseType: !420, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !406, line: 156, size: 192, elements: !423)
!423 = !{!424, !429, !434}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !422, file: !406, line: 157, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!109, !413, !411}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !406, line: 158, baseType: !430, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!77, !413, !411}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !422, file: !406, line: 159, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!109, !413, !411, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !406, line: 148, size: 20736, elements: !441)
!441 = !{!442, !447, !451, !452, !456}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !440, file: !406, line: 149, baseType: !443, size: 192)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 192, elements: !445)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!445 = !{!446}
!446 = !DISubrange(count: 3)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !440, file: !406, line: 150, baseType: !448, size: 4096, offset: 192)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 4096, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !440, file: !406, line: 151, baseType: !109, size: 32, offset: 4288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !440, file: !406, line: 152, baseType: !453, size: 16384, offset: 4320)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 16384, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 2048)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !440, file: !406, line: 153, baseType: !109, size: 32, offset: 20704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !405, file: !406, line: 69, baseType: !458, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !406, line: 138, size: 448, elements: !460)
!460 = !{!461, !465, !493, !495, !1637, !1670, !1674}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !459, file: !406, line: 139, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !411}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !459, file: !406, line: 140, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !469, line: 230, size: 128, elements: !470)
!469 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!470 = !{!471, !486}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !468, file: !469, line: 231, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!475, !411, !479, !444}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !64, line: 60, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !477, line: 73, baseType: !478)
!477 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !477, line: 15, baseType: !131)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !469, line: 30, size: 128, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !480, file: !469, line: 31, baseType: !77, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !480, file: !469, line: 32, baseType: !484, size: 16, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !64, line: 19, baseType: !485)
!485 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !468, file: !469, line: 232, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!475, !411, !479, !77, !490}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 55, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !477, line: 72, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !477, line: 16, baseType: !126)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !459, file: !406, line: 141, baseType: !494, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !459, file: !406, line: 142, baseType: !496, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !469, line: 84, size: 320, elements: !500)
!500 = !{!501, !502, !506, !1634, !1635}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !499, file: !469, line: 85, baseType: !77, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !499, file: !469, line: 86, baseType: !503, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DISubroutineType(types: !505)
!505 = !{!484, !411, !479, !109}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !499, file: !469, line: 88, baseType: !507, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{!484, !411, !510, !109}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !469, line: 168, size: 448, elements: !512)
!512 = !{!513, !514, !515, !516, !525, !526}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !511, file: !469, line: 169, baseType: !480, size: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !511, file: !469, line: 170, baseType: !490, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !511, file: !469, line: 171, baseType: !65, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !511, file: !469, line: 172, baseType: !517, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!475, !520, !411, !510, !444, !523, !490}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !522, line: 526, flags: DIFlagFwdDecl)
!522 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !64, line: 46, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !477, line: 88, baseType: !227)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !511, file: !469, line: 174, baseType: !517, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !511, file: !469, line: 176, baseType: !527, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!109, !520, !411, !510, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !532, line: 305, size: 1472, elements: !533)
!532 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!533 = !{!534, !535, !536, !537, !538, !546, !547, !1608, !1614, !1615, !1620, !1621, !1624, !1628, !1629, !1630, !1631, !1632}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !531, file: !532, line: 308, baseType: !126, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !531, file: !532, line: 309, baseType: !126, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !531, file: !532, line: 313, baseType: !530, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !531, file: !532, line: 313, baseType: !530, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !531, file: !532, line: 315, baseType: !539, size: 192, align: 64, offset: 256)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !540, line: 24, size: 192, align: 64, elements: !541)
!540 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!541 = !{!542, !543, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !539, file: !540, line: 25, baseType: !126, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !539, file: !540, line: 26, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !539, file: !540, line: 27, baseType: !544, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !531, file: !532, line: 323, baseType: !126, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !531, file: !532, line: 327, baseType: !548, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !532, line: 388, size: 7296, elements: !550)
!550 = !{!551, !1604}
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !532, line: 389, baseType: !552, size: 7296)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !549, file: !532, line: 389, size: 7296, elements: !553)
!553 = !{!554, !555, !559, !563, !567, !568, !569, !570, !571, !579, !584, !585, !586, !587, !588, !589, !590, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !625, !633, !636, !678, !679, !1574, !1575, !1578, !1582, !1583, !1586, !1587, !1588, !1591, !1603}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !552, file: !532, line: 390, baseType: !530, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !552, file: !532, line: 391, baseType: !556, size: 64, offset: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !540, line: 31, size: 64, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !556, file: !540, line: 32, baseType: !544, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !552, file: !532, line: 392, baseType: !560, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !150, line: 23, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !152, line: 31, baseType: !562)
!562 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !552, file: !532, line: 394, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{!126, !520, !126, !126, !126, !126}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !552, file: !532, line: 398, baseType: !126, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !552, file: !532, line: 399, baseType: !126, size: 64, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !552, file: !532, line: 405, baseType: !126, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !552, file: !532, line: 406, baseType: !126, size: 64, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !552, file: !532, line: 407, baseType: !572, size: 64, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !522, line: 286, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 286, size: 64, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !574, file: !522, line: 286, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !578, line: 18, baseType: !126)
!578 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!579 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !552, file: !532, line: 416, baseType: !580, size: 32, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !64, line: 168, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 166, size: 32, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !581, file: !64, line: 167, baseType: !109, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !552, file: !532, line: 428, baseType: !580, size: 32, offset: 608)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !552, file: !532, line: 437, baseType: !580, size: 32, offset: 640)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !552, file: !532, line: 447, baseType: !580, size: 32, offset: 672)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !552, file: !532, line: 450, baseType: !219, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !552, file: !532, line: 452, baseType: !109, size: 32, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !552, file: !532, line: 454, baseType: !229, offset: 800)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !552, file: !532, line: 457, baseType: !591, size: 256, offset: 832)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !592, line: 35, size: 256, elements: !593)
!592 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!593 = !{!594, !595, !596, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !591, file: !592, line: 36, baseType: !219, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !591, file: !592, line: 42, baseType: !219, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !591, file: !592, line: 46, baseType: !597, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !230, line: 29, baseType: !237)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !591, file: !592, line: 47, baseType: !71, size: 128, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !552, file: !532, line: 459, baseType: !71, size: 128, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !552, file: !532, line: 466, baseType: !126, size: 64, offset: 1216)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !552, file: !532, line: 467, baseType: !126, size: 64, offset: 1280)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !552, file: !532, line: 469, baseType: !126, size: 64, offset: 1344)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !552, file: !532, line: 470, baseType: !126, size: 64, offset: 1408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !552, file: !532, line: 471, baseType: !221, size: 64, offset: 1472)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !552, file: !532, line: 472, baseType: !126, size: 64, offset: 1536)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !552, file: !532, line: 473, baseType: !126, size: 64, offset: 1600)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !552, file: !532, line: 474, baseType: !126, size: 64, offset: 1664)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !552, file: !532, line: 475, baseType: !126, size: 64, offset: 1728)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !552, file: !532, line: 477, baseType: !229, offset: 1792)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !552, file: !532, line: 478, baseType: !126, size: 64, offset: 1792)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !552, file: !532, line: 478, baseType: !126, size: 64, offset: 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !552, file: !532, line: 478, baseType: !126, size: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !552, file: !532, line: 478, baseType: !126, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !552, file: !532, line: 479, baseType: !126, size: 64, offset: 2048)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !552, file: !532, line: 479, baseType: !126, size: 64, offset: 2112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !552, file: !532, line: 479, baseType: !126, size: 64, offset: 2176)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !552, file: !532, line: 480, baseType: !126, size: 64, offset: 2240)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !552, file: !532, line: 480, baseType: !126, size: 64, offset: 2304)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !552, file: !532, line: 480, baseType: !126, size: 64, offset: 2368)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !552, file: !532, line: 480, baseType: !126, size: 64, offset: 2432)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !552, file: !532, line: 482, baseType: !622, size: 2816, offset: 2496)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2816, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 44)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !552, file: !532, line: 488, baseType: !626, size: 256, offset: 5312)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !627, line: 60, size: 256, elements: !628)
!627 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !626, file: !627, line: 61, baseType: !630, size: 256)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 256, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 4)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !552, file: !532, line: 490, baseType: !634, size: 64, offset: 5568)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !532, line: 490, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !552, file: !532, line: 493, baseType: !637, size: 896, offset: 5632)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !638, line: 53, baseType: !639)
!638 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 13, size: 896, elements: !640)
!640 = !{!641, !642, !643, !644, !647, !648, !649, !650, !670, !671, !674}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !639, file: !638, line: 18, baseType: !560, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !639, file: !638, line: 28, baseType: !221, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !639, file: !638, line: 31, baseType: !591, size: 256, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !639, file: !638, line: 32, baseType: !645, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !638, line: 32, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !639, file: !638, line: 37, baseType: !485, size: 16, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !639, file: !638, line: 40, baseType: !215, size: 192, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !639, file: !638, line: 41, baseType: !65, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !639, file: !638, line: 42, baseType: !651, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !654, line: 13, size: 896, elements: !655)
!654 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !653, file: !654, line: 14, baseType: !65, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !653, file: !654, line: 15, baseType: !126, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !653, file: !654, line: 17, baseType: !126, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !653, file: !654, line: 17, baseType: !126, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !653, file: !654, line: 19, baseType: !131, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !653, file: !654, line: 21, baseType: !131, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !653, file: !654, line: 22, baseType: !131, size: 64, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !653, file: !654, line: 23, baseType: !131, size: 64, offset: 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !653, file: !654, line: 24, baseType: !131, size: 64, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !653, file: !654, line: 25, baseType: !131, size: 64, offset: 576)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !653, file: !654, line: 26, baseType: !131, size: 64, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !653, file: !654, line: 27, baseType: !131, size: 64, offset: 704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !653, file: !654, line: 28, baseType: !131, size: 64, offset: 768)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !653, file: !654, line: 29, baseType: !131, size: 64, offset: 832)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !639, file: !638, line: 44, baseType: !580, size: 32, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !639, file: !638, line: 50, baseType: !672, size: 16, offset: 864)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !150, line: 19, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !152, line: 24, baseType: !485)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !639, file: !638, line: 51, baseType: !675, size: 16, offset: 880)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !150, line: 18, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !152, line: 23, baseType: !677)
!677 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !552, file: !532, line: 495, baseType: !126, size: 64, offset: 6528)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !552, file: !532, line: 497, baseType: !680, size: 64, offset: 6592)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !532, line: 381, size: 384, elements: !682)
!682 = !{!683, !684, !1573}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !681, file: !532, line: 382, baseType: !580, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !681, file: !532, line: 383, baseType: !685, size: 128, offset: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !532, line: 376, size: 128, elements: !686)
!686 = !{!687, !1571}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !685, file: !532, line: 377, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !690, line: 640, size: 48640, elements: !691)
!690 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!691 = !{!692, !700, !702, !703, !709, !710, !711, !712, !713, !714, !715, !716, !720, !738, !749, !841, !842, !843, !854, !855, !857, !858, !859, !860, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !939, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !995, !997, !998, !999, !1011, !1013, !1014, !1015, !1016, !1017, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1041, !1046, !1051, !1052, !1053, !1056, !1060, !1063, !1066, !1069, !1072, !1076, !1079, !1082, !1088, !1089, !1090, !1096, !1097, !1098, !1099, !1100, !1109, !1110, !1111, !1112, !1113, !1118, !1119, !1120, !1123, !1124, !1127, !1130, !1133, !1136, !1139, !1142, !1143, !1223, !1226, !1229, !1230, !1233, !1234, !1235, !1241, !1242, !1243, !1256, !1257, !1258, !1270, !1275, !1278, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !689, file: !690, line: 646, baseType: !693, size: 128)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !694, line: 56, size: 128, elements: !695)
!694 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !694, line: 57, baseType: !126, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !693, file: !694, line: 58, baseType: !698, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !150, line: 21, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !152, line: 27, baseType: !7)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !689, file: !690, line: 649, baseType: !701, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !689, file: !690, line: 657, baseType: !65, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !689, file: !690, line: 658, baseType: !704, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !705, line: 113, baseType: !706)
!705 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !705, line: 111, size: 32, elements: !707)
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !706, file: !705, line: 112, baseType: !580, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !689, file: !690, line: 660, baseType: !7, size: 32, offset: 288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !689, file: !690, line: 661, baseType: !7, size: 32, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !689, file: !690, line: 684, baseType: !109, size: 32, offset: 352)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !689, file: !690, line: 686, baseType: !109, size: 32, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !689, file: !690, line: 687, baseType: !109, size: 32, offset: 416)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !689, file: !690, line: 688, baseType: !109, size: 32, offset: 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !689, file: !690, line: 689, baseType: !7, size: 32, offset: 480)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !689, file: !690, line: 691, baseType: !717, size: 64, offset: 512)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !690, line: 691, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !689, file: !690, line: 692, baseType: !721, size: 832, offset: 576)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !690, line: 451, size: 832, elements: !722)
!722 = !{!723, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !721, file: !690, line: 453, baseType: !724, size: 128)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !690, line: 325, size: 128, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !724, file: !690, line: 326, baseType: !126, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !724, file: !690, line: 327, baseType: !698, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !721, file: !690, line: 454, baseType: !539, size: 192, align: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !721, file: !690, line: 455, baseType: !71, size: 128, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !721, file: !690, line: 456, baseType: !7, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !721, file: !690, line: 458, baseType: !560, size: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !721, file: !690, line: 459, baseType: !560, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !721, file: !690, line: 460, baseType: !560, size: 64, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !721, file: !690, line: 461, baseType: !560, size: 64, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !721, file: !690, line: 463, baseType: !560, size: 64, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !721, file: !690, line: 465, baseType: !737, offset: 832)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !690, line: 415, elements: !243)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !689, file: !690, line: 693, baseType: !739, size: 384, offset: 1408)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !690, line: 489, size: 384, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !739, file: !690, line: 490, baseType: !71, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !739, file: !690, line: 491, baseType: !126, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !739, file: !690, line: 492, baseType: !126, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !739, file: !690, line: 493, baseType: !7, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !739, file: !690, line: 494, baseType: !485, size: 16, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !739, file: !690, line: 495, baseType: !485, size: 16, offset: 304)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !739, file: !690, line: 497, baseType: !748, size: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !689, file: !690, line: 697, baseType: !750, size: 1792, offset: 1792)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !690, line: 507, size: 1792, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !838, !839}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !750, file: !690, line: 508, baseType: !539, size: 192, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !750, file: !690, line: 515, baseType: !560, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !750, file: !690, line: 516, baseType: !560, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !750, file: !690, line: 517, baseType: !560, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !750, file: !690, line: 518, baseType: !560, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !750, file: !690, line: 519, baseType: !560, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !750, file: !690, line: 526, baseType: !225, size: 64, offset: 512)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !750, file: !690, line: 527, baseType: !560, size: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !750, file: !690, line: 528, baseType: !7, size: 32, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !750, file: !690, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !750, file: !690, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !750, file: !690, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !750, file: !690, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !750, file: !690, line: 563, baseType: !766, size: 512, offset: 704)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !767)
!767 = !{!768, !776, !777, !782, !834, !835, !836, !837}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !766, file: !6, line: 119, baseType: !769, size: 256)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !770, line: 9, size: 256, elements: !771)
!770 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !769, file: !770, line: 10, baseType: !539, size: 192, align: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !769, file: !770, line: 11, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !775, line: 29, baseType: !225)
!775 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !766, file: !6, line: 120, baseType: !774, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !766, file: !6, line: 121, baseType: !778, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!5, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !766, file: !6, line: 122, baseType: !783, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !785)
!785 = !{!786, !806, !807, !810, !820, !821, !829, !833}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !784, file: !6, line: 160, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !788, file: !6, line: 215, baseType: !597)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !788, file: !6, line: 216, baseType: !7, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !788, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !788, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !788, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !788, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !788, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !788, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !788, file: !6, line: 233, baseType: !774, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !788, file: !6, line: 234, baseType: !781, size: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !788, file: !6, line: 235, baseType: !774, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !788, file: !6, line: 236, baseType: !781, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !788, file: !6, line: 237, baseType: !803, size: 4096, offset: 512)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 4096, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !784, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !784, file: !6, line: 162, baseType: !808, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !64, line: 27, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !477, line: 96, baseType: !109)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !784, file: !6, line: 163, baseType: !811, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !812, line: 276, baseType: !813)
!812 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !812, line: 276, size: 32, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !813, file: !812, line: 276, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !812, line: 70, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !812, line: 65, size: 32, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !817, file: !812, line: 66, baseType: !7, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !784, file: !6, line: 164, baseType: !781, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !784, file: !6, line: 165, baseType: !822, size: 128, offset: 256)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !770, line: 14, size: 128, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !822, file: !770, line: 15, baseType: !825, size: 128)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !540, line: 125, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !825, file: !540, line: 126, baseType: !556, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !825, file: !540, line: 127, baseType: !544, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !784, file: !6, line: 166, baseType: !830, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!774}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !784, file: !6, line: 167, baseType: !774, size: 64, offset: 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !766, file: !6, line: 123, baseType: !149, size: 8, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !766, file: !6, line: 124, baseType: !149, size: 8, offset: 456)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !766, file: !6, line: 125, baseType: !149, size: 8, offset: 464)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !766, file: !6, line: 126, baseType: !149, size: 8, offset: 472)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !750, file: !690, line: 572, baseType: !766, size: 512, offset: 1216)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !750, file: !690, line: 580, baseType: !840, size: 64, offset: 1728)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !689, file: !690, line: 721, baseType: !7, size: 32, offset: 3584)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !689, file: !690, line: 722, baseType: !109, size: 32, offset: 3616)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !689, file: !690, line: 723, baseType: !844, size: 64, offset: 3648)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !847, line: 17, baseType: !848)
!847 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !847, line: 17, size: 64, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !848, file: !847, line: 17, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 1)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !689, file: !690, line: 724, baseType: !846, size: 64, offset: 3712)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !689, file: !690, line: 749, baseType: !856, offset: 3776)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !690, line: 290, elements: !243)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !689, file: !690, line: 751, baseType: !71, size: 128, offset: 3776)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !689, file: !690, line: 757, baseType: !548, size: 64, offset: 3904)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !689, file: !690, line: 758, baseType: !548, size: 64, offset: 3968)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !689, file: !690, line: 761, baseType: !861, size: 320, offset: 4032)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !627, line: 34, size: 320, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !861, file: !627, line: 35, baseType: !560, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !861, file: !627, line: 36, baseType: !865, size: 256, offset: 64)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 256, elements: !631)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !689, file: !690, line: 766, baseType: !109, size: 32, offset: 4352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !689, file: !690, line: 767, baseType: !109, size: 32, offset: 4384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !689, file: !690, line: 768, baseType: !109, size: 32, offset: 4416)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !689, file: !690, line: 770, baseType: !109, size: 32, offset: 4448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !689, file: !690, line: 772, baseType: !126, size: 64, offset: 4480)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !689, file: !690, line: 775, baseType: !7, size: 32, offset: 4544)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !689, file: !690, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !689, file: !690, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !689, file: !690, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !689, file: !690, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !689, file: !690, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !689, file: !690, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !689, file: !690, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !689, file: !690, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !689, file: !690, line: 831, baseType: !126, size: 64, offset: 4672)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !689, file: !690, line: 833, baseType: !882, size: 384, offset: 4736)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !883)
!883 = !{!884, !889}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !882, file: !12, line: 26, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!131, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, scope: !882, file: !12, line: 27, baseType: !890, size: 320, offset: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !882, file: !12, line: 27, size: 320, elements: !891)
!891 = !{!892, !902, !929}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !890, file: !12, line: 36, baseType: !893, size: 320)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !12, line: 29, size: 320, elements: !894)
!894 = !{!895, !897, !898, !899, !900, !901}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !893, file: !12, line: 30, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !893, file: !12, line: 31, baseType: !698, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !893, file: !12, line: 32, baseType: !698, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !893, file: !12, line: 33, baseType: !698, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !893, file: !12, line: 34, baseType: !560, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !893, file: !12, line: 35, baseType: !896, size: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !890, file: !12, line: 46, baseType: !903, size: 192)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !12, line: 38, size: 192, elements: !904)
!904 = !{!905, !906, !907, !928}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !903, file: !12, line: 39, baseType: !808, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, scope: !903, file: !12, line: 41, baseType: !908, size: 64, offset: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !903, file: !12, line: 41, size: 64, elements: !909)
!909 = !{!910, !918}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !908, file: !12, line: 42, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !913, line: 7, size: 128, elements: !914)
!913 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!914 = !{!915, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !912, file: !913, line: 8, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !477, line: 93, baseType: !227)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !912, file: !913, line: 9, baseType: !227, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !908, file: !12, line: 43, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !921, line: 7, size: 64, elements: !922)
!921 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!922 = !{!923, !927}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !920, file: !921, line: 8, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !921, line: 5, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !150, line: 20, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !152, line: 26, baseType: !109)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !920, file: !921, line: 9, baseType: !925, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !903, file: !12, line: 45, baseType: !560, size: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !890, file: !12, line: 54, baseType: !930, size: 256)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !12, line: 48, size: 256, elements: !931)
!931 = !{!932, !935, !936, !937, !938}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !930, file: !12, line: 49, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !930, file: !12, line: 50, baseType: !109, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !930, file: !12, line: 51, baseType: !109, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !930, file: !12, line: 52, baseType: !126, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !930, file: !12, line: 53, baseType: !126, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !689, file: !690, line: 835, baseType: !940, size: 32, offset: 5120)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !64, line: 22, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !477, line: 28, baseType: !109)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !689, file: !690, line: 836, baseType: !940, size: 32, offset: 5152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !689, file: !690, line: 840, baseType: !126, size: 64, offset: 5184)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !689, file: !690, line: 849, baseType: !688, size: 64, offset: 5248)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !689, file: !690, line: 852, baseType: !688, size: 64, offset: 5312)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !689, file: !690, line: 857, baseType: !71, size: 128, offset: 5376)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !689, file: !690, line: 858, baseType: !71, size: 128, offset: 5504)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !689, file: !690, line: 859, baseType: !688, size: 64, offset: 5632)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !689, file: !690, line: 867, baseType: !71, size: 128, offset: 5696)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !689, file: !690, line: 868, baseType: !71, size: 128, offset: 5824)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !689, file: !690, line: 871, baseType: !952, size: 64, offset: 5952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !954, line: 59, size: 768, elements: !955)
!954 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!955 = !{!956, !957, !958, !959, !970, !971, !978, !987}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !953, file: !954, line: 61, baseType: !704, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !953, file: !954, line: 62, baseType: !7, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !953, file: !954, line: 63, baseType: !229, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !953, file: !954, line: 65, baseType: !960, size: 256, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 256, elements: !631)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !64, line: 182, size: 64, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !961, file: !64, line: 183, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !64, line: 186, size: 128, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !965, file: !64, line: 187, baseType: !964, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !965, file: !64, line: 187, baseType: !969, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !953, file: !954, line: 66, baseType: !961, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !953, file: !954, line: 68, baseType: !972, size: 128, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !973, line: 40, baseType: !974)
!973 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !973, line: 36, size: 128, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !974, file: !973, line: 37, baseType: !229)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !974, file: !973, line: 38, baseType: !71, size: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !953, file: !954, line: 69, baseType: !979, size: 128, align: 64, offset: 512)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !64, line: 216, size: 128, align: 64, elements: !980)
!980 = !{!981, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !979, file: !64, line: 217, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !979, file: !64, line: 218, baseType: !984, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !982}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !953, file: !954, line: 70, baseType: !988, size: 128, offset: 640)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 128, elements: !852)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !954, line: 54, size: 128, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !989, file: !954, line: 55, baseType: !109, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !989, file: !954, line: 56, baseType: !993, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !954, line: 56, flags: DIFlagFwdDecl)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !689, file: !690, line: 872, baseType: !996, size: 512, offset: 6016)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 512, elements: !631)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !689, file: !690, line: 873, baseType: !71, size: 128, offset: 6528)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !689, file: !690, line: 874, baseType: !71, size: 128, offset: 6656)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !689, file: !690, line: 876, baseType: !1000, size: 64, offset: 6784)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !1002, line: 26, size: 192, elements: !1003)
!1002 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1001, file: !1002, line: 27, baseType: !7, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !1001, file: !1002, line: 28, baseType: !1006, size: 128, offset: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !1007, line: 43, size: 128, elements: !1008)
!1007 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1006, file: !1007, line: 44, baseType: !597)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !1006, file: !1007, line: 45, baseType: !71, size: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !689, file: !690, line: 879, baseType: !1012, size: 64, offset: 6848)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !689, file: !690, line: 882, baseType: !1012, size: 64, offset: 6912)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !689, file: !690, line: 884, baseType: !560, size: 64, offset: 6976)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !689, file: !690, line: 885, baseType: !560, size: 64, offset: 7040)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !689, file: !690, line: 890, baseType: !560, size: 64, offset: 7104)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !689, file: !690, line: 891, baseType: !1018, size: 128, offset: 7168)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !690, line: 242, size: 128, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !1018, file: !690, line: 244, baseType: !560, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !1018, file: !690, line: 245, baseType: !560, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1018, file: !690, line: 246, baseType: !597, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !689, file: !690, line: 900, baseType: !126, size: 64, offset: 7296)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !689, file: !690, line: 901, baseType: !126, size: 64, offset: 7360)
