; ModuleID = '../bcout/drivers/dma-buf/dma-fence-chain.llvm.bc'
source_filename = "drivers/dma-buf/dma-fence-chain.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dma_fence_ops = type { i8, i8* (%struct.dma_fence*)*, i8* (%struct.dma_fence*)*, i1 (%struct.dma_fence*)*, i1 (%struct.dma_fence*)*, i64 (%struct.dma_fence*, i1, i64)*, void (%struct.dma_fence*)*, void (%struct.dma_fence*, i8*, i32)*, void (%struct.dma_fence*, i8*, i32)* }
%struct.dma_fence = type { %struct.spinlock*, %struct.dma_fence_ops*, %union.anon.0, i64, i64, i64, %struct.kref, i32 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%union.anon.0 = type { %struct.list_head }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kref = type { %struct.refcount_struct }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.atomic_t = type { i32 }
%struct.dma_fence_chain = type { %struct.dma_fence, %struct.spinlock, %struct.dma_fence*, i64, %struct.dma_fence*, %struct.dma_fence_cb, %struct.irq_work }
%struct.dma_fence_cb = type { %struct.list_head, void (%struct.dma_fence*, %struct.dma_fence_cb*)* }
%struct.irq_work = type { %union.anon.1, void (%struct.irq_work*)* }
%union.anon.1 = type { %struct.__call_single_node }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dma_fence_chain_ops", scope: !2, file: !3, line: 210, type: !50, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !207, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/dma-buf/dma-fence-chain.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "refcount_saturation_type", file: !12, line: 119, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "REFCOUNT_ADD_NOT_ZERO_OVF", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "REFCOUNT_ADD_OVF", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "REFCOUNT_ADD_UAF", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "REFCOUNT_SUB_UAF", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "REFCOUNT_DEC_LEAK", value: 4, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dma_fence_flag_bits", file: !20, line: 98, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "./include/linux/dma-fence.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "DMA_FENCE_FLAG_SIGNALED_BIT", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "DMA_FENCE_FLAG_TIMESTAMP_BIT", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "DMA_FENCE_FLAG_ENABLE_SIGNAL_BIT", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "DMA_FENCE_FLAG_USER_BITS", value: 3, isUnsigned: true)
!26 = !{!27, !133, !135, !136, !28, !137, !139, !195, !197, !200, !201, !205, !206, !84, !203}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence", file: !20, line: 65, size: 512, elements: !30)
!30 = !{!31, !48, !86, !112, !116, !117, !119, !132}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !29, file: !20, line: 66, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !34, line: 83, baseType: !35)
!34 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !34, line: 71, elements: !36)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, scope: !35, file: !34, line: 72, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !35, file: !34, line: 72, elements: !39)
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !38, file: !34, line: 73, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !34, line: 20, elements: !42)
!42 = !{!43}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !41, file: !34, line: 21, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !45, line: 25, baseType: !46)
!45 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 25, elements: !47)
!47 = !{}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !29, file: !20, line: 67, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_ops", file: !20, line: 125, size: 576, elements: !52)
!52 = !{!53, !57, !64, !65, !69, !70, !75, !79, !85}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "use_64bit_seqno", scope: !51, file: !20, line: 132, baseType: !54, size: 8)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !55, line: 30, baseType: !56)
!55 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!56 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "get_driver_name", scope: !51, file: !20, line: 143, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !28}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "get_timeline_name", scope: !51, file: !20, line: 155, baseType: !58, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "enable_signaling", scope: !51, file: !20, line: 192, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DISubroutineType(types: !68)
!68 = !{!54, !28}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !51, file: !20, line: 209, baseType: !66, size: 64, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !51, file: !20, line: 231, baseType: !71, size: 64, offset: 320)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !28, !54, !74}
!74 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !51, file: !20, line: 242, baseType: !76, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !28}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fence_value_str", scope: !51, file: !20, line: 252, baseType: !80, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !28, !83, !84}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "timeline_value_str", scope: !51, file: !20, line: 262, baseType: !80, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !29, file: !20, line: 84, baseType: !87, size: 128, offset: 128)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !29, file: !20, line: 84, size: 128, elements: !88)
!88 = !{!89, !95, !103}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cb_list", scope: !87, file: !20, line: 85, baseType: !90, size: 128)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !55, line: 178, size: 128, elements: !91)
!91 = !{!92, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !55, line: 179, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !90, file: !55, line: 179, baseType: !93, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !87, file: !20, line: 87, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !97, line: 29, baseType: !98)
!97 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !99, line: 22, baseType: !100)
!99 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !101, line: 30, baseType: !102)
!101 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!102 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !87, file: !20, line: 89, baseType: !104, size: 128, align: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !55, line: 216, size: 128, align: 64, elements: !105)
!105 = !{!106, !108}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !104, file: !55, line: 217, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !104, file: !55, line: 218, baseType: !109, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !107}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !29, file: !20, line: 91, baseType: !113, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !99, line: 23, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !101, line: 31, baseType: !115)
!115 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !29, file: !20, line: 92, baseType: !113, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !29, file: !20, line: 93, baseType: !118, size: 64, offset: 384)
!118 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !29, file: !20, line: 94, baseType: !120, size: 32, offset: 448)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !121, line: 19, size: 32, elements: !122)
!121 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !120, file: !121, line: 20, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !12, line: 113, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !12, line: 111, size: 32, elements: !126)
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !125, file: !12, line: 112, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !55, line: 168, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 166, size: 32, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !129, file: !55, line: 167, baseType: !84, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !29, file: !20, line: 95, baseType: !84, size: 32, offset: 480)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !55, line: 37, baseType: !118)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_chain", file: !141, line: 26, size: 1088, elements: !142)
!141 = !DIFile(filename: "./include/linux/dma-fence-chain.h", directory: "/home/lizy2001/genbc/linux")
!142 = !{!143, !144, !145, !146, !147, !148, !158}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !140, file: !141, line: 27, baseType: !29, size: 512)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !140, file: !141, line: 28, baseType: !33, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !140, file: !141, line: 29, baseType: !28, size: 64, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seqno", scope: !140, file: !141, line: 30, baseType: !113, size: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "fence", scope: !140, file: !141, line: 31, baseType: !28, size: 64, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !140, file: !141, line: 32, baseType: !149, size: 192, offset: 704)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_cb", file: !20, line: 116, size: 192, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !149, file: !20, line: 117, baseType: !90, size: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !149, file: !20, line: 118, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_fence_func_t", file: !20, line: 105, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{null, !28, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !140, file: !141, line: 33, baseType: !159, size: 192, offset: 896)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irq_work", file: !160, line: 16, size: 192, elements: !161)
!160 = !DIFile(filename: "./include/linux/irq_work.h", directory: "/home/lizy2001/genbc/linux")
!161 = !{!162, !190}
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !160, line: 17, baseType: !163, size: 128)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !160, line: 17, size: 128, elements: !164)
!164 = !{!165, !185}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !163, file: !160, line: 18, baseType: !166, size: 128)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__call_single_node", file: !167, line: 58, size: 128, elements: !168)
!167 = !DIFile(filename: "./include/linux/smp_types.h", directory: "/home/lizy2001/genbc/linux")
!168 = !{!169, !175, !180, !184}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "llist", scope: !166, file: !167, line: 59, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !171, line: 58, size: 64, elements: !172)
!171 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !171, line: 59, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !167, line: 60, baseType: !176, size: 32, offset: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !167, line: 60, size: 32, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "u_flags", scope: !176, file: !167, line: 61, baseType: !7, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "a_flags", scope: !176, file: !167, line: 62, baseType: !128, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !166, file: !167, line: 65, baseType: !181, size: 16, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !99, line: 19, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !101, line: 24, baseType: !183)
!183 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !166, file: !167, line: 65, baseType: !181, size: 16, offset: 112)
!185 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !160, line: 19, baseType: !186, size: 128)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !163, file: !160, line: 19, size: 128, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "llnode", scope: !186, file: !160, line: 20, baseType: !170, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !160, line: 21, baseType: !128, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !159, file: !160, line: 24, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{null, !194}
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !84)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !99, line: 21, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !101, line: 27, baseType: !7)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!207 = !{!0}
!208 = !{i32 7, !"Dwarf Version", i32 4}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = !{i32 1, !"wchar_size", i32 2}
!211 = !{i32 1, !"Code Model", i32 2}
!212 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!213 = distinct !DISubprogram(name: "dma_fence_chain_walk", scope: !3, file: !3, line: 39, type: !214, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !47)
!214 = !DISubroutineType(types: !215)
!215 = !{!28, !28}
!216 = !DILocalVariable(name: "v", arg: 1, scope: !217, file: !218, line: 84, type: !221)
!217 = distinct !DISubprogram(name: "instrument_atomic_write", scope: !218, file: !218, line: 84, type: !219, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !47)
!218 = !DIFile(filename: "./include/linux/instrumented.h", directory: "/home/lizy2001/genbc/linux")
!219 = !DISubroutineType(types: !220)
!220 = !{null, !221, !224}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 55, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !226, line: 72, baseType: !227)
!226 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !226, line: 16, baseType: !118)
!228 = !DILocation(line: 84, column: 74, scope: !217, inlinedAt: !229)
!229 = distinct !DILocation(line: 65, column: 9, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 65, column: 9)
!231 = distinct !DILexicalBlock(scope: !213, file: !3, line: 50, column: 51)
!232 = !DILocalVariable(name: "size", arg: 2, scope: !217, file: !218, line: 84, type: !224)
!233 = !DILocation(line: 84, column: 84, scope: !217, inlinedAt: !229)
!234 = !DILocalVariable(name: "fence", arg: 1, scope: !213, file: !3, line: 39, type: !28)
!235 = !DILocation(line: 39, column: 58, scope: !213)
!236 = !DILocalVariable(name: "chain", scope: !213, file: !3, line: 41, type: !139)
!237 = !DILocation(line: 41, column: 26, scope: !213)
!238 = !DILocalVariable(name: "prev_chain", scope: !213, file: !3, line: 41, type: !139)
!239 = !DILocation(line: 41, column: 34, scope: !213)
!240 = !DILocalVariable(name: "prev", scope: !213, file: !3, line: 42, type: !28)
!241 = !DILocation(line: 42, column: 20, scope: !213)
!242 = !DILocalVariable(name: "replacement", scope: !213, file: !3, line: 42, type: !28)
