; ModuleID = '../bcout/drivers/dma-buf/dma-fence-array.llvm.bc'
source_filename = "drivers/dma-buf/dma-fence-array.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dma_fence = type { %struct.spinlock*, %struct.dma_fence_ops*, %union.anon.0, i64, i64, i64, %struct.kref, i32 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.dma_fence_ops = type { i8, {}*, {}*, i1 (%struct.dma_fence*)*, i1 (%struct.dma_fence*)*, i64 (%struct.dma_fence*, i1, i64)*, void (%struct.dma_fence*)*, void (%struct.dma_fence*, i8*, i32)*, void (%struct.dma_fence*, i8*, i32)* }
%union.anon.0 = type { %struct.list_head }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kref = type { %struct.refcount_struct }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.atomic_t = type { i32 }
%struct.kmem_cache = type opaque
%struct.dma_fence_array = type { %struct.dma_fence, %struct.spinlock, i32, %struct.atomic_t, %struct.dma_fence**, %struct.irq_work }
%struct.irq_work = type { %union.anon.1, void (%struct.irq_work*)* }
%union.anon.1 = type { %struct.__call_single_node }
%struct.__call_single_node = type { %struct.llist_node, %union.anon.2, i16, i16 }
%struct.llist_node = type { %struct.llist_node* }
%union.anon.2 = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dma_fence_array_ops", scope: !2, file: !3, line: 122, type: !71, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !26, globals: !204, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/dma-buf/dma-fence-array.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !19}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "refcount_saturation_type", file: !12, line: 119, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "REFCOUNT_ADD_NOT_ZERO_OVF", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "REFCOUNT_ADD_OVF", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "REFCOUNT_ADD_UAF", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "REFCOUNT_SUB_UAF", value: 3, isUnsigned: true)
!18 = !DIEnumerator(name: "REFCOUNT_DEC_LEAK", value: 4, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !20, line: 305, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!26 = !{!27, !29, !30, !196, !200, !150, !203}
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !28, line: 148, baseType: !7)
!28 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_array_cb", file: !32, line: 23, size: 256, elements: !33)
!32 = !DIFile(filename: "./include/linux/dma-fence-array.h", directory: "/home/lizy2001/genbc/linux")
!33 = !{!34, !149}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !31, file: !32, line: 24, baseType: !35, size: 192)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_cb", file: !36, line: 116, size: 192, elements: !37)
!36 = !DIFile(filename: "./include/linux/dma-fence.h", directory: "/home/lizy2001/genbc/linux")
!37 = !{!38, !44}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !35, file: !36, line: 117, baseType: !39, size: 128)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !28, line: 178, size: 128, elements: !40)
!40 = !{!41, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !39, file: !28, line: 179, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !39, file: !28, line: 179, baseType: !42, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !35, file: !36, line: 118, baseType: !45, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_fence_func_t", file: !36, line: 105, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49, !148}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence", file: !36, line: 65, size: 512, elements: !51)
!51 = !{!52, !69, !106, !127, !131, !132, !134, !147}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !50, file: !36, line: 66, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !55, line: 83, baseType: !56)
!55 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !55, line: 71, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, scope: !56, file: !55, line: 72, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !56, file: !55, line: 72, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !59, file: !55, line: 73, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !55, line: 20, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !62, file: !55, line: 21, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !66, line: 25, baseType: !67)
!66 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 25, elements: !68)
!68 = !{}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !50, file: !36, line: 67, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_ops", file: !36, line: 125, size: 576, elements: !73)
!73 = !{!74, !77, !84, !85, !89, !90, !95, !99, !105}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "use_64bit_seqno", scope: !72, file: !36, line: 132, baseType: !75, size: 8)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !28, line: 30, baseType: !76)
!76 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "get_driver_name", scope: !72, file: !36, line: 143, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !49}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "get_timeline_name", scope: !72, file: !36, line: 155, baseType: !78, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "enable_signaling", scope: !72, file: !36, line: 192, baseType: !86, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!75, !49}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !72, file: !36, line: 209, baseType: !86, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !72, file: !36, line: 231, baseType: !91, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !49, !75, !94}
!94 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !72, file: !36, line: 242, baseType: !96, size: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !49}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fence_value_str", scope: !72, file: !36, line: 252, baseType: !100, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !49, !103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "timeline_value_str", scope: !72, file: !36, line: 262, baseType: !100, size: 64, offset: 512)
!106 = !DIDerivedType(tag: DW_TAG_member, scope: !50, file: !36, line: 84, baseType: !107, size: 128, offset: 128)
!107 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !36, line: 84, size: 128, elements: !108)
!108 = !{!109, !110, !118}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "cb_list", scope: !107, file: !36, line: 85, baseType: !39, size: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !107, file: !36, line: 87, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !112, line: 29, baseType: !113)
!112 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !114, line: 22, baseType: !115)
!114 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !116, line: 30, baseType: !117)
!116 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!117 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !107, file: !36, line: 89, baseType: !119, size: 128, align: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !28, line: 216, size: 128, align: 64, elements: !120)
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !119, file: !28, line: 217, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !119, file: !28, line: 218, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !122}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !50, file: !36, line: 91, baseType: !128, size: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !114, line: 23, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !116, line: 31, baseType: !130)
!130 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "seqno", scope: !50, file: !36, line: 92, baseType: !128, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !36, line: 93, baseType: !133, size: 64, offset: 384)
!133 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !50, file: !36, line: 94, baseType: !135, size: 32, offset: 448)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !136, line: 19, size: 32, elements: !137)
!136 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !135, file: !136, line: 20, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !12, line: 113, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !12, line: 111, size: 32, elements: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !140, file: !12, line: 112, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !28, line: 168, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 166, size: 32, elements: !145)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !144, file: !28, line: 167, baseType: !104, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !50, file: !36, line: 95, baseType: !104, size: 32, offset: 480)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "array", scope: !31, file: !32, line: 25, baseType: !150, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_fence_array", file: !32, line: 37, size: 832, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !151, file: !32, line: 38, baseType: !50, size: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !151, file: !32, line: 40, baseType: !54, offset: 512)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "num_fences", scope: !151, file: !32, line: 41, baseType: !7, size: 32, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "num_pending", scope: !151, file: !32, line: 42, baseType: !143, size: 32, offset: 544)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fences", scope: !151, file: !32, line: 43, baseType: !158, size: 64, offset: 576)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !151, file: !32, line: 45, baseType: !160, size: 192, offset: 640)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irq_work", file: !161, line: 16, size: 192, elements: !162)
!161 = !DIFile(filename: "./include/linux/irq_work.h", directory: "/home/lizy2001/genbc/linux")
!162 = !{!163, !191}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !161, line: 17, baseType: !164, size: 128)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !160, file: !161, line: 17, size: 128, elements: !165)
!165 = !{!166, !186}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !164, file: !161, line: 18, baseType: !167, size: 128)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__call_single_node", file: !168, line: 58, size: 128, elements: !169)
!168 = !DIFile(filename: "./include/linux/smp_types.h", directory: "/home/lizy2001/genbc/linux")
!169 = !{!170, !176, !181, !185}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "llist", scope: !167, file: !168, line: 59, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !172, line: 58, size: 64, elements: !173)
!172 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !172, line: 59, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !167, file: !168, line: 60, baseType: !177, size: 32, offset: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !167, file: !168, line: 60, size: 32, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "u_flags", scope: !177, file: !168, line: 61, baseType: !7, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "a_flags", scope: !177, file: !168, line: 62, baseType: !143, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !167, file: !168, line: 65, baseType: !182, size: 16, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !114, line: 19, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !116, line: 24, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !167, file: !168, line: 65, baseType: !182, size: 16, offset: 112)
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !164, file: !161, line: 19, baseType: !187, size: 128)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !164, file: !161, line: 19, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "llnode", scope: !187, file: !161, line: 20, baseType: !171, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !161, line: 21, baseType: !143, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !160, file: !161, line: 24, baseType: !192, size: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !114, line: 21, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !116, line: 27, baseType: !7)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!204 = !{!0}
!205 = !{i32 7, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{i32 1, !"wchar_size", i32 2}
!208 = !{i32 1, !"Code Model", i32 2}
!209 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!210 = distinct !DISubprogram(name: "dma_fence_array_get_driver_name", scope: !3, file: !3, line: 18, type: !79, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !68)
!211 = !DILocalVariable(name: "fence", arg: 1, scope: !210, file: !3, line: 18, type: !49)
!212 = !DILocation(line: 18, column: 70, scope: !210)
!213 = !DILocation(line: 20, column: 2, scope: !210)
!214 = distinct !DISubprogram(name: "dma_fence_array_get_timeline_name", scope: !3, file: !3, line: 23, type: !79, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !68)
!215 = !DILocalVariable(name: "fence", arg: 1, scope: !214, file: !3, line: 23, type: !49)
!216 = !DILocation(line: 23, column: 72, scope: !214)
!217 = !DILocation(line: 25, column: 2, scope: !214)
!218 = distinct !DISubprogram(name: "dma_fence_array_enable_signaling", scope: !3, file: !3, line: 70, type: !87, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !68)
!219 = !DILocalVariable(name: "v", arg: 1, scope: !220, file: !221, line: 121, type: !224)
!220 = distinct !DISubprogram(name: "arch_atomic_dec_and_test", scope: !221, file: !221, line: 121, type: !222, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !68)
!221 = !DIFile(filename: "./arch/x86/include/asm/atomic.h", directory: "/home/lizy2001/genbc/linux")
!222 = !DISubroutineType(types: !223)
!223 = !{!75, !224}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!225 = !DILocation(line: 121, column: 64, scope: !220, inlinedAt: !226)
!226 = distinct !DILocation(line: 749, column: 9, scope: !227, inlinedAt: !229)
!227 = distinct !DISubprogram(name: "atomic_dec_and_test", scope: !228, file: !228, line: 746, type: !222, scopeLine: 747, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !68)
!228 = !DIFile(filename: "./include/asm-generic/atomic-instrumented.h", directory: "/home/lizy2001/genbc/linux")
!229 = distinct !DILocation(line: 93, column: 8, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 93, column: 8)
!231 = distinct !DILexicalBlock(scope: !232, file: !3, line: 88, column: 35)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 87, column: 7)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 76, column: 42)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 76, column: 2)
!235 = distinct !DILexicalBlock(scope: !218, file: !3, line: 76, column: 2)
!236 = !DILocalVariable(name: "c", scope: !237, file: !221, line: 123, type: !75)
