; ModuleID = '../bcout/drivers/mtd/chips/cfi_util.llvm.bc'
source_filename = "drivers/mtd/chips/cfi_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.map_info = type { i8*, i64, i64, i8*, i8*, i32, i32, i64 (%struct.map_info*, i64)*, void (%struct.map_info*, i8*, i64, i64)*, void (%struct.map_info*, i64, i64)*, void (%struct.map_info*, i64, i8*, i64)*, void (%struct.map_info*, i64, i64)*, void (%struct.map_info*, i32)*, i64, i64, i64, %struct.device_node*, i8*, %struct.mtd_chip_driver* }
%struct.device_node = type { i8*, i32, i8*, %struct.fwnode_handle, %struct.property*, %struct.property*, %struct.device_node*, %struct.device_node*, %struct.device_node*, %struct.kobject, i64, i8* }
%struct.fwnode_handle = type { %struct.fwnode_handle*, %struct.fwnode_operations*, %struct.device* }

!90 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !92, line: 24, baseType: !93)
!92 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !90, line: 29, baseType: !91)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !90, line: 32, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !92, line: 27, baseType: !7)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !90, line: 31, baseType: !96)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !99, line: 148, baseType: !7)
!99 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!103 = !{!0, !104}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license172", scope: !2, file: !3, line: 445, type: !106, isLocal: true, isDefinition: true, align: 8)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 168, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!109 = !{!110}
!110 = !DISubrange(count: 21)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 328, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 41)
!114 = !{i32 7, !"Dwarf Version", i32 4}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{i32 1, !"wchar_size", i32 2}
!117 = !{i32 1, !"Code Model", i32 2}
!118 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!119 = distinct !DISubprogram(name: "cfi_udelay", scope: !3, file: !3, line: 26, type: !120, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !123)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122}
!122 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!123 = !{}
!124 = !DILocalVariable(name: "us", arg: 1, scope: !119, file: !3, line: 26, type: !122)
!125 = !DILocation(line: 26, column: 21, scope: !119)
!126 = !DILocation(line: 28, column: 6, scope: !127)
!127 = distinct !DILexicalBlock(scope: !119, file: !3, line: 28, column: 6)
!128 = !DILocation(line: 28, column: 9, scope: !127)
!129 = !DILocation(line: 28, column: 6, scope: !119)
!130 = !DILocation(line: 29, column: 10, scope: !131)
!131 = distinct !DILexicalBlock(scope: !127, file: !3, line: 28, column: 18)
!132 = !DILocation(line: 29, column: 3, scope: !131)
!133 = !DILocation(line: 30, column: 2, scope: !131)
!134 = !DILocation(line: 31, column: 3, scope: !135)
!135 = distinct !DILexicalBlock(scope: !136, file: !3, line: 31, column: 3)
!136 = distinct !DILexicalBlock(scope: !137, file: !3, line: 31, column: 3)
!137 = distinct !DILexicalBlock(scope: !127, file: !3, line: 30, column: 9)
!138 = !DILocation(line: 31, column: 3, scope: !136)
!139 = !DILocation(line: 31, column: 3, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !3, line: 31, column: 3)
!141 = distinct !DILexicalBlock(scope: !135, file: !3, line: 31, column: 3)
!142 = !DILocation(line: 31, column: 3, scope: !141)
!143 = !DILocation(line: 31, column: 3, scope: !144)
!144 = distinct !DILexicalBlock(scope: !135, file: !3, line: 31, column: 3)
!145 = !DILocation(line: 32, column: 3, scope: !146)
!146 = distinct !DILexicalBlock(scope: !137, file: !3, line: 32, column: 3)
!147 = !DILocation(line: 34, column: 1, scope: !119)
!148 = distinct !DISubprogram(name: "___might_sleep", scope: !149, file: !149, line: 248, type: !150, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !123)
!149 = !DIFile(filename: "./include/linux/kernel.h", directory: "/home/lizy2001/genbc/linux")
!150 = !DISubroutineType(types: !151)
!151 = !{null, !152, !122, !122}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!153 = !DILocalVariable(name: "file", arg: 1, scope: !148, file: !149, line: 248, type: !152)
!154 = !DILocation(line: 248, column: 49, scope: !148)
!155 = !DILocalVariable(name: "line", arg: 2, scope: !148, file: !149, line: 248, type: !122)
!156 = !DILocation(line: 248, column: 59, scope: !148)
!157 = !DILocalVariable(name: "preempt_offset", arg: 3, scope: !148, file: !149, line: 249, type: !122)
!158 = !DILocation(line: 249, column: 12, scope: !148)
!159 = !DILocation(line: 249, column: 30, scope: !148)
!160 = distinct !DISubprogram(name: "cfi_build_cmd_addr", scope: !3, file: !3, line: 40, type: !161, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !123)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !163, !166, !2424}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !99, line: 104, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !165, line: 21, baseType: !96)
!165 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_info", file: !168, line: 191, size: 1152, elements: !169)
!168 = !DIFile(filename: "./include/linux/mtd/map.h", directory: "/home/lizy2001/genbc/linux")
!169 = !{!170, !171, !173, !179, !180, !181, !182, !183, !194, !203, !208, !214, !218, !222, !223, !224, !225, !2186, !2187}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !167, file: !168, line: 192, baseType: !152, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !168, line: 193, baseType: !172, size: 64, offset: 64)
!172 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !167, file: !168, line: 194, baseType: !174, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !99, line: 158, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !99, line: 153, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !165, line: 23, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !92, line: 31, baseType: !178)
!178 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "virt", scope: !167, file: !168, line: 197, baseType: !102, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !167, file: !168, line: 198, baseType: !102, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !167, file: !168, line: 200, baseType: !122, size: 32, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bankwidth", scope: !167, file: !168, line: 201, baseType: !122, size: 32, offset: 352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !167, file: !168, line: 207, baseType: !184, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !166, !172}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "map_word", file: !168, line: 171, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !168, line: 169, size: 64, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !188, file: !168, line: 170, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 1)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "copy_from", scope: !167, file: !168, line: 208, baseType: !195, size: 64, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{null, !166, !102, !172, !198}
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !99, line: 60, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !200, line: 73, baseType: !201)
!200 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !200, line: 15, baseType: !202)
!202 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !167, file: !168, line: 210, baseType: !204, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !166, !207, !172}
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to", scope: !167, file: !168, line: 211, baseType: !209, size: 64, offset: 576)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !166, !172, !212, !198}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "inval_cache", scope: !167, file: !168, line: 222, baseType: !215, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !166, !172, !198}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "set_vpp", scope: !167, file: !168, line: 229, baseType: !219, size: 64, offset: 704)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !166, !122}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pfow_base", scope: !167, file: !168, line: 231, baseType: !172, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "map_priv_1", scope: !167, file: !168, line: 232, baseType: !172, size: 64, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "map_priv_2", scope: !167, file: !168, line: 233, baseType: !172, size: 64, offset: 896)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !167, file: !168, line: 234, baseType: !226, size: 64, offset: 960)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !228, line: 51, size: 1344, elements: !229)
!228 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!229 = !{!230, !231, !233, !234, !2170, !2179, !2180, !2181, !2182, !2183, !2184, !2185}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !228, line: 52, baseType: !152, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !227, file: !228, line: 53, baseType: !232, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !228, line: 28, baseType: !164)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !227, file: !228, line: 54, baseType: !152, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !227, file: !228, line: 55, baseType: !235, size: 192, offset: 192)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !236, line: 17, size: 192, elements: !237)
!236 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!237 = !{!238, !240, !2169}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !235, file: !236, line: 18, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !235, file: !236, line: 19, baseType: !241, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !236, line: 110, size: 1152, elements: !244)
!244 = !{!245, !249, !253, !261, !2111, !2115, !2119, !2124, !2128, !2129, !2133, !2137, !2141, !2152, !2153, !2154, !2155, !2165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !243, file: !236, line: 111, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!239, !239}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !243, file: !236, line: 112, baseType: !250, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !239}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !243, file: !236, line: 113, baseType: !254, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!257, !259}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !99, line: 30, baseType: !258)
!258 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !243, file: !236, line: 114, baseType: !262, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!212, !259, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !268)
!268 = !{!269, !1748, !1750, !1753, !1754, !1805, !1902, !1903, !1904, !1905, !1906, !1915, !2020, !2033, !2036, !2037, !2041, !2043, !2044, !2045, !2049, !2055, !2056, !2059, !2060, !2061, !2064, !2065, !2066, !2067, !2099, !2100, !2101, !2104, !2107, !2108, !2109, !2110}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !267, file: !30, line: 462, baseType: !270, size: 512)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !271, line: 64, size: 512, elements: !272)
!271 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!272 = !{!273, !274, !280, !282, !341, !1586, !1738, !1743, !1744, !1745, !1746, !1747}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !270, file: !271, line: 65, baseType: !152, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !270, file: !271, line: 66, baseType: !275, size: 128, offset: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !99, line: 178, size: 128, elements: !276)
!276 = !{!277, !279}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !99, line: 179, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !99, line: 179, baseType: !278, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !270, file: !271, line: 67, baseType: !281, size: 64, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !270, file: !271, line: 68, baseType: !283, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !271, line: 192, size: 704, elements: !285)
!285 = !{!286, !287, !302, !303}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !284, file: !271, line: 193, baseType: !275, size: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !284, file: !271, line: 194, baseType: !288, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !289, line: 83, baseType: !290)
!289 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !289, line: 71, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !289, line: 72, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !289, line: 72, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !293, file: !289, line: 73, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !289, line: 20, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !296, file: !289, line: 21, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !300, line: 25, baseType: !301)
!300 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 25, elements: !123)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !284, file: !271, line: 195, baseType: !270, size: 512, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !284, file: !271, line: 196, baseType: !304, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !271, line: 156, size: 192, elements: !307)
!307 = !{!308, !313, !318}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !306, file: !271, line: 157, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!122, !283, !281}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !271, line: 158, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!152, !283, !281}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !306, file: !271, line: 159, baseType: !319, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DISubroutineType(types: !322)
!322 = !{!122, !283, !281, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !271, line: 148, size: 20736, elements: !325)
!325 = !{!326, !331, !335, !336, !340}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !324, file: !271, line: 149, baseType: !327, size: 192)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 192, elements: !329)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!329 = !{!330}
!330 = !DISubrange(count: 3)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !324, file: !271, line: 150, baseType: !332, size: 4096, offset: 192)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 4096, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !324, file: !271, line: 151, baseType: !122, size: 32, offset: 4288)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !324, file: !271, line: 152, baseType: !337, size: 16384, offset: 4320)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 16384, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 2048)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !324, file: !271, line: 153, baseType: !122, size: 32, offset: 20704)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !270, file: !271, line: 69, baseType: !342, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !271, line: 138, size: 448, elements: !344)
!344 = !{!345, !349, !372, !374, !1534, !1565, !1569}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !343, file: !271, line: 139, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !281}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !343, file: !271, line: 140, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !353, line: 230, size: 128, elements: !354)
!353 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!354 = !{!355, !365}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !352, file: !353, line: 231, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!198, !281, !359, !328}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !353, line: 30, size: 128, elements: !361)
!361 = !{!362, !363}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !360, file: !353, line: 31, baseType: !152, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !360, file: !353, line: 32, baseType: !364, size: 16, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !99, line: 19, baseType: !93)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !352, file: !353, line: 232, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!198, !281, !359, !152, !369}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 55, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !200, line: 72, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !200, line: 16, baseType: !172)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !343, file: !271, line: 141, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !343, file: !271, line: 142, baseType: !375, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !353, line: 84, size: 320, elements: !379)
!379 = !{!380, !381, !385, !1531, !1532}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !353, line: 85, baseType: !152, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !378, file: !353, line: 86, baseType: !382, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!364, !281, !359, !122}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !378, file: !353, line: 88, baseType: !386, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!364, !281, !389, !122}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !353, line: 168, size: 448, elements: !391)
!391 = !{!392, !393, !394, !395, !405, !406}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !390, file: !353, line: 169, baseType: !360, size: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !353, line: 170, baseType: !369, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !390, file: !353, line: 171, baseType: !102, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !390, file: !353, line: 172, baseType: !396, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DISubroutineType(types: !398)
!398 = !{!198, !399, !281, !389, !328, !402, !369}
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !401, line: 526, flags: DIFlagFwdDecl)
!401 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !99, line: 46, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !200, line: 88, baseType: !404)
!404 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !390, file: !353, line: 174, baseType: !396, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !390, file: !353, line: 176, baseType: !407, size: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!122, !399, !281, !389, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !412, line: 305, size: 1472, elements: !413)
!412 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!413 = !{!414, !415, !416, !417, !418, !426, !427, !1505, !1511, !1512, !1517, !1518, !1521, !1525, !1526, !1527, !1528, !1529}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !411, file: !412, line: 308, baseType: !172, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !411, file: !412, line: 309, baseType: !172, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !411, file: !412, line: 313, baseType: !410, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !411, file: !412, line: 313, baseType: !410, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !411, file: !412, line: 315, baseType: !419, size: 192, align: 64, offset: 256)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !420, line: 24, size: 192, align: 64, elements: !421)
!420 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!421 = !{!422, !423, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !419, file: !420, line: 25, baseType: !172, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !419, file: !420, line: 26, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !419, file: !420, line: 27, baseType: !424, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !411, file: !412, line: 323, baseType: !172, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !411, file: !412, line: 327, baseType: !428, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !412, line: 388, size: 7296, elements: !430)
!430 = !{!431, !1501}
!431 = !DIDerivedType(tag: DW_TAG_member, scope: !429, file: !412, line: 389, baseType: !432, size: 7296)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !429, file: !412, line: 389, size: 7296, elements: !433)
!433 = !{!434, !435, !439, !440, !444, !445, !446, !447, !448, !456, !461, !462, !463, !464, !473, !474, !475, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !510, !518, !521, !568, !569, !1471, !1472, !1475, !1479, !1480, !1483, !1484, !1485, !1488, !1500}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !432, file: !412, line: 390, baseType: !410, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !432, file: !412, line: 391, baseType: !436, size: 64, offset: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !420, line: 31, size: 64, elements: !437)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !436, file: !420, line: 32, baseType: !424, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !432, file: !412, line: 392, baseType: !176, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !432, file: !412, line: 394, baseType: !441, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!172, !399, !172, !172, !172, !172}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !432, file: !412, line: 398, baseType: !172, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !432, file: !412, line: 399, baseType: !172, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !432, file: !412, line: 405, baseType: !172, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !432, file: !412, line: 406, baseType: !172, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !432, file: !412, line: 407, baseType: !449, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !401, line: 286, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !401, line: 286, size: 64, elements: !452)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !451, file: !401, line: 286, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !455, line: 18, baseType: !172)
!455 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!456 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !432, file: !412, line: 416, baseType: !457, size: 32, offset: 576)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !99, line: 168, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 166, size: 32, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !458, file: !99, line: 167, baseType: !122, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !432, file: !412, line: 428, baseType: !457, size: 32, offset: 608)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !432, file: !412, line: 437, baseType: !457, size: 32, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !432, file: !412, line: 447, baseType: !457, size: 32, offset: 672)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !432, file: !412, line: 450, baseType: !465, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !466, line: 13, baseType: !467)
!466 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !99, line: 175, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 173, size: 64, elements: !469)
!469 = !{!470}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !468, file: !99, line: 174, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !165, line: 22, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !92, line: 30, baseType: !404)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !432, file: !412, line: 452, baseType: !122, size: 32, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !432, file: !412, line: 454, baseType: !288, offset: 800)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !432, file: !412, line: 457, baseType: !476, size: 256, offset: 832)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !477, line: 35, size: 256, elements: !478)
!477 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!478 = !{!479, !480, !481, !483}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !476, file: !477, line: 36, baseType: !465, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !476, file: !477, line: 42, baseType: !465, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !476, file: !477, line: 46, baseType: !482, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !289, line: 29, baseType: !296)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !476, file: !477, line: 47, baseType: !275, size: 128, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !432, file: !412, line: 459, baseType: !275, size: 128, offset: 1088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !432, file: !412, line: 466, baseType: !172, size: 64, offset: 1216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !432, file: !412, line: 467, baseType: !172, size: 64, offset: 1280)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !432, file: !412, line: 469, baseType: !172, size: 64, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !432, file: !412, line: 470, baseType: !172, size: 64, offset: 1408)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !432, file: !412, line: 471, baseType: !467, size: 64, offset: 1472)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !432, file: !412, line: 472, baseType: !172, size: 64, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !432, file: !412, line: 473, baseType: !172, size: 64, offset: 1600)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !432, file: !412, line: 474, baseType: !172, size: 64, offset: 1664)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !432, file: !412, line: 475, baseType: !172, size: 64, offset: 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !432, file: !412, line: 477, baseType: !288, offset: 1792)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !432, file: !412, line: 478, baseType: !172, size: 64, offset: 1792)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !432, file: !412, line: 478, baseType: !172, size: 64, offset: 1856)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !432, file: !412, line: 478, baseType: !172, size: 64, offset: 1920)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !432, file: !412, line: 478, baseType: !172, size: 64, offset: 1984)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !432, file: !412, line: 479, baseType: !172, size: 64, offset: 2048)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !432, file: !412, line: 479, baseType: !172, size: 64, offset: 2112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !432, file: !412, line: 479, baseType: !172, size: 64, offset: 2176)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !432, file: !412, line: 480, baseType: !172, size: 64, offset: 2240)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !432, file: !412, line: 480, baseType: !172, size: 64, offset: 2304)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !432, file: !412, line: 480, baseType: !172, size: 64, offset: 2368)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !432, file: !412, line: 480, baseType: !172, size: 64, offset: 2432)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !432, file: !412, line: 482, baseType: !507, size: 2816, offset: 2496)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 2816, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 44)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !432, file: !412, line: 488, baseType: !511, size: 256, offset: 5312)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !512, line: 60, size: 256, elements: !513)
!512 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !511, file: !512, line: 61, baseType: !515, size: 256)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 256, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 4)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !432, file: !412, line: 490, baseType: !519, size: 64, offset: 5568)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !412, line: 490, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !432, file: !412, line: 493, baseType: !522, size: 896, offset: 5632)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !523, line: 53, baseType: !524)
!523 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !523, line: 13, size: 896, elements: !525)
!525 = !{!526, !527, !528, !529, !532, !533, !540, !541, !561, !562, !564}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !524, file: !523, line: 18, baseType: !176, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !524, file: !523, line: 28, baseType: !467, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !524, file: !523, line: 31, baseType: !476, size: 256, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !524, file: !523, line: 32, baseType: !530, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !523, line: 32, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !524, file: !523, line: 37, baseType: !93, size: 16, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !524, file: !523, line: 40, baseType: !534, size: 192, offset: 512)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !535, line: 53, size: 192, elements: !536)
!535 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !534, file: !535, line: 54, baseType: !465, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !534, file: !535, line: 55, baseType: !288, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !534, file: !535, line: 59, baseType: !275, size: 128, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !524, file: !523, line: 41, baseType: !102, size: 64, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !524, file: !523, line: 42, baseType: !542, size: 64, offset: 768)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !545, line: 13, size: 896, elements: !546)
!545 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !545, line: 14, baseType: !102, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !545, line: 15, baseType: !172, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !544, file: !545, line: 17, baseType: !172, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !544, file: !545, line: 17, baseType: !172, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !544, file: !545, line: 19, baseType: !202, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !544, file: !545, line: 21, baseType: !202, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !544, file: !545, line: 22, baseType: !202, size: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !544, file: !545, line: 23, baseType: !202, size: 64, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !544, file: !545, line: 24, baseType: !202, size: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !544, file: !545, line: 25, baseType: !202, size: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !544, file: !545, line: 26, baseType: !202, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !544, file: !545, line: 27, baseType: !202, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !544, file: !545, line: 28, baseType: !202, size: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !544, file: !545, line: 29, baseType: !202, size: 64, offset: 832)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !524, file: !523, line: 44, baseType: !457, size: 32, offset: 832)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !524, file: !523, line: 50, baseType: !563, size: 16, offset: 864)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !165, line: 19, baseType: !91)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !524, file: !523, line: 51, baseType: !565, size: 16, offset: 880)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !165, line: 18, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !92, line: 23, baseType: !567)
!567 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !432, file: !412, line: 495, baseType: !172, size: 64, offset: 6528)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !432, file: !412, line: 497, baseType: !570, size: 64, offset: 6592)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !412, line: 381, size: 384, elements: !572)
!572 = !{!573, !574, !1470}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !571, file: !412, line: 382, baseType: !457, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !571, file: !412, line: 383, baseType: !575, size: 128, offset: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !412, line: 376, size: 128, elements: !576)
!576 = !{!577, !1468}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !575, file: !412, line: 377, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !580, line: 640, size: 48640, elements: !581)
!580 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!581 = !{!582, !588, !590, !591, !597, !598, !599, !600, !601, !602, !603, !604, !608, !626, !637, !731, !732, !733, !741, !742, !744, !745, !746, !747, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !826, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !882, !884, !885, !886, !898, !900, !901, !902, !903, !904, !910, !911, !912, !913, !914, !915, !916, !928, !933, !938, !939, !940, !943, !947, !950, !953, !956, !959, !963, !966, !969, !975, !976, !977, !983, !984, !985, !986, !987, !996, !997, !998, !999, !1000, !1005, !1006, !1007, !1010, !1011, !1014, !1017, !1020, !1023, !1026, !1029, !1030, !1110, !1113, !1116, !1117, !1120, !1121, !1122, !1128, !1129, !1130, !1143, !1144, !1145, !1155, !1160, !1164, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !579, file: !580, line: 646, baseType: !583, size: 128)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !584, line: 56, size: 128, elements: !585)
!584 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !584, line: 57, baseType: !172, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !583, file: !584, line: 58, baseType: !164, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !579, file: !580, line: 649, baseType: !589, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !202)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !579, file: !580, line: 657, baseType: !102, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !579, file: !580, line: 658, baseType: !592, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !593, line: 113, baseType: !594)
!593 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !593, line: 111, size: 32, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !594, file: !593, line: 112, baseType: !457, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !580, line: 660, baseType: !7, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !579, file: !580, line: 661, baseType: !7, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !579, file: !580, line: 684, baseType: !122, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !579, file: !580, line: 686, baseType: !122, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !579, file: !580, line: 687, baseType: !122, size: 32, offset: 416)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !579, file: !580, line: 688, baseType: !122, size: 32, offset: 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !579, file: !580, line: 689, baseType: !7, size: 32, offset: 480)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !579, file: !580, line: 691, baseType: !605, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !580, line: 691, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !579, file: !580, line: 692, baseType: !609, size: 832, offset: 576)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !580, line: 451, size: 832, elements: !610)
!610 = !{!611, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !609, file: !580, line: 453, baseType: !612, size: 128)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !580, line: 325, size: 128, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !612, file: !580, line: 326, baseType: !172, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !612, file: !580, line: 327, baseType: !164, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !609, file: !580, line: 454, baseType: !419, size: 192, align: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !609, file: !580, line: 455, baseType: !275, size: 128, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !609, file: !580, line: 456, baseType: !7, size: 32, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !609, file: !580, line: 458, baseType: !176, size: 64, offset: 512)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !609, file: !580, line: 459, baseType: !176, size: 64, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !609, file: !580, line: 460, baseType: !176, size: 64, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !609, file: !580, line: 461, baseType: !176, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !609, file: !580, line: 463, baseType: !176, size: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !609, file: !580, line: 465, baseType: !625, offset: 832)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !580, line: 415, elements: !123)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !579, file: !580, line: 693, baseType: !627, size: 384, offset: 1408)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !580, line: 489, size: 384, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !627, file: !580, line: 490, baseType: !275, size: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !627, file: !580, line: 491, baseType: !172, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !627, file: !580, line: 492, baseType: !172, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !627, file: !580, line: 493, baseType: !7, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !627, file: !580, line: 494, baseType: !93, size: 16, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !627, file: !580, line: 495, baseType: !93, size: 16, offset: 304)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !627, file: !580, line: 497, baseType: !636, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !579, file: !580, line: 697, baseType: !638, size: 1792, offset: 1792)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !580, line: 507, size: 1792, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !728, !729}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !638, file: !580, line: 508, baseType: !419, size: 192, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !638, file: !580, line: 515, baseType: !176, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !638, file: !580, line: 516, baseType: !176, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !638, file: !580, line: 517, baseType: !176, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !638, file: !580, line: 518, baseType: !176, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !638, file: !580, line: 519, baseType: !176, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !638, file: !580, line: 526, baseType: !471, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !638, file: !580, line: 527, baseType: !176, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !638, file: !580, line: 528, baseType: !7, size: 32, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !638, file: !580, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !638, file: !580, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !638, file: !580, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !638, file: !580, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !638, file: !580, line: 563, baseType: !654, size: 512, offset: 704)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !655)
!655 = !{!656, !664, !665, !670, !722, !725, !726, !727}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !654, file: !6, line: 119, baseType: !657, size: 256)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !658, line: 9, size: 256, elements: !659)
!658 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !657, file: !658, line: 10, baseType: !419, size: 192, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !657, file: !658, line: 11, baseType: !662, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !663, line: 29, baseType: !471)
!663 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !654, file: !6, line: 120, baseType: !662, size: 64, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !654, file: !6, line: 121, baseType: !666, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{!5, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !654, file: !6, line: 122, baseType: !671, size: 64, offset: 384)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !673)
!673 = !{!674, !694, !695, !698, !708, !709, !717, !721}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !672, file: !6, line: 160, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !676, file: !6, line: 215, baseType: !482)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !676, file: !6, line: 216, baseType: !7, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !676, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !676, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !676, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !676, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !676, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !676, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !676, file: !6, line: 233, baseType: !662, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !676, file: !6, line: 234, baseType: !669, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !676, file: !6, line: 235, baseType: !662, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !676, file: !6, line: 236, baseType: !669, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !676, file: !6, line: 237, baseType: !691, size: 4096, offset: 512)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 4096, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 8)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !672, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !672, file: !6, line: 162, baseType: !696, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !99, line: 27, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !200, line: 96, baseType: !122)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !672, file: !6, line: 163, baseType: !699, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !700, line: 276, baseType: !701)
!700 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !700, line: 276, size: 32, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !701, file: !700, line: 276, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !700, line: 70, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !700, line: 65, size: 32, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !705, file: !700, line: 66, baseType: !7, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !672, file: !6, line: 164, baseType: !669, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !672, file: !6, line: 165, baseType: !710, size: 128, offset: 256)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !658, line: 14, size: 128, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !710, file: !658, line: 15, baseType: !713, size: 128)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !420, line: 125, size: 128, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !713, file: !420, line: 126, baseType: !436, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !713, file: !420, line: 127, baseType: !424, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !672, file: !6, line: 166, baseType: !718, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!662}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !672, file: !6, line: 167, baseType: !662, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !654, file: !6, line: 123, baseType: !723, size: 8, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !165, line: 17, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !92, line: 21, baseType: !101)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !654, file: !6, line: 124, baseType: !723, size: 8, offset: 456)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !654, file: !6, line: 125, baseType: !723, size: 8, offset: 464)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !654, file: !6, line: 126, baseType: !723, size: 8, offset: 472)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !638, file: !580, line: 572, baseType: !654, size: 512, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !638, file: !580, line: 580, baseType: !730, size: 64, offset: 1728)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !579, file: !580, line: 721, baseType: !7, size: 32, offset: 3584)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !579, file: !580, line: 722, baseType: !122, size: 32, offset: 3616)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !579, file: !580, line: 723, baseType: !734, size: 64, offset: 3648)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !737, line: 17, baseType: !738)
!737 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !737, line: 17, size: 64, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !738, file: !737, line: 17, baseType: !191, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !579, file: !580, line: 724, baseType: !736, size: 64, offset: 3712)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !579, file: !580, line: 749, baseType: !743, offset: 3776)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !580, line: 290, elements: !123)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !579, file: !580, line: 751, baseType: !275, size: 128, offset: 3776)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !579, file: !580, line: 757, baseType: !428, size: 64, offset: 3904)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !579, file: !580, line: 758, baseType: !428, size: 64, offset: 3968)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !579, file: !580, line: 761, baseType: !748, size: 320, offset: 4032)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !512, line: 34, size: 320, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !748, file: !512, line: 35, baseType: !176, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !748, file: !512, line: 36, baseType: !752, size: 256, offset: 64)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 256, elements: !516)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !579, file: !580, line: 766, baseType: !122, size: 32, offset: 4352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !579, file: !580, line: 767, baseType: !122, size: 32, offset: 4384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !579, file: !580, line: 768, baseType: !122, size: 32, offset: 4416)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !579, file: !580, line: 770, baseType: !122, size: 32, offset: 4448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !579, file: !580, line: 772, baseType: !172, size: 64, offset: 4480)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !579, file: !580, line: 775, baseType: !7, size: 32, offset: 4544)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !579, file: !580, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !579, file: !580, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !579, file: !580, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !579, file: !580, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !579, file: !580, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !579, file: !580, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !579, file: !580, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !579, file: !580, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !579, file: !580, line: 831, baseType: !172, size: 64, offset: 4672)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !579, file: !580, line: 833, baseType: !769, size: 384, offset: 4736)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !770)
!770 = !{!771, !776}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !769, file: !12, line: 26, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!202, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, scope: !769, file: !12, line: 27, baseType: !777, size: 320, offset: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !769, file: !12, line: 27, size: 320, elements: !778)
!778 = !{!779, !789, !816}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !777, file: !12, line: 36, baseType: !780, size: 320)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !12, line: 29, size: 320, elements: !781)
!781 = !{!782, !784, !785, !786, !787, !788}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !780, file: !12, line: 30, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !780, file: !12, line: 31, baseType: !164, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !780, file: !12, line: 32, baseType: !164, size: 32, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !780, file: !12, line: 33, baseType: !164, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !780, file: !12, line: 34, baseType: !176, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !780, file: !12, line: 35, baseType: !783, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !777, file: !12, line: 46, baseType: !790, size: 192)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !12, line: 38, size: 192, elements: !791)
!791 = !{!792, !793, !794, !815}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !790, file: !12, line: 39, baseType: !696, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !790, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, scope: !790, file: !12, line: 41, baseType: !795, size: 64, offset: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !12, line: 41, size: 64, elements: !796)
!796 = !{!797, !805}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !795, file: !12, line: 42, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !800, line: 7, size: 128, elements: !801)
!800 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!801 = !{!802, !804}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !799, file: !800, line: 8, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !200, line: 93, baseType: !404)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !799, file: !800, line: 9, baseType: !404, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !795, file: !12, line: 43, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !808, line: 7, size: 64, elements: !809)
!808 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!809 = !{!810, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !807, file: !808, line: 8, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !808, line: 5, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !165, line: 20, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !92, line: 26, baseType: !122)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !807, file: !808, line: 9, baseType: !812, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !790, file: !12, line: 45, baseType: !176, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !777, file: !12, line: 54, baseType: !817, size: 256)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !12, line: 48, size: 256, elements: !818)
!818 = !{!819, !822, !823, !824, !825}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !817, file: !12, line: 49, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !817, file: !12, line: 50, baseType: !122, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !817, file: !12, line: 51, baseType: !122, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !817, file: !12, line: 52, baseType: !172, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !817, file: !12, line: 53, baseType: !172, size: 64, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !579, file: !580, line: 835, baseType: !827, size: 32, offset: 5120)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !99, line: 22, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !200, line: 28, baseType: !122)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !579, file: !580, line: 836, baseType: !827, size: 32, offset: 5152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !579, file: !580, line: 840, baseType: !172, size: 64, offset: 5184)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !579, file: !580, line: 849, baseType: !578, size: 64, offset: 5248)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !579, file: !580, line: 852, baseType: !578, size: 64, offset: 5312)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !579, file: !580, line: 857, baseType: !275, size: 128, offset: 5376)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !579, file: !580, line: 858, baseType: !275, size: 128, offset: 5504)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !579, file: !580, line: 859, baseType: !578, size: 64, offset: 5632)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !579, file: !580, line: 867, baseType: !275, size: 128, offset: 5696)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !579, file: !580, line: 868, baseType: !275, size: 128, offset: 5824)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !579, file: !580, line: 871, baseType: !839, size: 64, offset: 5952)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !841, line: 59, size: 768, elements: !842)
!841 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!842 = !{!843, !844, !845, !846, !857, !858, !865, !874}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !840, file: !841, line: 61, baseType: !592, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !840, file: !841, line: 62, baseType: !7, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !840, file: !841, line: 63, baseType: !288, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !840, file: !841, line: 65, baseType: !847, size: 256, offset: 64)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 256, elements: !516)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !99, line: 182, size: 64, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !848, file: !99, line: 183, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !99, line: 186, size: 128, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !99, line: 187, baseType: !851, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !852, file: !99, line: 187, baseType: !856, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !840, file: !841, line: 66, baseType: !848, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !840, file: !841, line: 68, baseType: !859, size: 128, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !860, line: 40, baseType: !861)
!860 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !860, line: 36, size: 128, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !861, file: !860, line: 37, baseType: !288)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !861, file: !860, line: 38, baseType: !275, size: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !840, file: !841, line: 69, baseType: !866, size: 128, align: 64, offset: 512)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !99, line: 216, size: 128, align: 64, elements: !867)
!867 = !{!868, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !866, file: !99, line: 217, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !866, file: !99, line: 218, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !869}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !840, file: !841, line: 70, baseType: !875, size: 128, offset: 640)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 128, elements: !192)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !841, line: 54, size: 128, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !876, file: !841, line: 55, baseType: !122, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !876, file: !841, line: 56, baseType: !880, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !841, line: 56, flags: DIFlagFwdDecl)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !579, file: !580, line: 872, baseType: !883, size: 512, offset: 6016)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 512, elements: !516)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !579, file: !580, line: 873, baseType: !275, size: 128, offset: 6528)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !579, file: !580, line: 874, baseType: !275, size: 128, offset: 6656)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !579, file: !580, line: 876, baseType: !887, size: 64, offset: 6784)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !889, line: 26, size: 192, elements: !890)
!889 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !888, file: !889, line: 27, baseType: !7, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !888, file: !889, line: 28, baseType: !893, size: 128, offset: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !894, line: 43, size: 128, elements: !895)
!894 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !893, file: !894, line: 44, baseType: !482)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !893, file: !894, line: 45, baseType: !275, size: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !579, file: !580, line: 879, baseType: !899, size: 64, offset: 6848)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !579, file: !580, line: 882, baseType: !899, size: 64, offset: 6912)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !579, file: !580, line: 884, baseType: !176, size: 64, offset: 6976)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !579, file: !580, line: 885, baseType: !176, size: 64, offset: 7040)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !579, file: !580, line: 890, baseType: !176, size: 64, offset: 7104)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !579, file: !580, line: 891, baseType: !905, size: 128, offset: 7168)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !580, line: 242, size: 128, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !905, file: !580, line: 244, baseType: !176, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !905, file: !580, line: 245, baseType: !176, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !905, file: !580, line: 246, baseType: !482, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !579, file: !580, line: 900, baseType: !172, size: 64, offset: 7296)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !579, file: !580, line: 901, baseType: !172, size: 64, offset: 7360)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !579, file: !580, line: 904, baseType: !176, size: 64, offset: 7424)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !579, file: !580, line: 907, baseType: !176, size: 64, offset: 7488)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !579, file: !580, line: 910, baseType: !172, size: 64, offset: 7552)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !579, file: !580, line: 911, baseType: !172, size: 64, offset: 7616)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !579, file: !580, line: 914, baseType: !917, size: 640, offset: 7680)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !918, line: 123, size: 640, elements: !919)
!918 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!919 = !{!920, !926, !927}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !917, file: !918, line: 124, baseType: !921, size: 576)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 576, elements: !329)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !918, line: 108, size: 192, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !922, file: !918, line: 109, baseType: !176, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !922, file: !918, line: 110, baseType: !710, size: 128, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !917, file: !918, line: 125, baseType: !7, size: 32, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !917, file: !918, line: 126, baseType: !7, size: 32, offset: 608)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !579, file: !580, line: 917, baseType: !929, size: 192, offset: 8320)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !918, line: 134, size: 192, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !929, file: !918, line: 135, baseType: !866, size: 128, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !929, file: !918, line: 136, baseType: !7, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !579, file: !580, line: 923, baseType: !934, size: 64, offset: 8512)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !937, line: 11, flags: DIFlagFwdDecl)
!937 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!938 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !579, file: !580, line: 926, baseType: !934, size: 64, offset: 8576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !579, file: !580, line: 929, baseType: !934, size: 64, offset: 8640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !579, file: !580, line: 933, baseType: !941, size: 64, offset: 8704)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !580, line: 933, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !579, file: !580, line: 943, baseType: !944, size: 128, offset: 8768)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 16)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !579, file: !580, line: 945, baseType: !948, size: 64, offset: 8896)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !580, line: 49, flags: DIFlagFwdDecl)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !579, file: !580, line: 956, baseType: !951, size: 64, offset: 8960)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !580, line: 45, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !579, file: !580, line: 959, baseType: !954, size: 64, offset: 9024)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !580, line: 959, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !579, file: !580, line: 962, baseType: !957, size: 64, offset: 9088)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !580, line: 66, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !579, file: !580, line: 966, baseType: !960, size: 64, offset: 9152)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !962, line: 35, flags: DIFlagFwdDecl)
!962 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!963 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !579, file: !580, line: 969, baseType: !964, size: 64, offset: 9216)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !918, line: 223, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !579, file: !580, line: 970, baseType: !967, size: 64, offset: 9280)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !580, line: 62, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !579, file: !580, line: 971, baseType: !970, size: 64, offset: 9344)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !971, line: 25, baseType: !972)
!971 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !971, line: 23, size: 64, elements: !973)
!973 = !{!974}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !972, file: !971, line: 24, baseType: !191, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !579, file: !580, line: 972, baseType: !970, size: 64, offset: 9408)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !579, file: !580, line: 974, baseType: !970, size: 64, offset: 9472)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !579, file: !580, line: 975, baseType: !978, size: 192, offset: 9536)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !979, line: 30, size: 192, elements: !980)
!979 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !978, file: !979, line: 31, baseType: !275, size: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !978, file: !979, line: 32, baseType: !970, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !579, file: !580, line: 976, baseType: !172, size: 64, offset: 9728)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !579, file: !580, line: 977, baseType: !369, size: 64, offset: 9792)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !579, file: !580, line: 978, baseType: !7, size: 32, offset: 9856)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !579, file: !580, line: 980, baseType: !869, size: 64, offset: 9920)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !579, file: !580, line: 989, baseType: !988, size: 128, offset: 9984)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !989, line: 35, size: 128, elements: !990)
!989 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !988, file: !989, line: 36, baseType: !122, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !988, file: !989, line: 37, baseType: !457, size: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !988, file: !989, line: 38, baseType: !994, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !989, line: 23, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !579, file: !580, line: 992, baseType: !176, size: 64, offset: 10112)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !579, file: !580, line: 993, baseType: !176, size: 64, offset: 10176)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !579, file: !580, line: 996, baseType: !288, offset: 10240)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !579, file: !580, line: 999, baseType: !482, offset: 10240)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !579, file: !580, line: 1001, baseType: !1001, size: 64, offset: 10240)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !580, line: 636, size: 64, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1001, file: !580, line: 637, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !579, file: !580, line: 1005, baseType: !713, size: 128, offset: 10304)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !579, file: !580, line: 1007, baseType: !578, size: 64, offset: 10432)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !579, file: !580, line: 1009, baseType: !1008, size: 64, offset: 10496)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !580, line: 1009, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !579, file: !580, line: 1043, baseType: !102, size: 64, offset: 10560)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !579, file: !580, line: 1046, baseType: !1012, size: 64, offset: 10624)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !580, line: 41, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !579, file: !580, line: 1050, baseType: !1015, size: 64, offset: 10688)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !580, line: 42, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !579, file: !580, line: 1054, baseType: !1018, size: 64, offset: 10752)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !580, line: 55, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !579, file: !580, line: 1056, baseType: !1021, size: 64, offset: 10816)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !580, line: 40, flags: DIFlagFwdDecl)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !579, file: !580, line: 1058, baseType: !1024, size: 64, offset: 10880)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !580, line: 47, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !579, file: !580, line: 1061, baseType: !1027, size: 64, offset: 10944)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !580, line: 43, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !579, file: !580, line: 1064, baseType: !172, size: 64, offset: 11008)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !579, file: !580, line: 1065, baseType: !1031, size: 64, offset: 11072)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !979, line: 14, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !979, line: 12, size: 384, elements: !1034)
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, scope: !1033, file: !979, line: 13, baseType: !1036, size: 384)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1033, file: !979, line: 13, size: 384, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1036, file: !979, line: 13, baseType: !122, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1036, file: !979, line: 13, baseType: !122, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1036, file: !979, line: 13, baseType: !122, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1036, file: !979, line: 13, baseType: !1042, size: 256, offset: 128)
!1042 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !1043, line: 32, size: 256, elements: !1044)
!1043 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!1044 = !{!1045, !1051, !1064, !1070, !1079, !1099, !1104}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1042, file: !1043, line: 37, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1042, file: !1043, line: 34, size: 64, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1046, file: !1043, line: 35, baseType: !828, size: 32)
