; ModuleID = '../bcout/drivers/of/kobj.llvm.bc'
source_filename = "drivers/of/kobj.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kobj_type = type { void (%struct.kobject*)*, %struct.sysfs_ops*, %struct.attribute**, %struct.attribute_group**, %struct.kobj_ns_type_operations* (%struct.kobject*)*, i8* (%struct.kobject*)*, void (%struct.kobject*, %struct.kuid_t*, %struct.kgid_t*)* }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.kset_uevent_ops = type { i32 (%struct.kset*, %struct.kobject*)*, i8* (%struct.kset*, %struct.kobject*)*, i32 (%struct.kset*, %struct.kobject*, %struct.kobj_uevent_env*)* }
%struct.kobj_uevent_env = type { [3 x i8*], [64 x i8*], i32, [2048 x i8], i32 }
%struct.kernfs_node = type { %struct.atomic_t, %struct.atomic_t, %struct.kernfs_node*, i8*, %struct.rb_node, i8*, i32, %union.anon, i8*, i64, i16, i16, %struct.kernfs_iattrs* }
%struct.atomic_t = type { i32 }
%struct.rb_node = type { i64, %struct.rb_node*, %struct.rb_node* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "of_node_ktype", scope: !2, file: !3, line: 27, type: !131, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !647, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/of/kobj.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !6, line: 26, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!12 = !{!13, !14, !16}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !15, line: 148, baseType: !7)
!15 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "property", file: !18, line: 31, size: 704, elements: !19)
!18 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !23, !25, !26, !27}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !17, file: !18, line: 32, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !17, file: !18, line: 33, baseType: !24, size: 32, offset: 64)
!24 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !17, file: !18, line: 34, baseType: !13, size: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !17, file: !18, line: 35, baseType: !16, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !17, file: !18, line: 43, baseType: !28, size: 448, offset: 256)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !29, line: 168, size: 448, elements: !30)
!29 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!30 = !{!31, !40, !46, !47, !642, !643}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !28, file: !29, line: 169, baseType: !32, size: 128)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !29, line: 30, size: 128, elements: !33)
!33 = !{!34, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !29, line: 31, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !32, file: !29, line: 32, baseType: !38, size: 16, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !15, line: 19, baseType: !39)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !28, file: !29, line: 170, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 55, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !43, line: 72, baseType: !44)
!43 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !43, line: 16, baseType: !45)
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !28, file: !29, line: 171, baseType: !13, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !28, file: !29, line: 172, baseType: !48, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !55, !58, !168, !21, !387, !41}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !15, line: 60, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !43, line: 73, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !43, line: 15, baseType: !54)
!54 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !57, line: 526, flags: DIFlagFwdDecl)
!57 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !60, line: 64, size: 512, elements: !61)
!60 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !63, !69, !70, !129, !230, !627, !637, !638, !639, !640, !641}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 65, baseType: !35, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !59, file: !60, line: 66, baseType: !64, size: 128, offset: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !15, line: 178, size: 128, elements: !65)
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !64, file: !15, line: 179, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !64, file: !15, line: 179, baseType: !67, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !59, file: !60, line: 67, baseType: !58, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !59, file: !60, line: 68, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !60, line: 192, size: 704, elements: !73)
!73 = !{!74, !75, !91, !92}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !72, file: !60, line: 193, baseType: !64, size: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !72, file: !60, line: 194, baseType: !76, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !77, line: 83, baseType: !78)
!77 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !77, line: 71, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 72, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 72, elements: !82)
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !81, file: !77, line: 73, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !77, line: 20, elements: !85)
!85 = !{!86}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !84, file: !77, line: 21, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !88, line: 25, baseType: !89)
!88 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !88, line: 25, elements: !90)
!90 = !{}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !72, file: !60, line: 195, baseType: !59, size: 512, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !72, file: !60, line: 196, baseType: !93, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !60, line: 156, size: 192, elements: !96)
!96 = !{!97, !102, !107}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !95, file: !60, line: 157, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{!24, !71, !58}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !60, line: 158, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!35, !71, !58}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !95, file: !60, line: 159, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!24, !71, !58, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !60, line: 148, size: 20736, elements: !114)
!114 = !{!115, !119, !123, !124, !128}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !113, file: !60, line: 149, baseType: !116, size: 192)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 3)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !113, file: !60, line: 150, baseType: !120, size: 4096, offset: 192)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 4096, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !113, file: !60, line: 151, baseType: !24, size: 32, offset: 4288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !113, file: !60, line: 152, baseType: !125, size: 16384, offset: 4320)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 16384, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 2048)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !113, file: !60, line: 153, baseType: !24, size: 32, offset: 20704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !59, file: !60, line: 69, baseType: !130, size: 64, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !60, line: 138, size: 448, elements: !132)
!132 = !{!133, !137, !151, !153, !172, !207, !211}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !131, file: !60, line: 139, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !58}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !131, file: !60, line: 140, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !29, line: 230, size: 128, elements: !141)
!141 = !{!142, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !140, file: !29, line: 231, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!51, !58, !146, !21}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !140, file: !29, line: 232, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!51, !58, !146, !35, !41}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !131, file: !60, line: 141, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !131, file: !60, line: 142, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !29, line: 84, size: 320, elements: !158)
!158 = !{!159, !160, !164, !169, !170}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !29, line: 85, baseType: !35, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !157, file: !29, line: 86, baseType: !161, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!38, !58, !146, !24}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !157, file: !29, line: 88, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!38, !58, !168, !24}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !157, file: !29, line: 90, baseType: !152, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bin_attrs", scope: !157, file: !29, line: 91, baseType: !171, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !131, file: !60, line: 143, baseType: !173, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !58}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !6, line: 39, size: 384, elements: !179)
!179 = !{!180, !181, !187, !191, !199, !203}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !178, file: !6, line: 40, baseType: !5, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !178, file: !6, line: 41, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !15, line: 30, baseType: !186)
!186 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !178, file: !6, line: 42, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!13}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !178, file: !6, line: 43, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !197}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !6, line: 19, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !178, file: !6, line: 44, baseType: !200, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DISubroutineType(types: !202)
!202 = !{!195}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !178, file: !6, line: 45, baseType: !204, size: 64, offset: 320)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !13}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !131, file: !60, line: 144, baseType: !208, size: 64, offset: 320)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DISubroutineType(types: !210)
!210 = !{!195, !58}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !131, file: !60, line: 145, baseType: !212, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !58, !215, !223}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !217, line: 23, baseType: !218)
!217 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 21, size: 32, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !218, file: !217, line: 22, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !15, line: 32, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !43, line: 49, baseType: !7)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !217, line: 28, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 26, size: 32, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !225, file: !217, line: 27, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !15, line: 33, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !43, line: 50, baseType: !7)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !59, file: !60, line: 70, baseType: !231, size: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !233, line: 123, size: 1024, elements: !234)
!233 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!234 = !{!235, !240, !241, !242, !243, !251, !252, !253, !620, !621, !622, !623, !624}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !232, file: !233, line: 124, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !15, line: 168, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 166, size: 32, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !237, file: !15, line: 167, baseType: !24, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !232, file: !233, line: 125, baseType: !236, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !232, file: !233, line: 135, baseType: !231, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !233, line: 136, baseType: !35, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !232, file: !233, line: 138, baseType: !244, size: 192, align: 64, offset: 192)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !245, line: 24, size: 192, align: 64, elements: !246)
!245 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!246 = !{!247, !248, !250}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !244, file: !245, line: 25, baseType: !45, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !244, file: !245, line: 26, baseType: !249, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !244, file: !245, line: 27, baseType: !249, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !232, file: !233, line: 140, baseType: !195, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !232, file: !233, line: 141, baseType: !7, size: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, scope: !232, file: !233, line: 142, baseType: !254, size: 256, offset: 512)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !233, line: 142, size: 256, elements: !255)
!255 = !{!256, !323, !327}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !254, file: !233, line: 143, baseType: !257, size: 192)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !233, line: 91, size: 192, elements: !258)
!258 = !{!259, !260, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !257, file: !233, line: 92, baseType: !45, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !257, file: !233, line: 94, baseType: !261, size: 64, offset: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !245, line: 31, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !261, file: !245, line: 32, baseType: !249, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !257, file: !233, line: 100, baseType: !265, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !233, line: 180, size: 704, elements: !267)
!267 = !{!268, !269, !270, !283, !288, !289, !315, !316}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !266, file: !233, line: 182, baseType: !231, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !233, line: 183, baseType: !7, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !266, file: !233, line: 186, baseType: !271, size: 192, offset: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !272, line: 19, size: 192, elements: !273)
!272 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !281, !282}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !271, file: !272, line: 20, baseType: !275, size: 128)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !276, line: 292, size: 128, elements: !277)
!276 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !275, file: !276, line: 293, baseType: !76)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !275, file: !276, line: 295, baseType: !14, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !275, file: !276, line: 296, baseType: !13, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !271, file: !272, line: 21, baseType: !7, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !271, file: !272, line: 22, baseType: !7, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !266, file: !233, line: 187, baseType: !284, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !285, line: 21, baseType: !286)
!285 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !287, line: 27, baseType: !7)
!287 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !266, file: !233, line: 188, baseType: !284, size: 32, offset: 352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !266, file: !233, line: 189, baseType: !290, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !233, line: 168, size: 320, elements: !292)
!292 = !{!293, !299, !303, !307, !311}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !291, file: !233, line: 169, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!24, !297, !265}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !57, line: 539, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !291, file: !233, line: 171, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!24, !231, !35, !38}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !291, file: !233, line: 173, baseType: !304, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!24, !231}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !291, file: !233, line: 174, baseType: !308, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!24, !231, !231, !35}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !291, file: !233, line: 176, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!24, !297, !231, !265}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !266, file: !233, line: 192, baseType: !64, size: 128, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !266, file: !233, line: 194, baseType: !317, size: 128, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !318, line: 40, baseType: !319)
!318 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !318, line: 36, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !319, file: !318, line: 37, baseType: !76)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !319, file: !318, line: 38, baseType: !64, size: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !254, file: !233, line: 144, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_symlink", file: !233, line: 103, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "target_kn", scope: !324, file: !233, line: 104, baseType: !231, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !254, file: !233, line: 145, baseType: !328, size: 256)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_attr", file: !233, line: 107, size: 256, elements: !329)
!329 = !{!330, !615, !618, !619}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !328, file: !233, line: 108, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_ops", file: !233, line: 217, size: 768, elements: !334)
!334 = !{!335, !374, !378, !382, !389, !393, !397, !401, !402, !403, !404, !412}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !333, file: !233, line: 222, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!24, !339}
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_file", file: !233, line: 197, size: 1088, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !362, !363, !364, !365, !366, !367, !368, !369}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !340, file: !233, line: 199, baseType: !231, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !340, file: !233, line: 200, baseType: !55, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "seq_file", scope: !340, file: !233, line: 201, baseType: !297, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !340, file: !233, line: 202, baseType: !13, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !340, file: !233, line: 205, baseType: !347, size: 192, offset: 256)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !348, line: 53, size: 192, elements: !349)
!348 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!349 = !{!350, !360, !361}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !347, file: !348, line: 54, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !352, line: 13, baseType: !353)
!352 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !15, line: 175, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 173, size: 64, elements: !355)
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !354, file: !15, line: 174, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !285, line: 22, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !287, line: 30, baseType: !359)
!359 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !347, file: !348, line: 55, baseType: !76, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !347, file: !348, line: 59, baseType: !64, size: 128, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_mutex", scope: !340, file: !233, line: 206, baseType: !347, size: 192, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !340, file: !233, line: 207, baseType: !24, size: 32, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !340, file: !233, line: 208, baseType: !64, size: 128, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_buf", scope: !340, file: !233, line: 209, baseType: !21, size: 64, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !340, file: !233, line: 211, baseType: !41, size: 64, offset: 896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mmapped", scope: !340, file: !233, line: 212, baseType: !185, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "released", scope: !340, file: !233, line: 213, baseType: !185, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !340, file: !233, line: 214, baseType: !370, size: 64, offset: 1024)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !373, line: 356, flags: DIFlagFwdDecl)
!373 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !333, file: !233, line: 223, baseType: !375, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !339}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "seq_show", scope: !333, file: !233, line: 236, baseType: !379, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!24, !297, !13}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "seq_start", scope: !333, file: !233, line: 238, baseType: !383, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!13, !297, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !15, line: 46, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !43, line: 88, baseType: !359)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "seq_next", scope: !333, file: !233, line: 239, baseType: !390, size: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!13, !297, !13, !386}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "seq_stop", scope: !333, file: !233, line: 240, baseType: !394, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !297, !13}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !333, file: !233, line: 242, baseType: !398, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!51, !339, !21, !41, !387}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !333, file: !233, line: 252, baseType: !41, size: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !333, file: !233, line: 259, baseType: !185, size: 8, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !333, file: !233, line: 260, baseType: !398, size: 64, offset: 576)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !333, file: !233, line: 263, baseType: !405, size: 64, offset: 640)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !339, !410}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !409, line: 52, baseType: !7)
!409 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !233, line: 27, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !333, file: !233, line: 266, baseType: !413, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!24, !339, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !373, line: 305, size: 1472, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !592, !598, !599, !604, !605, !608, !609, !610, !611, !612, !613}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !417, file: !373, line: 308, baseType: !45, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !417, file: !373, line: 309, baseType: !45, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !417, file: !373, line: 313, baseType: !416, size: 64, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !417, file: !373, line: 313, baseType: !416, size: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !417, file: !373, line: 315, baseType: !244, size: 192, align: 64, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !417, file: !373, line: 323, baseType: !45, size: 64, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !417, file: !373, line: 327, baseType: !426, size: 64, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !373, line: 388, size: 7296, elements: !428)
!428 = !{!429, !588}
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !427, file: !373, line: 389, baseType: !430, size: 7296)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !373, line: 389, size: 7296, elements: !431)
!431 = !{!432, !433, !434, !438, !442, !443, !444, !445, !446, !454, !455, !456, !457, !458, !459, !460, !461, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !496, !504, !507, !533, !534, !559, !560, !563, !566, !567, !570, !571, !572, !575, !587}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !430, file: !373, line: 390, baseType: !416, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !430, file: !373, line: 391, baseType: !261, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !430, file: !373, line: 392, baseType: !435, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !285, line: 23, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !287, line: 31, baseType: !437)
!437 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !430, file: !373, line: 394, baseType: !439, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!45, !55, !45, !45, !45, !45}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !430, file: !373, line: 398, baseType: !45, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !430, file: !373, line: 399, baseType: !45, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !430, file: !373, line: 405, baseType: !45, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !430, file: !373, line: 406, baseType: !45, size: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !430, file: !373, line: 407, baseType: !447, size: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !57, line: 286, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 286, size: 64, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !449, file: !57, line: 286, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !453, line: 18, baseType: !45)
!453 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!454 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !430, file: !373, line: 416, baseType: !236, size: 32, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !430, file: !373, line: 428, baseType: !236, size: 32, offset: 608)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !430, file: !373, line: 437, baseType: !236, size: 32, offset: 640)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !430, file: !373, line: 447, baseType: !236, size: 32, offset: 672)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !430, file: !373, line: 450, baseType: !351, size: 64, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !430, file: !373, line: 452, baseType: !24, size: 32, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !430, file: !373, line: 454, baseType: !76, offset: 800)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !430, file: !373, line: 457, baseType: !462, size: 256, offset: 832)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !463, line: 35, size: 256, elements: !464)
!463 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!464 = !{!465, !466, !467, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !462, file: !463, line: 36, baseType: !351, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !462, file: !463, line: 42, baseType: !351, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !462, file: !463, line: 46, baseType: !468, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !77, line: 29, baseType: !84)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !462, file: !463, line: 47, baseType: !64, size: 128, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !430, file: !373, line: 459, baseType: !64, size: 128, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !430, file: !373, line: 466, baseType: !45, size: 64, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !430, file: !373, line: 467, baseType: !45, size: 64, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !430, file: !373, line: 469, baseType: !45, size: 64, offset: 1344)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !430, file: !373, line: 470, baseType: !45, size: 64, offset: 1408)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !430, file: !373, line: 471, baseType: !353, size: 64, offset: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !430, file: !373, line: 472, baseType: !45, size: 64, offset: 1536)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !430, file: !373, line: 473, baseType: !45, size: 64, offset: 1600)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !430, file: !373, line: 474, baseType: !45, size: 64, offset: 1664)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !430, file: !373, line: 475, baseType: !45, size: 64, offset: 1728)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !430, file: !373, line: 477, baseType: !76, offset: 1792)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !430, file: !373, line: 478, baseType: !45, size: 64, offset: 1792)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !430, file: !373, line: 478, baseType: !45, size: 64, offset: 1856)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !430, file: !373, line: 478, baseType: !45, size: 64, offset: 1920)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !430, file: !373, line: 478, baseType: !45, size: 64, offset: 1984)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !430, file: !373, line: 479, baseType: !45, size: 64, offset: 2048)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !430, file: !373, line: 479, baseType: !45, size: 64, offset: 2112)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !430, file: !373, line: 479, baseType: !45, size: 64, offset: 2176)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !430, file: !373, line: 480, baseType: !45, size: 64, offset: 2240)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !430, file: !373, line: 480, baseType: !45, size: 64, offset: 2304)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !430, file: !373, line: 480, baseType: !45, size: 64, offset: 2368)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !430, file: !373, line: 480, baseType: !45, size: 64, offset: 2432)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !430, file: !373, line: 482, baseType: !493, size: 2816, offset: 2496)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2816, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 44)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !430, file: !373, line: 488, baseType: !497, size: 256, offset: 5312)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !498, line: 60, size: 256, elements: !499)
!498 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !497, file: !498, line: 61, baseType: !501, size: 256)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 256, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 4)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !430, file: !373, line: 490, baseType: !505, size: 64, offset: 5568)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !373, line: 490, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !430, file: !373, line: 493, baseType: !508, size: 896, offset: 5632)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !509, line: 53, baseType: !510)
!509 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 13, size: 896, elements: !511)
!511 = !{!512, !513, !514, !515, !518, !519, !520, !521, !525, !526, !529}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !510, file: !509, line: 18, baseType: !435, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !510, file: !509, line: 28, baseType: !353, size: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !510, file: !509, line: 31, baseType: !462, size: 256, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !510, file: !509, line: 32, baseType: !516, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !509, line: 32, flags: DIFlagFwdDecl)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !510, file: !509, line: 37, baseType: !39, size: 16, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !510, file: !509, line: 40, baseType: !347, size: 192, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !510, file: !509, line: 41, baseType: !13, size: 64, offset: 704)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !510, file: !509, line: 42, baseType: !522, size: 64, offset: 768)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !509, line: 42, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !510, file: !509, line: 44, baseType: !236, size: 32, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !510, file: !509, line: 50, baseType: !527, size: 16, offset: 864)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !285, line: 19, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !287, line: 24, baseType: !39)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !510, file: !509, line: 51, baseType: !530, size: 16, offset: 880)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !285, line: 18, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !287, line: 23, baseType: !532)
!532 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !430, file: !373, line: 495, baseType: !45, size: 64, offset: 6528)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !430, file: !373, line: 497, baseType: !535, size: 64, offset: 6592)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !373, line: 381, size: 384, elements: !537)
!537 = !{!538, !539, !548}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !536, file: !373, line: 382, baseType: !236, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !536, file: !373, line: 383, baseType: !540, size: 128, offset: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !373, line: 376, size: 128, elements: !541)
!541 = !{!542, !546}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !540, file: !373, line: 377, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !545, line: 9, flags: DIFlagFwdDecl)
!545 = !DIFile(filename: "./arch/x86/include/asm/current.h", directory: "/home/lizy2001/genbc/linux")
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !373, line: 378, baseType: !547, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !536, file: !373, line: 384, baseType: !549, size: 192, offset: 192)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !550, line: 26, size: 192, elements: !551)
!550 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !549, file: !550, line: 27, baseType: !7, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !549, file: !550, line: 28, baseType: !554, size: 128, offset: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !555, line: 43, size: 128, elements: !556)
!555 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !554, file: !555, line: 44, baseType: !468)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !554, file: !555, line: 45, baseType: !64, size: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_lock", scope: !430, file: !373, line: 500, baseType: !76, offset: 6656)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_table", scope: !430, file: !373, line: 501, baseType: !561, size: 64, offset: 6656)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "kioctx_table", file: !373, line: 387, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !430, file: !373, line: 516, baseType: !564, size: 64, offset: 6720)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !373, line: 516, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "exe_file", scope: !430, file: !373, line: 519, baseType: !55, size: 64, offset: 6784)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_subscriptions", scope: !430, file: !373, line: 521, baseType: !568, size: 64, offset: 6848)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmu_notifier_subscriptions", file: !373, line: 521, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_pending", scope: !430, file: !373, line: 545, baseType: !236, size: 32, offset: 6912)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_batched", scope: !430, file: !373, line: 548, baseType: !185, size: 8, offset: 6944)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "uprobes_state", scope: !430, file: !373, line: 550, baseType: !573, offset: 6952)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uprobes_state", file: !574, line: 142, elements: !90)
!574 = !DIFile(filename: "./include/linux/uprobes.h", directory: "/home/lizy2001/genbc/linux")
!575 = !DIDerivedType(tag: DW_TAG_member, name: "async_put_work", scope: !430, file: !373, line: 554, baseType: !576, size: 256, offset: 6976)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !577, line: 102, size: 256, elements: !578)
!577 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !576, file: !577, line: 103, baseType: !351, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !576, file: !577, line: 104, baseType: !64, size: 128, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !576, file: !577, line: 105, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !577, line: 21, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{null, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pasid", scope: !430, file: !373, line: 557, baseType: !284, size: 32, offset: 7232)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_bitmap", scope: !427, file: !373, line: 565, baseType: !589, offset: 7296)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: -1)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !417, file: !373, line: 333, baseType: !593, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !57, line: 284, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !57, line: 284, size: 64, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !594, file: !57, line: 284, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !453, line: 19, baseType: !45)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !417, file: !373, line: 334, baseType: !45, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !417, file: !373, line: 343, baseType: !600, size: 256, offset: 704)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !373, line: 340, size: 256, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !600, file: !373, line: 341, baseType: !244, size: 192, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !600, file: !373, line: 342, baseType: !45, size: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !417, file: !373, line: 351, baseType: !64, size: 128, offset: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !417, file: !373, line: 353, baseType: !606, size: 64, offset: 1088)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !373, line: 353, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !417, file: !373, line: 356, baseType: !370, size: 64, offset: 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !417, file: !373, line: 359, baseType: !45, size: 64, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !417, file: !373, line: 361, baseType: !55, size: 64, offset: 1280)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !417, file: !373, line: 362, baseType: !13, size: 64, offset: 1344)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !417, file: !373, line: 365, baseType: !351, size: 64, offset: 1408)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !417, file: !373, line: 373, baseType: !614, offset: 1472)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !373, line: 296, elements: !90)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !328, file: !233, line: 109, baseType: !616, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_node", file: !233, line: 31, flags: DIFlagFwdDecl)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !328, file: !233, line: 110, baseType: !387, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "notify_next", scope: !328, file: !233, line: 111, baseType: !231, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !232, file: !233, line: 148, baseType: !13, size: 64, offset: 768)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !232, file: !233, line: 154, baseType: !435, size: 64, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !233, line: 156, baseType: !39, size: 16, offset: 896)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !232, file: !233, line: 157, baseType: !38, size: 16, offset: 912)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "iattr", scope: !232, file: !233, line: 158, baseType: !625, size: 64, offset: 960)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_iattrs", file: !233, line: 32, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "kref", scope: !59, file: !60, line: 71, baseType: !628, size: 32, offset: 448)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kref", file: !629, line: 19, size: 32, elements: !630)
!629 = !DIFile(filename: "./include/linux/kref.h", directory: "/home/lizy2001/genbc/linux")
!630 = !{!631}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !628, file: !629, line: 20, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !633, line: 113, baseType: !634)
!633 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !633, line: 111, size: 32, elements: !635)
!635 = !{!636}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !634, file: !633, line: 112, baseType: !236, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "state_initialized", scope: !59, file: !60, line: 75, baseType: !7, size: 1, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "state_in_sysfs", scope: !59, file: !60, line: 76, baseType: !7, size: 1, offset: 481, flags: DIFlagBitField, extraData: i64 480)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "state_add_uevent_sent", scope: !59, file: !60, line: 77, baseType: !7, size: 1, offset: 482, flags: DIFlagBitField, extraData: i64 480)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "state_remove_uevent_sent", scope: !59, file: !60, line: 78, baseType: !7, size: 1, offset: 483, flags: DIFlagBitField, extraData: i64 480)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_suppress", scope: !59, file: !60, line: 79, baseType: !7, size: 1, offset: 484, flags: DIFlagBitField, extraData: i64 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !28, file: !29, line: 174, baseType: !48, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !28, file: !29, line: 176, baseType: !644, size: 64, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!24, !55, !58, !168, !416}
!647 = !{!0}
!648 = !{i32 7, !"Dwarf Version", i32 4}
!649 = !{i32 2, !"Debug Info Version", i32 3}
!650 = !{i32 1, !"wchar_size", i32 2}
!651 = !{i32 1, !"Code Model", i32 2}
!652 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!653 = distinct !DISubprogram(name: "of_node_is_attached", scope: !3, file: !3, line: 14, type: !654, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !90)
!654 = !DISubroutineType(types: !655)
!655 = !{!24, !656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !18, line: 51, size: 1344, elements: !658)
!658 = !{!659, !660, !662, !663, !757, !758, !759, !760, !761, !762, !763, !764}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !657, file: !18, line: 52, baseType: !35, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !657, file: !18, line: 53, baseType: !661, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !18, line: 28, baseType: !284)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !657, file: !18, line: 54, baseType: !35, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !657, file: !18, line: 55, baseType: !664, size: 192, offset: 192)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !665, line: 17, size: 192, elements: !666)
!665 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!666 = !{!667, !669, !756}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !664, file: !665, line: 18, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !664, file: !665, line: 19, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !665, line: 110, size: 1152, elements: !673)
!673 = !{!674, !678, !682, !688, !695, !699, !703, !708, !712, !713, !717, !721, !725, !738, !739, !740, !741, !751}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !672, file: !665, line: 111, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!668, !668}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !672, file: !665, line: 112, baseType: !679, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !668}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !672, file: !665, line: 113, baseType: !683, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!185, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !672, file: !665, line: 114, baseType: !689, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!195, !686, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !665, line: 15, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "property_present", scope: !672, file: !665, line: 116, baseType: !696, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!185, !686, !35}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_int_array", scope: !672, file: !665, line: 118, baseType: !700, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!24, !686, !35, !7, !13, !41}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "property_read_string_array", scope: !672, file: !665, line: 123, baseType: !704, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!24, !686, !35, !707, !41}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "get_name", scope: !672, file: !665, line: 126, baseType: !709, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!35, !686}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "get_name_prefix", scope: !672, file: !665, line: 127, baseType: !709, size: 64, offset: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_parent", scope: !672, file: !665, line: 128, baseType: !714, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!668, !686}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "get_next_child_node", scope: !672, file: !665, line: 130, baseType: !718, size: 64, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!668, !686, !668}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "get_named_child_node", scope: !672, file: !665, line: 133, baseType: !722, size: 64, offset: 704)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!668, !686, !35}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "get_reference_args", scope: !672, file: !665, line: 135, baseType: !726, size: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!24, !686, !35, !35, !7, !7, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_reference_args", file: !665, line: 43, size: 640, elements: !731)
!731 = !{!732, !733, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !730, file: !665, line: 44, baseType: !668, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !730, file: !665, line: 45, baseType: !7, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !730, file: !665, line: 46, baseType: !735, size: 512, offset: 128)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 512, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_next_endpoint", scope: !672, file: !665, line: 140, baseType: !718, size: 64, offset: 832)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_remote_endpoint", scope: !672, file: !665, line: 143, baseType: !714, size: 64, offset: 896)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "graph_get_port_parent", scope: !672, file: !665, line: 145, baseType: !675, size: 64, offset: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "graph_parse_endpoint", scope: !672, file: !665, line: 146, baseType: !742, size: 64, offset: 1024)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!24, !686, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_endpoint", file: !665, line: 29, size: 128, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !746, file: !665, line: 30, baseType: !7, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !746, file: !665, line: 31, baseType: !7, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "local_fwnode", scope: !746, file: !665, line: 32, baseType: !686, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "add_links", scope: !672, file: !665, line: 148, baseType: !752, size: 64, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!24, !686, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !664, file: !665, line: 20, baseType: !755, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !657, file: !18, line: 57, baseType: !16, size: 64, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "deadprops", scope: !657, file: !18, line: 58, baseType: !16, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !657, file: !18, line: 59, baseType: !656, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !657, file: !18, line: 60, baseType: !656, size: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !657, file: !18, line: 61, baseType: !656, size: 64, offset: 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !657, file: !18, line: 63, baseType: !59, size: 512, offset: 704)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !657, file: !18, line: 65, baseType: !45, size: 64, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !657, file: !18, line: 66, baseType: !13, size: 64, offset: 1280)
!765 = !DILocalVariable(name: "node", arg: 1, scope: !653, file: !3, line: 14, type: !656)
!766 = !DILocation(line: 14, column: 45, scope: !653)
!767 = !DILocation(line: 16, column: 9, scope: !653)
!768 = !DILocation(line: 16, column: 14, scope: !653)
!769 = !DILocation(line: 16, column: 17, scope: !653)
!770 = !DILocation(line: 16, column: 23, scope: !653)
!771 = !DILocation(line: 16, column: 28, scope: !653)
!772 = !DILocation(line: 0, scope: !653)
!773 = !DILocation(line: 16, column: 2, scope: !653)
!774 = distinct !DISubprogram(name: "of_node_release", scope: !3, file: !3, line: 21, type: !135, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !90)
!775 = !DILocalVariable(name: "kobj", arg: 1, scope: !774, file: !3, line: 21, type: !58)
!776 = !DILocation(line: 21, column: 45, scope: !774)
!777 = !DILocation(line: 24, column: 1, scope: !774)
!778 = distinct !DISubprogram(name: "__of_add_property_sysfs", scope: !3, file: !3, line: 63, type: !779, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !90)
!779 = !DISubroutineType(types: !780)
!780 = !{!24, !656, !16}
!781 = !DILocalVariable(name: "np", arg: 1, scope: !778, file: !3, line: 63, type: !656)
!782 = !DILocation(line: 63, column: 49, scope: !778)
!783 = !DILocalVariable(name: "pp", arg: 2, scope: !778, file: !3, line: 63, type: !16)
!784 = !DILocation(line: 63, column: 70, scope: !778)
!785 = !DILocalVariable(name: "rc", scope: !778, file: !3, line: 65, type: !24)
!786 = !DILocation(line: 65, column: 6, scope: !778)
!787 = !DILocalVariable(name: "secure", scope: !778, file: !3, line: 68, type: !185)
!788 = !DILocation(line: 68, column: 7, scope: !778)
!789 = !DILocation(line: 68, column: 24, scope: !778)
!790 = !DILocation(line: 68, column: 28, scope: !778)
!791 = !DILocation(line: 68, column: 16, scope: !778)
!792 = !DILocation(line: 68, column: 50, scope: !778)
!793 = !DILocation(line: 73, column: 7, scope: !794)
!794 = distinct !DILexicalBlock(scope: !778, file: !3, line: 73, column: 6)
!795 = !DILocation(line: 73, column: 15, scope: !794)
!796 = !DILocation(line: 73, column: 39, scope: !794)
!797 = !DILocation(line: 73, column: 19, scope: !794)
!798 = !DILocation(line: 73, column: 6, scope: !778)
!799 = !DILocation(line: 74, column: 3, scope: !794)
!800 = !DILocation(line: 76, column: 2, scope: !778)
!801 = !DILocation(line: 76, column: 2, scope: !802)
!802 = distinct !DILexicalBlock(scope: !778, file: !3, line: 76, column: 2)
!803 = !DILocation(line: 77, column: 34, scope: !778)
!804 = !DILocation(line: 77, column: 38, scope: !778)
!805 = !DILocation(line: 77, column: 44, scope: !778)
!806 = !DILocation(line: 77, column: 48, scope: !778)
!807 = !DILocation(line: 77, column: 23, scope: !778)
!808 = !DILocation(line: 77, column: 2, scope: !778)
!809 = !DILocation(line: 77, column: 6, scope: !778)
!810 = !DILocation(line: 77, column: 11, scope: !778)
!811 = !DILocation(line: 77, column: 16, scope: !778)
!812 = !DILocation(line: 77, column: 21, scope: !778)
!813 = !DILocation(line: 78, column: 23, scope: !778)
!814 = !DILocation(line: 78, column: 2, scope: !778)
!815 = !DILocation(line: 78, column: 6, scope: !778)
!816 = !DILocation(line: 78, column: 11, scope: !778)
!817 = !DILocation(line: 78, column: 16, scope: !778)
!818 = !DILocation(line: 78, column: 21, scope: !778)
!819 = !DILocation(line: 79, column: 18, scope: !778)
!820 = !DILocation(line: 79, column: 31, scope: !778)
!821 = !DILocation(line: 79, column: 35, scope: !778)
!822 = !DILocation(line: 79, column: 2, scope: !778)
!823 = !DILocation(line: 79, column: 6, scope: !778)
!824 = !DILocation(line: 79, column: 11, scope: !778)
!825 = !DILocation(line: 79, column: 16, scope: !778)
!826 = !DILocation(line: 80, column: 2, scope: !778)
!827 = !DILocation(line: 80, column: 6, scope: !778)
