; ModuleID = '../bcout/drivers/isdn/hardware/mISDN/isdnhdlc.llvm.bc'
source_filename = "drivers/isdn/hardware/mISDN/isdnhdlc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.isdnhdlc_vars = type { i32, i32, i32, i32, i32, i32, i16, i8, i8, i8, i8 }

@__UNIQUE_ID_author104 = internal constant [138 x i8] c"isdnhdlc.author=Wolfgang M\C3\BCes <wolfgang@iksw-muees.de>, Frode Isaksen <fisaksen@bewan.com>, Kai Germaschewski <kai.germaschewski@gmx.de>\00", section ".modinfo", align 1, !dbg !0
@__UNIQUE_ID_description105 = internal constant [55 x i8] c"isdnhdlc.description=General purpose ISDN HDLC decoder\00", section ".modinfo", align 1, !dbg !36
@__UNIQUE_ID_file106 = internal constant [51 x i8] c"isdnhdlc.file=drivers/isdn/hardware/mISDN/isdnhdlc\00", section ".modinfo", align 1, !dbg !43
@__UNIQUE_ID_license107 = internal constant [21 x i8] c"isdnhdlc.license=GPL\00", section ".modinfo", align 1, !dbg !48
@isdnhdlc_decode.fast_flag = internal constant [9 x i8] c"\00\00\00 08<>?", align 1, !dbg !53
@isdnhdlc_decode.fast_flag_value = internal constant [9 x i8] c"\00~\FC\F9\F3\E7\CF\9F?", align 1, !dbg !92
@isdnhdlc_decode.fast_abort = internal constant [10 x i8] c"\00\00\80\C0\E0\F0\F8\FC\FE\FF", align 1, !dbg !94
@isdnhdlc_encode.xfast_flag_value = internal constant [9 x i8] c"~?\9F\CF\E7\F3\F9\FC~", align 1, !dbg !99
@byte_rev_table = external dso_local constant [256 x i8], align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_author104", scope: !2, file: !3, line: 20, type: !104, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !29, globals: !35, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/isdn/hardware/mISDN/isdnhdlc.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 28, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12, !13}
!8 = !DIEnumerator(name: "HDLC_FAST_IDLE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "HDLC_GET_FLAG_B0", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "HDLC_GETFLAG_B1A6", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "HDLC_GETFLAG_B7", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "HDLC_GET_DATA", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "HDLC_FAST_FLAG", value: 5, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 33, baseType: !6, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28}
!16 = !DIEnumerator(name: "HDLC_SEND_DATA", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "HDLC_SEND_CRC1", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "HDLC_SEND_FAST_FLAG", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "HDLC_SEND_FIRST_FLAG", value: 3, isUnsigned: true)
!20 = !DIEnumerator(name: "HDLC_SEND_CRC2", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "HDLC_SEND_CLOSING_FLAG", value: 5, isUnsigned: true)
!22 = !DIEnumerator(name: "HDLC_SEND_IDLE1", value: 6, isUnsigned: true)
!23 = !DIEnumerator(name: "HDLC_SEND_FAST_IDLE", value: 7, isUnsigned: true)
!24 = !DIEnumerator(name: "HDLC_SENDFLAG_B0", value: 8, isUnsigned: true)
!25 = !DIEnumerator(name: "HDLC_SENDFLAG_B1A6", value: 9, isUnsigned: true)
!26 = !DIEnumerator(name: "HDLC_SENDFLAG_B7", value: 10, isUnsigned: true)
!27 = !DIEnumerator(name: "STOPPED", value: 11, isUnsigned: true)
!28 = !DIEnumerator(name: "HDLC_SENDFLAG_ONE", value: 12, isUnsigned: true)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !31, line: 17, baseType: !32)
!31 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !33, line: 21, baseType: !34)
!33 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!0, !36, !43, !48, !53, !92, !94, !99}
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_description105", scope: !2, file: !3, line: 23, type: !38, isLocal: true, isDefinition: true, align: 8)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 440, elements: !41)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!41 = !{!42}
!42 = !DISubrange(count: 55)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file106", scope: !2, file: !3, line: 24, type: !45, isLocal: true, isDefinition: true, align: 8)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 408, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 51)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license107", scope: !2, file: !3, line: 24, type: !50, isLocal: true, isDefinition: true, align: 8)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 168, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 21)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "fast_flag", scope: !55, file: !3, line: 123, type: !88, isLocal: true, isDefinition: true)
!55 = distinct !DISubprogram(name: "isdnhdlc_decode", scope: !3, file: !3, line: 118, type: !56, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !59, !83, !58, !85, !86, !58}
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "isdnhdlc_vars", file: !61, line: 19, size: 256, elements: !62)
!61 = !DIFile(filename: "drivers/isdn/hardware/mISDN/isdnhdlc.h", directory: "/home/lizy2001/genbc/linux")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !73, !74, !75, !76, !79, !80, !81, !82}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "bit_shift", scope: !60, file: !61, line: 20, baseType: !58, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "hdlc_bits1", scope: !60, file: !61, line: 21, baseType: !58, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !60, file: !61, line: 22, baseType: !58, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit_shift", scope: !60, file: !61, line: 23, baseType: !58, size: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !60, file: !61, line: 24, baseType: !58, size: 32, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "dstpos", scope: !60, file: !61, line: 25, baseType: !58, size: 32, offset: 160)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !60, file: !61, line: 27, baseType: !70, size: 16, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !31, line: 19, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !33, line: 24, baseType: !72)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cbin", scope: !60, file: !61, line: 29, baseType: !30, size: 8, offset: 208)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "shift_reg", scope: !60, file: !61, line: 30, baseType: !30, size: 8, offset: 216)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ffvalue", scope: !60, file: !61, line: 31, baseType: !30, size: 8, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data_received", scope: !60, file: !61, line: 34, baseType: !77, size: 1, offset: 232, flags: DIFlagBitField, extraData: i64 232)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !31, line: 21, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !33, line: 27, baseType: !6)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "dchannel", scope: !60, file: !61, line: 36, baseType: !77, size: 1, offset: 233, flags: DIFlagBitField, extraData: i64 232)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "do_adapt56", scope: !60, file: !61, line: 38, baseType: !77, size: 1, offset: 234, flags: DIFlagBitField, extraData: i64 232)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "do_closing", scope: !60, file: !61, line: 40, baseType: !77, size: 1, offset: 235, flags: DIFlagBitField, extraData: i64 232)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "do_bitreverse", scope: !60, file: !61, line: 42, baseType: !77, size: 1, offset: 236, flags: DIFlagBitField, extraData: i64 232)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!87 = !{}
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 72, elements: !90)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!90 = !{!91}
!91 = !DISubrange(count: 9)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "fast_flag_value", scope: !55, file: !3, line: 127, type: !88, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "fast_abort", scope: !55, file: !3, line: 131, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 80, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 10)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "xfast_flag_value", scope: !101, file: !3, line: 344, type: !88, isLocal: true, isDefinition: true)
!101 = distinct !DISubprogram(name: "isdnhdlc_encode", scope: !3, file: !3, line: 341, type: !102, scopeLine: 343, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!102 = !DISubroutineType(types: !103)
!103 = !{!58, !59, !83, !70, !85, !86, !58}
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 1104, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 138)
!107 = !{i32 7, !"Dwarf Version", i32 4}
!108 = !{i32 2, !"Debug Info Version", i32 3}
!109 = !{i32 1, !"wchar_size", i32 2}
!110 = !{i32 1, !"Code Model", i32 2}
!111 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!112 = distinct !DISubprogram(name: "isdnhdlc_rcv_init", scope: !3, file: !3, line: 40, type: !113, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !59, !77}
!115 = !DILocalVariable(name: "hdlc", arg: 1, scope: !112, file: !3, line: 40, type: !59)
!116 = !DILocation(line: 40, column: 46, scope: !112)
!117 = !DILocalVariable(name: "features", arg: 2, scope: !112, file: !3, line: 40, type: !77)
!118 = !DILocation(line: 40, column: 56, scope: !112)
!119 = !DILocation(line: 42, column: 9, scope: !112)
!120 = !DILocation(line: 42, column: 2, scope: !112)
!121 = !DILocation(line: 43, column: 2, scope: !112)
!122 = !DILocation(line: 43, column: 8, scope: !112)
!123 = !DILocation(line: 43, column: 14, scope: !112)
!124 = !DILocation(line: 44, column: 6, scope: !125)
!125 = distinct !DILexicalBlock(scope: !112, file: !3, line: 44, column: 6)
!126 = !DILocation(line: 44, column: 15, scope: !125)
!127 = !DILocation(line: 44, column: 6, scope: !112)
!128 = !DILocation(line: 45, column: 3, scope: !125)
!129 = !DILocation(line: 45, column: 9, scope: !125)
!130 = !DILocation(line: 45, column: 20, scope: !125)
!131 = !DILocation(line: 46, column: 6, scope: !132)
!132 = distinct !DILexicalBlock(scope: !112, file: !3, line: 46, column: 6)
!133 = !DILocation(line: 46, column: 15, scope: !132)
!134 = !DILocation(line: 46, column: 6, scope: !112)
!135 = !DILocation(line: 47, column: 3, scope: !132)
!136 = !DILocation(line: 47, column: 9, scope: !132)
!137 = !DILocation(line: 47, column: 23, scope: !132)
!138 = !DILocation(line: 48, column: 1, scope: !112)
!139 = distinct !DISubprogram(name: "isdnhdlc_out_init", scope: !3, file: !3, line: 51, type: !113, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !87)
