; ModuleID = '../bcout/drivers/cpuidle/cpuidle.llvm.bc'
source_filename = "drivers/cpuidle/cpuidle.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall1.init\22, \22a\22\09"
module asm "__initcall_cpuidle_init1:\09\09\09"
module asm ".long\09cpuidle_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.cpuidle_device = type { i8, i32, i64, i32, i64, i64, i64, [10 x %struct.cpuidle_state_usage], [10 x %struct.cpuidle_state_kobj*], %struct.cpuidle_driver_kobj*, %struct.cpuidle_device_kobj*, %struct.list_head }
%struct.cpuidle_state_usage = type { i64, i64, i64, i64, i64, i64, i64, i64 }
%struct.cpuidle_state_kobj = type opaque
%struct.cpuidle_driver_kobj = type opaque
%struct.cpuidle_device_kobj = type opaque
%struct.cpuidle_governor = type { [16 x i8], %struct.list_head, i32, i32 (%struct.cpuidle_driver*, %struct.cpuidle_device*)*, void (%struct.cpuidle_driver*, %struct.cpuidle_device*)*, i32 (%struct.cpuidle_driver*, %struct.cpuidle_device*, i8*)*, void (%struct.cpuidle_device*, i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cpuidle_lock", scope: !2, file: !3, line: 33, type: !187, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !16, globals: !79, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/cpuidle/cpuidle.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tick_broadcast_state", file: !12, line: 60, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/tick.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "TICK_BROADCAST_EXIT", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TICK_BROADCAST_ENTER", value: 1, isUnsigned: true)
!16 = !{!17, !73, !18, !74, !37, !75, !77}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_device", file: !20, line: 92, size: 6400, elements: !21)
!20 = !DIFile(filename: "./include/linux/cpuidle.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !23, !24, !25, !26, !34, !36, !40, !41, !42, !56, !60, !63, !66}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "registered", scope: !19, file: !20, line: 93, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !19, file: !20, line: 94, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "poll_time_limit", scope: !19, file: !20, line: 95, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !19, file: !20, line: 96, baseType: !7, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "next_hrtimer", scope: !19, file: !20, line: 97, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !28, line: 29, baseType: !29)
!28 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !30, line: 22, baseType: !31)
!30 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !32, line: 30, baseType: !33)
!32 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "last_state_idx", scope: !19, file: !20, line: 99, baseType: !35, size: 32, offset: 128)
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "last_residency_ns", scope: !19, file: !20, line: 100, baseType: !37, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !30, line: 23, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !32, line: 31, baseType: !39)
!39 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "poll_limit_ns", scope: !19, file: !20, line: 101, baseType: !37, size: 64, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "forced_idle_latency_limit_ns", scope: !19, file: !20, line: 102, baseType: !37, size: 64, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "states_usage", scope: !19, file: !20, line: 103, baseType: !43, size: 5120, offset: 384)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 5120, elements: !54)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state_usage", file: !20, line: 35, size: 512, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !44, file: !20, line: 36, baseType: !39, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !44, file: !20, line: 37, baseType: !39, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !44, file: !20, line: 38, baseType: !37, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !44, file: !20, line: 39, baseType: !39, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "below", scope: !44, file: !20, line: 40, baseType: !39, size: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rejected", scope: !44, file: !20, line: 41, baseType: !39, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "s2idle_usage", scope: !44, file: !20, line: 43, baseType: !39, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "s2idle_time", scope: !44, file: !20, line: 44, baseType: !39, size: 64, offset: 448)
!54 = !{!55}
!55 = !DISubrange(count: 10)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kobjs", scope: !19, file: !20, line: 104, baseType: !57, size: 640, offset: 5504)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 640, elements: !54)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state_kobj", file: !20, line: 89, flags: DIFlagFwdDecl)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_driver", scope: !19, file: !20, line: 105, baseType: !61, size: 64, offset: 6144)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_driver_kobj", file: !20, line: 90, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_dev", scope: !19, file: !20, line: 106, baseType: !64, size: 64, offset: 6208)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_device_kobj", file: !20, line: 88, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !19, file: !20, line: 107, baseType: !67, size: 128, offset: 6272)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !68, line: 178, size: 128, elements: !69)
!68 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!69 = !{!70, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !67, file: !68, line: 179, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !67, file: !68, line: 179, baseType: !71, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!74 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !27)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!79 = !{!0, !80, !82, !151, !156, !158, !163, !165, !167, !169, !171, !173, !175, !180, !185}
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "cpuidle_detected_devices", scope: !2, file: !3, line: 34, type: !67, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "__param_off", scope: !2, file: !3, line: 756, type: !84, isLocal: true, isDefinition: true, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !86, line: 69, size: 320, elements: !87)
!86 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!87 = !{!88, !92, !96, !116, !121, !125, !129}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !86, line: 70, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !85, file: !86, line: 71, baseType: !93, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !95, line: 76, flags: DIFlagFwdDecl)
!95 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !85, file: !86, line: 72, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !86, line: 47, size: 256, elements: !100)
!100 = !{!101, !102, !107, !112}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !86, line: 49, baseType: !7, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !99, file: !86, line: 51, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{!35, !89, !106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !99, file: !86, line: 53, baseType: !108, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!35, !111, !106}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !99, file: !86, line: 55, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{null, !73}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !85, file: !86, line: 73, baseType: !117, size: 16, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !30, line: 19, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !32, line: 24, baseType: !120)
!120 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !85, file: !86, line: 74, baseType: !122, size: 8, offset: 208)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !30, line: 16, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !32, line: 20, baseType: !124)
!124 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !85, file: !86, line: 75, baseType: !126, size: 8, offset: 216)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !30, line: 17, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !32, line: 21, baseType: !128)
!128 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_member, scope: !85, file: !86, line: 76, baseType: !130, size: 64, offset: 256)
!130 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !85, file: !86, line: 76, size: 64, elements: !131)
!131 = !{!132, !133, !140}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !130, file: !86, line: 77, baseType: !73, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !130, file: !86, line: 78, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !86, line: 86, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !136, file: !86, line: 87, baseType: !7, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !136, file: !86, line: 88, baseType: !111, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !130, file: !86, line: 79, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !86, line: 92, size: 256, elements: !144)
!144 = !{!145, !146, !147, !149, !150}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !143, file: !86, line: 94, baseType: !7, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !143, file: !86, line: 95, baseType: !7, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !143, file: !86, line: 96, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !143, file: !86, line: 97, baseType: !97, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !143, file: !86, line: 98, baseType: !73, size: 64, offset: 192)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_offtype312", scope: !2, file: !3, line: 756, type: !153, isLocal: true, isDefinition: true, align: 8)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 200, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 25)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "__param_governor", scope: !2, file: !3, line: 757, type: !84, isLocal: true, isDefinition: true, align: 64)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_governortype313", scope: !2, file: !3, line: 757, type: !160, isLocal: true, isDefinition: true, align: 8)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 264, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 33)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_cpuidle_init314", scope: !2, file: !3, line: 758, type: !73, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "cpuidle_devices", scope: !2, file: !3, line: 30, type: !18, isLocal: false, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "cpuidle_dev", scope: !2, file: !3, line: 31, type: !19, isLocal: false, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "enabled_devices", scope: !2, file: !3, line: 36, type: !35, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "off", scope: !2, file: !3, line: 37, type: !35, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "initialized", scope: !2, file: !3, line: 38, type: !35, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__param_str_off", scope: !2, file: !3, line: 756, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 96, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 12)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "__param_str_governor", scope: !2, file: !3, line: 757, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 136, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 17)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "__param_string_governor", scope: !2, file: !3, line: 757, type: !135, isLocal: true, isDefinition: true)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !188, line: 53, size: 192, elements: !189)
!188 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!189 = !{!190, !197, !213}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !187, file: !188, line: 54, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !192, line: 13, baseType: !193)
!192 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !68, line: 175, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 173, size: 64, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !194, file: !68, line: 174, baseType: !29, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !187, file: !188, line: 55, baseType: !198, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !199, line: 83, baseType: !200)
!199 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !199, line: 71, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, scope: !200, file: !199, line: 72, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !200, file: !199, line: 72, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !203, file: !199, line: 73, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !199, line: 20, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !206, file: !199, line: 21, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !210, line: 25, baseType: !211)
!210 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 25, elements: !212)
!212 = !{}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !187, file: !188, line: 59, baseType: !67, size: 128, offset: 64)
!214 = !{!"rsp"}
!215 = !{i32 7, !"Dwarf Version", i32 4}
!216 = !{i32 2, !"Debug Info Version", i32 3}
!217 = !{i32 1, !"wchar_size", i32 2}
!218 = !{i32 1, !"Code Model", i32 2}
!219 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!220 = distinct !DISubprogram(name: "cpuidle_disabled", scope: !3, file: !3, line: 40, type: !221, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !212)
!221 = !DISubroutineType(types: !222)
!222 = !{!35}
!223 = !DILocation(line: 42, column: 9, scope: !220)
!224 = !DILocation(line: 42, column: 2, scope: !220)
!225 = distinct !DISubprogram(name: "disable_cpuidle", scope: !3, file: !3, line: 44, type: !226, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !212)
!226 = !DISubroutineType(types: !227)
!227 = !{null}
!228 = !DILocation(line: 46, column: 6, scope: !225)
!229 = !DILocation(line: 47, column: 1, scope: !225)
!230 = distinct !DISubprogram(name: "cpuidle_not_available", scope: !3, file: !3, line: 49, type: !231, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !212)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !235, !18}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !68, line: 30, baseType: !234)
!234 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_driver", file: !20, line: 122, size: 8704, elements: !237)
!237 = !{!238, !239, !240, !241, !268, !269, !270, !279}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !20, line: 123, baseType: !89, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !236, file: !20, line: 124, baseType: !93, size: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bctimer", scope: !236, file: !20, line: 127, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !236, file: !20, line: 129, baseType: !242, size: 8320, offset: 192)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 8320, elements: !54)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state", file: !20, line: 48, size: 832, elements: !244)
!244 = !{!245, !249, !253, !254, !255, !256, !257, !258, !259, !263, !267}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !20, line: 49, baseType: !246, size: 128)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !243, file: !20, line: 50, baseType: !250, size: 256, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_ns", scope: !243, file: !20, line: 52, baseType: !37, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "target_residency_ns", scope: !243, file: !20, line: 53, baseType: !37, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !20, line: 54, baseType: !7, size: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency", scope: !243, file: !20, line: 55, baseType: !7, size: 32, offset: 544)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "power_usage", scope: !243, file: !20, line: 56, baseType: !35, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "target_residency", scope: !243, file: !20, line: 57, baseType: !7, size: 32, offset: 608)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "enter", scope: !243, file: !20, line: 59, baseType: !260, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!35, !18, !235, !35}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "enter_dead", scope: !243, file: !20, line: 63, baseType: !264, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!35, !18, !35}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "enter_s2idle", scope: !243, file: !20, line: 73, baseType: !260, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !236, file: !20, line: 130, baseType: !35, size: 32, offset: 8512)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "safe_state_index", scope: !236, file: !20, line: 131, baseType: !35, size: 32, offset: 8544)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "cpumask", scope: !236, file: !20, line: 134, baseType: !271, size: 64, offset: 8576)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !273, line: 17, size: 64, elements: !274)
!273 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !272, file: !273, line: 17, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 64, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 1)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "governor", scope: !236, file: !20, line: 137, baseType: !89, size: 64, offset: 8640)
!280 = !DILocalVariable(name: "drv", arg: 1, scope: !230, file: !3, line: 49, type: !235)
!281 = !DILocation(line: 49, column: 51, scope: !230)
!282 = !DILocalVariable(name: "dev", arg: 2, scope: !230, file: !3, line: 50, type: !18)
!283 = !DILocation(line: 50, column: 30, scope: !230)
!284 = !DILocation(line: 52, column: 9, scope: !230)
!285 = !DILocation(line: 52, column: 13, scope: !230)
!286 = !DILocation(line: 52, column: 17, scope: !230)
!287 = !DILocation(line: 52, column: 29, scope: !230)
!288 = !DILocation(line: 52, column: 33, scope: !230)
!289 = !DILocation(line: 52, column: 37, scope: !230)
!290 = !DILocation(line: 52, column: 41, scope: !230)
!291 = !DILocation(line: 52, column: 45, scope: !230)
!292 = !DILocation(line: 52, column: 49, scope: !230)
!293 = !DILocation(line: 52, column: 54, scope: !230)
!294 = !DILocation(line: 52, column: 48, scope: !230)
!295 = !DILocation(line: 52, column: 2, scope: !230)
!296 = distinct !DISubprogram(name: "cpuidle_play_dead", scope: !3, file: !3, line: 60, type: !221, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !212)
!297 = !DILocalVariable(name: "dev", scope: !296, file: !3, line: 62, type: !18)
!298 = !DILocation(line: 62, column: 25, scope: !296)
!299 = !DILocation(line: 62, column: 31, scope: !300)
!300 = distinct !DILexicalBlock(scope: !296, file: !3, line: 62, column: 31)
!301 = !DILocalVariable(name: "pscr_ret__", scope: !302, file: !3, line: 62, type: !18)
!302 = distinct !DILexicalBlock(scope: !300, file: !3, line: 62, column: 31)
!303 = !DILocation(line: 62, column: 31, scope: !302)
!304 = !DILocalVariable(name: "__vpp_verify", scope: !305, file: !3, line: 62, type: !306)
!305 = distinct !DILexicalBlock(scope: !302, file: !3, line: 62, column: 31)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!308 = !DILocation(line: 62, column: 31, scope: !305)
!309 = !DILocalVariable(name: "pfo_val__", scope: !310, file: !3, line: 62, type: !37)
!310 = distinct !DILexicalBlock(scope: !302, file: !3, line: 62, column: 31)
!311 = !DILocation(line: 62, column: 31, scope: !310)
!312 = !{i32 -2139965241}
!313 = !DILocalVariable(name: "drv", scope: !296, file: !3, line: 63, type: !235)
!314 = !DILocation(line: 63, column: 25, scope: !296)
!315 = !DILocation(line: 63, column: 54, scope: !296)
!316 = !DILocation(line: 63, column: 31, scope: !296)
!317 = !DILocalVariable(name: "i", scope: !296, file: !3, line: 64, type: !35)
!318 = !DILocation(line: 64, column: 6, scope: !296)
!319 = !DILocation(line: 66, column: 7, scope: !320)
!320 = distinct !DILexicalBlock(scope: !296, file: !3, line: 66, column: 6)
!321 = !DILocation(line: 66, column: 6, scope: !296)
!322 = !DILocation(line: 67, column: 3, scope: !320)
!323 = !DILocation(line: 70, column: 11, scope: !324)
!324 = distinct !DILexicalBlock(scope: !296, file: !3, line: 70, column: 2)
!325 = !DILocation(line: 70, column: 16, scope: !324)
!326 = !DILocation(line: 70, column: 28, scope: !324)
!327 = !DILocation(line: 70, column: 9, scope: !324)
!328 = !DILocation(line: 70, column: 7, scope: !324)
!329 = !DILocation(line: 70, column: 33, scope: !330)
!330 = distinct !DILexicalBlock(scope: !324, file: !3, line: 70, column: 2)
!331 = !DILocation(line: 70, column: 35, scope: !330)
!332 = !DILocation(line: 70, column: 2, scope: !324)
!333 = !DILocation(line: 71, column: 7, scope: !334)
!334 = distinct !DILexicalBlock(scope: !330, file: !3, line: 71, column: 7)
!335 = !DILocation(line: 71, column: 12, scope: !334)
!336 = !DILocation(line: 71, column: 19, scope: !334)
!337 = !DILocation(line: 71, column: 22, scope: !334)
!338 = !DILocation(line: 71, column: 7, scope: !330)
!339 = !DILocation(line: 72, column: 11, scope: !334)
!340 = !DILocation(line: 72, column: 16, scope: !334)
