; ModuleID = '../bcout/drivers/cpuidle/driver.llvm.bc'
source_filename = "drivers/cpuidle/driver.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.cpuidle_governor = type { [16 x i8], %struct.list_head, i32, i32 (%struct.cpuidle_driver*, %struct.cpuidle_device*)*, void (%struct.cpuidle_driver*, %struct.cpuidle_device*)*, i32 (%struct.cpuidle_driver*, %struct.cpuidle_device*, i8*)*, void (%struct.cpuidle_device*, i32)* }
%struct.cpuidle_driver = type { i8*, %struct.module*, i8, [10 x %struct.cpuidle_state], i32, i32, %struct.cpumask*, i8* }
%struct.module = type opaque
%struct.cpuidle_state = type { [16 x i8], [32 x i8], i64, i64, i32, i32, i32, i32, i32 (%struct.cpuidle_device*, %struct.cpuidle_driver*, i32)*, i32 (%struct.cpuidle_device*, i32)*, i32 (%struct.cpuidle_device*, %struct.cpuidle_driver*, i32)* }
%struct.cpumask = type { [1 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "cpuidle_driver_lock", scope: !2, file: !3, line: 22, type: !127, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !81, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/cpuidle/driver.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tick_broadcast_mode", file: !6, line: 54, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/tick.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "TICK_BROADCAST_OFF", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "TICK_BROADCAST_ON", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "TICK_BROADCAST_FORCE", value: 2, isUnsigned: true)
!12 = !{!13, !69, !70, !79}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_device", file: !16, line: 92, size: 6400, elements: !17)
!16 = !DIFile(filename: "./include/linux/cpuidle.h", directory: "/home/lizy2001/genbc/linux")
!17 = !{!18, !19, !20, !21, !22, !30, !32, !36, !37, !38, !52, !56, !59, !62}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "registered", scope: !15, file: !16, line: 93, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !15, file: !16, line: 94, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "poll_time_limit", scope: !15, file: !16, line: 95, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !15, file: !16, line: 96, baseType: !7, size: 32, offset: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "next_hrtimer", scope: !15, file: !16, line: 97, baseType: !23, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !24, line: 29, baseType: !25)
!24 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !26, line: 22, baseType: !27)
!26 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !28, line: 30, baseType: !29)
!28 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "last_state_idx", scope: !15, file: !16, line: 99, baseType: !31, size: 32, offset: 128)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "last_residency_ns", scope: !15, file: !16, line: 100, baseType: !33, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !26, line: 23, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !28, line: 31, baseType: !35)
!35 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "poll_limit_ns", scope: !15, file: !16, line: 101, baseType: !33, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "forced_idle_latency_limit_ns", scope: !15, file: !16, line: 102, baseType: !33, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "states_usage", scope: !15, file: !16, line: 103, baseType: !39, size: 5120, offset: 384)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 5120, elements: !50)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state_usage", file: !16, line: 35, size: 512, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !40, file: !16, line: 36, baseType: !35, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !40, file: !16, line: 37, baseType: !35, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !40, file: !16, line: 38, baseType: !33, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "above", scope: !40, file: !16, line: 39, baseType: !35, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "below", scope: !40, file: !16, line: 40, baseType: !35, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rejected", scope: !40, file: !16, line: 41, baseType: !35, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "s2idle_usage", scope: !40, file: !16, line: 43, baseType: !35, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "s2idle_time", scope: !40, file: !16, line: 44, baseType: !35, size: 64, offset: 448)
!50 = !{!51}
!51 = !DISubrange(count: 10)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "kobjs", scope: !15, file: !16, line: 104, baseType: !53, size: 640, offset: 5504)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 640, elements: !50)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state_kobj", file: !16, line: 89, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_driver", scope: !15, file: !16, line: 105, baseType: !57, size: 64, offset: 6144)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_driver_kobj", file: !16, line: 90, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_dev", scope: !15, file: !16, line: 106, baseType: !60, size: 64, offset: 6208)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_device_kobj", file: !16, line: 88, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "device_list", scope: !15, file: !16, line: 107, baseType: !63, size: 128, offset: 6272)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !64, line: 178, size: 128, elements: !65)
!64 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!65 = !{!66, !68}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !64, line: 179, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !63, file: !64, line: 179, baseType: !67, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !72, line: 17, size: 64, elements: !73)
!72 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !71, file: !72, line: 17, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !77)
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!81 = !{!0, !82}
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "cpuidle_curr_driver", scope: !2, file: !3, line: 88, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_driver", file: !16, line: 122, size: 8704, elements: !86)
!86 = !{!87, !91, !95, !96, !123, !124, !125, !126}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !16, line: 123, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !85, file: !16, line: 124, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !94, line: 76, flags: DIFlagFwdDecl)
!94 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bctimer", scope: !85, file: !16, line: 127, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !85, file: !16, line: 129, baseType: !97, size: 8320, offset: 192)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8320, elements: !50)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_state", file: !16, line: 48, size: 832, elements: !99)
!99 = !{!100, !104, !108, !109, !110, !111, !112, !113, !114, !118, !122}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !16, line: 49, baseType: !101, size: 128)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !98, file: !16, line: 50, baseType: !105, size: 256, offset: 128)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_ns", scope: !98, file: !16, line: 52, baseType: !33, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "target_residency_ns", scope: !98, file: !16, line: 53, baseType: !33, size: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !16, line: 54, baseType: !7, size: 32, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency", scope: !98, file: !16, line: 55, baseType: !7, size: 32, offset: 544)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "power_usage", scope: !98, file: !16, line: 56, baseType: !31, size: 32, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "target_residency", scope: !98, file: !16, line: 57, baseType: !7, size: 32, offset: 608)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "enter", scope: !98, file: !16, line: 59, baseType: !115, size: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!31, !14, !84, !31}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "enter_dead", scope: !98, file: !16, line: 63, baseType: !119, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!31, !14, !31}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "enter_s2idle", scope: !98, file: !16, line: 73, baseType: !115, size: 64, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !85, file: !16, line: 130, baseType: !31, size: 32, offset: 8512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "safe_state_index", scope: !85, file: !16, line: 131, baseType: !31, size: 32, offset: 8544)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cpumask", scope: !85, file: !16, line: 134, baseType: !70, size: 64, offset: 8576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "governor", scope: !85, file: !16, line: 137, baseType: !88, size: 64, offset: 8640)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !128, line: 83, baseType: !129)
!128 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !128, line: 71, elements: !130)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !129, file: !128, line: 72, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !129, file: !128, line: 72, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !132, file: !128, line: 73, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !128, line: 20, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !135, file: !128, line: 21, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !139, line: 25, baseType: !140)
!139 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 25, elements: !141)
!141 = !{}
!142 = !{i32 7, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 2}
!145 = !{i32 1, !"Code Model", i32 2}
!146 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!147 = distinct !DISubprogram(name: "cpuidle_register_driver", scope: !3, file: !3, line: 260, type: !148, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !141)
!148 = !DISubroutineType(types: !149)
!149 = !{!31, !84}
!150 = !DILocalVariable(name: "lock", arg: 1, scope: !151, file: !152, line: 392, type: !155)
!151 = distinct !DISubprogram(name: "spin_unlock", scope: !152, file: !152, line: 392, type: !153, scopeLine: 393, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !141)
!152 = !DIFile(filename: "./include/linux/spinlock.h", directory: "/home/lizy2001/genbc/linux")
!153 = !DISubroutineType(types: !154)
!154 = !{null, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!156 = !DILocation(line: 392, column: 53, scope: !151, inlinedAt: !157)
!157 = distinct !DILocation(line: 267, column: 2, scope: !147)
!158 = !DILocalVariable(name: "lock", arg: 1, scope: !159, file: !152, line: 352, type: !155)
!159 = distinct !DISubprogram(name: "spin_lock", scope: !152, file: !152, line: 352, type: !153, scopeLine: 353, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !141)
!160 = !DILocation(line: 352, column: 51, scope: !159, inlinedAt: !161)
!161 = distinct !DILocation(line: 265, column: 2, scope: !147)
!162 = !DILocalVariable(name: "drv", arg: 1, scope: !147, file: !3, line: 260, type: !84)
!163 = !DILocation(line: 260, column: 52, scope: !147)
!164 = !DILocalVariable(name: "gov", scope: !147, file: !3, line: 262, type: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpuidle_governor", file: !16, line: 258, size: 576, elements: !167)
!167 = !{!168, !169, !170, !171, !175, !179, !186}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !16, line: 259, baseType: !101, size: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "governor_list", scope: !166, file: !16, line: 260, baseType: !63, size: 128, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !166, file: !16, line: 261, baseType: !7, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !166, file: !16, line: 263, baseType: !172, size: 64, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!31, !84, !14}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !166, file: !16, line: 265, baseType: !176, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !84, !14}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "select", scope: !166, file: !16, line: 268, baseType: !180, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!31, !84, !14, !183}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !64, line: 30, baseType: !185)
!185 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reflect", scope: !166, file: !16, line: 271, baseType: !187, size: 64, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !14, !31}
!190 = !DILocation(line: 262, column: 27, scope: !147)
!191 = !DILocalVariable(name: "ret", scope: !147, file: !3, line: 263, type: !31)
!192 = !DILocation(line: 263, column: 6, scope: !147)
!193 = !DILocation(line: 354, column: 2, scope: !194, inlinedAt: !161)
!194 = distinct !DILexicalBlock(scope: !159, file: !152, line: 354, column: 2)
!195 = !{i32 -2145460316}
!196 = !DILocation(line: 354, column: 2, scope: !197, inlinedAt: !161)
!197 = distinct !DILexicalBlock(scope: !194, file: !152, line: 354, column: 2)
!198 = !DILocation(line: 266, column: 34, scope: !147)
!199 = !DILocation(line: 266, column: 8, scope: !147)
!200 = !DILocation(line: 266, column: 6, scope: !147)
!201 = !DILocation(line: 394, column: 2, scope: !202, inlinedAt: !157)
!202 = distinct !DILexicalBlock(scope: !151, file: !152, line: 394, column: 2)
!203 = !{i32 -2145457955}
!204 = !DILocation(line: 394, column: 2, scope: !205, inlinedAt: !157)
!205 = distinct !DILexicalBlock(scope: !202, file: !152, line: 394, column: 2)
!206 = !DILocation(line: 269, column: 7, scope: !207)
!207 = distinct !DILexicalBlock(scope: !147, file: !3, line: 269, column: 6)
!208 = !DILocation(line: 269, column: 11, scope: !207)
!209 = !DILocation(line: 269, column: 15, scope: !207)
!210 = !DILocation(line: 269, column: 38, scope: !207)
!211 = !DILocation(line: 269, column: 41, scope: !207)
!212 = !DILocation(line: 269, column: 46, scope: !207)
!213 = !DILocation(line: 269, column: 55, scope: !207)
!214 = !DILocation(line: 270, column: 7, scope: !207)
!215 = !DILocation(line: 270, column: 31, scope: !207)
!216 = !DILocation(line: 270, column: 28, scope: !207)
!217 = !DILocation(line: 269, column: 6, scope: !147)
!218 = !DILocation(line: 271, column: 3, scope: !219)
!219 = distinct !DILexicalBlock(scope: !207, file: !3, line: 270, column: 37)
!220 = !DILocation(line: 272, column: 31, scope: !219)
!221 = !DILocation(line: 272, column: 36, scope: !219)
!222 = !DILocation(line: 272, column: 9, scope: !219)
!223 = !DILocation(line: 272, column: 7, scope: !219)
!224 = !DILocation(line: 273, column: 7, scope: !225)
!225 = distinct !DILexicalBlock(scope: !219, file: !3, line: 273, column: 7)
!226 = !DILocation(line: 273, column: 7, scope: !219)
!227 = !DILocation(line: 274, column: 28, scope: !228)
!228 = distinct !DILexicalBlock(scope: !225, file: !3, line: 273, column: 12)
!229 = !DILocation(line: 274, column: 26, scope: !228)
!230 = !DILocation(line: 275, column: 32, scope: !231)
!231 = distinct !DILexicalBlock(scope: !228, file: !3, line: 275, column: 8)
!232 = !DILocation(line: 275, column: 8, scope: !231)
!233 = !DILocation(line: 275, column: 37, scope: !231)
!234 = !DILocation(line: 275, column: 8, scope: !228)
!235 = !DILocation(line: 276, column: 27, scope: !231)
!236 = !DILocation(line: 276, column: 5, scope: !231)
!237 = !DILocation(line: 277, column: 3, scope: !228)
!238 = !DILocation(line: 278, column: 3, scope: !219)
!239 = !DILocation(line: 279, column: 2, scope: !219)
!240 = !DILocation(line: 281, column: 9, scope: !147)
!241 = !DILocation(line: 281, column: 2, scope: !147)
!242 = distinct !DISubprogram(name: "__cpuidle_register_driver", scope: !3, file: !3, line: 203, type: !148, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !141)
!243 = !DILocalVariable(name: "drv", arg: 1, scope: !242, file: !3, line: 203, type: !84)
!244 = !DILocation(line: 203, column: 61, scope: !242)
!245 = !DILocalVariable(name: "ret", scope: !242, file: !3, line: 205, type: !31)
!246 = !DILocation(line: 205, column: 6, scope: !242)
!247 = !DILocation(line: 207, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !242, file: !3, line: 207, column: 6)
