; ModuleID = '../bcout/drivers/hid/hid-lg-g15.llvm.bc'
source_filename = "drivers/hid/hid-lg-g15.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_lg_g15_driver_init6:\09\09\09"
module asm ".long\09lg_g15_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.hid_driver = type { i8*, %struct.hid_device_id*, %struct.list_head, %struct.spinlock, i1 (%struct.hid_device*, i1)*, i32 (%struct.hid_device*, %struct.hid_device_id*)*, void (%struct.hid_device*)*, %struct.hid_report_id*, i32 (%struct.hid_device*, %struct.hid_report*, i8*, i32)*, %struct.hid_usage_id*, i32 (%struct.hid_device*, %struct.hid_field*, %struct.hid_usage*, i32)*, void (%struct.hid_device*, %struct.hid_report*)*, i8* (%struct.hid_device*, i8*, i32*)*, i32 (%struct.hid_device*, %struct.hid_input*, %struct.hid_field*, %struct.hid_usage*, i64**, i32*)*, i32 (%struct.hid_device*, %struct.hid_input*, %struct.hid_field*, %struct.hid_usage*, i64**, i32*)*, i32 (%struct.hid_device*, %struct.hid_input*)*, void (%struct.hid_device*, %struct.hid_field*, %struct.hid_usage*)*, i32 (%struct.hid_device*, i32)*, i32 (%struct.hid_device*)*, i32 (%struct.hid_device*)*, %struct.device_driver }
%struct.hid_device_id = type { i16, i16, i32, i32, i64 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.spinlock = type { %union.anon }

!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !73, line: 502, baseType: !7, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 10, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lg_g15_model", file: !3, line: 26, baseType: !7, size: 32, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIEnumerator(name: "LG_G15", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "LG_G15_V2", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "LG_G510", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "LG_G510_USB_AUDIO", value: 3, isUnsigned: true)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "led_brightness", file: !98, line: 29, baseType: !7, size: 32, elements: !99)
!98 = !DIFile(filename: "./include/linux/leds.h", directory: "/home/lizy2001/genbc/linux")
!99 = !{!100, !101, !102, !103}
!100 = !DIEnumerator(name: "LED_OFF", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "LED_ON", value: 1, isUnsigned: true)
!102 = !DIEnumerator(name: "LED_HALF", value: 127, isUnsigned: true)
!103 = !DIEnumerator(name: "LED_FULL", value: 255, isUnsigned: true)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lg_g15_led_type", file: !3, line: 33, baseType: !7, size: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113}
!106 = !DIEnumerator(name: "LG_G15_KBD_BRIGHTNESS", value: 0, isUnsigned: true)
!107 = !DIEnumerator(name: "LG_G15_LCD_BRIGHTNESS", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "LG_G15_BRIGHTNESS_MAX", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "LG_G15_MACRO_PRESET1", value: 2, isUnsigned: true)
!110 = !DIEnumerator(name: "LG_G15_MACRO_PRESET2", value: 3, isUnsigned: true)
!111 = !DIEnumerator(name: "LG_G15_MACRO_PRESET3", value: 4, isUnsigned: true)
!112 = !DIEnumerator(name: "LG_G15_MACRO_RECORD", value: 5, isUnsigned: true)
!113 = !DIEnumerator(name: "LG_G15_LED_MAX", value: 6, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !115, line: 30, baseType: !116, size: 64, elements: !117)
!115 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!116 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!118 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!119 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!120 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!121 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!122 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!123 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!124 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!125 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!126 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!127 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!128 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!129 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!130 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!131 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!132 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!133 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!134 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!135 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!136 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!137 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!138 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!139 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!140 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!141 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!142 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!143 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!144 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!145 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!146 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!147 = !{!148, !151, !152, !812, !243, !4056, !4058, !1324, !4132, !4133}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !150, line: 76, flags: DIFlagFwdDecl)
!150 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_report", file: !6, line: 476, size: 16896, elements: !154)
!154 = !{!155, !162, !163, !164, !165, !166, !3863, !3864, !3865}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !153, file: !6, line: 477, baseType: !156, size: 128)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !157, line: 178, size: 128, elements: !158)
!157 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!158 = !{!159, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !157, line: 179, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !157, line: 179, baseType: !160, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "hidinput_list", scope: !153, file: !6, line: 478, baseType: !156, size: 128, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !6, line: 479, baseType: !7, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !6, line: 480, baseType: !7, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "application", scope: !153, file: !6, line: 481, baseType: !7, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !153, file: !6, line: 482, baseType: !167, size: 16384, offset: 384)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 16384, elements: !3861)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_field", file: !6, line: 449, size: 896, elements: !170)
!170 = !{!171, !172, !173, !174, !198, !199, !200, !201, !202, !203, !204, !208, !209, !210, !211, !212, !213, !214, !215, !216, !3860}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "physical", scope: !169, file: !6, line: 450, baseType: !7, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "logical", scope: !169, file: !6, line: 451, baseType: !7, size: 32, offset: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "application", scope: !169, file: !6, line: 452, baseType: !7, size: 32, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !169, file: !6, line: 453, baseType: !175, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_usage", file: !6, line: 431, size: 192, elements: !177)
!177 = !{!178, !179, !180, !181, !185, !186, !189, !192, !193, !194, !195}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !176, file: !6, line: 432, baseType: !7, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "collection_index", scope: !176, file: !6, line: 433, baseType: !7, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "usage_index", scope: !176, file: !6, line: 434, baseType: !7, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "resolution_multiplier", scope: !176, file: !6, line: 435, baseType: !182, size: 8, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !183, line: 20, baseType: !184)
!183 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!184 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "wheel_factor", scope: !176, file: !6, line: 438, baseType: !182, size: 8, offset: 104)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !176, file: !6, line: 439, baseType: !187, size: 16, offset: 112)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !183, line: 24, baseType: !188)
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !6, line: 440, baseType: !190, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !183, line: 21, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hat_min", scope: !176, file: !6, line: 441, baseType: !182, size: 8, offset: 136)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "hat_max", scope: !176, file: !6, line: 442, baseType: !182, size: 8, offset: 144)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "hat_dir", scope: !176, file: !6, line: 443, baseType: !182, size: 8, offset: 152)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "wheel_accumulated", scope: !176, file: !6, line: 444, baseType: !196, size: 16, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !183, line: 23, baseType: !197)
!197 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxusage", scope: !169, file: !6, line: 454, baseType: !7, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !169, file: !6, line: 455, baseType: !7, size: 32, offset: 224)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "report_offset", scope: !169, file: !6, line: 456, baseType: !7, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "report_size", scope: !169, file: !6, line: 457, baseType: !7, size: 32, offset: 288)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "report_count", scope: !169, file: !6, line: 458, baseType: !7, size: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "report_type", scope: !169, file: !6, line: 459, baseType: !7, size: 32, offset: 352)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !169, file: !6, line: 460, baseType: !205, size: 64, offset: 384)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !183, line: 26, baseType: !207)
!207 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "logical_minimum", scope: !169, file: !6, line: 461, baseType: !206, size: 32, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "logical_maximum", scope: !169, file: !6, line: 462, baseType: !206, size: 32, offset: 480)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "physical_minimum", scope: !169, file: !6, line: 463, baseType: !206, size: 32, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "physical_maximum", scope: !169, file: !6, line: 464, baseType: !206, size: 32, offset: 544)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "unit_exponent", scope: !169, file: !6, line: 465, baseType: !206, size: 32, offset: 576)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !169, file: !6, line: 466, baseType: !7, size: 32, offset: 608)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "report", scope: !169, file: !6, line: 467, baseType: !152, size: 64, offset: 640)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !169, file: !6, line: 468, baseType: !7, size: 32, offset: 704)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "hidinput", scope: !169, file: !6, line: 470, baseType: !217, size: 64, offset: 768)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_input", file: !6, line: 522, size: 576, elements: !219)
!219 = !{!220, !221, !222, !3856, !3857, !3858, !3859}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !218, file: !6, line: 523, baseType: !156, size: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "report", scope: !218, file: !6, line: 524, baseType: !152, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !218, file: !6, line: 525, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_dev", file: !225, line: 131, size: 10432, elements: !226)
!225 = !DIFile(filename: "./include/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!226 = !{!227, !231, !232, !233, !241, !246, !247, !251, !252, !253, !254, !255, !256, !260, !261, !262, !263, !264, !265, !283, !288, !3065, !3068, !3069, !3081, !3083, !3086, !3096, !3097, !3098, !3099, !3100, !3104, !3108, !3112, !3116, !3194, !3195, !3196, !3197, !3198, !3847, !3848, !3849, !3850, !3851, !3853, !3854}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !224, file: !225, line: 132, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !224, file: !225, line: 133, baseType: !228, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !224, file: !225, line: 134, baseType: !228, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !225, line: 135, baseType: !234, size: 64, offset: 192)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_id", file: !235, line: 59, size: 64, elements: !236)
!235 = !DIFile(filename: "./include/uapi/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!236 = !{!237, !238, !239, !240}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bustype", scope: !234, file: !235, line: 60, baseType: !187, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !234, file: !235, line: 61, baseType: !187, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !234, file: !235, line: 62, baseType: !187, size: 16, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !234, file: !235, line: 63, baseType: !187, size: 16, offset: 48)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "propbit", scope: !224, file: !225, line: 137, baseType: !242, size: 64, offset: 256)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 64, elements: !244)
!243 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!244 = !{!245}
!245 = !DISubrange(count: 1)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "evbit", scope: !224, file: !225, line: 139, baseType: !242, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "keybit", scope: !224, file: !225, line: 140, baseType: !248, size: 768, offset: 384)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 768, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 12)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "relbit", scope: !224, file: !225, line: 141, baseType: !242, size: 64, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "absbit", scope: !224, file: !225, line: 142, baseType: !242, size: 64, offset: 1216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "mscbit", scope: !224, file: !225, line: 143, baseType: !242, size: 64, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ledbit", scope: !224, file: !225, line: 144, baseType: !242, size: 64, offset: 1344)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sndbit", scope: !224, file: !225, line: 145, baseType: !242, size: 64, offset: 1408)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !224, file: !225, line: 146, baseType: !257, size: 128, offset: 1472)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 128, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 2)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "swbit", scope: !224, file: !225, line: 147, baseType: !242, size: 64, offset: 1600)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "hint_events_per_packet", scope: !224, file: !225, line: 149, baseType: !7, size: 32, offset: 1664)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "keycodemax", scope: !224, file: !225, line: 151, baseType: !7, size: 32, offset: 1696)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "keycodesize", scope: !224, file: !225, line: 152, baseType: !7, size: 32, offset: 1728)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !224, file: !225, line: 153, baseType: !151, size: 64, offset: 1792)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "setkeycode", scope: !224, file: !225, line: 155, baseType: !266, size: 64, offset: 1856)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DISubroutineType(types: !268)
!268 = !{!207, !223, !269, !282}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_keymap_entry", file: !235, line: 114, size: 320, elements: !272)
!272 = !{!273, !274, !275, !276, !278}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !235, line: 116, baseType: !190, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !271, file: !235, line: 117, baseType: !190, size: 8, offset: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !271, file: !235, line: 118, baseType: !187, size: 16, offset: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !271, file: !235, line: 119, baseType: !277, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !183, line: 27, baseType: !7)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "scancode", scope: !271, file: !235, line: 120, baseType: !279, size: 256, offset: 64)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 256, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "getkeycode", scope: !224, file: !225, line: 158, baseType: !284, size: 64, offset: 1920)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!207, !223, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !224, file: !225, line: 161, baseType: !289, size: 64, offset: 1984)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_device", file: !225, line: 534, size: 896, elements: !291)
!291 = !{!292, !359, !363, !367, !373, !374, !378, !379, !380, !411, !412, !413}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !290, file: !225, line: 535, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!207, !223, !296, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_effect", file: !235, line: 450, size: 384, elements: !298)
!298 = !{!299, !300, !301, !302, !307, !312}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !235, line: 451, baseType: !187, size: 16)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !297, file: !235, line: 452, baseType: !196, size: 16, offset: 16)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !297, file: !235, line: 453, baseType: !187, size: 16, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !297, file: !235, line: 454, baseType: !303, size: 32, offset: 48)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_trigger", file: !235, line: 316, size: 32, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !303, file: !235, line: 317, baseType: !187, size: 16)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !303, file: !235, line: 318, baseType: !187, size: 16, offset: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !297, file: !235, line: 455, baseType: !308, size: 32, offset: 80)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_replay", file: !235, line: 306, size: 32, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !308, file: !235, line: 307, baseType: !187, size: 16)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !308, file: !235, line: 308, baseType: !187, size: 16, offset: 16)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !297, file: !235, line: 463, baseType: !313, size: 256, offset: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !297, file: !235, line: 457, size: 256, elements: !314)
!314 = !{!315, !326, !332, !344, !354}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !313, file: !235, line: 458, baseType: !316, size: 80)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_constant_effect", file: !235, line: 345, size: 80, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !316, file: !235, line: 346, baseType: !196, size: 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !316, file: !235, line: 347, baseType: !320, size: 64, offset: 16)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_envelope", file: !235, line: 333, size: 64, elements: !321)
!321 = !{!322, !323, !324, !325}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "attack_length", scope: !320, file: !235, line: 334, baseType: !187, size: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "attack_level", scope: !320, file: !235, line: 335, baseType: !187, size: 16, offset: 16)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "fade_length", scope: !320, file: !235, line: 336, baseType: !187, size: 16, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fade_level", scope: !320, file: !235, line: 337, baseType: !187, size: 16, offset: 48)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ramp", scope: !313, file: !235, line: 459, baseType: !327, size: 96)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_ramp_effect", file: !235, line: 356, size: 96, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "start_level", scope: !327, file: !235, line: 357, baseType: !196, size: 16)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end_level", scope: !327, file: !235, line: 358, baseType: !196, size: 16, offset: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !327, file: !235, line: 359, baseType: !320, size: 64, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !313, file: !235, line: 460, baseType: !333, size: 256)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_periodic_effect", file: !235, line: 401, size: 256, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !333, file: !235, line: 402, baseType: !187, size: 16)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !333, file: !235, line: 403, baseType: !187, size: 16, offset: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !333, file: !235, line: 404, baseType: !196, size: 16, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !333, file: !235, line: 405, baseType: !196, size: 16, offset: 48)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !333, file: !235, line: 406, baseType: !187, size: 16, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !333, file: !235, line: 408, baseType: !320, size: 64, offset: 80)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "custom_len", scope: !333, file: !235, line: 410, baseType: !277, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !333, file: !235, line: 411, baseType: !343, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !313, file: !235, line: 461, baseType: !345, size: 192)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 192, elements: !258)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_condition_effect", file: !235, line: 372, size: 96, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "right_saturation", scope: !346, file: !235, line: 373, baseType: !187, size: 16)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "left_saturation", scope: !346, file: !235, line: 374, baseType: !187, size: 16, offset: 16)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "right_coeff", scope: !346, file: !235, line: 376, baseType: !196, size: 16, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "left_coeff", scope: !346, file: !235, line: 377, baseType: !196, size: 16, offset: 48)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "deadband", scope: !346, file: !235, line: 379, baseType: !187, size: 16, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !346, file: !235, line: 380, baseType: !196, size: 16, offset: 80)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rumble", scope: !313, file: !235, line: 462, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_rumble_effect", file: !235, line: 422, size: 32, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "strong_magnitude", scope: !355, file: !235, line: 423, baseType: !187, size: 16)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "weak_magnitude", scope: !355, file: !235, line: 424, baseType: !187, size: 16, offset: 16)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !290, file: !225, line: 537, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!207, !223, !207}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "playback", scope: !290, file: !225, line: 539, baseType: !364, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!207, !223, !207, !207}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "set_gain", scope: !290, file: !225, line: 540, baseType: !368, size: 64, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !223, !371}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !372, line: 19, baseType: !187)
!372 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!373 = !DIDerivedType(tag: DW_TAG_member, name: "set_autocenter", scope: !290, file: !225, line: 541, baseType: !368, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !290, file: !225, line: 543, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !289}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !290, file: !225, line: 545, baseType: !151, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !290, file: !225, line: 547, baseType: !257, size: 128, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !290, file: !225, line: 549, baseType: !381, size: 192, offset: 576)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !382, line: 53, size: 192, elements: !383)
!382 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!383 = !{!384, !394, !410}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !381, file: !382, line: 54, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !386, line: 13, baseType: !387)
!386 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !157, line: 175, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 173, size: 64, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !388, file: !157, line: 174, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !372, line: 22, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !183, line: 30, baseType: !393)
!393 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !381, file: !382, line: 55, baseType: !395, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !396, line: 83, baseType: !397)
!396 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !396, line: 71, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !396, line: 72, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !397, file: !396, line: 72, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !400, file: !396, line: 73, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !396, line: 20, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !403, file: !396, line: 21, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !407, line: 25, baseType: !408)
!407 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 25, elements: !409)
!409 = !{}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !381, file: !382, line: 59, baseType: !156, size: 128, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_effects", scope: !290, file: !225, line: 551, baseType: !207, size: 32, offset: 768)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "effects", scope: !290, file: !225, line: 552, baseType: !296, size: 64, offset: 832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "effect_owners", scope: !290, file: !225, line: 553, baseType: !414, offset: 896)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, elements: !2281)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !37, line: 916, size: 1856, align: 32, elements: !417)
!417 = !{!418, !436, !3030, !3031, !3032, !3033, !3034, !3035, !3036, !3037, !3038, !3039, !3048, !3049, !3058, !3059, !3060, !3061, !3062, !3063, !3064}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !416, file: !37, line: 920, baseType: !419, size: 128)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !416, file: !37, line: 917, size: 128, elements: !420)
!420 = !{!421, !427}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !419, file: !37, line: 918, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !423, line: 58, size: 64, elements: !424)
!423 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !423, line: 59, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !419, file: !37, line: 919, baseType: !428, size: 128, align: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !157, line: 216, size: 128, align: 64, elements: !429)
!429 = !{!430, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !157, line: 217, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !428, file: !157, line: 218, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !431}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !416, file: !37, line: 921, baseType: !437, size: 128, offset: 128)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !438, line: 8, size: 128, elements: !439)
!438 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440, !444}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !437, file: !438, line: 9, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !443, line: 18, flags: DIFlagFwdDecl)
!443 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !437, file: !438, line: 10, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !443, line: 89, size: 1536, elements: !447)
!447 = !{!448, !449, !459, !467, !468, !487, !2998, !3000, !3012, !3013, !3014, !3015, !3016, !3022, !3023, !3024}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !446, file: !443, line: 91, baseType: !7, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !446, file: !443, line: 92, baseType: !450, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !451, line: 277, baseType: !452)
!451 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !451, line: 277, size: 32, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !452, file: !451, line: 277, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !451, line: 70, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !451, line: 65, size: 32, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !456, file: !451, line: 66, baseType: !7, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !446, file: !443, line: 93, baseType: !460, size: 128, offset: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !461, line: 38, size: 128, elements: !462)
!461 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!462 = !{!463, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !461, line: 39, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !460, file: !461, line: 39, baseType: !466, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !446, file: !443, line: 94, baseType: !445, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !446, file: !443, line: 95, baseType: !469, size: 128, offset: 256)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !443, line: 47, size: 128, elements: !470)
!470 = !{!471, !484}
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !443, line: 48, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !469, file: !443, line: 48, size: 64, elements: !473)
!473 = !{!474, !480}
!474 = !DIDerivedType(tag: DW_TAG_member, scope: !472, file: !443, line: 49, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !443, line: 49, size: 64, elements: !476)
!476 = !{!477, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !475, file: !443, line: 50, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !372, line: 21, baseType: !277)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !475, file: !443, line: 50, baseType: !478, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !472, file: !443, line: 52, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !372, line: 23, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !183, line: 31, baseType: !483)
!483 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !443, line: 54, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !446, file: !443, line: 96, baseType: !488, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !37, line: 610, size: 4224, elements: !490)
!490 = !{!491, !493, !494, !503, !510, !511, !664, !2709, !2710, !2711, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2974, !2982, !2983, !2984, !2994, !2995, !2996, !2997}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !489, file: !37, line: 611, baseType: !492, size: 16)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !157, line: 19, baseType: !188)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !489, file: !37, line: 612, baseType: !188, size: 16, offset: 16)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !489, file: !37, line: 613, baseType: !495, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !496, line: 23, baseType: !497)
!496 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 21, size: 32, elements: !498)
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !497, file: !496, line: 22, baseType: !500, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !157, line: 32, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !502, line: 49, baseType: !7)
!502 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !489, file: !37, line: 614, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !496, line: 28, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 26, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !505, file: !496, line: 27, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !157, line: 33, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !502, line: 50, baseType: !7)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !489, file: !37, line: 615, baseType: !7, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !489, file: !37, line: 622, baseType: !512, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !37, line: 1864, size: 1536, align: 512, elements: !515)
!515 = !{!516, !520, !533, !537, !543, !548, !554, !558, !562, !566, !570, !571, !577, !581, !605, !634, !644, !650, !655, !659, !660}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !514, file: !37, line: 1865, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!445, !488, !445, !7}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !514, file: !37, line: 1866, baseType: !521, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DISubroutineType(types: !523)
!523 = !{!228, !445, !488, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !526, line: 10, size: 128, elements: !527)
!526 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!527 = !{!528, !532}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !525, file: !526, line: 11, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !151}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !525, file: !526, line: 12, baseType: !151, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !514, file: !37, line: 1867, baseType: !534, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!207, !488, !207}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !514, file: !37, line: 1868, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!541, !488, !207}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !37, line: 581, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !514, file: !37, line: 1870, baseType: !544, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!207, !445, !547, !207}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !514, file: !37, line: 1872, baseType: !549, size: 64, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!207, !488, !445, !492, !552}
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !157, line: 30, baseType: !553)
!553 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !514, file: !37, line: 1873, baseType: !555, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!207, !445, !488, !445}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !514, file: !37, line: 1874, baseType: !559, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!207, !488, !445}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !514, file: !37, line: 1875, baseType: !563, size: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!207, !488, !445, !228}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !514, file: !37, line: 1876, baseType: !567, size: 64, offset: 576)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!207, !488, !445, !492}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !514, file: !37, line: 1877, baseType: !559, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !514, file: !37, line: 1878, baseType: !572, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!207, !488, !445, !492, !575}
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !157, line: 16, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !157, line: 13, baseType: !478)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !514, file: !37, line: 1879, baseType: !578, size: 64, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!207, !488, !445, !488, !445, !7}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !514, file: !37, line: 1881, baseType: !582, size: 64, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!207, !445, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !37, line: 219, size: 640, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !595, !602, !603, !604}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !586, file: !37, line: 220, baseType: !7, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !586, file: !37, line: 221, baseType: !492, size: 16, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !586, file: !37, line: 222, baseType: !495, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !586, file: !37, line: 223, baseType: !504, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !586, file: !37, line: 224, baseType: !593, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !157, line: 46, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !502, line: 88, baseType: !393)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !586, file: !37, line: 225, baseType: !596, size: 128, offset: 192)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !597, line: 13, size: 128, elements: !598)
!597 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!598 = !{!599, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !596, file: !597, line: 14, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !597, line: 8, baseType: !392)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !596, file: !597, line: 15, baseType: !116, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !586, file: !37, line: 226, baseType: !596, size: 128, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !586, file: !37, line: 227, baseType: !596, size: 128, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !586, file: !37, line: 234, baseType: !415, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !514, file: !37, line: 1882, baseType: !606, size: 64, offset: 896)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!207, !609, !611, !478, !7}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !613, line: 22, size: 1152, elements: !614)
!613 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!614 = !{!615, !616, !617, !618, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !612, file: !613, line: 23, baseType: !478, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !612, file: !613, line: 24, baseType: !492, size: 16, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !612, file: !613, line: 25, baseType: !7, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !612, file: !613, line: 26, baseType: !619, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !157, line: 104, baseType: !478)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !612, file: !613, line: 27, baseType: !481, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !612, file: !613, line: 28, baseType: !481, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !612, file: !613, line: 37, baseType: !481, size: 64, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !612, file: !613, line: 38, baseType: !575, size: 32, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !612, file: !613, line: 39, baseType: !575, size: 32, offset: 352)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !612, file: !613, line: 40, baseType: !495, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !612, file: !613, line: 41, baseType: !504, size: 32, offset: 416)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !612, file: !613, line: 42, baseType: !593, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !612, file: !613, line: 43, baseType: !596, size: 128, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !612, file: !613, line: 44, baseType: !596, size: 128, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !612, file: !613, line: 45, baseType: !596, size: 128, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !612, file: !613, line: 46, baseType: !596, size: 128, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !612, file: !613, line: 47, baseType: !481, size: 64, offset: 1024)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !612, file: !613, line: 48, baseType: !481, size: 64, offset: 1088)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !514, file: !37, line: 1883, baseType: !635, size: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!638, !445, !547, !641}
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !157, line: 60, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !502, line: 73, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !502, line: 15, baseType: !116)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 55, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !502, line: 72, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !502, line: 16, baseType: !243)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !514, file: !37, line: 1884, baseType: !645, size: 64, offset: 1024)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!207, !488, !648, !481, !481}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !37, line: 50, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !514, file: !37, line: 1886, baseType: !651, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!207, !488, !654, !207}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !514, file: !37, line: 1887, baseType: !656, size: 64, offset: 1152)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!207, !488, !445, !415, !7, !492}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !514, file: !37, line: 1890, baseType: !567, size: 64, offset: 1216)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !514, file: !37, line: 1891, baseType: !661, size: 64, offset: 1280)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!207, !488, !541, !207}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !489, file: !37, line: 623, baseType: !665, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !37, line: 1416, size: 9472, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !722, !2317, !2399, !2482, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2498, !2502, !2503, !2506, !2507, !2510, !2511, !2512, !2553, !2579, !2580, !2581, !2582, !2583, !2584, !2587, !2589, !2596, !2597, !2599, !2600, !2601, !2660, !2661, !2676, !2677, !2678, !2679, !2680, !2683, !2684, !2685, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !666, file: !37, line: 1417, baseType: !156, size: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !666, file: !37, line: 1418, baseType: !575, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !666, file: !37, line: 1419, baseType: !191, size: 8, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !666, file: !37, line: 1420, baseType: !243, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !666, file: !37, line: 1421, baseType: !593, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !666, file: !37, line: 1422, baseType: !674, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !37, line: 2228, size: 576, elements: !676)
!676 = !{!677, !678, !679, !686, !690, !694, !698, !699, !700, !710, !713, !714, !715, !719, !720, !721}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !37, line: 2229, baseType: !228, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !675, file: !37, line: 2230, baseType: !207, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !675, file: !37, line: 2238, baseType: !680, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!207, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !685, line: 28, flags: DIFlagFwdDecl)
!685 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !675, file: !37, line: 2239, baseType: !687, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !37, line: 70, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !675, file: !37, line: 2240, baseType: !691, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!445, !674, !207, !228, !151}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !675, file: !37, line: 2242, baseType: !695, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !665}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !675, file: !37, line: 2243, baseType: !148, size: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !37, line: 2244, baseType: !674, size: 64, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !675, file: !37, line: 2245, baseType: !701, size: 64, offset: 512)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !157, line: 182, size: 64, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !701, file: !157, line: 183, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !157, line: 186, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !157, line: 187, baseType: !704, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !705, file: !157, line: 187, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !675, file: !37, line: 2247, baseType: !711, offset: 576)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !712, line: 187, elements: !409)
!712 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!713 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !675, file: !37, line: 2248, baseType: !711, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !675, file: !37, line: 2249, baseType: !711, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !675, file: !37, line: 2250, baseType: !716, offset: 576)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 3)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !675, file: !37, line: 2252, baseType: !711, offset: 576)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !675, file: !37, line: 2253, baseType: !711, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !675, file: !37, line: 2254, baseType: !711, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !666, file: !37, line: 1423, baseType: !723, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !37, line: 1935, size: 1472, elements: !726)
!726 = !{!727, !731, !735, !736, !740, !746, !750, !751, !752, !756, !760, !761, !762, !763, !769, !774, !775, !782, !783, !784, !785, !2301, !2316}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !725, file: !37, line: 1936, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!488, !665}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !725, file: !37, line: 1937, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !488}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !725, file: !37, line: 1938, baseType: !732, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !725, file: !37, line: 1940, baseType: !737, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !488, !207}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !725, file: !37, line: 1941, baseType: !741, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!207, !488, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !37, line: 289, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !725, file: !37, line: 1942, baseType: !747, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!207, !488}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !725, file: !37, line: 1943, baseType: !732, size: 64, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !725, file: !37, line: 1944, baseType: !695, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !725, file: !37, line: 1945, baseType: !753, size: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!207, !665, !207}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !725, file: !37, line: 1946, baseType: !757, size: 64, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!207, !665}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !725, file: !37, line: 1947, baseType: !757, size: 64, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !725, file: !37, line: 1948, baseType: !757, size: 64, offset: 704)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !725, file: !37, line: 1949, baseType: !757, size: 64, offset: 768)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !725, file: !37, line: 1950, baseType: !764, size: 64, offset: 832)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!207, !445, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !37, line: 57, flags: DIFlagFwdDecl)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !725, file: !37, line: 1951, baseType: !770, size: 64, offset: 896)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{!207, !665, !773, !547}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !725, file: !37, line: 1952, baseType: !695, size: 64, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !725, file: !37, line: 1954, baseType: !776, size: 64, offset: 1024)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!207, !779, !445}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !781, line: 539, flags: DIFlagFwdDecl)
!781 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!782 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !725, file: !37, line: 1955, baseType: !776, size: 64, offset: 1088)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !725, file: !37, line: 1956, baseType: !776, size: 64, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !725, file: !37, line: 1957, baseType: !776, size: 64, offset: 1216)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !725, file: !37, line: 1963, baseType: !786, size: 64, offset: 1280)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!207, !665, !789, !812}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !791, line: 68, size: 512, align: 128, elements: !792)
!791 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!792 = !{!793, !794, !2293, !2300}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !791, line: 69, baseType: !243, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, scope: !790, file: !791, line: 77, baseType: !795, size: 320, offset: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !791, line: 77, size: 320, elements: !796)
!796 = !{!797, !976, !981, !1009, !1017, !1023, !2285, !2292}
!797 = !DIDerivedType(tag: DW_TAG_member, scope: !795, file: !791, line: 78, baseType: !798, size: 320)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !791, line: 78, size: 320, elements: !799)
!799 = !{!800, !801, !974, !975}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !798, file: !791, line: 84, baseType: !156, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !798, file: !791, line: 86, baseType: !802, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !37, line: 451, size: 1216, align: 64, elements: !804)
!804 = !{!805, !806, !814, !815, !820, !835, !844, !845, !846, !847, !967, !968, !971, !972, !973}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !803, file: !37, line: 452, baseType: !488, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !803, file: !37, line: 453, baseType: !807, size: 128, offset: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !808, line: 292, size: 128, elements: !809)
!808 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!809 = !{!810, !811, !813}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !807, file: !808, line: 293, baseType: !395)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !807, file: !808, line: 295, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !157, line: 148, baseType: !7)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !807, file: !808, line: 296, baseType: !151, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !803, file: !37, line: 454, baseType: !812, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !803, file: !37, line: 455, baseType: !816, size: 32, offset: 224)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !157, line: 168, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 166, size: 32, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !817, file: !157, line: 167, baseType: !207, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !803, file: !37, line: 460, baseType: !821, size: 128, offset: 256)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !822, line: 125, size: 128, elements: !823)
!822 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!823 = !{!824, !834}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !821, file: !822, line: 126, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !822, line: 31, size: 64, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !825, file: !822, line: 32, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !822, line: 24, size: 192, align: 64, elements: !830)
!830 = !{!831, !832, !833}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !829, file: !822, line: 25, baseType: !243, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !829, file: !822, line: 26, baseType: !828, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !829, file: !822, line: 27, baseType: !828, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !821, file: !822, line: 127, baseType: !828, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !803, file: !37, line: 461, baseType: !836, size: 256, offset: 384)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !837, line: 35, size: 256, elements: !838)
!837 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!838 = !{!839, !840, !841, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !836, file: !837, line: 36, baseType: !385, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !836, file: !837, line: 42, baseType: !385, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !836, file: !837, line: 46, baseType: !842, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !396, line: 29, baseType: !403)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !836, file: !837, line: 47, baseType: !156, size: 128, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !803, file: !37, line: 462, baseType: !243, size: 64, offset: 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !803, file: !37, line: 463, baseType: !243, size: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !803, file: !37, line: 464, baseType: !243, size: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !803, file: !37, line: 465, baseType: !848, size: 64, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !37, line: 367, size: 1408, elements: !851)
!851 = !{!852, !856, !860, !864, !868, !872, !878, !884, !888, !893, !897, !901, !905, !931, !935, !941, !942, !943, !947, !952, !956, !963}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !850, file: !37, line: 368, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!207, !789, !744}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !850, file: !37, line: 369, baseType: !857, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!207, !415, !789}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !850, file: !37, line: 372, baseType: !861, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!207, !802, !744}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !850, file: !37, line: 375, baseType: !865, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!207, !789}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !850, file: !37, line: 381, baseType: !869, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!207, !415, !802, !160, !7}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !850, file: !37, line: 383, baseType: !873, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !37, line: 290, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !850, file: !37, line: 385, baseType: !879, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!207, !415, !802, !593, !7, !7, !882, !883}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !850, file: !37, line: 388, baseType: !885, size: 64, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!207, !415, !802, !593, !7, !7, !789, !151}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !850, file: !37, line: 393, baseType: !889, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!892, !802, !892}
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !157, line: 125, baseType: !481)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !850, file: !37, line: 394, baseType: !894, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !789, !7, !7}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !850, file: !37, line: 395, baseType: !898, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!207, !789, !812}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !850, file: !37, line: 396, baseType: !902, size: 64, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !789}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !850, file: !37, line: 397, baseType: !906, size: 64, offset: 768)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!638, !909, !929}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !37, line: 320, size: 384, elements: !911)
!911 = !{!912, !913, !914, !918, !919, !920, !921, !922}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !910, file: !37, line: 321, baseType: !415, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !910, file: !37, line: 326, baseType: !593, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !910, file: !37, line: 327, baseType: !915, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !909, !116, !116}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !910, file: !37, line: 328, baseType: !151, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !910, file: !37, line: 329, baseType: !207, size: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !910, file: !37, line: 330, baseType: !371, size: 16, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !910, file: !37, line: 331, baseType: !371, size: 16, offset: 304)
!922 = !DIDerivedType(tag: DW_TAG_member, scope: !910, file: !37, line: 332, baseType: !923, size: 64, offset: 320)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !37, line: 332, size: 64, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !923, file: !37, line: 333, baseType: !7, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !923, file: !37, line: 334, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !37, line: 334, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !37, line: 64, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !850, file: !37, line: 402, baseType: !932, size: 64, offset: 832)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!207, !802, !789, !789, !12}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !850, file: !37, line: 404, baseType: !936, size: 64, offset: 896)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!552, !789, !939}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !940, line: 305, baseType: !7)
!940 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!941 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !850, file: !37, line: 405, baseType: !902, size: 64, offset: 960)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !850, file: !37, line: 406, baseType: !865, size: 64, offset: 1024)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !850, file: !37, line: 407, baseType: !944, size: 64, offset: 1088)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!207, !789, !243, !243}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "is_dirty_writeback", scope: !850, file: !37, line: 409, baseType: !948, size: 64, offset: 1152)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !789, !951, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "error_remove_page", scope: !850, file: !37, line: 410, baseType: !953, size: 64, offset: 1216)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!207, !802, !789}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "swap_activate", scope: !850, file: !37, line: 413, baseType: !957, size: 64, offset: 1280)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!207, !960, !415, !962}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "swap_info_struct", file: !37, line: 61, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "swap_deactivate", scope: !850, file: !37, line: 415, baseType: !964, size: 64, offset: 1344)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !415}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !37, line: 466, baseType: !243, size: 64, offset: 896)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "wb_err", scope: !803, file: !37, line: 467, baseType: !969, size: 32, offset: 960)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "errseq_t", file: !970, line: 8, baseType: !478)
!970 = !DIFile(filename: "./include/linux/errseq.h", directory: "/home/lizy2001/genbc/linux")
!971 = !DIDerivedType(tag: DW_TAG_member, name: "private_lock", scope: !803, file: !37, line: 468, baseType: !395, offset: 992)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !803, file: !37, line: 469, baseType: !156, size: 128, offset: 1024)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !803, file: !37, line: 470, baseType: !151, size: 64, offset: 1152)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !798, file: !791, line: 87, baseType: !243, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !798, file: !791, line: 94, baseType: !243, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, scope: !795, file: !791, line: 96, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !791, line: 96, size: 64, elements: !978)
!978 = !{!979}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dma_addr", scope: !977, file: !791, line: 101, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !157, line: 143, baseType: !481)
!981 = !DIDerivedType(tag: DW_TAG_member, scope: !795, file: !791, line: 103, baseType: !982, size: 320)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !791, line: 103, size: 320, elements: !983)
!983 = !{!984, !994, !997, !998}
!984 = !DIDerivedType(tag: DW_TAG_member, scope: !982, file: !791, line: 104, baseType: !985, size: 128)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !982, file: !791, line: 104, size: 128, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "slab_list", scope: !985, file: !791, line: 105, baseType: !156, size: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, scope: !985, file: !791, line: 106, baseType: !989, size: 128)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !985, file: !791, line: 106, size: 128, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !791, line: 107, baseType: !789, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !989, file: !791, line: 109, baseType: !207, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pobjects", scope: !989, file: !791, line: 110, baseType: !207, size: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "slab_cache", scope: !982, file: !791, line: 117, baseType: !995, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !791, line: 117, flags: DIFlagFwdDecl)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !982, file: !791, line: 119, baseType: !151, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, scope: !982, file: !791, line: 120, baseType: !999, size: 64, offset: 256)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !982, file: !791, line: 120, size: 64, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "s_mem", scope: !999, file: !791, line: 121, baseType: !151, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !999, file: !791, line: 122, baseType: !243, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, scope: !999, file: !791, line: 123, baseType: !1004, size: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !999, file: !791, line: 123, size: 32, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !1004, file: !791, line: 124, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1004, file: !791, line: 125, baseType: !7, size: 15, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !1004, file: !791, line: 126, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, scope: !795, file: !791, line: 130, baseType: !1010, size: 192)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !791, line: 130, size: 192, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "compound_head", scope: !1010, file: !791, line: 131, baseType: !243, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "compound_dtor", scope: !1010, file: !791, line: 134, baseType: !191, size: 8, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "compound_order", scope: !1010, file: !791, line: 135, baseType: !191, size: 8, offset: 72)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "compound_mapcount", scope: !1010, file: !791, line: 136, baseType: !816, size: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "compound_nr", scope: !1010, file: !791, line: 137, baseType: !7, size: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, scope: !795, file: !791, line: 139, baseType: !1018, size: 256)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !791, line: 139, size: 256, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "_compound_pad_1", scope: !1018, file: !791, line: 140, baseType: !243, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hpage_pinned_refcount", scope: !1018, file: !791, line: 141, baseType: !816, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_list", scope: !1018, file: !791, line: 143, baseType: !156, size: 128, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, scope: !795, file: !791, line: 145, baseType: !1024, size: 256)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !791, line: 145, size: 256, elements: !1025)
!1025 = !{!1026, !1027, !1029, !1030, !2284}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_pt_pad_1", scope: !1024, file: !791, line: 146, baseType: !243, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pmd_huge_pte", scope: !1024, file: !791, line: 147, baseType: !1028, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgtable_t", file: !781, line: 509, baseType: !789)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_pt_pad_2", scope: !1024, file: !791, line: 148, baseType: !243, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, scope: !1024, file: !791, line: 149, baseType: !1031, size: 64, offset: 192)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1024, file: !791, line: 149, size: 64, elements: !1032)
!1032 = !{!1033, !2283}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pt_mm", scope: !1031, file: !791, line: 150, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !791, line: 388, size: 7296, elements: !1036)
!1036 = !{!1037, !2279}
!1037 = !DIDerivedType(tag: DW_TAG_member, scope: !1035, file: !791, line: 389, baseType: !1038, size: 7296)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1035, file: !791, line: 389, size: 7296, elements: !1039)
!1039 = !{!1040, !1078, !1079, !1080, !1084, !1085, !1086, !1087, !1088, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1129, !1137, !1140, !1178, !1179, !2263, !2264, !2267, !2268, !2269, !2272, !2273, !2274, !2277, !2278}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !1038, file: !791, line: 390, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !791, line: 305, size: 1472, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1058, !1059, !1064, !1065, !1068, !1072, !1073, !1074, !1075, !1076}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !1042, file: !791, line: 308, baseType: !243, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !1042, file: !791, line: 309, baseType: !243, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !1042, file: !791, line: 313, baseType: !1041, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !1042, file: !791, line: 313, baseType: !1041, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !1042, file: !791, line: 315, baseType: !829, size: 192, align: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !1042, file: !791, line: 323, baseType: !243, size: 64, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !1042, file: !791, line: 327, baseType: !1034, size: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !1042, file: !791, line: 333, baseType: !1052, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !781, line: 284, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !781, line: 284, size: 64, elements: !1054)
!1054 = !{!1055}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !1053, file: !781, line: 284, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !1057, line: 19, baseType: !243)
!1057 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !1042, file: !791, line: 334, baseType: !243, size: 64, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1042, file: !791, line: 343, baseType: !1060, size: 256, offset: 704)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1042, file: !791, line: 340, size: 256, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !1060, file: !791, line: 341, baseType: !829, size: 192, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !1060, file: !791, line: 342, baseType: !243, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !1042, file: !791, line: 351, baseType: !156, size: 128, offset: 960)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !1042, file: !791, line: 353, baseType: !1066, size: 64, offset: 1088)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !791, line: 353, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !1042, file: !791, line: 356, baseType: !1069, size: 64, offset: 1152)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !791, line: 356, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !1042, file: !791, line: 359, baseType: !243, size: 64, offset: 1216)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !1042, file: !791, line: 361, baseType: !415, size: 64, offset: 1280)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !1042, file: !791, line: 362, baseType: !151, size: 64, offset: 1344)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !1042, file: !791, line: 365, baseType: !385, size: 64, offset: 1408)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !1042, file: !791, line: 373, baseType: !1077, offset: 1472)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !791, line: 296, elements: !409)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !1038, file: !791, line: 391, baseType: !825, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !1038, file: !791, line: 392, baseType: !481, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !1038, file: !791, line: 394, baseType: !1081, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!243, !415, !243, !243, !243, !243}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !1038, file: !791, line: 398, baseType: !243, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !1038, file: !791, line: 399, baseType: !243, size: 64, offset: 320)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !1038, file: !791, line: 405, baseType: !243, size: 64, offset: 384)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !1038, file: !791, line: 406, baseType: !243, size: 64, offset: 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !1038, file: !791, line: 407, baseType: !1089, size: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !781, line: 286, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !781, line: 286, size: 64, elements: !1092)
!1092 = !{!1093}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !1091, file: !781, line: 286, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !1057, line: 18, baseType: !243)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !1038, file: !791, line: 416, baseType: !816, size: 32, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !1038, file: !791, line: 428, baseType: !816, size: 32, offset: 608)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !1038, file: !791, line: 437, baseType: !816, size: 32, offset: 640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !1038, file: !791, line: 447, baseType: !816, size: 32, offset: 672)
