; ModuleID = '../bcout/drivers/hid/hid-quirks.llvm.bc'
source_filename = "drivers/hid/hid-quirks.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_device_id = type { [9 x i8], i64, i32, i32 }
%struct.hid_device_id = type { i16, i16, i32, i32, i64 }
%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kmem_cache = type opaque
%struct.hid_device = type { i8*, i32, i8*, i32, %struct.hid_collection*, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, [3 x %struct.hid_report_enum], %struct.work_struct, %struct.semaphore, %struct.device, %struct.hid_driver*, %struct.hid_ll_driver*, %struct.mutex, i32, i64, i32, i32, i8, %struct.list_head, i8*, i8*, [128 x i8], [64 x i8], [64 x i8], i8*, i32 (%struct.hid_device*)*, i32 (%struct.hid_device*, i32)*, void (%struct.hid_device*)*, void (%struct.hid_device*, %struct.hid_field*, %struct.hid_usage*, i32)*, void (%struct.hid_device*, %struct.hid_report*)*, i16, %struct.dentry*, %struct.dentry*, %struct.dentry*, %struct.list_head, %struct.spinlock, %struct.wait_queue_head }
%struct.hid_collection = type { i32, i32, i32, i32 }

!37 = !DIFile(filename: "./include/linux/fs.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43, !44}
!39 = !DIEnumerator(name: "WRITE_LIFE_NOT_SET", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "WRITE_LIFE_NONE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "WRITE_LIFE_SHORT", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "WRITE_LIFE_MEDIUM", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "WRITE_LIFE_LONG", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "WRITE_LIFE_EXTREME", value: 5, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !46, line: 9, baseType: !7, size: 32, elements: !47)
!46 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIEnumerator(name: "PIDTYPE_PID", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "PIDTYPE_SID", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !54, line: 26, baseType: !7, size: 32, elements: !55)
!54 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !60, line: 44, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !66, line: 343, baseType: !7, size: 32, elements: !67)
!66 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !73, line: 524, baseType: !7, size: 32, elements: !74)
!73 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !73, line: 502, baseType: !7, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 10, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !92, line: 305, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!93 = !{!94, !95, !96, !97}
!94 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!98 = !{!99, !102, !104, !105, !126}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !100, line: 24, baseType: !101)
!100 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !103, line: 148, baseType: !7)
!103 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quirks_list_struct", file: !3, line: 1018, size: 320, elements: !107)
!107 = !{!108, !120}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "hid_bl_item", scope: !106, file: !3, line: 1019, baseType: !109, size: 192)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_device_id", file: !110, line: 166, size: 192, elements: !111)
!110 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!111 = !{!112, !113, !114, !116, !117}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !109, file: !110, line: 167, baseType: !99, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !109, file: !110, line: 168, baseType: !99, size: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !109, file: !110, line: 169, baseType: !115, size: 32, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !100, line: 27, baseType: !7)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !109, file: !110, line: 170, baseType: !115, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !109, file: !110, line: 171, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_ulong_t", file: !110, line: 14, baseType: !119)
!119 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !106, file: !3, line: 1020, baseType: !121, size: 128, offset: 192)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !103, line: 178, size: 128, elements: !122)
!122 = !{!123, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !103, line: 179, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !103, line: 179, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !124)
!128 = !{!0, !129, !135, !140, !142, !175, !180}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "hid_mouse_ignore_list", scope: !2, file: !3, line: 869, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 10752, elements: !133)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!133 = !{!134}
!134 = !DISubrange(count: 56)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "hid_ignore_list", scope: !2, file: !3, line: 695, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 31104, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 162)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "dquirks_list", scope: !2, file: !3, line: 1023, type: !121, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "dquirks_lock", scope: !2, file: !3, line: 1024, type: !144, isLocal: true, isDefinition: true)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !145, line: 53, size: 192, elements: !146)
!145 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!146 = !{!147, !158, !174}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !144, file: !145, line: 54, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !149, line: 13, baseType: !150)
!149 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !103, line: 175, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 173, size: 64, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !151, file: !103, line: 174, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !155, line: 22, baseType: !156)
!155 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !100, line: 30, baseType: !157)
!157 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !144, file: !145, line: 55, baseType: !159, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !160, line: 83, baseType: !161)
!160 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !160, line: 71, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !160, line: 72, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !160, line: 72, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !164, file: !160, line: 73, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !160, line: 20, elements: !168)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !167, file: !160, line: 21, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !171, line: 25, baseType: !172)
!171 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !171, line: 25, elements: !173)
!173 = !{}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !144, file: !145, line: 59, baseType: !121, size: 128, offset: 64)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "hid_have_special_driver", scope: !2, file: !3, line: 209, type: !177, isLocal: true, isDefinition: true)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 27264, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 142)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "hid_quirks", scope: !2, file: !3, line: 27, type: !182, isLocal: true, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 31488, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 164)
!185 = !DIFile(filename: "./include/linux/input/elan-i2c-ids.h", directory: "/home/lizy2001/genbc/linux")
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 13568, elements: !199)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device_id", file: !110, line: 210, size: 256, elements: !189)
!189 = !{!190, !196, !197, !198}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !188, file: !110, line: 211, baseType: !191, size: 72)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 72, elements: !194)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !100, line: 21, baseType: !193)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !{!195}
!195 = !DISubrange(count: 9)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !188, file: !110, line: 212, baseType: !118, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "cls", scope: !188, file: !110, line: 213, baseType: !115, size: 32, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cls_msk", scope: !188, file: !110, line: 214, baseType: !115, size: 32, offset: 224)
!199 = !{!200}
!200 = !DISubrange(count: 53)
!201 = !{i32 7, !"Dwarf Version", i32 4}
!202 = !{i32 2, !"Debug Info Version", i32 3}
!203 = !{i32 1, !"wchar_size", i32 2}
!204 = !{i32 1, !"Code Model", i32 2}
!205 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!206 = distinct !DISubprogram(name: "hid_ignore", scope: !3, file: !3, line: 929, type: !207, scopeLine: 930, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !173)
!207 = !DISubroutineType(types: !208)
!208 = !{!209, !211}
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !103, line: 30, baseType: !210)
!210 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_device", file: !6, line: 547, size: 60160, elements: !213)
!213 = !{!214, !216, !217, !218, !219, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !3890, !3891, !3898, !3899, !3976, !4006, !4007, !4008, !4009, !4010, !4011, !4012, !4013, !4014, !4015, !4016, !4018, !4019, !4020, !4021, !4025, !4026, !4030, !4031, !4032, !4033, !4034, !4035, !4036, !4037}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dev_rdesc", scope: !212, file: !6, line: 548, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dev_rsize", scope: !212, file: !6, line: 549, baseType: !7, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "rdesc", scope: !212, file: !6, line: 550, baseType: !215, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !212, file: !6, line: 551, baseType: !7, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "collection", scope: !212, file: !6, line: 552, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_collection", file: !6, line: 424, size: 128, elements: !222)
!222 = !{!223, !225, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent_idx", scope: !221, file: !6, line: 425, baseType: !224, size: 32)
!224 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !6, line: 426, baseType: !7, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !221, file: !6, line: 427, baseType: !7, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !221, file: !6, line: 428, baseType: !7, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "collection_size", scope: !212, file: !6, line: 553, baseType: !7, size: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "maxcollection", scope: !212, file: !6, line: 554, baseType: !7, size: 32, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "maxapplication", scope: !212, file: !6, line: 555, baseType: !7, size: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !212, file: !6, line: 556, baseType: !99, size: 16, offset: 416)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !212, file: !6, line: 557, baseType: !99, size: 16, offset: 432)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !212, file: !6, line: 558, baseType: !115, size: 32, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !212, file: !6, line: 559, baseType: !115, size: 32, offset: 480)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !212, file: !6, line: 560, baseType: !115, size: 32, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !6, line: 561, baseType: !5, size: 32, offset: 544)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "country", scope: !212, file: !6, line: 562, baseType: !7, size: 32, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "report_enum", scope: !212, file: !6, line: 563, baseType: !239, size: 49728, offset: 640)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 49728, elements: !768)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_report_enum", file: !6, line: 490, size: 16576, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !240, file: !6, line: 491, baseType: !7, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "report_list", scope: !240, file: !6, line: 492, baseType: !121, size: 128, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "report_id_hash", scope: !240, file: !6, line: 493, baseType: !245, size: 16384, offset: 192)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 16384, elements: !3885)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_report", file: !6, line: 476, size: 16896, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !3887, !3888, !3889}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !247, file: !6, line: 477, baseType: !121, size: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "hidinput_list", scope: !247, file: !6, line: 478, baseType: !121, size: 128, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !247, file: !6, line: 479, baseType: !7, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !247, file: !6, line: 480, baseType: !7, size: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "application", scope: !247, file: !6, line: 481, baseType: !7, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !247, file: !6, line: 482, baseType: !255, size: 16384, offset: 384)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 16384, elements: !3885)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_field", file: !6, line: 449, size: 896, elements: !258)
!258 = !{!259, !260, !261, !262, !281, !282, !283, !284, !285, !286, !287, !290, !291, !292, !293, !294, !295, !296, !297, !298, !3884}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "physical", scope: !257, file: !6, line: 450, baseType: !7, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "logical", scope: !257, file: !6, line: 451, baseType: !7, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "application", scope: !257, file: !6, line: 452, baseType: !7, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !257, file: !6, line: 453, baseType: !263, size: 64, offset: 128)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_usage", file: !6, line: 431, size: 192, elements: !265)
!265 = !{!266, !267, !268, !269, !272, !273, !274, !275, !276, !277, !278}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !264, file: !6, line: 432, baseType: !7, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "collection_index", scope: !264, file: !6, line: 433, baseType: !7, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "usage_index", scope: !264, file: !6, line: 434, baseType: !7, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "resolution_multiplier", scope: !264, file: !6, line: 435, baseType: !270, size: 8, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !100, line: 20, baseType: !271)
!271 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wheel_factor", scope: !264, file: !6, line: 438, baseType: !270, size: 8, offset: 104)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !264, file: !6, line: 439, baseType: !99, size: 16, offset: 112)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !264, file: !6, line: 440, baseType: !192, size: 8, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hat_min", scope: !264, file: !6, line: 441, baseType: !270, size: 8, offset: 136)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "hat_max", scope: !264, file: !6, line: 442, baseType: !270, size: 8, offset: 144)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "hat_dir", scope: !264, file: !6, line: 443, baseType: !270, size: 8, offset: 152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "wheel_accumulated", scope: !264, file: !6, line: 444, baseType: !279, size: 16, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !100, line: 23, baseType: !280)
!280 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxusage", scope: !257, file: !6, line: 454, baseType: !7, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !6, line: 455, baseType: !7, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "report_offset", scope: !257, file: !6, line: 456, baseType: !7, size: 32, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "report_size", scope: !257, file: !6, line: 457, baseType: !7, size: 32, offset: 288)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "report_count", scope: !257, file: !6, line: 458, baseType: !7, size: 32, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "report_type", scope: !257, file: !6, line: 459, baseType: !7, size: 32, offset: 352)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !257, file: !6, line: 460, baseType: !288, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !100, line: 26, baseType: !224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "logical_minimum", scope: !257, file: !6, line: 461, baseType: !289, size: 32, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "logical_maximum", scope: !257, file: !6, line: 462, baseType: !289, size: 32, offset: 480)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "physical_minimum", scope: !257, file: !6, line: 463, baseType: !289, size: 32, offset: 512)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "physical_maximum", scope: !257, file: !6, line: 464, baseType: !289, size: 32, offset: 544)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "unit_exponent", scope: !257, file: !6, line: 465, baseType: !289, size: 32, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !257, file: !6, line: 466, baseType: !7, size: 32, offset: 608)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "report", scope: !257, file: !6, line: 467, baseType: !246, size: 64, offset: 640)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !257, file: !6, line: 468, baseType: !7, size: 32, offset: 704)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hidinput", scope: !257, file: !6, line: 470, baseType: !299, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_input", file: !6, line: 522, size: 576, elements: !301)
!301 = !{!302, !303, !304, !3880, !3881, !3882, !3883}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !300, file: !6, line: 523, baseType: !121, size: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "report", scope: !300, file: !6, line: 524, baseType: !246, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !300, file: !6, line: 525, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_dev", file: !307, line: 131, size: 10432, elements: !308)
!307 = !DIFile(filename: "./include/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!308 = !{!309, !313, !314, !315, !323, !327, !328, !332, !333, !334, !335, !336, !337, !341, !342, !343, !344, !345, !346, !363, !368, !3101, !3104, !3105, !3117, !3119, !3122, !3132, !3133, !3134, !3135, !3136, !3140, !3144, !3148, !3152, !3228, !3229, !3230, !3231, !3232, !3871, !3872, !3873, !3874, !3875, !3877, !3878}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !307, line: 132, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !306, file: !307, line: 133, baseType: !310, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !306, file: !307, line: 134, baseType: !310, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !306, file: !307, line: 135, baseType: !316, size: 64, offset: 192)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_id", file: !317, line: 59, size: 64, elements: !318)
!317 = !DIFile(filename: "./include/uapi/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bustype", scope: !316, file: !317, line: 60, baseType: !99, size: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !316, file: !317, line: 61, baseType: !99, size: 16, offset: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !316, file: !317, line: 62, baseType: !99, size: 16, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !316, file: !317, line: 63, baseType: !99, size: 16, offset: 48)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "propbit", scope: !306, file: !307, line: 137, baseType: !324, size: 64, offset: 256)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 1)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "evbit", scope: !306, file: !307, line: 139, baseType: !324, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "keybit", scope: !306, file: !307, line: 140, baseType: !329, size: 768, offset: 384)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 768, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 12)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "relbit", scope: !306, file: !307, line: 141, baseType: !324, size: 64, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "absbit", scope: !306, file: !307, line: 142, baseType: !324, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mscbit", scope: !306, file: !307, line: 143, baseType: !324, size: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ledbit", scope: !306, file: !307, line: 144, baseType: !324, size: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sndbit", scope: !306, file: !307, line: 145, baseType: !324, size: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !306, file: !307, line: 146, baseType: !338, size: 128, offset: 1472)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 2)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swbit", scope: !306, file: !307, line: 147, baseType: !324, size: 64, offset: 1600)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "hint_events_per_packet", scope: !306, file: !307, line: 149, baseType: !7, size: 32, offset: 1664)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "keycodemax", scope: !306, file: !307, line: 151, baseType: !7, size: 32, offset: 1696)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "keycodesize", scope: !306, file: !307, line: 152, baseType: !7, size: 32, offset: 1728)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !306, file: !307, line: 153, baseType: !104, size: 64, offset: 1792)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "setkeycode", scope: !306, file: !307, line: 155, baseType: !347, size: 64, offset: 1856)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!224, !305, !350, !362}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_keymap_entry", file: !317, line: 114, size: 320, elements: !353)
!353 = !{!354, !355, !356, !357, !358}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !317, line: 116, baseType: !192, size: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !352, file: !317, line: 117, baseType: !192, size: 8, offset: 8)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !352, file: !317, line: 118, baseType: !99, size: 16, offset: 16)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !352, file: !317, line: 119, baseType: !115, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "scancode", scope: !352, file: !317, line: 120, baseType: !359, size: 256, offset: 64)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 32)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "getkeycode", scope: !306, file: !307, line: 158, baseType: !364, size: 64, offset: 1920)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!224, !305, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !306, file: !307, line: 161, baseType: !369, size: 64, offset: 1984)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_device", file: !307, line: 534, size: 896, elements: !371)
!371 = !{!372, !439, !443, !447, !452, !453, !457, !458, !459, !460, !461, !462}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !370, file: !307, line: 535, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!224, !305, !376, !376}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_effect", file: !317, line: 450, size: 384, elements: !378)
!378 = !{!379, !380, !381, !382, !387, !392}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !317, line: 451, baseType: !99, size: 16)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !377, file: !317, line: 452, baseType: !279, size: 16, offset: 16)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !377, file: !317, line: 453, baseType: !99, size: 16, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !377, file: !317, line: 454, baseType: !383, size: 32, offset: 48)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_trigger", file: !317, line: 316, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !383, file: !317, line: 317, baseType: !99, size: 16)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !383, file: !317, line: 318, baseType: !99, size: 16, offset: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !377, file: !317, line: 455, baseType: !388, size: 32, offset: 80)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_replay", file: !317, line: 306, size: 32, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !388, file: !317, line: 307, baseType: !99, size: 16)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !388, file: !317, line: 308, baseType: !99, size: 16, offset: 16)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !377, file: !317, line: 463, baseType: !393, size: 256, offset: 128)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !377, file: !317, line: 457, size: 256, elements: !394)
!394 = !{!395, !406, !412, !424, !434}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !393, file: !317, line: 458, baseType: !396, size: 80)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_constant_effect", file: !317, line: 345, size: 80, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !396, file: !317, line: 346, baseType: !279, size: 16)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !396, file: !317, line: 347, baseType: !400, size: 64, offset: 16)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_envelope", file: !317, line: 333, size: 64, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "attack_length", scope: !400, file: !317, line: 334, baseType: !99, size: 16)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "attack_level", scope: !400, file: !317, line: 335, baseType: !99, size: 16, offset: 16)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "fade_length", scope: !400, file: !317, line: 336, baseType: !99, size: 16, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "fade_level", scope: !400, file: !317, line: 337, baseType: !99, size: 16, offset: 48)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ramp", scope: !393, file: !317, line: 459, baseType: !407, size: 96)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_ramp_effect", file: !317, line: 356, size: 96, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "start_level", scope: !407, file: !317, line: 357, baseType: !279, size: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "end_level", scope: !407, file: !317, line: 358, baseType: !279, size: 16, offset: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !407, file: !317, line: 359, baseType: !400, size: 64, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !393, file: !317, line: 460, baseType: !413, size: 256)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_periodic_effect", file: !317, line: 401, size: 256, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !413, file: !317, line: 402, baseType: !99, size: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !413, file: !317, line: 403, baseType: !99, size: 16, offset: 16)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !413, file: !317, line: 404, baseType: !279, size: 16, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !413, file: !317, line: 405, baseType: !279, size: 16, offset: 48)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !413, file: !317, line: 406, baseType: !99, size: 16, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !413, file: !317, line: 408, baseType: !400, size: 64, offset: 80)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "custom_len", scope: !413, file: !317, line: 410, baseType: !115, size: 32, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !413, file: !317, line: 411, baseType: !423, size: 64, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !393, file: !317, line: 461, baseType: !425, size: 192)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 192, elements: !339)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_condition_effect", file: !317, line: 372, size: 96, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "right_saturation", scope: !426, file: !317, line: 373, baseType: !99, size: 16)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "left_saturation", scope: !426, file: !317, line: 374, baseType: !99, size: 16, offset: 16)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "right_coeff", scope: !426, file: !317, line: 376, baseType: !279, size: 16, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "left_coeff", scope: !426, file: !317, line: 377, baseType: !279, size: 16, offset: 48)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "deadband", scope: !426, file: !317, line: 379, baseType: !99, size: 16, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !426, file: !317, line: 380, baseType: !279, size: 16, offset: 80)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rumble", scope: !393, file: !317, line: 462, baseType: !435, size: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_rumble_effect", file: !317, line: 422, size: 32, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "strong_magnitude", scope: !435, file: !317, line: 423, baseType: !99, size: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "weak_magnitude", scope: !435, file: !317, line: 424, baseType: !99, size: 16, offset: 16)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !370, file: !307, line: 537, baseType: !440, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!224, !305, !224}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "playback", scope: !370, file: !307, line: 539, baseType: !444, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!224, !305, !224, !224}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "set_gain", scope: !370, file: !307, line: 540, baseType: !448, size: 64, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !305, !451}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !155, line: 19, baseType: !99)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "set_autocenter", scope: !370, file: !307, line: 541, baseType: !448, size: 64, offset: 256)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !370, file: !307, line: 543, baseType: !454, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !369}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !370, file: !307, line: 545, baseType: !104, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !370, file: !307, line: 547, baseType: !338, size: 128, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !370, file: !307, line: 549, baseType: !144, size: 192, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "max_effects", scope: !370, file: !307, line: 551, baseType: !224, size: 32, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "effects", scope: !370, file: !307, line: 552, baseType: !376, size: 64, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "effect_owners", scope: !370, file: !307, line: 553, baseType: !463, offset: 896)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, elements: !2317)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !37, line: 916, size: 1856, align: 32, elements: !466)
!466 = !{!467, !485, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3084, !3085, !3094, !3095, !3096, !3097, !3098, !3099, !3100}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !465, file: !37, line: 920, baseType: !468, size: 128)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !465, file: !37, line: 917, size: 128, elements: !469)
!469 = !{!470, !476}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !468, file: !37, line: 918, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !472, line: 58, size: 64, elements: !473)
!472 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !472, line: 59, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !468, file: !37, line: 919, baseType: !477, size: 128, align: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !103, line: 216, size: 128, align: 64, elements: !478)
!478 = !{!479, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !103, line: 217, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !477, file: !103, line: 218, baseType: !482, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !480}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !465, file: !37, line: 921, baseType: !486, size: 128, offset: 128)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !487, line: 8, size: 128, elements: !488)
!487 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!488 = !{!489, !493}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !486, file: !487, line: 9, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !492, line: 18, flags: DIFlagFwdDecl)
!492 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !486, file: !487, line: 10, baseType: !494, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !492, line: 89, size: 1536, elements: !496)
!496 = !{!497, !498, !508, !516, !517, !536, !3034, !3036, !3048, !3049, !3050, !3051, !3052, !3058, !3059, !3060}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !495, file: !492, line: 91, baseType: !7, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !495, file: !492, line: 92, baseType: !499, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !500, line: 277, baseType: !501)
!500 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !500, line: 277, size: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !501, file: !500, line: 277, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !500, line: 70, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !500, line: 65, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !505, file: !500, line: 66, baseType: !7, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !495, file: !492, line: 93, baseType: !509, size: 128, offset: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !510, line: 38, size: 128, elements: !511)
!510 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!511 = !{!512, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !510, line: 39, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !509, file: !510, line: 39, baseType: !515, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !495, file: !492, line: 94, baseType: !494, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !495, file: !492, line: 95, baseType: !518, size: 128, offset: 256)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !492, line: 47, size: 128, elements: !519)
!519 = !{!520, !533}
!520 = !DIDerivedType(tag: DW_TAG_member, scope: !518, file: !492, line: 48, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !518, file: !492, line: 48, size: 64, elements: !522)
!522 = !{!523, !529}
!523 = !DIDerivedType(tag: DW_TAG_member, scope: !521, file: !492, line: 49, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !492, line: 49, size: 64, elements: !525)
!525 = !{!526, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !524, file: !492, line: 50, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !155, line: 21, baseType: !115)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !524, file: !492, line: 50, baseType: !527, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !521, file: !492, line: 52, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !155, line: 23, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !100, line: 31, baseType: !532)
!532 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !518, file: !492, line: 54, baseType: !534, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !495, file: !492, line: 96, baseType: !537, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !37, line: 610, size: 4224, elements: !539)
!539 = !{!540, !542, !543, !552, !559, !560, !712, !2745, !2746, !2747, !2753, !2754, !2755, !2756, !2757, !2758, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !3010, !3018, !3019, !3020, !3030, !3031, !3032, !3033}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !538, file: !37, line: 611, baseType: !541, size: 16)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !103, line: 19, baseType: !101)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !538, file: !37, line: 612, baseType: !101, size: 16, offset: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !538, file: !37, line: 613, baseType: !544, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !545, line: 23, baseType: !546)
!545 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 21, size: 32, elements: !547)
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !546, file: !545, line: 22, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !103, line: 32, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !551, line: 49, baseType: !7)
!551 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !538, file: !37, line: 614, baseType: !553, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !545, line: 28, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 26, size: 32, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !554, file: !545, line: 27, baseType: !557, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !103, line: 33, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !551, line: 50, baseType: !7)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !538, file: !37, line: 615, baseType: !7, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !538, file: !37, line: 622, baseType: !561, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !37, line: 1864, size: 1536, align: 512, elements: !564)
!564 = !{!565, !569, !582, !586, !592, !597, !601, !605, !609, !613, !617, !618, !624, !628, !653, !682, !692, !698, !703, !707, !708}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !563, file: !37, line: 1865, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!494, !537, !494, !7}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !563, file: !37, line: 1866, baseType: !570, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!310, !494, !537, !573}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !575, line: 10, size: 128, elements: !576)
!575 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!576 = !{!577, !581}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !574, file: !575, line: 11, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !104}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !574, file: !575, line: 12, baseType: !104, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !563, file: !37, line: 1867, baseType: !583, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DISubroutineType(types: !585)
!585 = !{!224, !537, !224}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !563, file: !37, line: 1868, baseType: !587, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !537, !224}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !37, line: 581, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !563, file: !37, line: 1870, baseType: !593, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!224, !494, !596, !224}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !563, file: !37, line: 1872, baseType: !598, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!224, !537, !494, !541, !209}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !563, file: !37, line: 1873, baseType: !602, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!224, !494, !537, !494}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !563, file: !37, line: 1874, baseType: !606, size: 64, offset: 448)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!224, !537, !494}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !563, file: !37, line: 1875, baseType: !610, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!224, !537, !494, !310}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !563, file: !37, line: 1876, baseType: !614, size: 64, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!224, !537, !494, !541}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !563, file: !37, line: 1877, baseType: !606, size: 64, offset: 640)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !563, file: !37, line: 1878, baseType: !619, size: 64, offset: 704)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!224, !537, !494, !541, !622}
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !103, line: 16, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !103, line: 13, baseType: !527)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !563, file: !37, line: 1879, baseType: !625, size: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!224, !537, !494, !537, !494, !7}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !563, file: !37, line: 1881, baseType: !629, size: 64, offset: 832)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!224, !494, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !37, line: 219, size: 640, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !642, !650, !651, !652}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !633, file: !37, line: 220, baseType: !7, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !633, file: !37, line: 221, baseType: !541, size: 16, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !633, file: !37, line: 222, baseType: !544, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !633, file: !37, line: 223, baseType: !553, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !633, file: !37, line: 224, baseType: !640, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !103, line: 46, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !551, line: 88, baseType: !157)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !633, file: !37, line: 225, baseType: !643, size: 128, offset: 192)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !644, line: 13, size: 128, elements: !645)
!644 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!645 = !{!646, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !643, file: !644, line: 14, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !644, line: 8, baseType: !156)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !643, file: !644, line: 15, baseType: !649, size: 64, offset: 64)
!649 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !633, file: !37, line: 226, baseType: !643, size: 128, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !633, file: !37, line: 227, baseType: !643, size: 128, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !633, file: !37, line: 234, baseType: !464, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !563, file: !37, line: 1882, baseType: !654, size: 64, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!224, !657, !659, !527, !7}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !661, line: 22, size: 1152, elements: !662)
!661 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!662 = !{!663, !664, !665, !666, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !660, file: !661, line: 23, baseType: !527, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !660, file: !661, line: 24, baseType: !541, size: 16, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !660, file: !661, line: 25, baseType: !7, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !660, file: !661, line: 26, baseType: !667, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !103, line: 104, baseType: !527)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !660, file: !661, line: 27, baseType: !530, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !660, file: !661, line: 28, baseType: !530, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !660, file: !661, line: 37, baseType: !530, size: 64, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !660, file: !661, line: 38, baseType: !622, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !660, file: !661, line: 39, baseType: !622, size: 32, offset: 352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !660, file: !661, line: 40, baseType: !544, size: 32, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !660, file: !661, line: 41, baseType: !553, size: 32, offset: 416)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !661, line: 42, baseType: !640, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !660, file: !661, line: 43, baseType: !643, size: 128, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !660, file: !661, line: 44, baseType: !643, size: 128, offset: 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !660, file: !661, line: 45, baseType: !643, size: 128, offset: 768)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !660, file: !661, line: 46, baseType: !643, size: 128, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !660, file: !661, line: 47, baseType: !530, size: 64, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !660, file: !661, line: 48, baseType: !530, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !563, file: !37, line: 1883, baseType: !683, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !494, !596, !689}
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !103, line: 60, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !551, line: 73, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !551, line: 15, baseType: !649)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !103, line: 55, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !551, line: 72, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !551, line: 16, baseType: !119)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !563, file: !37, line: 1884, baseType: !693, size: 64, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!224, !537, !696, !530, !530}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !37, line: 50, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !563, file: !37, line: 1886, baseType: !699, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!224, !537, !702, !224}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !563, file: !37, line: 1887, baseType: !704, size: 64, offset: 1152)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!224, !537, !494, !464, !7, !541}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !563, file: !37, line: 1890, baseType: !614, size: 64, offset: 1216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !563, file: !37, line: 1891, baseType: !709, size: 64, offset: 1280)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!224, !537, !590, !224}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !538, file: !37, line: 623, baseType: !713, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !37, line: 1416, size: 9472, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !773, !2353, !2435, !2518, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2534, !2538, !2539, !2542, !2543, !2546, !2547, !2548, !2589, !2615, !2616, !2617, !2618, !2619, !2620, !2623, !2625, !2632, !2633, !2635, !2636, !2637, !2696, !2697, !2712, !2713, !2714, !2715, !2716, !2719, !2720, !2721, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !714, file: !37, line: 1417, baseType: !121, size: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !714, file: !37, line: 1418, baseType: !622, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !714, file: !37, line: 1419, baseType: !193, size: 8, offset: 160)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !714, file: !37, line: 1420, baseType: !119, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !714, file: !37, line: 1421, baseType: !640, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !714, file: !37, line: 1422, baseType: !722, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !37, line: 2228, size: 576, elements: !724)
!724 = !{!725, !726, !727, !734, !738, !742, !746, !750, !751, !761, !764, !765, !766, !770, !771, !772}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !723, file: !37, line: 2229, baseType: !310, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !723, file: !37, line: 2230, baseType: !224, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !723, file: !37, line: 2238, baseType: !728, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!224, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !733, line: 28, flags: DIFlagFwdDecl)
!733 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!734 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !723, file: !37, line: 2239, baseType: !735, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !37, line: 70, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !723, file: !37, line: 2240, baseType: !739, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!494, !722, !224, !310, !104}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !723, file: !37, line: 2242, baseType: !743, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !713}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !723, file: !37, line: 2243, baseType: !747, size: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !749, line: 76, flags: DIFlagFwdDecl)
!749 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!750 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !37, line: 2244, baseType: !722, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !723, file: !37, line: 2245, baseType: !752, size: 64, offset: 512)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !103, line: 182, size: 64, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !752, file: !103, line: 183, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !103, line: 186, size: 128, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !103, line: 187, baseType: !755, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !756, file: !103, line: 187, baseType: !760, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !723, file: !37, line: 2247, baseType: !762, offset: 576)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !763, line: 187, elements: !173)
!763 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!764 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !723, file: !37, line: 2248, baseType: !762, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !723, file: !37, line: 2249, baseType: !762, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !723, file: !37, line: 2250, baseType: !767, offset: 576)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 3)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !723, file: !37, line: 2252, baseType: !762, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !723, file: !37, line: 2253, baseType: !762, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !723, file: !37, line: 2254, baseType: !762, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !714, file: !37, line: 1423, baseType: !774, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !37, line: 1935, size: 1472, elements: !777)
!777 = !{!778, !782, !786, !787, !791, !797, !801, !802, !803, !807, !811, !812, !813, !814, !820, !825, !826, !833, !834, !835, !836, !2337, !2352}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !776, file: !37, line: 1936, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!537, !713}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !776, file: !37, line: 1937, baseType: !783, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !537}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !776, file: !37, line: 1938, baseType: !783, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !776, file: !37, line: 1940, baseType: !788, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !537, !224}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !776, file: !37, line: 1941, baseType: !792, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!224, !537, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !37, line: 289, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !776, file: !37, line: 1942, baseType: !798, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!224, !537}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !776, file: !37, line: 1943, baseType: !783, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !776, file: !37, line: 1944, baseType: !743, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !776, file: !37, line: 1945, baseType: !804, size: 64, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!224, !713, !224}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !776, file: !37, line: 1946, baseType: !808, size: 64, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!224, !713}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !776, file: !37, line: 1947, baseType: !808, size: 64, offset: 640)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !776, file: !37, line: 1948, baseType: !808, size: 64, offset: 704)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !776, file: !37, line: 1949, baseType: !808, size: 64, offset: 768)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !776, file: !37, line: 1950, baseType: !815, size: 64, offset: 832)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!224, !494, !818}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !37, line: 57, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !776, file: !37, line: 1951, baseType: !821, size: 64, offset: 896)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!224, !713, !824, !596}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !776, file: !37, line: 1952, baseType: !743, size: 64, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !776, file: !37, line: 1954, baseType: !827, size: 64, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!224, !830, !494}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !832, line: 539, flags: DIFlagFwdDecl)
!832 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!833 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !776, file: !37, line: 1955, baseType: !827, size: 64, offset: 1088)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !776, file: !37, line: 1956, baseType: !827, size: 64, offset: 1152)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !776, file: !37, line: 1957, baseType: !827, size: 64, offset: 1216)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !776, file: !37, line: 1963, baseType: !837, size: 64, offset: 1280)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!224, !713, !840, !102}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !842, line: 68, size: 512, align: 128, elements: !843)
!842 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!843 = !{!844, !845, !2329, !2336}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !842, line: 69, baseType: !119, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, scope: !841, file: !842, line: 77, baseType: !846, size: 320, offset: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !842, line: 77, size: 320, elements: !847)
!847 = !{!848, !1026, !1031, !1059, !1067, !1073, !2321, !2328}
!848 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !842, line: 78, baseType: !849, size: 320)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !846, file: !842, line: 78, size: 320, elements: !850)
!850 = !{!851, !852, !1024, !1025}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !849, file: !842, line: 84, baseType: !121, size: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !849, file: !842, line: 86, baseType: !853, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !37, line: 451, size: 1216, align: 64, elements: !855)
!855 = !{!856, !857, !864, !865, !870, !885, !894, !895, !896, !897, !1017, !1018, !1021, !1022, !1023}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !854, file: !37, line: 452, baseType: !537, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !854, file: !37, line: 453, baseType: !858, size: 128, offset: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !859, line: 292, size: 128, elements: !860)
!859 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !858, file: !859, line: 293, baseType: !159)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !858, file: !859, line: 295, baseType: !102, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !858, file: !859, line: 296, baseType: !104, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !854, file: !37, line: 454, baseType: !102, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !854, file: !37, line: 455, baseType: !866, size: 32, offset: 224)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !103, line: 168, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 166, size: 32, elements: !868)
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !867, file: !103, line: 167, baseType: !224, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !854, file: !37, line: 460, baseType: !871, size: 128, offset: 256)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !872, line: 125, size: 128, elements: !873)
!872 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!873 = !{!874, !884}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !871, file: !872, line: 126, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !872, line: 31, size: 64, elements: !876)
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !875, file: !872, line: 32, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !872, line: 24, size: 192, align: 64, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !879, file: !872, line: 25, baseType: !119, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !879, file: !872, line: 26, baseType: !878, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !879, file: !872, line: 27, baseType: !878, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !871, file: !872, line: 127, baseType: !878, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !854, file: !37, line: 461, baseType: !886, size: 256, offset: 384)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !887, line: 35, size: 256, elements: !888)
!887 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!888 = !{!889, !890, !891, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !886, file: !887, line: 36, baseType: !148, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !886, file: !887, line: 42, baseType: !148, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !886, file: !887, line: 46, baseType: !892, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !160, line: 29, baseType: !167)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !886, file: !887, line: 47, baseType: !121, size: 128, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !854, file: !37, line: 462, baseType: !119, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !854, file: !37, line: 463, baseType: !119, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !854, file: !37, line: 464, baseType: !119, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !854, file: !37, line: 465, baseType: !898, size: 64, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !37, line: 367, size: 1408, elements: !901)
!901 = !{!902, !906, !910, !914, !918, !922, !928, !934, !938, !943, !947, !951, !955, !981, !985, !991, !992, !993, !997, !1002, !1006, !1013}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !900, file: !37, line: 368, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!224, !840, !795}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !900, file: !37, line: 369, baseType: !907, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!224, !464, !840}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !900, file: !37, line: 372, baseType: !911, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!224, !853, !795}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !900, file: !37, line: 375, baseType: !915, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!224, !840}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !900, file: !37, line: 381, baseType: !919, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{!224, !464, !853, !124, !7}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !900, file: !37, line: 383, baseType: !923, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !37, line: 290, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !900, file: !37, line: 385, baseType: !929, size: 64, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!224, !464, !853, !640, !7, !7, !932, !933}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !900, file: !37, line: 388, baseType: !935, size: 64, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!224, !464, !853, !640, !7, !7, !840, !104}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !900, file: !37, line: 393, baseType: !939, size: 64, offset: 512)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!942, !853, !942}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !103, line: 125, baseType: !530)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !900, file: !37, line: 394, baseType: !944, size: 64, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !840, !7, !7}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !900, file: !37, line: 395, baseType: !948, size: 64, offset: 640)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!224, !840, !102}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !900, file: !37, line: 396, baseType: !952, size: 64, offset: 704)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !840}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !900, file: !37, line: 397, baseType: !956, size: 64, offset: 768)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!686, !959, !979}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !37, line: 320, size: 384, elements: !961)
!961 = !{!962, !963, !964, !968, !969, !970, !971, !972}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !960, file: !37, line: 321, baseType: !464, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !960, file: !37, line: 326, baseType: !640, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !960, file: !37, line: 327, baseType: !965, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !959, !649, !649}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !960, file: !37, line: 328, baseType: !104, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !960, file: !37, line: 329, baseType: !224, size: 32, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !960, file: !37, line: 330, baseType: !451, size: 16, offset: 288)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !960, file: !37, line: 331, baseType: !451, size: 16, offset: 304)
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !960, file: !37, line: 332, baseType: !973, size: 64, offset: 320)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !960, file: !37, line: 332, size: 64, elements: !974)
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !973, file: !37, line: 333, baseType: !7, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !973, file: !37, line: 334, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !37, line: 334, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !37, line: 64, flags: DIFlagFwdDecl)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !900, file: !37, line: 402, baseType: !982, size: 64, offset: 832)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!224, !853, !840, !840, !12}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !900, file: !37, line: 404, baseType: !986, size: 64, offset: 896)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!209, !840, !989}
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !990, line: 305, baseType: !7)
!990 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!991 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !900, file: !37, line: 405, baseType: !952, size: 64, offset: 960)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !900, file: !37, line: 406, baseType: !915, size: 64, offset: 1024)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !900, file: !37, line: 407, baseType: !994, size: 64, offset: 1088)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!224, !840, !119, !119}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "is_dirty_writeback", scope: !900, file: !37, line: 409, baseType: !998, size: 64, offset: 1152)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !840, !1001, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "error_remove_page", scope: !900, file: !37, line: 410, baseType: !1003, size: 64, offset: 1216)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!224, !853, !840}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "swap_activate", scope: !900, file: !37, line: 413, baseType: !1007, size: 64, offset: 1280)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!224, !1010, !464, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "swap_info_struct", file: !37, line: 61, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "swap_deactivate", scope: !900, file: !37, line: 415, baseType: !1014, size: 64, offset: 1344)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !464}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !854, file: !37, line: 466, baseType: !119, size: 64, offset: 896)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "wb_err", scope: !854, file: !37, line: 467, baseType: !1019, size: 32, offset: 960)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "errseq_t", file: !1020, line: 8, baseType: !527)
!1020 = !DIFile(filename: "./include/linux/errseq.h", directory: "/home/lizy2001/genbc/linux")
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "private_lock", scope: !854, file: !37, line: 468, baseType: !159, offset: 992)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !854, file: !37, line: 469, baseType: !121, size: 128, offset: 1024)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !854, file: !37, line: 470, baseType: !104, size: 64, offset: 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !849, file: !842, line: 87, baseType: !119, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !849, file: !842, line: 94, baseType: !119, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !842, line: 96, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !846, file: !842, line: 96, size: 64, elements: !1028)
!1028 = !{!1029}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dma_addr", scope: !1027, file: !842, line: 101, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !103, line: 143, baseType: !530)
!1031 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !842, line: 103, baseType: !1032, size: 320)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !846, file: !842, line: 103, size: 320, elements: !1033)
!1033 = !{!1034, !1044, !1047, !1048}
!1034 = !DIDerivedType(tag: DW_TAG_member, scope: !1032, file: !842, line: 104, baseType: !1035, size: 128)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1032, file: !842, line: 104, size: 128, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "slab_list", scope: !1035, file: !842, line: 105, baseType: !121, size: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, scope: !1035, file: !842, line: 106, baseType: !1039, size: 128)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1035, file: !842, line: 106, size: 128, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1039, file: !842, line: 107, baseType: !840, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !1039, file: !842, line: 109, baseType: !224, size: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pobjects", scope: !1039, file: !842, line: 110, baseType: !224, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "slab_cache", scope: !1032, file: !842, line: 117, baseType: !1045, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !842, line: 117, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !1032, file: !842, line: 119, baseType: !104, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, scope: !1032, file: !842, line: 120, baseType: !1049, size: 64, offset: 256)
!1049 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1032, file: !842, line: 120, size: 64, elements: !1050)
!1050 = !{!1051, !1052, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "s_mem", scope: !1049, file: !842, line: 121, baseType: !104, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !1049, file: !842, line: 122, baseType: !119, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, scope: !1049, file: !842, line: 123, baseType: !1054, size: 32)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1049, file: !842, line: 123, size: 32, elements: !1055)
!1055 = !{!1056, !1057, !1058}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !1054, file: !842, line: 124, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1054, file: !842, line: 125, baseType: !7, size: 15, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !1054, file: !842, line: 126, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !842, line: 130, baseType: !1060, size: 192)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !846, file: !842, line: 130, size: 192, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1066}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "compound_head", scope: !1060, file: !842, line: 131, baseType: !119, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "compound_dtor", scope: !1060, file: !842, line: 134, baseType: !193, size: 8, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "compound_order", scope: !1060, file: !842, line: 135, baseType: !193, size: 8, offset: 72)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "compound_mapcount", scope: !1060, file: !842, line: 136, baseType: !866, size: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "compound_nr", scope: !1060, file: !842, line: 137, baseType: !7, size: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !842, line: 139, baseType: !1068, size: 256)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !846, file: !842, line: 139, size: 256, elements: !1069)
!1069 = !{!1070, !1071, !1072}
