; ModuleID = '../bcout/drivers/hid/hid-apple.llvm.bc'
source_filename = "drivers/hid/hid-apple.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_apple_driver_init6:\09\09\09"
module asm ".long\09apple_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }

!41 = !DIEnumerator(name: "WRITE_LIFE_SHORT", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "WRITE_LIFE_MEDIUM", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "WRITE_LIFE_LONG", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "WRITE_LIFE_EXTREME", value: 5, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !46, line: 9, baseType: !7, size: 32, elements: !47)
!46 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIEnumerator(name: "PIDTYPE_PID", value: 0, isUnsigned: true)
!49 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1, isUnsigned: true)
!50 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2, isUnsigned: true)
!51 = !DIEnumerator(name: "PIDTYPE_SID", value: 3, isUnsigned: true)
!52 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !54, line: 26, baseType: !7, size: 32, elements: !55)
!54 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !60, line: 44, baseType: !7, size: 32, elements: !61)
!60 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !63, !64}
!62 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !66, line: 343, baseType: !7, size: 32, elements: !67)
!66 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !69, !70, !71}
!68 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !73, line: 524, baseType: !7, size: 32, elements: !74)
!73 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!79 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !73, line: 502, baseType: !7, size: 32, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 10, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!91 = !{!92, !95, !97, !98, !100, !103}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !94, line: 76, flags: DIFlagFwdDecl)
!94 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !96, line: 148, baseType: !7)
!96 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !102)
!102 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !105)
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !{!107, !175, !180, !185, !187, !192, !197, !199, !204, !209, !211, !216, !221, !223, !230, !232, !237, !239, !0, !241, !243, !248, !250, !255, !260, !4141, !4146, !4157, !4160, !4165, !4168, !4171, !4176, !4179}
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "__param_fnmode", scope: !2, file: !3, line: 39, type: !109, isLocal: true, isDefinition: true, align: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !111, line: 69, size: 320, elements: !112)
!111 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!112 = !{!113, !116, !117, !138, !145, !149, !153}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 70, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !110, file: !111, line: 71, baseType: !92, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !110, file: !111, line: 72, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !111, line: 47, size: 256, elements: !121)
!121 = !{!122, !123, !129, !134}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !111, line: 49, baseType: !7, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !120, file: !111, line: 51, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !114, !128}
!127 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !120, file: !111, line: 53, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!127, !133, !128}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !120, file: !111, line: 55, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !97}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !110, file: !111, line: 73, baseType: !139, size: 16, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !141, line: 19, baseType: !142)
!141 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !143, line: 24, baseType: !144)
!143 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!144 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !110, file: !111, line: 74, baseType: !146, size: 8, offset: 208)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !141, line: 16, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !143, line: 20, baseType: !148)
!148 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !111, line: 75, baseType: !150, size: 8, offset: 216)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !141, line: 17, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !143, line: 21, baseType: !152)
!152 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !110, file: !111, line: 76, baseType: !154, size: 64, offset: 256)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !110, file: !111, line: 76, size: 64, elements: !155)
!155 = !{!156, !157, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !154, file: !111, line: 77, baseType: !97, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !154, file: !111, line: 78, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !111, line: 86, size: 128, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !160, file: !111, line: 87, baseType: !7, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !160, file: !111, line: 88, baseType: !133, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !154, file: !111, line: 79, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !111, line: 92, size: 256, elements: !168)
!168 = !{!169, !170, !171, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !167, file: !111, line: 94, baseType: !7, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !167, file: !111, line: 95, baseType: !7, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !167, file: !111, line: 96, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !167, file: !111, line: 97, baseType: !118, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !167, file: !111, line: 98, baseType: !97, size: 64, offset: 192)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_fnmodetype204", scope: !2, file: !3, line: 39, type: !177, isLocal: true, isDefinition: true, align: 8)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 248, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 31)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_fnmode205", scope: !2, file: !3, line: 40, type: !182, isLocal: true, isDefinition: true, align: 8)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 832, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 104)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "__param_iso_layout", scope: !2, file: !3, line: 44, type: !109, isLocal: true, isDefinition: true, align: 64)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_iso_layouttype206", scope: !2, file: !3, line: 44, type: !189, isLocal: true, isDefinition: true, align: 8)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 280, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 35)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_iso_layout207", scope: !2, file: !3, line: 45, type: !194, isLocal: true, isDefinition: true, align: 8)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 872, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 109)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "__param_swap_opt_cmd", scope: !2, file: !3, line: 49, type: !109, isLocal: true, isDefinition: true, align: 64)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_swap_opt_cmdtype208", scope: !2, file: !3, line: 49, type: !201, isLocal: true, isDefinition: true, align: 8)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 296, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 37)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_swap_opt_cmd209", scope: !2, file: !3, line: 50, type: !206, isLocal: true, isDefinition: true, align: 8)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 1584, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 198)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "__param_swap_fn_leftctrl", scope: !2, file: !3, line: 55, type: !109, isLocal: true, isDefinition: true, align: 64)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_swap_fn_leftctrltype210", scope: !2, file: !3, line: 55, type: !213, isLocal: true, isDefinition: true, align: 8)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 328, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 41)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_swap_fn_leftctrl211", scope: !2, file: !3, line: 56, type: !218, isLocal: true, isDefinition: true, align: 8)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 1376, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 172)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_apple_driver_init212", scope: !2, file: !3, line: 635, type: !97, isLocal: true, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "__exitcall_apple_driver_exit", scope: !2, file: !3, line: 635, type: !225, isLocal: true, isDefinition: true)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "exitcall_t", file: !226, line: 117, baseType: !227)
!226 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null}
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file213", scope: !2, file: !3, line: 637, type: !201, isLocal: true, isDefinition: true, align: 8)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license214", scope: !2, file: !3, line: 637, type: !234, isLocal: true, isDefinition: true, align: 8)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 176, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 22)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "swap_opt_cmd", scope: !2, file: !3, line: 48, type: !7, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "swap_fn_leftctrl", scope: !2, file: !3, line: 54, type: !7, isLocal: true, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "fnmode", scope: !2, file: !3, line: 38, type: !7, isLocal: true, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "__param_str_iso_layout", scope: !2, file: !3, line: 44, type: !245, isLocal: true, isDefinition: true)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 168, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 21)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "iso_layout", scope: !2, file: !3, line: 43, type: !7, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "__param_str_swap_opt_cmd", scope: !2, file: !3, line: 49, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 184, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 23)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__param_str_swap_fn_leftctrl", scope: !2, file: !3, line: 55, type: !257, isLocal: true, isDefinition: true)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 216, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 27)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "apple_driver", scope: !2, file: !3, line: 625, type: !262, isLocal: true, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_driver", file: !6, line: 738, size: 2432, elements: !263)
!263 = !{!264, !265, !278, !284, !300, !4087, !4091, !4092, !4098, !4103, !4111, !4115, !4116, !4120, !4125, !4126, !4130, !4134, !4138, !4139, !4140}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !6, line: 739, baseType: !133, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "id_table", scope: !262, file: !6, line: 740, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_device_id", file: !269, line: 166, size: 192, elements: !270)
!269 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!270 = !{!271, !272, !273, !275, !276}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !268, file: !269, line: 167, baseType: !142, size: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !268, file: !269, line: 168, baseType: !142, size: 16, offset: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !268, file: !269, line: 169, baseType: !274, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !143, line: 27, baseType: !7)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !268, file: !269, line: 170, baseType: !274, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !268, file: !269, line: 171, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_ulong_t", file: !269, line: 14, baseType: !99)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_list", scope: !262, file: !6, line: 742, baseType: !279, size: 128, offset: 128)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !96, line: 178, size: 128, elements: !280)
!280 = !{!281, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !96, line: 179, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !279, file: !96, line: 179, baseType: !282, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dyn_lock", scope: !262, file: !6, line: 743, baseType: !285, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !286, line: 83, baseType: !287)
!286 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !286, line: 71, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !286, line: 72, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !286, line: 72, elements: !291)
!291 = !{!292}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !290, file: !286, line: 73, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !286, line: 20, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !293, file: !286, line: 21, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !297, line: 25, baseType: !298)
!297 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !297, line: 25, elements: !299)
!299 = !{}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !262, file: !6, line: 745, baseType: !301, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!304, !306, !304}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !96, line: 30, baseType: !305)
!305 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_device", file: !6, line: 547, size: 60160, elements: !308)
!308 = !{!309, !311, !312, !313, !314, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !4005, !4006, !4013, !4014, !4016, !4052, !4053, !4054, !4055, !4056, !4057, !4058, !4059, !4060, !4061, !4062, !4064, !4065, !4066, !4067, !4071, !4072, !4076, !4080, !4081, !4082, !4083, !4084, !4085, !4086}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dev_rdesc", scope: !307, file: !6, line: 548, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dev_rsize", scope: !307, file: !6, line: 549, baseType: !7, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rdesc", scope: !307, file: !6, line: 550, baseType: !310, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rsize", scope: !307, file: !6, line: 551, baseType: !7, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "collection", scope: !307, file: !6, line: 552, baseType: !315, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_collection", file: !6, line: 424, size: 128, elements: !317)
!317 = !{!318, !319, !320, !321}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "parent_idx", scope: !316, file: !6, line: 425, baseType: !127, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !6, line: 426, baseType: !7, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !316, file: !6, line: 427, baseType: !7, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !316, file: !6, line: 428, baseType: !7, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "collection_size", scope: !307, file: !6, line: 553, baseType: !7, size: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "maxcollection", scope: !307, file: !6, line: 554, baseType: !7, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "maxapplication", scope: !307, file: !6, line: 555, baseType: !7, size: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !307, file: !6, line: 556, baseType: !142, size: 16, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !307, file: !6, line: 557, baseType: !142, size: 16, offset: 432)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !307, file: !6, line: 558, baseType: !274, size: 32, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !307, file: !6, line: 559, baseType: !274, size: 32, offset: 480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !307, file: !6, line: 560, baseType: !274, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !6, line: 561, baseType: !5, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "country", scope: !307, file: !6, line: 562, baseType: !7, size: 32, offset: 576)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "report_enum", scope: !307, file: !6, line: 563, baseType: !333, size: 49728, offset: 640)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 49728, elements: !862)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_report_enum", file: !6, line: 490, size: 16576, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "numbered", scope: !334, file: !6, line: 491, baseType: !7, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "report_list", scope: !334, file: !6, line: 492, baseType: !279, size: 128, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "report_id_hash", scope: !334, file: !6, line: 493, baseType: !339, size: 16384, offset: 192)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 16384, elements: !4000)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_report", file: !6, line: 476, size: 16896, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !4002, !4003, !4004}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !341, file: !6, line: 477, baseType: !279, size: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hidinput_list", scope: !341, file: !6, line: 478, baseType: !279, size: 128, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !341, file: !6, line: 479, baseType: !7, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !341, file: !6, line: 480, baseType: !7, size: 32, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "application", scope: !341, file: !6, line: 481, baseType: !7, size: 32, offset: 320)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !341, file: !6, line: 482, baseType: !349, size: 16384, offset: 384)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 16384, elements: !4000)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_field", file: !6, line: 449, size: 896, elements: !352)
!352 = !{!353, !354, !355, !356, !373, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !3999}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "physical", scope: !351, file: !6, line: 450, baseType: !7, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "logical", scope: !351, file: !6, line: 451, baseType: !7, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "application", scope: !351, file: !6, line: 452, baseType: !7, size: 32, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !351, file: !6, line: 453, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_usage", file: !6, line: 431, size: 192, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hid", scope: !358, file: !6, line: 432, baseType: !7, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "collection_index", scope: !358, file: !6, line: 433, baseType: !7, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "usage_index", scope: !358, file: !6, line: 434, baseType: !7, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "resolution_multiplier", scope: !358, file: !6, line: 435, baseType: !147, size: 8, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "wheel_factor", scope: !358, file: !6, line: 438, baseType: !147, size: 8, offset: 104)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !358, file: !6, line: 439, baseType: !142, size: 16, offset: 112)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !6, line: 440, baseType: !151, size: 8, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "hat_min", scope: !358, file: !6, line: 441, baseType: !147, size: 8, offset: 136)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "hat_max", scope: !358, file: !6, line: 442, baseType: !147, size: 8, offset: 144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "hat_dir", scope: !358, file: !6, line: 443, baseType: !147, size: 8, offset: 152)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "wheel_accumulated", scope: !358, file: !6, line: 444, baseType: !371, size: 16, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !143, line: 23, baseType: !372)
!372 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "maxusage", scope: !351, file: !6, line: 454, baseType: !7, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !351, file: !6, line: 455, baseType: !7, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "report_offset", scope: !351, file: !6, line: 456, baseType: !7, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "report_size", scope: !351, file: !6, line: 457, baseType: !7, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "report_count", scope: !351, file: !6, line: 458, baseType: !7, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "report_type", scope: !351, file: !6, line: 459, baseType: !7, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !351, file: !6, line: 460, baseType: !380, size: 64, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !143, line: 26, baseType: !127)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "logical_minimum", scope: !351, file: !6, line: 461, baseType: !381, size: 32, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "logical_maximum", scope: !351, file: !6, line: 462, baseType: !381, size: 32, offset: 480)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "physical_minimum", scope: !351, file: !6, line: 463, baseType: !381, size: 32, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "physical_maximum", scope: !351, file: !6, line: 464, baseType: !381, size: 32, offset: 544)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "unit_exponent", scope: !351, file: !6, line: 465, baseType: !381, size: 32, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !351, file: !6, line: 466, baseType: !7, size: 32, offset: 608)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "report", scope: !351, file: !6, line: 467, baseType: !340, size: 64, offset: 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !351, file: !6, line: 468, baseType: !7, size: 32, offset: 704)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "hidinput", scope: !351, file: !6, line: 470, baseType: !391, size: 64, offset: 768)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hid_input", file: !6, line: 522, size: 576, elements: !393)
!393 = !{!394, !395, !396, !3995, !3996, !3997, !3998}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !392, file: !6, line: 523, baseType: !279, size: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "report", scope: !392, file: !6, line: 524, baseType: !340, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !392, file: !6, line: 525, baseType: !397, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_dev", file: !399, line: 131, size: 10432, elements: !400)
!399 = !DIFile(filename: "./include/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!400 = !{!401, !402, !403, !404, !412, !416, !417, !421, !422, !423, !424, !425, !426, !430, !431, !432, !433, !434, !435, !451, !456, !3206, !3209, !3210, !3222, !3224, !3227, !3237, !3238, !3239, !3240, !3241, !3245, !3249, !3253, !3257, !3333, !3334, !3335, !3336, !3337, !3986, !3987, !3988, !3989, !3990, !3992, !3993}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !399, line: 132, baseType: !114, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !398, file: !399, line: 133, baseType: !114, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !398, file: !399, line: 134, baseType: !114, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !399, line: 135, baseType: !405, size: 64, offset: 192)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_id", file: !406, line: 59, size: 64, elements: !407)
!406 = !DIFile(filename: "./include/uapi/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!407 = !{!408, !409, !410, !411}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "bustype", scope: !405, file: !406, line: 60, baseType: !142, size: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !405, file: !406, line: 61, baseType: !142, size: 16, offset: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !405, file: !406, line: 62, baseType: !142, size: 16, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !405, file: !406, line: 63, baseType: !142, size: 16, offset: 48)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "propbit", scope: !398, file: !399, line: 137, baseType: !413, size: 64, offset: 256)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 1)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "evbit", scope: !398, file: !399, line: 139, baseType: !413, size: 64, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "keybit", scope: !398, file: !399, line: 140, baseType: !418, size: 768, offset: 384)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 768, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 12)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "relbit", scope: !398, file: !399, line: 141, baseType: !413, size: 64, offset: 1152)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "absbit", scope: !398, file: !399, line: 142, baseType: !413, size: 64, offset: 1216)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mscbit", scope: !398, file: !399, line: 143, baseType: !413, size: 64, offset: 1280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ledbit", scope: !398, file: !399, line: 144, baseType: !413, size: 64, offset: 1344)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sndbit", scope: !398, file: !399, line: 145, baseType: !413, size: 64, offset: 1408)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !398, file: !399, line: 146, baseType: !427, size: 128, offset: 1472)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "swbit", scope: !398, file: !399, line: 147, baseType: !413, size: 64, offset: 1600)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hint_events_per_packet", scope: !398, file: !399, line: 149, baseType: !7, size: 32, offset: 1664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "keycodemax", scope: !398, file: !399, line: 151, baseType: !7, size: 32, offset: 1696)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "keycodesize", scope: !398, file: !399, line: 152, baseType: !7, size: 32, offset: 1728)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !398, file: !399, line: 153, baseType: !97, size: 64, offset: 1792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "setkeycode", scope: !398, file: !399, line: 155, baseType: !436, size: 64, offset: 1856)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!127, !397, !439, !172}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_keymap_entry", file: !406, line: 114, size: 320, elements: !442)
!442 = !{!443, !444, !445, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !441, file: !406, line: 116, baseType: !151, size: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !441, file: !406, line: 117, baseType: !151, size: 8, offset: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !441, file: !406, line: 118, baseType: !142, size: 16, offset: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !441, file: !406, line: 119, baseType: !274, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "scancode", scope: !441, file: !406, line: 120, baseType: !448, size: 256, offset: 64)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "getkeycode", scope: !398, file: !399, line: 158, baseType: !452, size: 64, offset: 1920)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DISubroutineType(types: !454)
!454 = !{!127, !397, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !398, file: !399, line: 161, baseType: !457, size: 64, offset: 1984)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_device", file: !399, line: 534, size: 896, elements: !459)
!459 = !{!460, !527, !531, !535, !539, !540, !544, !545, !546, !562, !563, !564}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !458, file: !399, line: 535, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!127, !397, !464, !464}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_effect", file: !406, line: 450, size: 384, elements: !466)
!466 = !{!467, !468, !469, !470, !475, !480}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !406, line: 451, baseType: !142, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !465, file: !406, line: 452, baseType: !371, size: 16, offset: 16)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !465, file: !406, line: 453, baseType: !142, size: 16, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !465, file: !406, line: 454, baseType: !471, size: 32, offset: 48)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_trigger", file: !406, line: 316, size: 32, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !471, file: !406, line: 317, baseType: !142, size: 16)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !471, file: !406, line: 318, baseType: !142, size: 16, offset: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !465, file: !406, line: 455, baseType: !476, size: 32, offset: 80)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_replay", file: !406, line: 306, size: 32, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !476, file: !406, line: 307, baseType: !142, size: 16)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !476, file: !406, line: 308, baseType: !142, size: 16, offset: 16)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !465, file: !406, line: 463, baseType: !481, size: 256, offset: 128)
!481 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !465, file: !406, line: 457, size: 256, elements: !482)
!482 = !{!483, !494, !500, !512, !522}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !481, file: !406, line: 458, baseType: !484, size: 80)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_constant_effect", file: !406, line: 345, size: 80, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !484, file: !406, line: 346, baseType: !371, size: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !484, file: !406, line: 347, baseType: !488, size: 64, offset: 16)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_envelope", file: !406, line: 333, size: 64, elements: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "attack_length", scope: !488, file: !406, line: 334, baseType: !142, size: 16)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "attack_level", scope: !488, file: !406, line: 335, baseType: !142, size: 16, offset: 16)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fade_length", scope: !488, file: !406, line: 336, baseType: !142, size: 16, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fade_level", scope: !488, file: !406, line: 337, baseType: !142, size: 16, offset: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ramp", scope: !481, file: !406, line: 459, baseType: !495, size: 96)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_ramp_effect", file: !406, line: 356, size: 96, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "start_level", scope: !495, file: !406, line: 357, baseType: !371, size: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "end_level", scope: !495, file: !406, line: 358, baseType: !371, size: 16, offset: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !495, file: !406, line: 359, baseType: !488, size: 64, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !481, file: !406, line: 460, baseType: !501, size: 256)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_periodic_effect", file: !406, line: 401, size: 256, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !501, file: !406, line: 402, baseType: !142, size: 16)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !501, file: !406, line: 403, baseType: !142, size: 16, offset: 16)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !501, file: !406, line: 404, baseType: !371, size: 16, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !501, file: !406, line: 405, baseType: !371, size: 16, offset: 48)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !501, file: !406, line: 406, baseType: !142, size: 16, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !501, file: !406, line: 408, baseType: !488, size: 64, offset: 80)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "custom_len", scope: !501, file: !406, line: 410, baseType: !274, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !501, file: !406, line: 411, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !481, file: !406, line: 461, baseType: !513, size: 192)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 192, elements: !428)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_condition_effect", file: !406, line: 372, size: 96, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "right_saturation", scope: !514, file: !406, line: 373, baseType: !142, size: 16)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "left_saturation", scope: !514, file: !406, line: 374, baseType: !142, size: 16, offset: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "right_coeff", scope: !514, file: !406, line: 376, baseType: !371, size: 16, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "left_coeff", scope: !514, file: !406, line: 377, baseType: !371, size: 16, offset: 48)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "deadband", scope: !514, file: !406, line: 379, baseType: !142, size: 16, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !514, file: !406, line: 380, baseType: !371, size: 16, offset: 80)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rumble", scope: !481, file: !406, line: 462, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_rumble_effect", file: !406, line: 422, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "strong_magnitude", scope: !523, file: !406, line: 423, baseType: !142, size: 16)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "weak_magnitude", scope: !523, file: !406, line: 424, baseType: !142, size: 16, offset: 16)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !458, file: !399, line: 537, baseType: !528, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!127, !397, !127}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "playback", scope: !458, file: !399, line: 539, baseType: !532, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!127, !397, !127, !127}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "set_gain", scope: !458, file: !399, line: 540, baseType: !536, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !397, !140}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "set_autocenter", scope: !458, file: !399, line: 541, baseType: !536, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !458, file: !399, line: 543, baseType: !541, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !457}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !458, file: !399, line: 545, baseType: !97, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !458, file: !399, line: 547, baseType: !427, size: 128, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !458, file: !399, line: 549, baseType: !547, size: 192, offset: 576)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !548, line: 53, size: 192, elements: !549)
!548 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!549 = !{!550, !560, !561}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !547, file: !548, line: 54, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !552, line: 13, baseType: !553)
!552 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !96, line: 175, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 173, size: 64, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !554, file: !96, line: 174, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !141, line: 22, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !143, line: 30, baseType: !559)
!559 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !547, file: !548, line: 55, baseType: !285, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !547, file: !548, line: 59, baseType: !279, size: 128, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "max_effects", scope: !458, file: !399, line: 551, baseType: !127, size: 32, offset: 768)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "effects", scope: !458, file: !399, line: 552, baseType: !464, size: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "effect_owners", scope: !458, file: !399, line: 553, baseType: !565, offset: 896)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, elements: !2422)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !37, line: 916, size: 1856, align: 32, elements: !568)
!568 = !{!569, !587, !3171, !3172, !3173, !3174, !3175, !3176, !3177, !3178, !3179, !3180, !3189, !3190, !3199, !3200, !3201, !3202, !3203, !3204, !3205}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !567, file: !37, line: 920, baseType: !570, size: 128)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !567, file: !37, line: 917, size: 128, elements: !571)
!571 = !{!572, !578}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !570, file: !37, line: 918, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !574, line: 58, size: 64, elements: !575)
!574 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !574, line: 59, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !570, file: !37, line: 919, baseType: !579, size: 128, align: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !96, line: 216, size: 128, align: 64, elements: !580)
!580 = !{!581, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !579, file: !96, line: 217, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !579, file: !96, line: 218, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !582}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !567, file: !37, line: 921, baseType: !588, size: 128, offset: 128)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !589, line: 8, size: 128, elements: !590)
!589 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!590 = !{!591, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !588, file: !589, line: 9, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !594, line: 18, flags: DIFlagFwdDecl)
!594 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !588, file: !589, line: 10, baseType: !596, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !594, line: 89, size: 1536, elements: !598)
!598 = !{!599, !600, !610, !618, !619, !638, !3139, !3141, !3153, !3154, !3155, !3156, !3157, !3163, !3164, !3165}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !597, file: !594, line: 91, baseType: !7, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !597, file: !594, line: 92, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !602, line: 277, baseType: !603)
!602 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !602, line: 277, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !603, file: !602, line: 277, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !602, line: 70, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !602, line: 65, size: 32, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !607, file: !602, line: 66, baseType: !7, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !597, file: !594, line: 93, baseType: !611, size: 128, offset: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !612, line: 38, size: 128, elements: !613)
!612 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!613 = !{!614, !616}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !612, line: 39, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !611, file: !612, line: 39, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !597, file: !594, line: 94, baseType: !596, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !597, file: !594, line: 95, baseType: !620, size: 128, offset: 256)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !594, line: 47, size: 128, elements: !621)
!621 = !{!622, !635}
!622 = !DIDerivedType(tag: DW_TAG_member, scope: !620, file: !594, line: 48, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !620, file: !594, line: 48, size: 64, elements: !624)
!624 = !{!625, !631}
!625 = !DIDerivedType(tag: DW_TAG_member, scope: !623, file: !594, line: 49, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !594, line: 49, size: 64, elements: !627)
!627 = !{!628, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !626, file: !594, line: 50, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !141, line: 21, baseType: !274)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !626, file: !594, line: 50, baseType: !629, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !623, file: !594, line: 52, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !141, line: 23, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !143, line: 31, baseType: !634)
!634 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !620, file: !594, line: 54, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !597, file: !594, line: 96, baseType: !639, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !37, line: 610, size: 4224, elements: !641)
!641 = !{!642, !644, !645, !654, !661, !662, !809, !2850, !2851, !2852, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !3115, !3123, !3124, !3125, !3135, !3136, !3137, !3138}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !640, file: !37, line: 611, baseType: !643, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !96, line: 19, baseType: !144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !640, file: !37, line: 612, baseType: !144, size: 16, offset: 16)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !640, file: !37, line: 613, baseType: !646, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !647, line: 23, baseType: !648)
!647 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 21, size: 32, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !648, file: !647, line: 22, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !96, line: 32, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !653, line: 49, baseType: !7)
!653 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !640, file: !37, line: 614, baseType: !655, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !647, line: 28, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !647, line: 26, size: 32, elements: !657)
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !656, file: !647, line: 27, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !96, line: 33, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !653, line: 50, baseType: !7)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !640, file: !37, line: 615, baseType: !7, size: 32, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !640, file: !37, line: 622, baseType: !663, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !37, line: 1864, size: 1536, align: 512, elements: !666)
!666 = !{!667, !671, !681, !685, !691, !695, !699, !703, !707, !711, !715, !716, !722, !726, !750, !779, !789, !795, !800, !804, !805}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !665, file: !37, line: 1865, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!596, !639, !596, !7}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !665, file: !37, line: 1866, baseType: !672, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!114, !596, !639, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !677, line: 10, size: 128, elements: !678)
!677 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !676, file: !677, line: 11, baseType: !135, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !676, file: !677, line: 12, baseType: !97, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !665, file: !37, line: 1867, baseType: !682, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!127, !639, !127}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !665, file: !37, line: 1868, baseType: !686, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!689, !639, !127}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !37, line: 581, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !665, file: !37, line: 1870, baseType: !692, size: 64, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!127, !596, !133, !127}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !665, file: !37, line: 1872, baseType: !696, size: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{!127, !639, !596, !643, !304}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !665, file: !37, line: 1873, baseType: !700, size: 64, offset: 384)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!127, !596, !639, !596}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !665, file: !37, line: 1874, baseType: !704, size: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{!127, !639, !596}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !665, file: !37, line: 1875, baseType: !708, size: 64, offset: 512)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!127, !639, !596, !114}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !665, file: !37, line: 1876, baseType: !712, size: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!127, !639, !596, !643}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !665, file: !37, line: 1877, baseType: !704, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !665, file: !37, line: 1878, baseType: !717, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!127, !639, !596, !643, !720}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !96, line: 16, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !96, line: 13, baseType: !629)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !665, file: !37, line: 1879, baseType: !723, size: 64, offset: 768)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!127, !639, !596, !639, !596, !7}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !665, file: !37, line: 1881, baseType: !727, size: 64, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!127, !596, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !37, line: 219, size: 640, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !740, !747, !748, !749}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !731, file: !37, line: 220, baseType: !7, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !731, file: !37, line: 221, baseType: !643, size: 16, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !731, file: !37, line: 222, baseType: !646, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !731, file: !37, line: 223, baseType: !655, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !731, file: !37, line: 224, baseType: !738, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !96, line: 46, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !653, line: 88, baseType: !559)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !731, file: !37, line: 225, baseType: !741, size: 128, offset: 192)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !742, line: 13, size: 128, elements: !743)
!742 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!743 = !{!744, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !741, file: !742, line: 14, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !742, line: 8, baseType: !558)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !741, file: !742, line: 15, baseType: !105, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !731, file: !37, line: 226, baseType: !741, size: 128, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !731, file: !37, line: 227, baseType: !741, size: 128, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !731, file: !37, line: 234, baseType: !566, size: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !665, file: !37, line: 1882, baseType: !751, size: 64, offset: 896)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!127, !754, !756, !629, !7}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !758, line: 22, size: 1152, elements: !759)
!758 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!759 = !{!760, !761, !762, !763, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !757, file: !758, line: 23, baseType: !629, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !757, file: !758, line: 24, baseType: !643, size: 16, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !757, file: !758, line: 25, baseType: !7, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !757, file: !758, line: 26, baseType: !764, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 104, baseType: !629)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !757, file: !758, line: 27, baseType: !632, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !757, file: !758, line: 28, baseType: !632, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !757, file: !758, line: 37, baseType: !632, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !757, file: !758, line: 38, baseType: !720, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !757, file: !758, line: 39, baseType: !720, size: 32, offset: 352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !757, file: !758, line: 40, baseType: !646, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !757, file: !758, line: 41, baseType: !655, size: 32, offset: 416)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !757, file: !758, line: 42, baseType: !738, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !757, file: !758, line: 43, baseType: !741, size: 128, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !757, file: !758, line: 44, baseType: !741, size: 128, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !757, file: !758, line: 45, baseType: !741, size: 128, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !757, file: !758, line: 46, baseType: !741, size: 128, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !757, file: !758, line: 47, baseType: !632, size: 64, offset: 1024)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !757, file: !758, line: 48, baseType: !632, size: 64, offset: 1088)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !665, file: !37, line: 1883, baseType: !780, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !596, !133, !786}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !96, line: 60, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !653, line: 73, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !653, line: 15, baseType: !105)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 55, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !653, line: 72, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !653, line: 16, baseType: !99)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !665, file: !37, line: 1884, baseType: !790, size: 64, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!127, !639, !793, !632, !632}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !37, line: 50, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !665, file: !37, line: 1886, baseType: !796, size: 64, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!127, !639, !799, !127}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !665, file: !37, line: 1887, baseType: !801, size: 64, offset: 1152)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!127, !639, !596, !566, !7, !643}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !665, file: !37, line: 1890, baseType: !712, size: 64, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !665, file: !37, line: 1891, baseType: !806, size: 64, offset: 1280)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!127, !639, !689, !127}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !640, file: !37, line: 623, baseType: !810, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !37, line: 1416, size: 9472, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !867, !2458, !2540, !2623, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2639, !2643, !2644, !2647, !2648, !2651, !2652, !2653, !2694, !2720, !2721, !2722, !2723, !2724, !2725, !2728, !2730, !2737, !2738, !2740, !2741, !2742, !2801, !2802, !2817, !2818, !2819, !2820, !2821, !2824, !2825, !2826, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !811, file: !37, line: 1417, baseType: !279, size: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !811, file: !37, line: 1418, baseType: !720, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !811, file: !37, line: 1419, baseType: !152, size: 8, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !811, file: !37, line: 1420, baseType: !99, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !811, file: !37, line: 1421, baseType: !738, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !811, file: !37, line: 1422, baseType: !819, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !37, line: 2228, size: 576, elements: !821)
!821 = !{!822, !823, !824, !831, !835, !839, !843, !844, !845, !855, !858, !859, !860, !864, !865, !866}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !820, file: !37, line: 2229, baseType: !114, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !820, file: !37, line: 2230, baseType: !127, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !820, file: !37, line: 2238, baseType: !825, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!127, !828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !830, line: 28, flags: DIFlagFwdDecl)
!830 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!831 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !820, file: !37, line: 2239, baseType: !832, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !37, line: 70, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !820, file: !37, line: 2240, baseType: !836, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!596, !819, !127, !114, !97}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !820, file: !37, line: 2242, baseType: !840, size: 64, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !810}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !820, file: !37, line: 2243, baseType: !92, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !37, line: 2244, baseType: !819, size: 64, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !820, file: !37, line: 2245, baseType: !846, size: 64, offset: 512)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !96, line: 182, size: 64, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !846, file: !96, line: 183, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !96, line: 186, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !96, line: 187, baseType: !849, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !850, file: !96, line: 187, baseType: !854, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !820, file: !37, line: 2247, baseType: !856, offset: 576)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !857, line: 187, elements: !299)
!857 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!858 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !820, file: !37, line: 2248, baseType: !856, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !820, file: !37, line: 2249, baseType: !856, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !820, file: !37, line: 2250, baseType: !861, offset: 576)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 3)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !820, file: !37, line: 2252, baseType: !856, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !820, file: !37, line: 2253, baseType: !856, offset: 576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !820, file: !37, line: 2254, baseType: !856, offset: 576)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !811, file: !37, line: 1423, baseType: !868, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !37, line: 1935, size: 1472, elements: !871)
!871 = !{!872, !876, !880, !881, !885, !891, !895, !896, !897, !901, !905, !906, !907, !908, !914, !919, !920, !927, !928, !929, !930, !2442, !2457}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !870, file: !37, line: 1936, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!639, !810}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !870, file: !37, line: 1937, baseType: !877, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !639}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !870, file: !37, line: 1938, baseType: !877, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !870, file: !37, line: 1940, baseType: !882, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !639, !127}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !870, file: !37, line: 1941, baseType: !886, size: 64, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!127, !639, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !37, line: 289, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !870, file: !37, line: 1942, baseType: !892, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{!127, !639}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !870, file: !37, line: 1943, baseType: !877, size: 64, offset: 384)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !870, file: !37, line: 1944, baseType: !840, size: 64, offset: 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !870, file: !37, line: 1945, baseType: !898, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!127, !810, !127}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !870, file: !37, line: 1946, baseType: !902, size: 64, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!127, !810}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !870, file: !37, line: 1947, baseType: !902, size: 64, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !870, file: !37, line: 1948, baseType: !902, size: 64, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !870, file: !37, line: 1949, baseType: !902, size: 64, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !870, file: !37, line: 1950, baseType: !909, size: 64, offset: 832)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!127, !596, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !37, line: 57, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !870, file: !37, line: 1951, baseType: !915, size: 64, offset: 896)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!127, !810, !918, !133}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !870, file: !37, line: 1952, baseType: !840, size: 64, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !870, file: !37, line: 1954, baseType: !921, size: 64, offset: 1024)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!127, !924, !596}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !926, line: 539, flags: DIFlagFwdDecl)
!926 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!927 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !870, file: !37, line: 1955, baseType: !921, size: 64, offset: 1088)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !870, file: !37, line: 1956, baseType: !921, size: 64, offset: 1152)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !870, file: !37, line: 1957, baseType: !921, size: 64, offset: 1216)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !870, file: !37, line: 1963, baseType: !931, size: 64, offset: 1280)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!127, !810, !934, !95}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !936, line: 68, size: 512, align: 128, elements: !937)
!936 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!937 = !{!938, !939, !2434, !2441}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !935, file: !936, line: 69, baseType: !99, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, scope: !935, file: !936, line: 77, baseType: !940, size: 320, offset: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !935, file: !936, line: 77, size: 320, elements: !941)
!941 = !{!942, !1120, !1125, !1153, !1161, !1167, !2426, !2433}
!942 = !DIDerivedType(tag: DW_TAG_member, scope: !940, file: !936, line: 78, baseType: !943, size: 320)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !940, file: !936, line: 78, size: 320, elements: !944)
!944 = !{!945, !946, !1118, !1119}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !943, file: !936, line: 84, baseType: !279, size: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !943, file: !936, line: 86, baseType: !947, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !37, line: 451, size: 1216, align: 64, elements: !949)
!949 = !{!950, !951, !958, !959, !964, !979, !988, !989, !990, !991, !1111, !1112, !1115, !1116, !1117}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !948, file: !37, line: 452, baseType: !639, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !948, file: !37, line: 453, baseType: !952, size: 128, offset: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !953, line: 292, size: 128, elements: !954)
!953 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !952, file: !953, line: 293, baseType: !285)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !952, file: !953, line: 295, baseType: !95, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !952, file: !953, line: 296, baseType: !97, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !948, file: !37, line: 454, baseType: !95, size: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !948, file: !37, line: 455, baseType: !960, size: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !96, line: 168, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !96, line: 166, size: 32, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !961, file: !96, line: 167, baseType: !127, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !948, file: !37, line: 460, baseType: !965, size: 128, offset: 256)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !966, line: 125, size: 128, elements: !967)
!966 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!967 = !{!968, !978}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !965, file: !966, line: 126, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !966, line: 31, size: 64, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !969, file: !966, line: 32, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !966, line: 24, size: 192, align: 64, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !973, file: !966, line: 25, baseType: !99, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !973, file: !966, line: 26, baseType: !972, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !973, file: !966, line: 27, baseType: !972, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !965, file: !966, line: 127, baseType: !972, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !948, file: !37, line: 461, baseType: !980, size: 256, offset: 384)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !981, line: 35, size: 256, elements: !982)
!981 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!982 = !{!983, !984, !985, !987}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !980, file: !981, line: 36, baseType: !551, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !980, file: !981, line: 42, baseType: !551, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !980, file: !981, line: 46, baseType: !986, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !286, line: 29, baseType: !293)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !980, file: !981, line: 47, baseType: !279, size: 128, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !948, file: !37, line: 462, baseType: !99, size: 64, offset: 640)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !948, file: !37, line: 463, baseType: !99, size: 64, offset: 704)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !948, file: !37, line: 464, baseType: !99, size: 64, offset: 768)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !948, file: !37, line: 465, baseType: !992, size: 64, offset: 832)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !37, line: 367, size: 1408, elements: !995)
!995 = !{!996, !1000, !1004, !1008, !1012, !1016, !1022, !1028, !1032, !1037, !1041, !1045, !1049, !1075, !1079, !1085, !1086, !1087, !1091, !1096, !1100, !1107}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !994, file: !37, line: 368, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!127, !934, !889}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !994, file: !37, line: 369, baseType: !1001, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!127, !566, !934}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !994, file: !37, line: 372, baseType: !1005, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!127, !947, !889}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !994, file: !37, line: 375, baseType: !1009, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!127, !934}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !994, file: !37, line: 381, baseType: !1013, size: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!127, !566, !947, !282, !7}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !994, file: !37, line: 383, baseType: !1017, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !37, line: 290, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !994, file: !37, line: 385, baseType: !1023, size: 64, offset: 384)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!127, !566, !947, !738, !7, !7, !1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !994, file: !37, line: 388, baseType: !1029, size: 64, offset: 448)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!127, !566, !947, !738, !7, !7, !934, !97}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !994, file: !37, line: 393, baseType: !1033, size: 64, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1036, !947, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !96, line: 125, baseType: !632)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !994, file: !37, line: 394, baseType: !1038, size: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !934, !7, !7}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !994, file: !37, line: 395, baseType: !1042, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!127, !934, !95}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !994, file: !37, line: 396, baseType: !1046, size: 64, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !934}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !994, file: !37, line: 397, baseType: !1050, size: 64, offset: 768)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!783, !1053, !1073}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !37, line: 320, size: 384, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1062, !1063, !1064, !1065, !1066}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !1054, file: !37, line: 321, baseType: !566, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !1054, file: !37, line: 326, baseType: !738, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !1054, file: !37, line: 327, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{null, !1053, !105, !105}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1054, file: !37, line: 328, baseType: !97, size: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !1054, file: !37, line: 329, baseType: !127, size: 32, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !1054, file: !37, line: 330, baseType: !140, size: 16, offset: 288)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !1054, file: !37, line: 331, baseType: !140, size: 16, offset: 304)
!1066 = !DIDerivedType(tag: DW_TAG_member, scope: !1054, file: !37, line: 332, baseType: !1067, size: 64, offset: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1054, file: !37, line: 332, size: 64, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !1067, file: !37, line: 333, baseType: !7, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !1067, file: !37, line: 334, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !37, line: 334, flags: DIFlagFwdDecl)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !37, line: 64, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !994, file: !37, line: 402, baseType: !1076, size: 64, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!127, !947, !934, !934, !12}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !994, file: !37, line: 404, baseType: !1080, size: 64, offset: 896)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!304, !934, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !1084, line: 305, baseType: !7)
!1084 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
