; ModuleID = '../bcout/drivers/usb/image/mdc800.llvm.bc'
source_filename = "drivers/usb/image/mdc800.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_usb_mdc800_init6:\09\09\09"
module asm ".long\09usb_mdc800_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.usb_driver = type { i8*, i32 (%struct.usb_interface*, %struct.usb_device_id*)*, void (%struct.usb_interface*)*, i32 (%struct.usb_interface*, i32, i8*)*, i32 (%struct.usb_interface*, i32)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, %struct.usb_device_id*, %struct.attribute_group**, %struct.usb_dynids, %struct.usbdrv_wrap, i8 }
%struct.usb_interface = type { %struct.usb_host_interface*, %struct.usb_host_interface*, i32, %struct.usb_interface_assoc_descriptor*, i32, i32, i8, %struct.device, %struct.device*, %struct.work_struct }
%struct.usb_host_interface = type { %struct.usb_interface_descriptor, i32, i8*, %struct.usb_host_endpoint*, i8* }
%struct.usb_interface_descriptor = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.usb_host_endpoint = type <{ %struct.usb_endpoint_descriptor, %struct.usb_ss_ep_comp_descriptor, %struct.usb_ssp_isoc_ep_comp_descriptor, i8, %struct.list_head, i8*, %struct.ep_device*, i8*, i32, i32, i32, [4 x i8] }>

!67 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !69, line: 26, baseType: !7, size: 32, elements: !70)
!69 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !75, line: 44, baseType: !7, size: 32, elements: !76)
!75 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !81, line: 343, baseType: !7, size: 32, elements: !82)
!81 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!82 = !{!83, !84, !85, !86}
!83 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!84 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!85 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!86 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !88, line: 524, baseType: !7, size: 32, elements: !89)
!88 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!89 = !{!90, !91, !92, !93, !94}
!90 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!91 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!92 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!93 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!94 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !88, line: 502, baseType: !7, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100}
!97 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!99 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!100 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_interface_condition", file: !102, line: 96, baseType: !7, size: 32, elements: !103)
!102 = !DIFile(filename: "./include/linux/usb.h", directory: "/home/lizy2001/genbc/linux")
!103 = !{!104, !105, !106, !107}
!104 = !DIEnumerator(name: "USB_INTERFACE_UNBOUND", value: 0, isUnsigned: true)
!105 = !DIEnumerator(name: "USB_INTERFACE_BINDING", value: 1, isUnsigned: true)
!106 = !DIEnumerator(name: "USB_INTERFACE_BOUND", value: 2, isUnsigned: true)
!107 = !DIEnumerator(name: "USB_INTERFACE_UNBINDING", value: 3, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "usb_device_removable", file: !102, line: 476, baseType: !7, size: 32, elements: !109)
!109 = !{!110, !111, !112}
!110 = !DIEnumerator(name: "USB_DEVICE_REMOVABLE_UNKNOWN", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "USB_DEVICE_REMOVABLE", value: 1, isUnsigned: true)
!112 = !DIEnumerator(name: "USB_DEVICE_FIXED", value: 2, isUnsigned: true)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 118, baseType: !7, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DIEnumerator(name: "NOT_CONNECTED", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "READY", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "WORKING", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "DOWNLOAD", value: 3, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !120, line: 10, baseType: !7, size: 32, elements: !121)
!120 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!121 = !{!122, !123}
!122 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !125, line: 305, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!126 = !{!127, !128, !129, !130}
!127 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!131 = !{!132, !133, !700, !3829, !3830, !1094, !282, !137, !267, !140, !381, !586}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_device", file: !102, line: 631, size: 10624, elements: !135)
!135 = !{!136, !138, !143, !148, !149, !150, !151, !152, !155, !156, !160, !161, !3570, !3611, !3612, !3629, !3690, !3772, !3773, !3775, !3776, !3778, !3779, !3780, !3781, !3782, !3783, !3784, !3785, !3786, !3787, !3788, !3789, !3790, !3791, !3792, !3793, !3794, !3795, !3796, !3797, !3798, !3799, !3800, !3801, !3802, !3803, !3804, !3805, !3806, !3807, !3808, !3811, !3812, !3813, !3818, !3825, !3826, !3827, !3828}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "devnum", scope: !134, file: !102, line: 632, baseType: !137, size: 32)
!137 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "devpath", scope: !134, file: !102, line: 633, baseType: !139, size: 128, offset: 32)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 128, elements: !141)
!140 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!141 = !{!142}
!142 = !DISubrange(count: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "route", scope: !134, file: !102, line: 634, baseType: !144, size: 32, offset: 160)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !145, line: 21, baseType: !146)
!145 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !147, line: 27, baseType: !7)
!147 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !134, file: !102, line: 635, baseType: !5, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !134, file: !102, line: 636, baseType: !18, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rx_lanes", scope: !134, file: !102, line: 637, baseType: !7, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tx_lanes", scope: !134, file: !102, line: 638, baseType: !7, size: 32, offset: 288)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !134, file: !102, line: 640, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "usb_tt", file: !102, line: 474, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ttport", scope: !134, file: !102, line: 641, baseType: !137, size: 32, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "toggle", scope: !134, file: !102, line: 643, baseType: !157, size: 64, offset: 416)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !134, file: !102, line: 645, baseType: !133, size: 64, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !134, file: !102, line: 646, baseType: !162, size: 64, offset: 576)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "usb_bus", file: !102, line: 424, size: 960, elements: !164)
!164 = !{!165, !3547, !3548, !3549, !3550, !3551, !3552, !3553, !3554, !3555, !3556, !3557, !3558, !3559, !3564, !3565, !3566, !3567, !3568, !3569}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "controller", scope: !163, file: !102, line: 425, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !81, line: 461, size: 5568, elements: !168)
!168 = !{!169, !3188, !3189, !3192, !3193, !3244, !3335, !3336, !3337, !3338, !3339, !3348, !3453, !3466, !3469, !3470, !3474, !3476, !3477, !3478, !3482, !3488, !3489, !3492, !3496, !3499, !3500, !3501, !3502, !3503, !3535, !3536, !3537, !3540, !3543, !3544, !3545, !3546}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !167, file: !81, line: 462, baseType: !170, size: 512)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !171, line: 64, size: 512, elements: !172)
!171 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!172 = !{!173, !176, !183, !185, !245, !3038, !3178, !3183, !3184, !3185, !3186, !3187}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !171, line: 65, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !170, file: !171, line: 66, baseType: !177, size: 128, offset: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !178, line: 178, size: 128, elements: !179)
!178 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !178, line: 179, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !177, file: !178, line: 179, baseType: !181, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !170, file: !171, line: 67, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !170, file: !171, line: 68, baseType: !186, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !171, line: 192, size: 704, elements: !188)
!188 = !{!189, !190, !206, !207}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !187, file: !171, line: 193, baseType: !177, size: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !187, file: !171, line: 194, baseType: !191, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !192, line: 83, baseType: !193)
!192 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !192, line: 71, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !193, file: !192, line: 72, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !193, file: !192, line: 72, elements: !197)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !196, file: !192, line: 73, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !192, line: 20, elements: !200)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !199, file: !192, line: 21, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !203, line: 25, baseType: !204)
!203 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 25, elements: !205)
!205 = !{}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !187, file: !171, line: 195, baseType: !170, size: 512, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !187, file: !171, line: 196, baseType: !208, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !171, line: 156, size: 192, elements: !211)
!211 = !{!212, !217, !222}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !210, file: !171, line: 157, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!137, !186, !184}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !171, line: 158, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!174, !186, !184}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !210, file: !171, line: 159, baseType: !223, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!137, !186, !184, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !171, line: 148, size: 20736, elements: !229)
!229 = !{!230, !235, !239, !240, !244}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !228, file: !171, line: 149, baseType: !231, size: 192)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 192, elements: !233)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!233 = !{!234}
!234 = !DISubrange(count: 3)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !228, file: !171, line: 150, baseType: !236, size: 4096, offset: 192)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 4096, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !228, file: !171, line: 151, baseType: !137, size: 32, offset: 4288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !228, file: !171, line: 152, baseType: !241, size: 16384, offset: 4320)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 16384, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 2048)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !228, file: !171, line: 153, baseType: !137, size: 32, offset: 20704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !170, file: !171, line: 69, baseType: !246, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !171, line: 138, size: 448, elements: !248)
!248 = !{!249, !253, !283, !285, !2998, !3028, !3032}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !247, file: !171, line: 139, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !184}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !247, file: !171, line: 140, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !257, line: 230, size: 128, elements: !258)
!257 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!258 = !{!259, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !256, file: !257, line: 231, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !184, !268, !232}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !178, line: 60, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !265, line: 73, baseType: !266)
!265 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !265, line: 15, baseType: !267)
!267 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !257, line: 30, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !257, line: 31, baseType: !174, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !269, file: !257, line: 32, baseType: !273, size: 16, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !178, line: 19, baseType: !274)
!274 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !256, file: !257, line: 232, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!263, !184, !268, !174, !279}
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !178, line: 55, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !265, line: 72, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !265, line: 16, baseType: !282)
!282 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !247, file: !171, line: 141, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !247, file: !171, line: 142, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !257, line: 84, size: 320, elements: !290)
!290 = !{!291, !292, !296, !2995, !2996}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !257, line: 85, baseType: !174, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !289, file: !257, line: 86, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!273, !184, !268, !137}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !289, file: !257, line: 88, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!273, !184, !300, !137}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !257, line: 168, size: 448, elements: !302)
!302 = !{!303, !304, !305, !306, !2990, !2991}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !301, file: !257, line: 169, baseType: !269, size: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !301, file: !257, line: 170, baseType: !279, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !301, file: !257, line: 171, baseType: !132, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !301, file: !257, line: 172, baseType: !307, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!263, !310, !184, !300, !232, !485, !279}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !52, line: 916, size: 1856, align: 32, elements: !312)
!312 = !{!313, !331, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2973, !2974, !2983, !2984, !2985, !2986, !2987, !2988, !2989}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !311, file: !52, line: 920, baseType: !314, size: 128)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !311, file: !52, line: 917, size: 128, elements: !315)
!315 = !{!316, !322}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !314, file: !52, line: 918, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !318, line: 58, size: 64, elements: !319)
!318 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !318, line: 59, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !314, file: !52, line: 919, baseType: !323, size: 128, align: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !178, line: 216, size: 128, align: 64, elements: !324)
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !178, line: 217, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !323, file: !178, line: 218, baseType: !328, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !326}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !311, file: !52, line: 921, baseType: !332, size: 128, offset: 128)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !333, line: 8, size: 128, elements: !334)
!333 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!334 = !{!335, !339}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !332, file: !333, line: 9, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !338, line: 18, flags: DIFlagFwdDecl)
!338 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !332, file: !333, line: 10, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !338, line: 89, size: 1536, elements: !342)
!342 = !{!343, !344, !354, !362, !363, !382, !2924, !2926, !2938, !2939, !2940, !2941, !2942, !2947, !2948, !2949}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !341, file: !338, line: 91, baseType: !7, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !341, file: !338, line: 92, baseType: !345, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !346, line: 277, baseType: !347)
!346 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !346, line: 277, size: 32, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !347, file: !346, line: 277, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !346, line: 70, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !346, line: 65, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !351, file: !346, line: 66, baseType: !7, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !341, file: !338, line: 93, baseType: !355, size: 128, offset: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !356, line: 38, size: 128, elements: !357)
!356 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !356, line: 39, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !355, file: !356, line: 39, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !341, file: !338, line: 94, baseType: !340, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !341, file: !338, line: 95, baseType: !364, size: 128, offset: 256)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !338, line: 47, size: 128, elements: !365)
!365 = !{!366, !378}
!366 = !DIDerivedType(tag: DW_TAG_member, scope: !364, file: !338, line: 48, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !364, file: !338, line: 48, size: 64, elements: !368)
!368 = !{!369, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !367, file: !338, line: 49, baseType: !370, size: 64)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !338, line: 49, size: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !370, file: !338, line: 50, baseType: !144, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !370, file: !338, line: 50, baseType: !144, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !367, file: !338, line: 52, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !145, line: 23, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !147, line: 31, baseType: !377)
!377 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !364, file: !338, line: 54, baseType: !379, size: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!381 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !341, file: !338, line: 96, baseType: !383, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !52, line: 610, size: 4224, elements: !385)
!385 = !{!386, !387, !388, !396, !403, !404, !552, !2626, !2627, !2628, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2900, !2908, !2909, !2910, !2920, !2921, !2922, !2923}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !384, file: !52, line: 611, baseType: !273, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !384, file: !52, line: 612, baseType: !274, size: 16, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !384, file: !52, line: 613, baseType: !389, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !390, line: 23, baseType: !391)
!390 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 21, size: 32, elements: !392)
!392 = !{!393}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !391, file: !390, line: 22, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !178, line: 32, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !265, line: 49, baseType: !7)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !384, file: !52, line: 614, baseType: !397, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !390, line: 28, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !390, line: 26, size: 32, elements: !399)
!399 = !{!400}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !398, file: !390, line: 27, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !178, line: 33, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !265, line: 50, baseType: !7)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !384, file: !52, line: 615, baseType: !7, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !384, file: !52, line: 622, baseType: !405, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !52, line: 1864, size: 1536, align: 512, elements: !408)
!408 = !{!409, !413, !426, !430, !436, !440, !446, !450, !454, !458, !462, !463, !469, !473, !499, !528, !532, !538, !543, !547, !548}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !407, file: !52, line: 1865, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DISubroutineType(types: !412)
!412 = !{!340, !383, !340, !7}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !407, file: !52, line: 1866, baseType: !414, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!174, !340, !383, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !419, line: 10, size: 128, elements: !420)
!419 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!420 = !{!421, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !418, file: !419, line: 11, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !132}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !418, file: !419, line: 12, baseType: !132, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !407, file: !52, line: 1867, baseType: !427, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!137, !383, !137}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !407, file: !52, line: 1868, baseType: !431, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!434, !383, !137}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !52, line: 581, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !407, file: !52, line: 1870, baseType: !437, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!137, !340, !232, !137}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !407, file: !52, line: 1872, baseType: !441, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!137, !383, !340, !273, !444}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !178, line: 30, baseType: !445)
!445 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !407, file: !52, line: 1873, baseType: !447, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!137, !340, !383, !340}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !407, file: !52, line: 1874, baseType: !451, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!137, !383, !340}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !407, file: !52, line: 1875, baseType: !455, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!137, !383, !340, !174}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !407, file: !52, line: 1876, baseType: !459, size: 64, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!137, !383, !340, !273}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !407, file: !52, line: 1877, baseType: !451, size: 64, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !407, file: !52, line: 1878, baseType: !464, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DISubroutineType(types: !466)
!466 = !{!137, !383, !340, !273, !467}
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !178, line: 16, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !178, line: 13, baseType: !144)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !407, file: !52, line: 1879, baseType: !470, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!137, !383, !340, !383, !340, !7}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !407, file: !52, line: 1881, baseType: !474, size: 64, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!137, !340, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !52, line: 219, size: 640, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !488, !496, !497, !498}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !478, file: !52, line: 220, baseType: !7, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !478, file: !52, line: 221, baseType: !273, size: 16, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !478, file: !52, line: 222, baseType: !389, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !478, file: !52, line: 223, baseType: !397, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !478, file: !52, line: 224, baseType: !485, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !178, line: 46, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !265, line: 88, baseType: !487)
!487 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !478, file: !52, line: 225, baseType: !489, size: 128, offset: 192)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !490, line: 13, size: 128, elements: !491)
!490 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!491 = !{!492, !495}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !489, file: !490, line: 14, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !490, line: 8, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !147, line: 30, baseType: !487)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !489, file: !490, line: 15, baseType: !267, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !478, file: !52, line: 226, baseType: !489, size: 128, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !478, file: !52, line: 227, baseType: !489, size: 128, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !478, file: !52, line: 234, baseType: !310, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !407, file: !52, line: 1882, baseType: !500, size: 64, offset: 896)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!137, !503, !505, !144, !7}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !507, line: 22, size: 1152, elements: !508)
!507 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!508 = !{!509, !510, !511, !512, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !506, file: !507, line: 23, baseType: !144, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !506, file: !507, line: 24, baseType: !273, size: 16, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !506, file: !507, line: 25, baseType: !7, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !506, file: !507, line: 26, baseType: !513, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !178, line: 104, baseType: !144)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !506, file: !507, line: 27, baseType: !375, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !506, file: !507, line: 28, baseType: !375, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !506, file: !507, line: 37, baseType: !375, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !506, file: !507, line: 38, baseType: !467, size: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !506, file: !507, line: 39, baseType: !467, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !506, file: !507, line: 40, baseType: !389, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !506, file: !507, line: 41, baseType: !397, size: 32, offset: 416)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !507, line: 42, baseType: !485, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !506, file: !507, line: 43, baseType: !489, size: 128, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !506, file: !507, line: 44, baseType: !489, size: 128, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !506, file: !507, line: 45, baseType: !489, size: 128, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !506, file: !507, line: 46, baseType: !489, size: 128, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !506, file: !507, line: 47, baseType: !375, size: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !506, file: !507, line: 48, baseType: !375, size: 64, offset: 1088)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !407, file: !52, line: 1883, baseType: !529, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{!263, !340, !232, !279}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !407, file: !52, line: 1884, baseType: !533, size: 64, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!137, !383, !536, !375, !375}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !52, line: 50, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !407, file: !52, line: 1886, baseType: !539, size: 64, offset: 1088)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!137, !383, !542, !137}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !407, file: !52, line: 1887, baseType: !544, size: 64, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!137, !383, !340, !310, !7, !273}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !407, file: !52, line: 1890, baseType: !459, size: 64, offset: 1216)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !407, file: !52, line: 1891, baseType: !549, size: 64, offset: 1280)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!137, !383, !434, !137}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !384, file: !52, line: 623, baseType: !553, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !52, line: 1416, size: 9472, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !610, !2233, !2315, !2398, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2414, !2418, !2419, !2422, !2423, !2426, !2427, !2428, !2469, !2496, !2497, !2498, !2499, !2500, !2501, !2504, !2506, !2513, !2514, !2516, !2517, !2518, !2577, !2578, !2593, !2594, !2595, !2596, !2597, !2600, !2601, !2602, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !554, file: !52, line: 1417, baseType: !177, size: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !554, file: !52, line: 1418, baseType: !467, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !554, file: !52, line: 1419, baseType: !381, size: 8, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !554, file: !52, line: 1420, baseType: !282, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !554, file: !52, line: 1421, baseType: !485, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !554, file: !52, line: 1422, baseType: !562, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !52, line: 2228, size: 576, elements: !564)
!564 = !{!565, !566, !567, !573, !577, !581, !585, !589, !590, !600, !603, !604, !605, !607, !608, !609}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !52, line: 2229, baseType: !174, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !563, file: !52, line: 2230, baseType: !137, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !563, file: !52, line: 2238, baseType: !568, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DISubroutineType(types: !570)
!570 = !{!137, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !52, line: 69, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !563, file: !52, line: 2239, baseType: !574, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !52, line: 70, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !563, file: !52, line: 2240, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!340, !562, !137, !174, !132}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !563, file: !52, line: 2242, baseType: !582, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !553}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !563, file: !52, line: 2243, baseType: !586, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !588, line: 76, flags: DIFlagFwdDecl)
!588 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !563, file: !52, line: 2244, baseType: !562, size: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !563, file: !52, line: 2245, baseType: !591, size: 64, offset: 512)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !178, line: 182, size: 64, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !591, file: !178, line: 183, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !178, line: 186, size: 128, elements: !596)
!596 = !{!597, !598}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !178, line: 187, baseType: !594, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !595, file: !178, line: 187, baseType: !599, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !563, file: !52, line: 2247, baseType: !601, offset: 576)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !602, line: 187, elements: !205)
!602 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!603 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !563, file: !52, line: 2248, baseType: !601, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !563, file: !52, line: 2249, baseType: !601, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !563, file: !52, line: 2250, baseType: !606, offset: 576)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, elements: !233)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !563, file: !52, line: 2252, baseType: !601, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !563, file: !52, line: 2253, baseType: !601, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !563, file: !52, line: 2254, baseType: !601, offset: 576)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !554, file: !52, line: 1423, baseType: !611, size: 64, offset: 384)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !52, line: 1935, size: 1472, elements: !614)
!614 = !{!615, !619, !623, !624, !628, !634, !638, !639, !640, !644, !648, !649, !650, !651, !657, !662, !663, !670, !671, !672, !673, !2217, !2232}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !613, file: !52, line: 1936, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!383, !553}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !613, file: !52, line: 1937, baseType: !620, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !383}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !613, file: !52, line: 1938, baseType: !620, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !613, file: !52, line: 1940, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !383, !137}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !613, file: !52, line: 1941, baseType: !629, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{!137, !383, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !52, line: 289, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !613, file: !52, line: 1942, baseType: !635, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!137, !383}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !613, file: !52, line: 1943, baseType: !620, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !613, file: !52, line: 1944, baseType: !582, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !613, file: !52, line: 1945, baseType: !641, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!137, !553, !137}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !613, file: !52, line: 1946, baseType: !645, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!137, !553}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !613, file: !52, line: 1947, baseType: !645, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !613, file: !52, line: 1948, baseType: !645, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !613, file: !52, line: 1949, baseType: !645, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !613, file: !52, line: 1950, baseType: !652, size: 64, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!137, !340, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !52, line: 57, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !613, file: !52, line: 1951, baseType: !658, size: 64, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!137, !553, !661, !232}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !613, file: !52, line: 1952, baseType: !582, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !613, file: !52, line: 1954, baseType: !664, size: 64, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!137, !667, !340}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !669, line: 539, flags: DIFlagFwdDecl)
!669 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!670 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !613, file: !52, line: 1955, baseType: !664, size: 64, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !613, file: !52, line: 1956, baseType: !664, size: 64, offset: 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !613, file: !52, line: 1957, baseType: !664, size: 64, offset: 1216)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !613, file: !52, line: 1963, baseType: !674, size: 64, offset: 1280)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{!137, !553, !677, !700}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !679, line: 68, size: 512, align: 128, elements: !680)
!679 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!680 = !{!681, !682, !2209, !2216}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !679, line: 69, baseType: !282, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !678, file: !679, line: 77, baseType: !683, size: 320, offset: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !679, line: 77, size: 320, elements: !684)
!684 = !{!685, !873, !878, !907, !915, !921, !2201, !2208}
!685 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !679, line: 78, baseType: !686, size: 320)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !679, line: 78, size: 320, elements: !687)
!687 = !{!688, !689, !871, !872}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !686, file: !679, line: 84, baseType: !177, size: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !686, file: !679, line: 86, baseType: !690, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !52, line: 451, size: 1216, align: 64, elements: !692)
!692 = !{!693, !694, !702, !703, !708, !723, !739, !740, !741, !742, !864, !865, !868, !869, !870}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !691, file: !52, line: 452, baseType: !383, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !691, file: !52, line: 453, baseType: !695, size: 128, offset: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !696, line: 292, size: 128, elements: !697)
!696 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!697 = !{!698, !699, !701}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !695, file: !696, line: 293, baseType: !191)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !695, file: !696, line: 295, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !178, line: 148, baseType: !7)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !695, file: !696, line: 296, baseType: !132, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !691, file: !52, line: 454, baseType: !700, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !691, file: !52, line: 455, baseType: !704, size: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !178, line: 168, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 166, size: 32, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !705, file: !178, line: 167, baseType: !137, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !691, file: !52, line: 460, baseType: !709, size: 128, offset: 256)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !710, line: 125, size: 128, elements: !711)
!710 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!711 = !{!712, !722}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !709, file: !710, line: 126, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !710, line: 31, size: 64, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !713, file: !710, line: 32, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !710, line: 24, size: 192, align: 64, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !717, file: !710, line: 25, baseType: !282, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !717, file: !710, line: 26, baseType: !716, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !717, file: !710, line: 27, baseType: !716, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !709, file: !710, line: 127, baseType: !716, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !691, file: !52, line: 461, baseType: !724, size: 256, offset: 384)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !725, line: 35, size: 256, elements: !726)
!725 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!726 = !{!727, !735, !736, !738}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !724, file: !725, line: 36, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !729, line: 13, baseType: !730)
!729 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !178, line: 175, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 173, size: 64, elements: !732)
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !731, file: !178, line: 174, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !145, line: 22, baseType: !494)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !724, file: !725, line: 42, baseType: !728, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !724, file: !725, line: 46, baseType: !737, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !192, line: 29, baseType: !199)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !724, file: !725, line: 47, baseType: !177, size: 128, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !691, file: !52, line: 462, baseType: !282, size: 64, offset: 640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !691, file: !52, line: 463, baseType: !282, size: 64, offset: 704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !691, file: !52, line: 464, baseType: !282, size: 64, offset: 768)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !691, file: !52, line: 465, baseType: !743, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !52, line: 367, size: 1408, elements: !746)
!746 = !{!747, !751, !755, !759, !763, !767, !773, !779, !783, !788, !792, !796, !800, !828, !832, !838, !839, !840, !844, !849, !853, !860}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !745, file: !52, line: 368, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!137, !677, !632}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !745, file: !52, line: 369, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!137, !310, !677}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !745, file: !52, line: 372, baseType: !756, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!137, !690, !632}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !745, file: !52, line: 375, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!137, !677}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !745, file: !52, line: 381, baseType: !764, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!137, !310, !690, !181, !7}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !745, file: !52, line: 383, baseType: !768, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !771}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !52, line: 290, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !745, file: !52, line: 385, baseType: !774, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{!137, !310, !690, !485, !7, !7, !777, !778}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !745, file: !52, line: 388, baseType: !780, size: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!137, !310, !690, !485, !7, !7, !677, !132}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !745, file: !52, line: 393, baseType: !784, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!787, !690, !787}
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !178, line: 125, baseType: !375)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !745, file: !52, line: 394, baseType: !789, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !677, !7, !7}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !745, file: !52, line: 395, baseType: !793, size: 64, offset: 640)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!137, !677, !700}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !745, file: !52, line: 396, baseType: !797, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !677}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !745, file: !52, line: 397, baseType: !801, size: 64, offset: 768)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!263, !804, !826}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !52, line: 320, size: 384, elements: !806)
!806 = !{!807, !808, !809, !813, !814, !815, !818, !819}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !805, file: !52, line: 321, baseType: !310, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !805, file: !52, line: 326, baseType: !485, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !805, file: !52, line: 327, baseType: !810, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DISubroutineType(types: !812)
!812 = !{null, !804, !267, !267}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !805, file: !52, line: 328, baseType: !132, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !805, file: !52, line: 329, baseType: !137, size: 32, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !805, file: !52, line: 330, baseType: !816, size: 16, offset: 288)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !145, line: 19, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !147, line: 24, baseType: !274)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !805, file: !52, line: 331, baseType: !816, size: 16, offset: 304)
!819 = !DIDerivedType(tag: DW_TAG_member, scope: !805, file: !52, line: 332, baseType: !820, size: 64, offset: 320)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !805, file: !52, line: 332, size: 64, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !820, file: !52, line: 333, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !820, file: !52, line: 334, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !52, line: 334, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !52, line: 64, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "migratepage", scope: !745, file: !52, line: 402, baseType: !829, size: 64, offset: 832)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!137, !690, !677, !677, !27}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "isolate_page", scope: !745, file: !52, line: 404, baseType: !833, size: 64, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!444, !677, !836}
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "isolate_mode_t", file: !837, line: 305, baseType: !7)
!837 = !DIFile(filename: "./include/linux/mmzone.h", directory: "/home/lizy2001/genbc/linux")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "putback_page", scope: !745, file: !52, line: 405, baseType: !797, size: 64, offset: 960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "launder_page", scope: !745, file: !52, line: 406, baseType: !760, size: 64, offset: 1024)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "is_partially_uptodate", scope: !745, file: !52, line: 407, baseType: !841, size: 64, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!137, !677, !282, !282}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "is_dirty_writeback", scope: !745, file: !52, line: 409, baseType: !845, size: 64, offset: 1152)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !677, !848, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "error_remove_page", scope: !745, file: !52, line: 410, baseType: !850, size: 64, offset: 1216)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!137, !690, !677}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "swap_activate", scope: !745, file: !52, line: 413, baseType: !854, size: 64, offset: 1280)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!137, !857, !310, !859}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "swap_info_struct", file: !52, line: 61, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "swap_deactivate", scope: !745, file: !52, line: 415, baseType: !861, size: 64, offset: 1344)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !310}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !52, line: 466, baseType: !282, size: 64, offset: 896)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "wb_err", scope: !691, file: !52, line: 467, baseType: !866, size: 32, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "errseq_t", file: !867, line: 8, baseType: !144)
!867 = !DIFile(filename: "./include/linux/errseq.h", directory: "/home/lizy2001/genbc/linux")
!868 = !DIDerivedType(tag: DW_TAG_member, name: "private_lock", scope: !691, file: !52, line: 468, baseType: !191, offset: 992)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "private_list", scope: !691, file: !52, line: 469, baseType: !177, size: 128, offset: 1024)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "private_data", scope: !691, file: !52, line: 470, baseType: !132, size: 64, offset: 1152)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !686, file: !679, line: 87, baseType: !282, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !686, file: !679, line: 94, baseType: !282, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !679, line: 96, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !679, line: 96, size: 64, elements: !875)
!875 = !{!876}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dma_addr", scope: !874, file: !679, line: 101, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !178, line: 143, baseType: !375)
!878 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !679, line: 103, baseType: !879, size: 320)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !679, line: 103, size: 320, elements: !880)
!880 = !{!881, !891, !895, !896}
!881 = !DIDerivedType(tag: DW_TAG_member, scope: !879, file: !679, line: 104, baseType: !882, size: 128)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !879, file: !679, line: 104, size: 128, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "slab_list", scope: !882, file: !679, line: 105, baseType: !177, size: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, scope: !882, file: !679, line: 106, baseType: !886, size: 128)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !882, file: !679, line: 106, size: 128, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !886, file: !679, line: 107, baseType: !677, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pages", scope: !886, file: !679, line: 109, baseType: !137, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pobjects", scope: !886, file: !679, line: 110, baseType: !137, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "slab_cache", scope: !879, file: !679, line: 117, baseType: !892, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !894, line: 323, flags: DIFlagFwdDecl)
!894 = !DIFile(filename: "./include/linux/signal.h", directory: "/home/lizy2001/genbc/linux")
!895 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !879, file: !679, line: 119, baseType: !132, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, scope: !879, file: !679, line: 120, baseType: !897, size: 64, offset: 256)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !879, file: !679, line: 120, size: 64, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "s_mem", scope: !897, file: !679, line: 121, baseType: !132, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !897, file: !679, line: 122, baseType: !282, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, scope: !897, file: !679, line: 123, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !897, file: !679, line: 123, size: 32, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "inuse", scope: !902, file: !679, line: 124, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !902, file: !679, line: 125, baseType: !7, size: 15, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !902, file: !679, line: 126, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !679, line: 130, baseType: !908, size: 192)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !679, line: 130, size: 192, elements: !909)
!909 = !{!910, !911, !912, !913, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "compound_head", scope: !908, file: !679, line: 131, baseType: !282, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "compound_dtor", scope: !908, file: !679, line: 134, baseType: !381, size: 8, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "compound_order", scope: !908, file: !679, line: 135, baseType: !381, size: 8, offset: 72)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "compound_mapcount", scope: !908, file: !679, line: 136, baseType: !704, size: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "compound_nr", scope: !908, file: !679, line: 137, baseType: !7, size: 32, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !679, line: 139, baseType: !916, size: 256)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !679, line: 139, size: 256, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_compound_pad_1", scope: !916, file: !679, line: 140, baseType: !282, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "hpage_pinned_refcount", scope: !916, file: !679, line: 141, baseType: !704, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_list", scope: !916, file: !679, line: 143, baseType: !177, size: 128, offset: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !679, line: 145, baseType: !922, size: 256)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !679, line: 145, size: 256, elements: !923)
!923 = !{!924, !925, !927, !928, !2200}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_pt_pad_1", scope: !922, file: !679, line: 146, baseType: !282, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pmd_huge_pte", scope: !922, file: !679, line: 147, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgtable_t", file: !669, line: 509, baseType: !677)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_pt_pad_2", scope: !922, file: !679, line: 148, baseType: !282, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, scope: !922, file: !679, line: 149, baseType: !929, size: 64, offset: 192)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !922, file: !679, line: 149, size: 64, elements: !930)
!930 = !{!931, !2199}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pt_mm", scope: !929, file: !679, line: 150, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !679, line: 388, size: 7296, elements: !934)
!934 = !{!935, !2195}
!935 = !DIDerivedType(tag: DW_TAG_member, scope: !933, file: !679, line: 389, baseType: !936, size: 7296)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !679, line: 389, size: 7296, elements: !937)
!937 = !{!938, !976, !977, !978, !982, !983, !984, !985, !986, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1027, !1035, !1038, !1084, !1085, !2179, !2180, !2183, !2184, !2185, !2188, !2189, !2190, !2193, !2194}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !936, file: !679, line: 390, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !679, line: 305, size: 1472, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !956, !957, !962, !963, !966, !970, !971, !972, !973, !974}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !940, file: !679, line: 308, baseType: !282, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !940, file: !679, line: 309, baseType: !282, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !940, file: !679, line: 313, baseType: !939, size: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !940, file: !679, line: 313, baseType: !939, size: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !940, file: !679, line: 315, baseType: !717, size: 192, align: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !940, file: !679, line: 323, baseType: !282, size: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !940, file: !679, line: 327, baseType: !932, size: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !940, file: !679, line: 333, baseType: !950, size: 64, offset: 576)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !669, line: 284, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !669, line: 284, size: 64, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !951, file: !669, line: 284, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !955, line: 19, baseType: !282)
!955 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !940, file: !679, line: 334, baseType: !282, size: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !940, file: !679, line: 343, baseType: !958, size: 256, offset: 704)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !940, file: !679, line: 340, size: 256, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !958, file: !679, line: 341, baseType: !717, size: 192, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !958, file: !679, line: 342, baseType: !282, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !940, file: !679, line: 351, baseType: !177, size: 128, offset: 960)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !940, file: !679, line: 353, baseType: !964, size: 64, offset: 1088)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !679, line: 353, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !940, file: !679, line: 356, baseType: !967, size: 64, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !679, line: 356, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !940, file: !679, line: 359, baseType: !282, size: 64, offset: 1216)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !940, file: !679, line: 361, baseType: !310, size: 64, offset: 1280)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !940, file: !679, line: 362, baseType: !132, size: 64, offset: 1344)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !940, file: !679, line: 365, baseType: !728, size: 64, offset: 1408)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !940, file: !679, line: 373, baseType: !975, offset: 1472)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !679, line: 296, elements: !205)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !936, file: !679, line: 391, baseType: !713, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !936, file: !679, line: 392, baseType: !375, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !936, file: !679, line: 394, baseType: !979, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!282, !310, !282, !282, !282, !282}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !936, file: !679, line: 398, baseType: !282, size: 64, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !936, file: !679, line: 399, baseType: !282, size: 64, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !936, file: !679, line: 405, baseType: !282, size: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !936, file: !679, line: 406, baseType: !282, size: 64, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !936, file: !679, line: 407, baseType: !987, size: 64, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !669, line: 286, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 286, size: 64, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !989, file: !669, line: 286, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !955, line: 18, baseType: !282)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !936, file: !679, line: 416, baseType: !704, size: 32, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !936, file: !679, line: 428, baseType: !704, size: 32, offset: 608)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !936, file: !679, line: 437, baseType: !704, size: 32, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !936, file: !679, line: 447, baseType: !704, size: 32, offset: 672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !936, file: !679, line: 450, baseType: !728, size: 64, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !936, file: !679, line: 452, baseType: !137, size: 32, offset: 768)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !936, file: !679, line: 454, baseType: !191, offset: 800)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !936, file: !679, line: 457, baseType: !724, size: 256, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !936, file: !679, line: 459, baseType: !177, size: 128, offset: 1088)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !936, file: !679, line: 466, baseType: !282, size: 64, offset: 1216)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !936, file: !679, line: 467, baseType: !282, size: 64, offset: 1280)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !936, file: !679, line: 469, baseType: !282, size: 64, offset: 1344)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !936, file: !679, line: 470, baseType: !282, size: 64, offset: 1408)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !936, file: !679, line: 471, baseType: !730, size: 64, offset: 1472)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !936, file: !679, line: 472, baseType: !282, size: 64, offset: 1536)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !936, file: !679, line: 473, baseType: !282, size: 64, offset: 1600)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !936, file: !679, line: 474, baseType: !282, size: 64, offset: 1664)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !936, file: !679, line: 475, baseType: !282, size: 64, offset: 1728)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !936, file: !679, line: 477, baseType: !191, offset: 1792)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !936, file: !679, line: 478, baseType: !282, size: 64, offset: 1792)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !936, file: !679, line: 478, baseType: !282, size: 64, offset: 1856)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !936, file: !679, line: 478, baseType: !282, size: 64, offset: 1920)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !936, file: !679, line: 478, baseType: !282, size: 64, offset: 1984)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !936, file: !679, line: 479, baseType: !282, size: 64, offset: 2048)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !936, file: !679, line: 479, baseType: !282, size: 64, offset: 2112)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !936, file: !679, line: 479, baseType: !282, size: 64, offset: 2176)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !936, file: !679, line: 480, baseType: !282, size: 64, offset: 2240)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !936, file: !679, line: 480, baseType: !282, size: 64, offset: 2304)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !936, file: !679, line: 480, baseType: !282, size: 64, offset: 2368)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !936, file: !679, line: 480, baseType: !282, size: 64, offset: 2432)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !936, file: !679, line: 482, baseType: !1024, size: 2816, offset: 2496)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 2816, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 44)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !936, file: !679, line: 488, baseType: !1028, size: 256, offset: 5312)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !1029, line: 60, size: 256, elements: !1030)
!1029 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1028, file: !1029, line: 61, baseType: !1032, size: 256)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 256, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 4)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !936, file: !679, line: 490, baseType: !1036, size: 64, offset: 5568)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !679, line: 490, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !936, file: !679, line: 493, baseType: !1039, size: 896, offset: 5632)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !1040, line: 53, baseType: !1041)
!1040 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1040, line: 13, size: 896, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1049, !1050, !1057, !1058, !1078, !1079, !1080}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !1041, file: !1040, line: 18, baseType: !375, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !1041, file: !1040, line: 28, baseType: !730, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !1041, file: !1040, line: 31, baseType: !724, size: 256, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !1041, file: !1040, line: 32, baseType: !1047, size: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !1040, line: 32, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !1041, file: !1040, line: 37, baseType: !274, size: 16, offset: 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1041, file: !1040, line: 40, baseType: !1051, size: 192, offset: 512)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !1052, line: 53, size: 192, elements: !1053)
!1052 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1051, file: !1052, line: 54, baseType: !728, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1051, file: !1052, line: 55, baseType: !191, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1051, file: !1052, line: 59, baseType: !177, size: 128, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !1041, file: !1040, line: 41, baseType: !132, size: 64, offset: 704)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !1041, file: !1040, line: 42, baseType: !1059, size: 64, offset: 768)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !1062, line: 13, size: 896, elements: !1063)
!1062 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !1062, line: 14, baseType: !132, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1061, file: !1062, line: 15, baseType: !282, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !1061, file: !1062, line: 17, baseType: !282, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !1061, file: !1062, line: 17, baseType: !282, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !1061, file: !1062, line: 19, baseType: !267, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !1061, file: !1062, line: 21, baseType: !267, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !1061, file: !1062, line: 22, baseType: !267, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !1061, file: !1062, line: 23, baseType: !267, size: 64, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !1061, file: !1062, line: 24, baseType: !267, size: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !1061, file: !1062, line: 25, baseType: !267, size: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !1061, file: !1062, line: 26, baseType: !267, size: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !1061, file: !1062, line: 27, baseType: !267, size: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !1061, file: !1062, line: 28, baseType: !267, size: 64, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !1061, file: !1062, line: 29, baseType: !267, size: 64, offset: 832)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !1041, file: !1040, line: 44, baseType: !704, size: 32, offset: 832)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !1041, file: !1040, line: 50, baseType: !816, size: 16, offset: 864)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !1041, file: !1040, line: 51, baseType: !1081, size: 16, offset: 880)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !145, line: 18, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !147, line: 23, baseType: !1083)
!1083 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !936, file: !679, line: 495, baseType: !282, size: 64, offset: 6528)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !936, file: !679, line: 497, baseType: !1086, size: 64, offset: 6592)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !679, line: 381, size: 384, elements: !1088)
!1088 = !{!1089, !1090, !2178}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !1087, file: !679, line: 382, baseType: !704, size: 32)
