; ModuleID = '../bcout/drivers/net/wireless/intersil/orinoco/hermes_dld.llvm.bc'
source_filename = "drivers/net/wireless/intersil/orinoco/hermes_dld.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.anon = type { i16, i16, [10 x i8] }
%struct.anon.0 = type { i16, i16, [4 x i8] }
%struct.anon.1 = type { i16, i16, [10 x i8] }
%struct.anon.2 = type { i16, i16, [2 x i8] }
%struct.anon.3 = type { i16, i16, [28 x i8] }
%struct.anon.4 = type { i16, i16, [256 x i8] }
%struct.hermes = type { i8*, i32, i16, i8, %struct.hermes_ops*, i8* }
%struct.hermes_ops = type { i32 (%struct.hermes*)*, i32 (%struct.hermes*, i16, i16, %struct.hermes_response*)*, i32 (%struct.hermes*, i16, i16, i16, i16, %struct.hermes_response*)*, i32 (%struct.hermes*, i16, i16*)*, i32 (%struct.hermes*, i32, i16, i32, i16*, i8*)*, i32 (%struct.hermes*, i32, i16, i16, i8*)*, i32 (%struct.hermes*, i32, i8*, i32, i16, i16)*, i32 (%struct.hermes*, i32, i8*, i32, i16, i16)*, i32 (%struct.hermes*, i16*, i32, i16)*, i32 (%struct.hermes*, i32)*, i32 (%struct.hermes*)*, i32 (%struct.hermes*, i8*, i32, i32)*, void (%struct.spinlock*, i64*)*, void (%struct.spinlock*, i64*)*, void (%struct.spinlock*)*, void (%struct.spinlock*)* }
%struct.hermes_response = type { i16, i16, i16, i16 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "default_pdr_data_0x0005", scope: !2, file: !3, line: 330, type: !104, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !44, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/wireless/intersil/orinoco/hermes_dld.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !23, !33, !34, !41, !42, !29, !28, !43, !13, !11}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pdr", file: !3, line: 75, size: 96, elements: !9)
!9 = !{!10, !16, !17, !18}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !8, file: !3, line: 76, baseType: !11, size: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !12, line: 31, baseType: !13)
!12 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !14, line: 27, baseType: !15)
!14 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !8, file: !3, line: 77, baseType: !11, size: 32, offset: 32)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !8, file: !3, line: 78, baseType: !11, size: 32, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !3, line: 79, baseType: !19, offset: 96)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, elements: !21)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !{!22}
!22 = !DISubrange(count: -1)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pdi", file: !3, line: 87, size: 32, elements: !26)
!26 = !{!27, !31, !32}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !25, file: !3, line: 88, baseType: !28, size: 16)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !12, line: 29, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !14, line: 24, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !25, file: !3, line: 89, baseType: !28, size: 16, offset: 16)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !25, file: !3, line: 90, baseType: !19, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dblock", file: !3, line: 64, size: 48, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !36, file: !3, line: 65, baseType: !11, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !36, file: !3, line: 66, baseType: !28, size: 16, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !36, file: !3, line: 67, baseType: !19, offset: 48)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!44 = !{!0, !45, !60, !71, !82, !93}
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "default_pdr_data_0x0108", scope: !2, file: !3, line: 333, type: !47, isLocal: true, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 333, size: 64, elements: !49)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !48, file: !3, line: 333, baseType: !28, size: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !48, file: !3, line: 333, baseType: !28, size: 16, offset: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !48, file: !3, line: 333, baseType: !53, size: 32, offset: 32)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !58)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !55, line: 17, baseType: !56)
!55 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !14, line: 21, baseType: !57)
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59}
!59 = !DISubrange(count: 4)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "default_pdr_data_0x0109", scope: !2, file: !3, line: 336, type: !62, isLocal: true, isDefinition: true)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 336, size: 112, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !63, file: !3, line: 336, baseType: !28, size: 16)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !3, line: 336, baseType: !28, size: 16, offset: 16)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !63, file: !3, line: 336, baseType: !68, size: 80, offset: 32)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 80, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 10)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "default_pdr_data_0x0150", scope: !2, file: !3, line: 339, type: !73, isLocal: true, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 339, size: 48, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !74, file: !3, line: 339, baseType: !28, size: 16)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !3, line: 339, baseType: !28, size: 16, offset: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !74, file: !3, line: 339, baseType: !79, size: 16, offset: 32)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 16, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 2)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "default_pdr_data_0x0160", scope: !2, file: !3, line: 342, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 342, size: 256, elements: !86)
!86 = !{!87, !88, !89}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !85, file: !3, line: 342, baseType: !28, size: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !85, file: !3, line: 342, baseType: !28, size: 16, offset: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !85, file: !3, line: 342, baseType: !90, size: 224, offset: 32)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 224, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 28)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "default_pdr_data_0x0161", scope: !2, file: !3, line: 349, type: !95, isLocal: true, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 349, size: 2080, elements: !97)
!97 = !{!98, !99, !100}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !96, file: !3, line: 349, baseType: !28, size: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !96, file: !3, line: 349, baseType: !28, size: 16, offset: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !96, file: !3, line: 349, baseType: !101, size: 2048, offset: 32)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 256)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 330, size: 112, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !105, file: !3, line: 330, baseType: !28, size: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !105, file: !3, line: 330, baseType: !28, size: 16, offset: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !3, line: 330, baseType: !68, size: 80, offset: 32)
!110 = !{i32 7, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{i32 1, !"wchar_size", i32 2}
!113 = !{i32 1, !"Code Model", i32 2}
!114 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!115 = distinct !DISubprogram(name: "hermes_apply_pda", scope: !3, file: !3, line: 223, type: !116, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !119, !193, !168, !223, !168}
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hermes", file: !121, line: 408, size: 256, elements: !122)
!121 = !DIFile(filename: "drivers/net/wireless/intersil/orinoco/hermes.h", directory: "/home/lizy2001/genbc/linux")
!122 = !{!123, !124, !125, !127, !131, !222}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "iobase", scope: !120, file: !121, line: 409, baseType: !33, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reg_spacing", scope: !120, file: !121, line: 410, baseType: !118, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "inten", scope: !120, file: !121, line: 413, baseType: !126, size: 16, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !55, line: 19, baseType: !29)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "eeprom_pda", scope: !120, file: !121, line: 414, baseType: !128, size: 8, offset: 112)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !129, line: 30, baseType: !130)
!129 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!130 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !120, file: !121, line: 415, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hermes_ops", file: !121, line: 379, size: 1024, elements: !135)
!135 = !{!136, !140, !151, !155, !160, !164, !170, !174, !178, !184, !188, !189, !195, !216, !217, !221}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !134, file: !121, line: 380, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!118, !119}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_wait", scope: !134, file: !121, line: 381, baseType: !141, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!118, !119, !126, !126, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hermes_response", file: !121, line: 359, size: 64, elements: !146)
!146 = !{!147, !148, !149, !150}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !145, file: !121, line: 360, baseType: !126, size: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "resp0", scope: !145, file: !121, line: 360, baseType: !126, size: 16, offset: 16)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "resp1", scope: !145, file: !121, line: 360, baseType: !126, size: 16, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "resp2", scope: !145, file: !121, line: 360, baseType: !126, size: 16, offset: 48)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "init_cmd_wait", scope: !134, file: !121, line: 383, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!118, !119, !126, !126, !126, !126, !144}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !134, file: !121, line: 386, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!118, !119, !126, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "read_ltv", scope: !134, file: !121, line: 387, baseType: !161, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!118, !119, !118, !126, !15, !159, !33}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "write_ltv", scope: !134, file: !121, line: 389, baseType: !165, size: 64, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!118, !119, !118, !126, !126, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bap_pread", scope: !134, file: !121, line: 391, baseType: !171, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!118, !119, !118, !33, !118, !126, !126}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bap_pwrite", scope: !134, file: !121, line: 393, baseType: !175, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!118, !119, !118, !168, !118, !126, !126}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "read_pda", scope: !134, file: !121, line: 395, baseType: !179, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!118, !119, !182, !183, !126}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !55, line: 21, baseType: !13)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "program_init", scope: !134, file: !121, line: 397, baseType: !185, size: 64, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{!118, !119, !183}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "program_end", scope: !134, file: !121, line: 398, baseType: !137, size: 64, offset: 640)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !134, file: !121, line: 399, baseType: !190, size: 64, offset: 704)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!118, !119, !193, !183, !183}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "lock_irqsave", scope: !134, file: !121, line: 401, baseType: !196, size: 64, offset: 768)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{null, !199, !214}
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !201, line: 83, baseType: !202)
!201 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !201, line: 71, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !201, line: 72, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !201, line: 72, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !205, file: !201, line: 73, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !201, line: 20, elements: !209)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !208, file: !201, line: 21, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !212, line: 25, baseType: !213)
!212 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 25, elements: !4)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "unlock_irqrestore", scope: !134, file: !121, line: 402, baseType: !196, size: 64, offset: 832)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "lock_irq", scope: !134, file: !121, line: 403, baseType: !218, size: 64, offset: 896)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !199}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "unlock_irq", scope: !134, file: !121, line: 404, baseType: !218, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !120, file: !121, line: 416, baseType: !33, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!225 = !DILocalVariable(name: "hw", arg: 1, scope: !115, file: !3, line: 223, type: !119)
!226 = !DILocation(line: 223, column: 37, scope: !115)
!227 = !DILocalVariable(name: "first_pdr", arg: 2, scope: !115, file: !3, line: 224, type: !193)
!228 = !DILocation(line: 224, column: 20, scope: !115)
!229 = !DILocalVariable(name: "pdr_end", arg: 3, scope: !115, file: !3, line: 225, type: !168)
!230 = !DILocation(line: 225, column: 20, scope: !115)
!231 = !DILocalVariable(name: "pda", arg: 4, scope: !115, file: !3, line: 226, type: !223)
!232 = !DILocation(line: 226, column: 22, scope: !115)
!233 = !DILocalVariable(name: "pda_end", arg: 5, scope: !115, file: !3, line: 227, type: !168)
!234 = !DILocation(line: 227, column: 20, scope: !115)
!235 = !DILocalVariable(name: "ret", scope: !115, file: !3, line: 229, type: !118)
!236 = !DILocation(line: 229, column: 6, scope: !115)
!237 = !DILocalVariable(name: "pdi", scope: !115, file: !3, line: 230, type: !23)
!238 = !DILocation(line: 230, column: 20, scope: !115)
!239 = !DILocalVariable(name: "pdr", scope: !115, file: !3, line: 231, type: !6)
!240 = !DILocation(line: 231, column: 20, scope: !115)
!241 = !DILocation(line: 233, column: 29, scope: !115)
!242 = !DILocation(line: 233, column: 8, scope: !115)
!243 = !DILocation(line: 233, column: 6, scope: !115)
!244 = !DILocation(line: 234, column: 10, scope: !115)
!245 = !DILocation(line: 237, column: 30, scope: !115)
!246 = !DILocation(line: 237, column: 34, scope: !115)
!247 = !DILocation(line: 237, column: 8, scope: !115)
!248 = !DILocation(line: 237, column: 6, scope: !115)
!249 = !DILocation(line: 238, column: 2, scope: !115)
!250 = !DILocation(line: 238, column: 19, scope: !115)
!251 = !DILocation(line: 238, column: 10, scope: !115)
!252 = !DILocation(line: 238, column: 26, scope: !115)
!253 = !DILocation(line: 238, column: 23, scope: !115)
!254 = !DILocation(line: 238, column: 35, scope: !115)
!255 = !DILocation(line: 239, column: 17, scope: !115)
!256 = !DILocation(line: 239, column: 10, scope: !115)
!257 = !DILocation(line: 239, column: 22, scope: !115)
!258 = !DILocation(line: 0, scope: !115)
!259 = !DILocation(line: 240, column: 25, scope: !260)
!260 = distinct !DILexicalBlock(scope: !115, file: !3, line: 239, column: 35)
!261 = !DILocation(line: 240, column: 29, scope: !260)
!262 = !DILocation(line: 240, column: 34, scope: !260)
!263 = !DILocation(line: 240, column: 39, scope: !260)
!264 = !DILocation(line: 240, column: 9, scope: !260)
!265 = !DILocation(line: 240, column: 7, scope: !260)
!266 = !DILocation(line: 241, column: 7, scope: !267)
!267 = distinct !DILexicalBlock(scope: !260, file: !3, line: 241, column: 7)
!268 = !DILocation(line: 241, column: 7, scope: !260)
!269 = !DILocation(line: 242, column: 11, scope: !267)
!270 = !DILocation(line: 242, column: 4, scope: !267)
!271 = !DILocation(line: 245, column: 31, scope: !260)
!272 = !DILocation(line: 245, column: 36, scope: !260)
!273 = !DILocation(line: 245, column: 49, scope: !260)
!274 = !DILocation(line: 245, column: 41, scope: !260)
!275 = !DILocation(line: 245, column: 9, scope: !260)
!276 = !DILocation(line: 245, column: 7, scope: !260)
!277 = distinct !{!277, !249, !278}
!278 = !DILocation(line: 246, column: 2, scope: !115)
!279 = !DILocation(line: 247, column: 2, scope: !115)
!280 = !DILocation(line: 248, column: 1, scope: !115)
!281 = distinct !DISubprogram(name: "pdi_id", scope: !3, file: !3, line: 130, type: !282, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!282 = !DISubroutineType(types: !283)
!283 = !{!183, !23}
!284 = !DILocalVariable(name: "pdi", arg: 1, scope: !281, file: !3, line: 130, type: !23)
