; ModuleID = '../bcout/drivers/net/wireless/intersil/orinoco/hermes.llvm.bc'
source_filename = "drivers/net/wireless/intersil/orinoco/hermes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.hermes_ops = type { i32 (%struct.hermes*)*, i32 (%struct.hermes*, i16, i16, %struct.hermes_response*)*, i32 (%struct.hermes*, i16, i16, i16, i16, %struct.hermes_response*)*, i32 (%struct.hermes*, i16, i16*)*, i32 (%struct.hermes*, i32, i16, i32, i16*, i8*)*, i32 (%struct.hermes*, i32, i16, i16, i8*)*, i32 (%struct.hermes*, i32, i8*, i32, i16, i16)*, i32 (%struct.hermes*, i32, i8*, i32, i16, i16)*, i32 (%struct.hermes*, i16*, i32, i16)*, i32 (%struct.hermes*, i32)*, i32 (%struct.hermes*)*, i32 (%struct.hermes*, i8*, i32, i32)*, void (%struct.spinlock*, i64*)*, void (%struct.spinlock*, i64*)*, void (%struct.spinlock*)*, void (%struct.spinlock*)* }
%struct.hermes = type { i8*, i32, i16, i8, %struct.hermes_ops*, i8* }
%struct.hermes_response = type { i16, i16, i16, i16 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "hermes_ops_local", scope: !2, file: !3, line: 760, type: !21, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/wireless/intersil/orinoco/hermes.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !{!7, !12, !14, !17, !19}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le16", file: !13, line: 29, baseType: !14)
!13 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !15, line: 24, baseType: !16)
!15 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !18, line: 19, baseType: !14)
!18 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!20 = !{!0}
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hermes_ops", file: !23, line: 379, size: 1024, elements: !24)
!23 = !DIFile(filename: "drivers/net/wireless/intersil/orinoco/hermes.h", directory: "/home/lizy2001/genbc/linux")
!24 = !{!25, !44, !55, !59, !64, !68, !74, !78, !82, !89, !93, !94, !101, !122, !123, !127}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !22, file: !23, line: 380, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DISubroutineType(types: !28)
!28 = !{!29, !30}
!29 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hermes", file: !23, line: 408, size: 256, elements: !32)
!32 = !{!33, !35, !36, !37, !41, !43}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "iobase", scope: !31, file: !23, line: 409, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "reg_spacing", scope: !31, file: !23, line: 410, baseType: !29, size: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "inten", scope: !31, file: !23, line: 413, baseType: !17, size: 16, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "eeprom_pda", scope: !31, file: !23, line: 414, baseType: !38, size: 8, offset: 112)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !39, line: 30, baseType: !40)
!39 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!40 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !31, file: !23, line: 415, baseType: !42, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !31, file: !23, line: 416, baseType: !34, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_wait", scope: !22, file: !23, line: 381, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!29, !30, !17, !17, !48}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hermes_response", file: !23, line: 359, size: 64, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !49, file: !23, line: 360, baseType: !17, size: 16)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "resp0", scope: !49, file: !23, line: 360, baseType: !17, size: 16, offset: 16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "resp1", scope: !49, file: !23, line: 360, baseType: !17, size: 16, offset: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "resp2", scope: !49, file: !23, line: 360, baseType: !17, size: 16, offset: 48)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "init_cmd_wait", scope: !22, file: !23, line: 383, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!29, !30, !17, !17, !17, !17, !48}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !22, file: !23, line: 386, baseType: !60, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!29, !30, !17, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "read_ltv", scope: !22, file: !23, line: 387, baseType: !65, size: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!29, !30, !29, !17, !7, !63, !34}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "write_ltv", scope: !22, file: !23, line: 389, baseType: !69, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!29, !30, !29, !17, !17, !72}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bap_pread", scope: !22, file: !23, line: 391, baseType: !75, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!29, !30, !29, !34, !29, !17, !17}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bap_pwrite", scope: !22, file: !23, line: 393, baseType: !79, size: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!29, !30, !29, !72, !29, !17, !17}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "read_pda", scope: !22, file: !23, line: 395, baseType: !83, size: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!29, !30, !86, !87, !17}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !18, line: 21, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !15, line: 27, baseType: !7)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "program_init", scope: !22, file: !23, line: 397, baseType: !90, size: 64, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{!29, !30, !87}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "program_end", scope: !22, file: !23, line: 398, baseType: !26, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !22, file: !23, line: 399, baseType: !95, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!29, !30, !98, !87, !87}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "lock_irqsave", scope: !22, file: !23, line: 401, baseType: !102, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{null, !105, !121}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !107, line: 83, baseType: !108)
!107 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !107, line: 71, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, scope: !108, file: !107, line: 72, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !108, file: !107, line: 72, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !111, file: !107, line: 73, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !107, line: 20, elements: !115)
!115 = !{!116}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !114, file: !107, line: 21, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !118, line: 25, baseType: !119)
!118 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 25, elements: !120)
!120 = !{}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "unlock_irqrestore", scope: !22, file: !23, line: 402, baseType: !102, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "lock_irq", scope: !22, file: !23, line: 403, baseType: !124, size: 64, offset: 896)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !105}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "unlock_irq", scope: !22, file: !23, line: 404, baseType: !124, size: 64, offset: 960)
!128 = !{!"rsp"}
!129 = !{i32 7, !"Dwarf Version", i32 4}
!130 = !{i32 2, !"Debug Info Version", i32 3}
!131 = !{i32 1, !"wchar_size", i32 2}
!132 = !{i32 1, !"Code Model", i32 2}
!133 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!134 = distinct !DISubprogram(name: "hermes_struct_init", scope: !3, file: !3, line: 187, type: !135, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !120)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !30, !34, !29}
!137 = !DILocalVariable(name: "hw", arg: 1, scope: !134, file: !3, line: 187, type: !30)
!138 = !DILocation(line: 187, column: 40, scope: !134)
!139 = !DILocalVariable(name: "address", arg: 2, scope: !134, file: !3, line: 187, type: !34)
!140 = !DILocation(line: 187, column: 58, scope: !134)
!141 = !DILocalVariable(name: "reg_spacing", arg: 3, scope: !134, file: !3, line: 188, type: !29)
!142 = !DILocation(line: 188, column: 8, scope: !134)
!143 = !DILocation(line: 190, column: 15, scope: !134)
!144 = !DILocation(line: 190, column: 2, scope: !134)
!145 = !DILocation(line: 190, column: 6, scope: !134)
!146 = !DILocation(line: 190, column: 13, scope: !134)
!147 = !DILocation(line: 191, column: 20, scope: !134)
!148 = !DILocation(line: 191, column: 2, scope: !134)
!149 = !DILocation(line: 191, column: 6, scope: !134)
!150 = !DILocation(line: 191, column: 18, scope: !134)
!151 = !DILocation(line: 192, column: 2, scope: !134)
!152 = !DILocation(line: 192, column: 6, scope: !134)
!153 = !DILocation(line: 192, column: 12, scope: !134)
!154 = !DILocation(line: 193, column: 2, scope: !134)
!155 = !DILocation(line: 193, column: 6, scope: !134)
!156 = !DILocation(line: 193, column: 17, scope: !134)
!157 = !DILocation(line: 194, column: 2, scope: !134)
!158 = !DILocation(line: 194, column: 6, scope: !134)
!159 = !DILocation(line: 194, column: 10, scope: !134)
!160 = !DILocation(line: 195, column: 1, scope: !134)
!161 = distinct !DISubprogram(name: "hermes_init", scope: !3, file: !3, line: 198, type: !27, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !120)
!162 = !DILocalVariable(name: "hw", arg: 1, scope: !161, file: !3, line: 198, type: !30)
!163 = !DILocation(line: 198, column: 39, scope: !161)
!164 = !DILocalVariable(name: "reg", scope: !161, file: !3, line: 200, type: !17)
!165 = !DILocation(line: 200, column: 6, scope: !161)
!166 = !DILocalVariable(name: "err", scope: !161, file: !3, line: 201, type: !29)
!167 = !DILocation(line: 201, column: 6, scope: !161)
!168 = !DILocalVariable(name: "k", scope: !161, file: !3, line: 202, type: !29)
!169 = !DILocation(line: 202, column: 6, scope: !161)
!170 = !DILocation(line: 205, column: 2, scope: !161)
!171 = !DILocation(line: 205, column: 6, scope: !161)
!172 = !DILocation(line: 205, column: 12, scope: !161)
!173 = !DILocation(line: 206, column: 2, scope: !161)
!174 = !DILocation(line: 207, column: 2, scope: !161)
!175 = !DILocation(line: 215, column: 4, scope: !161)
!176 = !DILocation(line: 216, column: 8, scope: !161)
!177 = !DILocation(line: 216, column: 6, scope: !161)
!178 = !DILocation(line: 217, column: 2, scope: !161)
!179 = !DILocation(line: 217, column: 9, scope: !161)
!180 = !DILocation(line: 217, column: 11, scope: !161)
!181 = !DILocation(line: 217, column: 15, scope: !161)
!182 = !DILocation(line: 217, column: 19, scope: !161)
!183 = !DILocation(line: 0, scope: !161)
!184 = !DILocation(line: 218, column: 7, scope: !185)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 218, column: 7)
!186 = distinct !DILexicalBlock(scope: !161, file: !3, line: 217, column: 39)
!187 = !DILocation(line: 218, column: 11, scope: !185)
!188 = !DILocation(line: 218, column: 7, scope: !186)
!189 = !DILocation(line: 220, column: 4, scope: !185)
