; ModuleID = '../bcout/drivers/i2c/algos/i2c-algo-bit.llvm.bc'
source_filename = "drivers/i2c/algos/i2c-algo-bit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.i2c_adapter = type { %struct.module*, i32, %struct.i2c_algorithm*, i8*, %struct.i2c_lock_operations*, %struct.rt_mutex, %struct.rt_mutex, i32, i32, %struct.device, i64, i32, [48 x i8], %struct.completion, %struct.mutex, %struct.list_head, %struct.i2c_bus_recovery_info*, %struct.i2c_adapter_quirks*, %struct.irq_domain* }
%struct.i2c_algorithm = type { {}*, {}*, i32 (%struct.i2c_adapter*, i16, i16, i8, i8, i32, %union.i2c_smbus_data*)*, i32 (%struct.i2c_adapter*, i16, i16, i8, i8, i32, %union.i2c_smbus_data*)*, i32 (%struct.i2c_adapter*)* }
%struct.i2c_lock_operations = type { void (%struct.i2c_adapter*, i32)*, i32 (%struct.i2c_adapter*, i32)*, void (%struct.i2c_adapter*, i32)* }
%struct.rt_mutex = type { %struct.raw_spinlock, %struct.rb_root_cached, %struct.task_struct* }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.rb_root_cached = type { %struct.rb_root, %struct.rb_node* }

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !64, globals: !67, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/i2c/algos/i2c-algo-bit.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !{!65, !66}
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!67 = !{!68, !140, !145, !150, !2321, !2326, !2331, !2336, !2341, !0, !2343}
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "__param_bit_test", scope: !2, file: !3, line: 36, type: !70, isLocal: true, isDefinition: true, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !72, line: 69, size: 320, elements: !73)
!72 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!73 = !{!74, !78, !82, !103, !110, !114, !118}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !72, line: 70, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !71, file: !72, line: 71, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !81, line: 76, flags: DIFlagFwdDecl)
!81 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !71, file: !72, line: 72, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !72, line: 47, size: 256, elements: !86)
!86 = !{!87, !88, !94, !99}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !85, file: !72, line: 49, baseType: !7, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !85, file: !72, line: 51, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!92, !75, !93}
!92 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !85, file: !72, line: 53, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!92, !98, !93}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !85, file: !72, line: 55, baseType: !100, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !66}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !71, file: !72, line: 73, baseType: !104, size: 16, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !106, line: 19, baseType: !107)
!106 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !108, line: 24, baseType: !109)
!108 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!109 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !71, file: !72, line: 74, baseType: !111, size: 8, offset: 208)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !106, line: 16, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !108, line: 20, baseType: !113)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !71, file: !72, line: 75, baseType: !115, size: 8, offset: 216)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !106, line: 17, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !108, line: 21, baseType: !117)
!117 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!118 = !DIDerivedType(tag: DW_TAG_member, scope: !71, file: !72, line: 76, baseType: !119, size: 64, offset: 256)
!119 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !71, file: !72, line: 76, size: 64, elements: !120)
!120 = !{!121, !122, !129}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !119, file: !72, line: 77, baseType: !66, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !119, file: !72, line: 78, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !72, line: 86, size: 128, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !125, file: !72, line: 87, baseType: !7, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !125, file: !72, line: 88, baseType: !98, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !119, file: !72, line: 79, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !72, line: 92, size: 256, elements: !133)
!133 = !{!134, !135, !136, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !132, file: !72, line: 94, baseType: !7, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !132, file: !72, line: 95, baseType: !7, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !132, file: !72, line: 96, baseType: !137, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !132, file: !72, line: 97, baseType: !83, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !132, file: !72, line: 98, baseType: !66, size: 64, offset: 192)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_bit_testtype171", scope: !2, file: !3, line: 36, type: !142, isLocal: true, isDefinition: true, align: 8)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 280, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 35)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_bit_test172", scope: !2, file: !3, line: 37, type: !147, isLocal: true, isDefinition: true, align: 8)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 608, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 76)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "i2c_bit_algo", scope: !2, file: !3, line: 634, type: !152, isLocal: false, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_algorithm", file: !154, line: 519, size: 320, elements: !155)
!154 = !DIFile(filename: "./include/linux/i2c.h", directory: "/home/lizy2001/genbc/linux")
!155 = !{!156, !2302, !2303, !2316, !2317}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "master_xfer", scope: !153, file: !154, line: 529, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!92, !160, !2293, !92}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_adapter", file: !154, line: 695, size: 7552, elements: !162)
!162 = !{!163, !164, !165, !167, !168, !182, !1354, !1355, !1356, !1357, !2240, !2241, !2242, !2246, !2247, !2248, !2249, !2281, !2292}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !161, file: !154, line: 696, baseType: !79, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !161, file: !154, line: 697, baseType: !7, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "algo", scope: !161, file: !154, line: 698, baseType: !166, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "algo_data", scope: !161, file: !154, line: 699, baseType: !66, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lock_ops", scope: !161, file: !154, line: 702, baseType: !169, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "i2c_lock_operations", file: !154, line: 557, size: 192, elements: !172)
!172 = !{!173, !177, !181}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "lock_bus", scope: !171, file: !154, line: 558, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !160, !7}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "trylock_bus", scope: !171, file: !154, line: 559, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!92, !160, !7}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "unlock_bus", scope: !171, file: !154, line: 560, baseType: !174, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "bus_lock", scope: !161, file: !154, line: 703, baseType: !183, size: 192, offset: 320)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex", file: !184, line: 30, size: 192, elements: !185)
!184 = !DIFile(filename: "./include/linux/rtmutex.h", directory: "/home/lizy2001/genbc/linux")
!185 = !{!186, !196, !212}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !183, file: !184, line: 31, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !188, line: 29, baseType: !189)
!188 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !188, line: 20, elements: !190)
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !189, file: !188, line: 21, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !193, line: 25, baseType: !194)
!193 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !193, line: 25, elements: !195)
!195 = !{}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "waiters", scope: !183, file: !184, line: 32, baseType: !197, size: 128)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !198, line: 125, size: 128, elements: !199)
!198 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!199 = !{!200, !211}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !197, file: !198, line: 126, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !198, line: 31, size: 64, elements: !202)
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !201, file: !198, line: 32, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !198, line: 24, size: 192, align: 64, elements: !206)
!206 = !{!207, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !205, file: !198, line: 25, baseType: !208, size: 64)
!208 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !205, file: !198, line: 26, baseType: !204, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !205, file: !198, line: 27, baseType: !204, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !197, file: !198, line: 127, baseType: !204, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !183, file: !184, line: 33, baseType: !213, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !215, line: 640, size: 48640, elements: !216)
!215 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!216 = !{!217, !225, !227, !228, !239, !240, !241, !242, !243, !244, !245, !246, !250, !276, !287, !379, !380, !381, !392, !393, !395, !396, !632, !633, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !712, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !768, !770, !771, !772, !774, !776, !777, !778, !779, !780, !786, !787, !788, !789, !790, !791, !792, !806, !811, !816, !817, !818, !821, !825, !828, !831, !834, !837, !841, !844, !847, !853, !854, !855, !861, !862, !866, !867, !868, !877, !878, !879, !880, !881, !886, !887, !888, !891, !892, !895, !898, !901, !904, !907, !910, !911, !992, !995, !998, !999, !1002, !1003, !1004, !1010, !1011, !1012, !1025, !1026, !1027, !1037, !1042, !1045, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !214, file: !215, line: 646, baseType: !218, size: 128)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !219, line: 56, size: 128, elements: !220)
!219 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !218, file: !219, line: 57, baseType: !208, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !218, file: !219, line: 58, baseType: !223, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !106, line: 21, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !108, line: 27, baseType: !7)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !215, line: 649, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !65)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !214, file: !215, line: 657, baseType: !66, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !214, file: !215, line: 658, baseType: !229, size: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !230, line: 113, baseType: !231)
!230 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !230, line: 111, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !231, file: !230, line: 112, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !235, line: 168, baseType: !236)
!235 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !235, line: 166, size: 32, elements: !237)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !236, file: !235, line: 167, baseType: !92, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !214, file: !215, line: 660, baseType: !7, size: 32, offset: 288)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !214, file: !215, line: 661, baseType: !7, size: 32, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !214, file: !215, line: 684, baseType: !92, size: 32, offset: 352)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !214, file: !215, line: 686, baseType: !92, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !214, file: !215, line: 687, baseType: !92, size: 32, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !214, file: !215, line: 688, baseType: !92, size: 32, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !214, file: !215, line: 689, baseType: !7, size: 32, offset: 480)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !214, file: !215, line: 691, baseType: !247, size: 64, offset: 512)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !215, line: 691, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !214, file: !215, line: 692, baseType: !251, size: 832, offset: 576)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !215, line: 451, size: 832, elements: !252)
!252 = !{!253, !258, !259, !265, !266, !270, !271, !272, !273, !274}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !251, file: !215, line: 453, baseType: !254, size: 128)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !215, line: 325, size: 128, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !254, file: !215, line: 326, baseType: !208, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !254, file: !215, line: 327, baseType: !223, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !251, file: !215, line: 454, baseType: !205, size: 192, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !251, file: !215, line: 455, baseType: !260, size: 128, offset: 320)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !235, line: 178, size: 128, elements: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !235, line: 179, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !260, file: !235, line: 179, baseType: !263, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !251, file: !215, line: 456, baseType: !7, size: 32, offset: 448)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !251, file: !215, line: 458, baseType: !267, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !106, line: 23, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !108, line: 31, baseType: !269)
!269 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !251, file: !215, line: 459, baseType: !267, size: 64, offset: 576)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !251, file: !215, line: 460, baseType: !267, size: 64, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !251, file: !215, line: 461, baseType: !267, size: 64, offset: 704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !251, file: !215, line: 463, baseType: !267, size: 64, offset: 768)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !251, file: !215, line: 465, baseType: !275, offset: 832)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !215, line: 415, elements: !195)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !214, file: !215, line: 693, baseType: !277, size: 384, offset: 1408)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !215, line: 489, size: 384, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !277, file: !215, line: 490, baseType: !260, size: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !277, file: !215, line: 491, baseType: !208, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !277, file: !215, line: 492, baseType: !208, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !277, file: !215, line: 493, baseType: !7, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !277, file: !215, line: 494, baseType: !109, size: 16, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !277, file: !215, line: 495, baseType: !109, size: 16, offset: 304)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !277, file: !215, line: 497, baseType: !286, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !214, file: !215, line: 697, baseType: !288, size: 1792, offset: 1792)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !215, line: 507, size: 1792, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !376, !377}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !288, file: !215, line: 508, baseType: !205, size: 192, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !288, file: !215, line: 515, baseType: !267, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !288, file: !215, line: 516, baseType: !267, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !288, file: !215, line: 517, baseType: !267, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !288, file: !215, line: 518, baseType: !267, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !288, file: !215, line: 519, baseType: !267, size: 64, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !288, file: !215, line: 526, baseType: !297, size: 64, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !106, line: 22, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !108, line: 30, baseType: !299)
!299 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !288, file: !215, line: 527, baseType: !267, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !215, line: 528, baseType: !7, size: 32, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !288, file: !215, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !288, file: !215, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !288, file: !215, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !288, file: !215, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !288, file: !215, line: 563, baseType: !307, size: 512, offset: 704)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !308)
!308 = !{!309, !317, !318, !323, !372, !373, !374, !375}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !307, file: !6, line: 119, baseType: !310, size: 256)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !311, line: 9, size: 256, elements: !312)
!311 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !310, file: !311, line: 10, baseType: !205, size: 192, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !310, file: !311, line: 11, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !316, line: 29, baseType: !297)
!316 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !307, file: !6, line: 120, baseType: !315, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !307, file: !6, line: 121, baseType: !319, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!5, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !307, file: !6, line: 122, baseType: !324, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !326)
!326 = !{!327, !347, !348, !352, !362, !363, !367, !371}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !325, file: !6, line: 160, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !329, file: !6, line: 215, baseType: !187)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !329, file: !6, line: 216, baseType: !7, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !329, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !329, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !329, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !329, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !329, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !329, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !329, file: !6, line: 233, baseType: !315, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !329, file: !6, line: 234, baseType: !322, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !329, file: !6, line: 235, baseType: !315, size: 64, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !329, file: !6, line: 236, baseType: !322, size: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !329, file: !6, line: 237, baseType: !344, size: 4096, offset: 512)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 4096, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !325, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !325, file: !6, line: 162, baseType: !349, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !235, line: 27, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !351, line: 96, baseType: !92)
!351 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!352 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !325, file: !6, line: 163, baseType: !353, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !354, line: 276, baseType: !355)
!354 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !354, line: 276, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !355, file: !354, line: 276, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !354, line: 70, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !354, line: 65, size: 32, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !359, file: !354, line: 66, baseType: !7, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !325, file: !6, line: 164, baseType: !322, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !325, file: !6, line: 165, baseType: !364, size: 128, offset: 256)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !311, line: 14, size: 128, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !364, file: !311, line: 15, baseType: !197, size: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !325, file: !6, line: 166, baseType: !368, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!315}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !325, file: !6, line: 167, baseType: !315, size: 64, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !307, file: !6, line: 123, baseType: !115, size: 8, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !307, file: !6, line: 124, baseType: !115, size: 8, offset: 456)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !307, file: !6, line: 125, baseType: !115, size: 8, offset: 464)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !307, file: !6, line: 126, baseType: !115, size: 8, offset: 472)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !288, file: !215, line: 572, baseType: !307, size: 512, offset: 1216)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !288, file: !215, line: 580, baseType: !378, size: 64, offset: 1728)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !214, file: !215, line: 721, baseType: !7, size: 32, offset: 3584)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !214, file: !215, line: 722, baseType: !92, size: 32, offset: 3616)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !214, file: !215, line: 723, baseType: !382, size: 64, offset: 3648)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !385, line: 17, baseType: !386)
!385 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !385, line: 17, size: 64, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !386, file: !385, line: 17, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 1)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !214, file: !215, line: 724, baseType: !384, size: 64, offset: 3712)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !214, file: !215, line: 749, baseType: !394, offset: 3776)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !215, line: 290, elements: !195)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !214, file: !215, line: 751, baseType: !260, size: 128, offset: 3776)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !214, file: !215, line: 757, baseType: !397, size: 64, offset: 3904)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !399, line: 388, size: 7296, elements: !400)
!399 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!400 = !{!401, !628}
!401 = !DIDerivedType(tag: DW_TAG_member, scope: !398, file: !399, line: 389, baseType: !402, size: 7296)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !398, file: !399, line: 389, size: 7296, elements: !403)
!403 = !{!404, !451, !452, !453, !457, !458, !459, !460, !461, !468, !469, !470, !471, !472, !473, !474, !482, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !516, !524, !527, !573, !574, !596, !597, !600, !604, !605, !608, !609, !612, !615, !627}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !402, file: !399, line: 390, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !399, line: 305, size: 1472, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !423, !424, !429, !430, !433, !437, !438, !441, !442, !449}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !406, file: !399, line: 308, baseType: !208, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !406, file: !399, line: 309, baseType: !208, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !406, file: !399, line: 313, baseType: !405, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !406, file: !399, line: 313, baseType: !405, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !406, file: !399, line: 315, baseType: !205, size: 192, align: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !406, file: !399, line: 323, baseType: !208, size: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !406, file: !399, line: 327, baseType: !397, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !406, file: !399, line: 333, baseType: !416, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !417, line: 284, baseType: !418)
!417 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !417, line: 284, size: 64, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !418, file: !417, line: 284, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !422, line: 19, baseType: !208)
!422 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !406, file: !399, line: 334, baseType: !208, size: 64, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !406, file: !399, line: 343, baseType: !425, size: 256, offset: 704)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !406, file: !399, line: 340, size: 256, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !425, file: !399, line: 341, baseType: !205, size: 192, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !425, file: !399, line: 342, baseType: !208, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !406, file: !399, line: 351, baseType: !260, size: 128, offset: 960)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !406, file: !399, line: 353, baseType: !431, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !399, line: 353, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !406, file: !399, line: 356, baseType: !434, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !399, line: 356, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !406, file: !399, line: 359, baseType: !208, size: 64, offset: 1216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !406, file: !399, line: 361, baseType: !439, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !417, line: 526, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !406, file: !399, line: 362, baseType: !66, size: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !406, file: !399, line: 365, baseType: !443, size: 64, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !444, line: 13, baseType: !445)
!444 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !235, line: 175, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !235, line: 173, size: 64, elements: !447)
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !446, file: !235, line: 174, baseType: !297, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !406, file: !399, line: 373, baseType: !450, offset: 1472)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !399, line: 296, elements: !195)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !402, file: !399, line: 391, baseType: !201, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !402, file: !399, line: 392, baseType: !267, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !402, file: !399, line: 394, baseType: !454, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DISubroutineType(types: !456)
!456 = !{!208, !439, !208, !208, !208, !208}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !402, file: !399, line: 398, baseType: !208, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !402, file: !399, line: 399, baseType: !208, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !402, file: !399, line: 405, baseType: !208, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !402, file: !399, line: 406, baseType: !208, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !402, file: !399, line: 407, baseType: !462, size: 64, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !417, line: 286, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 286, size: 64, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !464, file: !417, line: 286, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !422, line: 18, baseType: !208)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !402, file: !399, line: 416, baseType: !234, size: 32, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !402, file: !399, line: 428, baseType: !234, size: 32, offset: 608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !402, file: !399, line: 437, baseType: !234, size: 32, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !402, file: !399, line: 447, baseType: !234, size: 32, offset: 672)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !402, file: !399, line: 450, baseType: !443, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !402, file: !399, line: 452, baseType: !92, size: 32, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !402, file: !399, line: 454, baseType: !475, offset: 800)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !188, line: 83, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !188, line: 71, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, scope: !476, file: !188, line: 72, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !476, file: !188, line: 72, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !479, file: !188, line: 73, baseType: !189)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !402, file: !399, line: 457, baseType: !483, size: 256, offset: 832)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !484, line: 35, size: 256, elements: !485)
!484 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!485 = !{!486, !487, !488, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !483, file: !484, line: 36, baseType: !443, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !483, file: !484, line: 42, baseType: !443, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !483, file: !484, line: 46, baseType: !187, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !483, file: !484, line: 47, baseType: !260, size: 128, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !402, file: !399, line: 459, baseType: !260, size: 128, offset: 1088)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !402, file: !399, line: 466, baseType: !208, size: 64, offset: 1216)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !402, file: !399, line: 467, baseType: !208, size: 64, offset: 1280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !402, file: !399, line: 469, baseType: !208, size: 64, offset: 1344)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !402, file: !399, line: 470, baseType: !208, size: 64, offset: 1408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !402, file: !399, line: 471, baseType: !445, size: 64, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !402, file: !399, line: 472, baseType: !208, size: 64, offset: 1536)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !402, file: !399, line: 473, baseType: !208, size: 64, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !402, file: !399, line: 474, baseType: !208, size: 64, offset: 1664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !402, file: !399, line: 475, baseType: !208, size: 64, offset: 1728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !402, file: !399, line: 477, baseType: !475, offset: 1792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !402, file: !399, line: 478, baseType: !208, size: 64, offset: 1792)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !402, file: !399, line: 478, baseType: !208, size: 64, offset: 1856)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !402, file: !399, line: 478, baseType: !208, size: 64, offset: 1920)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !402, file: !399, line: 478, baseType: !208, size: 64, offset: 1984)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !402, file: !399, line: 479, baseType: !208, size: 64, offset: 2048)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !402, file: !399, line: 479, baseType: !208, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !402, file: !399, line: 479, baseType: !208, size: 64, offset: 2176)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !402, file: !399, line: 480, baseType: !208, size: 64, offset: 2240)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !402, file: !399, line: 480, baseType: !208, size: 64, offset: 2304)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !402, file: !399, line: 480, baseType: !208, size: 64, offset: 2368)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !402, file: !399, line: 480, baseType: !208, size: 64, offset: 2432)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !402, file: !399, line: 482, baseType: !513, size: 2816, offset: 2496)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 2816, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 44)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !402, file: !399, line: 488, baseType: !517, size: 256, offset: 5312)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !518, line: 60, size: 256, elements: !519)
!518 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!519 = !{!520}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !517, file: !518, line: 61, baseType: !521, size: 256)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 256, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 4)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !402, file: !399, line: 490, baseType: !525, size: 64, offset: 5568)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !399, line: 490, flags: DIFlagFwdDecl)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !402, file: !399, line: 493, baseType: !528, size: 896, offset: 5632)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !529, line: 53, baseType: !530)
!529 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 13, size: 896, elements: !531)
!531 = !{!532, !533, !534, !535, !538, !539, !546, !547, !567, !568, !569}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !530, file: !529, line: 18, baseType: !267, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !530, file: !529, line: 28, baseType: !445, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !530, file: !529, line: 31, baseType: !483, size: 256, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !530, file: !529, line: 32, baseType: !536, size: 64, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !529, line: 32, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !530, file: !529, line: 37, baseType: !109, size: 16, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !530, file: !529, line: 40, baseType: !540, size: 192, offset: 512)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !541, line: 53, size: 192, elements: !542)
!541 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !540, file: !541, line: 54, baseType: !443, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !540, file: !541, line: 55, baseType: !475, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !540, file: !541, line: 59, baseType: !260, size: 128, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !530, file: !529, line: 41, baseType: !66, size: 64, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !530, file: !529, line: 42, baseType: !548, size: 64, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !551, line: 13, size: 896, elements: !552)
!551 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !550, file: !551, line: 14, baseType: !66, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !550, file: !551, line: 15, baseType: !208, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !550, file: !551, line: 17, baseType: !208, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !550, file: !551, line: 17, baseType: !208, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !550, file: !551, line: 19, baseType: !65, size: 64, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !550, file: !551, line: 21, baseType: !65, size: 64, offset: 320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !550, file: !551, line: 22, baseType: !65, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !550, file: !551, line: 23, baseType: !65, size: 64, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !550, file: !551, line: 24, baseType: !65, size: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !550, file: !551, line: 25, baseType: !65, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !550, file: !551, line: 26, baseType: !65, size: 64, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !550, file: !551, line: 27, baseType: !65, size: 64, offset: 704)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !550, file: !551, line: 28, baseType: !65, size: 64, offset: 768)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !550, file: !551, line: 29, baseType: !65, size: 64, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !530, file: !529, line: 44, baseType: !234, size: 32, offset: 832)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !530, file: !529, line: 50, baseType: !105, size: 16, offset: 864)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !530, file: !529, line: 51, baseType: !570, size: 16, offset: 880)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !106, line: 18, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !108, line: 23, baseType: !572)
!572 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !402, file: !399, line: 495, baseType: !208, size: 64, offset: 6528)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !402, file: !399, line: 497, baseType: !575, size: 64, offset: 6592)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !399, line: 381, size: 384, elements: !577)
!577 = !{!578, !579, !585}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !576, file: !399, line: 382, baseType: !234, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !576, file: !399, line: 383, baseType: !580, size: 128, offset: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !399, line: 376, size: 128, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !580, file: !399, line: 377, baseType: !213, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !399, line: 378, baseType: !584, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !576, file: !399, line: 384, baseType: !586, size: 192, offset: 192)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !587, line: 26, size: 192, elements: !588)
!587 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !586, file: !587, line: 27, baseType: !7, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !586, file: !587, line: 28, baseType: !591, size: 128, offset: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !592, line: 43, size: 128, elements: !593)
!592 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !591, file: !592, line: 44, baseType: !187)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !591, file: !592, line: 45, baseType: !260, size: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_lock", scope: !402, file: !399, line: 500, baseType: !475, offset: 6656)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_table", scope: !402, file: !399, line: 501, baseType: !598, size: 64, offset: 6656)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "kioctx_table", file: !399, line: 387, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !402, file: !399, line: 516, baseType: !601, size: 64, offset: 6720)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !603, line: 18, flags: DIFlagFwdDecl)
!603 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!604 = !DIDerivedType(tag: DW_TAG_member, name: "exe_file", scope: !402, file: !399, line: 519, baseType: !439, size: 64, offset: 6784)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_subscriptions", scope: !402, file: !399, line: 521, baseType: !606, size: 64, offset: 6848)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmu_notifier_subscriptions", file: !399, line: 521, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_pending", scope: !402, file: !399, line: 545, baseType: !234, size: 32, offset: 6912)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_batched", scope: !402, file: !399, line: 548, baseType: !610, size: 8, offset: 6944)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !235, line: 30, baseType: !611)
!611 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "uprobes_state", scope: !402, file: !399, line: 550, baseType: !613, offset: 6952)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uprobes_state", file: !614, line: 142, elements: !195)
!614 = !DIFile(filename: "./include/linux/uprobes.h", directory: "/home/lizy2001/genbc/linux")
!615 = !DIDerivedType(tag: DW_TAG_member, name: "async_put_work", scope: !402, file: !399, line: 554, baseType: !616, size: 256, offset: 6976)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !617, line: 102, size: 256, elements: !618)
!617 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !616, file: !617, line: 103, baseType: !443, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !616, file: !617, line: 104, baseType: !260, size: 128, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !616, file: !617, line: 105, baseType: !622, size: 64, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !617, line: 21, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pasid", scope: !402, file: !399, line: 557, baseType: !223, size: 32, offset: 7232)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_bitmap", scope: !398, file: !399, line: 565, baseType: !629, offset: 7296)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: -1)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !214, file: !215, line: 758, baseType: !397, size: 64, offset: 3968)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !214, file: !215, line: 761, baseType: !634, size: 320, offset: 4032)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !518, line: 34, size: 320, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !634, file: !518, line: 35, baseType: !267, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !634, file: !518, line: 36, baseType: !638, size: 256, offset: 64)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 256, elements: !522)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !214, file: !215, line: 766, baseType: !92, size: 32, offset: 4352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !214, file: !215, line: 767, baseType: !92, size: 32, offset: 4384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !214, file: !215, line: 768, baseType: !92, size: 32, offset: 4416)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !214, file: !215, line: 770, baseType: !92, size: 32, offset: 4448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !214, file: !215, line: 772, baseType: !208, size: 64, offset: 4480)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !214, file: !215, line: 775, baseType: !7, size: 32, offset: 4544)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !214, file: !215, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !214, file: !215, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !214, file: !215, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !214, file: !215, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !214, file: !215, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !214, file: !215, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !214, file: !215, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !214, file: !215, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !214, file: !215, line: 831, baseType: !208, size: 64, offset: 4672)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !214, file: !215, line: 833, baseType: !655, size: 384, offset: 4736)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !656)
!656 = !{!657, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !655, file: !12, line: 26, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DISubroutineType(types: !660)
!660 = !{!65, !661}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, scope: !655, file: !12, line: 27, baseType: !663, size: 320, offset: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !655, file: !12, line: 27, size: 320, elements: !664)
!664 = !{!665, !675, !702}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !663, file: !12, line: 36, baseType: !666, size: 320)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !663, file: !12, line: 29, size: 320, elements: !667)
!667 = !{!668, !670, !671, !672, !673, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !666, file: !12, line: 30, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !666, file: !12, line: 31, baseType: !223, size: 32, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !666, file: !12, line: 32, baseType: !223, size: 32, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !666, file: !12, line: 33, baseType: !223, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !666, file: !12, line: 34, baseType: !267, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !666, file: !12, line: 35, baseType: !669, size: 64, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !663, file: !12, line: 46, baseType: !676, size: 192)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !663, file: !12, line: 38, size: 192, elements: !677)
!677 = !{!678, !679, !680, !701}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !676, file: !12, line: 39, baseType: !349, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !676, file: !12, line: 41, baseType: !681, size: 64, offset: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !676, file: !12, line: 41, size: 64, elements: !682)
!682 = !{!683, !691}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !681, file: !12, line: 42, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !686, line: 7, size: 128, elements: !687)
!686 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!687 = !{!688, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !685, file: !686, line: 8, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !351, line: 93, baseType: !299)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !685, file: !686, line: 9, baseType: !299, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !681, file: !12, line: 43, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !694, line: 7, size: 64, elements: !695)
!694 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!695 = !{!696, !700}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !693, file: !694, line: 8, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !694, line: 5, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !106, line: 20, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !108, line: 26, baseType: !92)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !693, file: !694, line: 9, baseType: !698, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !676, file: !12, line: 45, baseType: !267, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !663, file: !12, line: 54, baseType: !703, size: 256)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !663, file: !12, line: 48, size: 256, elements: !704)
!704 = !{!705, !708, !709, !710, !711}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !703, file: !12, line: 49, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !703, file: !12, line: 50, baseType: !92, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !703, file: !12, line: 51, baseType: !92, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !703, file: !12, line: 52, baseType: !208, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !703, file: !12, line: 53, baseType: !208, size: 64, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !214, file: !215, line: 835, baseType: !713, size: 32, offset: 5120)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !235, line: 22, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !351, line: 28, baseType: !92)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !214, file: !215, line: 836, baseType: !713, size: 32, offset: 5152)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !214, file: !215, line: 840, baseType: !208, size: 64, offset: 5184)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !214, file: !215, line: 849, baseType: !213, size: 64, offset: 5248)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !215, line: 852, baseType: !213, size: 64, offset: 5312)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !214, file: !215, line: 857, baseType: !260, size: 128, offset: 5376)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !214, file: !215, line: 858, baseType: !260, size: 128, offset: 5504)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !214, file: !215, line: 859, baseType: !213, size: 64, offset: 5632)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !214, file: !215, line: 867, baseType: !260, size: 128, offset: 5696)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !214, file: !215, line: 868, baseType: !260, size: 128, offset: 5824)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !214, file: !215, line: 871, baseType: !725, size: 64, offset: 5952)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !727, line: 59, size: 768, elements: !728)
!727 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!728 = !{!729, !730, !731, !732, !743, !744, !751, !760}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !726, file: !727, line: 61, baseType: !229, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !726, file: !727, line: 62, baseType: !7, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !726, file: !727, line: 63, baseType: !475, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !726, file: !727, line: 65, baseType: !733, size: 256, offset: 64)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 256, elements: !522)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !235, line: 182, size: 64, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !734, file: !235, line: 183, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !235, line: 186, size: 128, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !235, line: 187, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !738, file: !235, line: 187, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !726, file: !727, line: 66, baseType: !734, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !726, file: !727, line: 68, baseType: !745, size: 128, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !746, line: 40, baseType: !747)
!746 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !746, line: 36, size: 128, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !747, file: !746, line: 37, baseType: !475)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !747, file: !746, line: 38, baseType: !260, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !726, file: !727, line: 69, baseType: !752, size: 128, align: 64, offset: 512)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !235, line: 216, size: 128, align: 64, elements: !753)
!753 = !{!754, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !235, line: 217, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !752, file: !235, line: 218, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !755}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !726, file: !727, line: 70, baseType: !761, size: 128, offset: 640)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 128, elements: !390)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !727, line: 54, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !762, file: !727, line: 55, baseType: !92, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !762, file: !727, line: 56, baseType: !766, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !727, line: 56, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !214, file: !215, line: 872, baseType: !769, size: 512, offset: 6016)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 512, elements: !522)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !214, file: !215, line: 873, baseType: !260, size: 128, offset: 6528)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !214, file: !215, line: 874, baseType: !260, size: 128, offset: 6656)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !214, file: !215, line: 876, baseType: !773, size: 64, offset: 6784)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !214, file: !215, line: 879, baseType: !775, size: 64, offset: 6848)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !214, file: !215, line: 882, baseType: !775, size: 64, offset: 6912)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !214, file: !215, line: 884, baseType: !267, size: 64, offset: 6976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !214, file: !215, line: 885, baseType: !267, size: 64, offset: 7040)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !214, file: !215, line: 890, baseType: !267, size: 64, offset: 7104)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !214, file: !215, line: 891, baseType: !781, size: 128, offset: 7168)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !215, line: 242, size: 128, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !781, file: !215, line: 244, baseType: !267, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !781, file: !215, line: 245, baseType: !267, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !781, file: !215, line: 246, baseType: !187, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !214, file: !215, line: 900, baseType: !208, size: 64, offset: 7296)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !214, file: !215, line: 901, baseType: !208, size: 64, offset: 7360)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !214, file: !215, line: 904, baseType: !267, size: 64, offset: 7424)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !214, file: !215, line: 907, baseType: !267, size: 64, offset: 7488)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !214, file: !215, line: 910, baseType: !208, size: 64, offset: 7552)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !214, file: !215, line: 911, baseType: !208, size: 64, offset: 7616)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !214, file: !215, line: 914, baseType: !793, size: 640, offset: 7680)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !794, line: 123, size: 640, elements: !795)
!794 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!795 = !{!796, !804, !805}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !793, file: !794, line: 124, baseType: !797, size: 576)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 576, elements: !802)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !794, line: 108, size: 192, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !798, file: !794, line: 109, baseType: !267, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !798, file: !794, line: 110, baseType: !364, size: 128, offset: 64)
!802 = !{!803}
!803 = !DISubrange(count: 3)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !793, file: !794, line: 125, baseType: !7, size: 32, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !793, file: !794, line: 126, baseType: !7, size: 32, offset: 608)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !214, file: !215, line: 917, baseType: !807, size: 192, offset: 8320)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !794, line: 134, size: 192, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !807, file: !794, line: 135, baseType: !752, size: 128, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !807, file: !794, line: 136, baseType: !7, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !214, file: !215, line: 923, baseType: !812, size: 64, offset: 8512)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !815, line: 11, flags: DIFlagFwdDecl)
!815 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!816 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !214, file: !215, line: 926, baseType: !812, size: 64, offset: 8576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !214, file: !215, line: 929, baseType: !812, size: 64, offset: 8640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !214, file: !215, line: 933, baseType: !819, size: 64, offset: 8704)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !215, line: 933, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !214, file: !215, line: 943, baseType: !822, size: 128, offset: 8768)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 16)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !214, file: !215, line: 945, baseType: !826, size: 64, offset: 8896)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !215, line: 49, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !214, file: !215, line: 956, baseType: !829, size: 64, offset: 8960)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !215, line: 45, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !214, file: !215, line: 959, baseType: !832, size: 64, offset: 9024)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !215, line: 959, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !214, file: !215, line: 962, baseType: !835, size: 64, offset: 9088)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !215, line: 66, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !214, file: !215, line: 966, baseType: !838, size: 64, offset: 9152)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !840, line: 35, flags: DIFlagFwdDecl)
!840 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!841 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !214, file: !215, line: 969, baseType: !842, size: 64, offset: 9216)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !794, line: 223, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !214, file: !215, line: 970, baseType: !845, size: 64, offset: 9280)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !215, line: 62, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !214, file: !215, line: 971, baseType: !848, size: 64, offset: 9344)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !849, line: 25, baseType: !850)
!849 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !849, line: 23, size: 64, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !850, file: !849, line: 24, baseType: !389, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !214, file: !215, line: 972, baseType: !848, size: 64, offset: 9408)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !214, file: !215, line: 974, baseType: !848, size: 64, offset: 9472)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !214, file: !215, line: 975, baseType: !856, size: 192, offset: 9536)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !857, line: 30, size: 192, elements: !858)
!857 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !856, file: !857, line: 31, baseType: !260, size: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !856, file: !857, line: 32, baseType: !848, size: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !214, file: !215, line: 976, baseType: !208, size: 64, offset: 9728)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !214, file: !215, line: 977, baseType: !863, size: 64, offset: 9792)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !235, line: 55, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !351, line: 72, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !351, line: 16, baseType: !208)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !214, file: !215, line: 978, baseType: !7, size: 32, offset: 9856)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !214, file: !215, line: 980, baseType: !755, size: 64, offset: 9920)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !214, file: !215, line: 989, baseType: !869, size: 128, offset: 9984)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !870, line: 35, size: 128, elements: !871)
!870 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !869, file: !870, line: 36, baseType: !92, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !869, file: !870, line: 37, baseType: !234, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !869, file: !870, line: 38, baseType: !875, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !870, line: 23, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !214, file: !215, line: 992, baseType: !267, size: 64, offset: 10112)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !214, file: !215, line: 993, baseType: !267, size: 64, offset: 10176)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !214, file: !215, line: 996, baseType: !475, offset: 10240)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !214, file: !215, line: 999, baseType: !187, offset: 10240)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !214, file: !215, line: 1001, baseType: !882, size: 64, offset: 10240)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !215, line: 636, size: 64, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !215, line: 637, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !214, file: !215, line: 1005, baseType: !197, size: 128, offset: 10304)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !214, file: !215, line: 1007, baseType: !213, size: 64, offset: 10432)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !214, file: !215, line: 1009, baseType: !889, size: 64, offset: 10496)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !215, line: 1009, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !214, file: !215, line: 1043, baseType: !66, size: 64, offset: 10560)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !214, file: !215, line: 1046, baseType: !893, size: 64, offset: 10624)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !215, line: 41, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !214, file: !215, line: 1050, baseType: !896, size: 64, offset: 10688)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !215, line: 42, flags: DIFlagFwdDecl)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !214, file: !215, line: 1054, baseType: !899, size: 64, offset: 10752)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !215, line: 55, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !214, file: !215, line: 1056, baseType: !902, size: 64, offset: 10816)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !215, line: 40, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !214, file: !215, line: 1058, baseType: !905, size: 64, offset: 10880)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !215, line: 47, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !214, file: !215, line: 1061, baseType: !908, size: 64, offset: 10944)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !215, line: 43, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !214, file: !215, line: 1064, baseType: !208, size: 64, offset: 11008)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !214, file: !215, line: 1065, baseType: !912, size: 64, offset: 11072)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !857, line: 14, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !857, line: 12, size: 384, elements: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, scope: !914, file: !857, line: 13, baseType: !917, size: 384)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !914, file: !857, line: 13, size: 384, elements: !918)
!918 = !{!919, !920, !921, !922}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !917, file: !857, line: 13, baseType: !92, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !917, file: !857, line: 13, baseType: !92, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !917, file: !857, line: 13, baseType: !92, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !917, file: !857, line: 13, baseType: !923, size: 256, offset: 128)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !924, line: 32, size: 256, elements: !925)
!924 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!925 = !{!926, !932, !945, !951, !961, !981, !986}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !923, file: !924, line: 37, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !923, file: !924, line: 34, size: 64, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !927, file: !924, line: 35, baseType: !714, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !927, file: !924, line: 36, baseType: !931, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !351, line: 49, baseType: !7)
