; ModuleID = '../bcout/drivers/clocksource/dw_apb_timer.llvm.bc'
source_filename = "drivers/clocksource/dw_apb_timer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.cpumask = type { [1 x i64] }
%struct.kmem_cache = type opaque
%struct.dw_apb_clock_event_device = type { %struct.clock_event_device, %struct.dw_apb_timer, void (%struct.dw_apb_timer*)*, [32 x i8] }
%struct.clock_event_device = type { void (%struct.clock_event_device*)*, i32 (i64, %struct.clock_event_device*)*, i32 (i64, %struct.clock_event_device*)*, i64, i64, i64, i32, i32, i32, i32, i64, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, void (%struct.cpumask*)*, void (%struct.clock_event_device*)*, void (%struct.clock_event_device*)*, i64, i64, i8*, i32, i32, i32, %struct.cpumask*, %struct.list_head, %struct.module*, [48 x i8] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.module = type opaque
%struct.dw_apb_timer = type { i8*, i64, i32 }
%struct.dw_apb_clocksource = type { %struct.dw_apb_timer, %struct.clocksource }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !34, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/clocksource/dw_apb_timer.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3, !12, !21, !28}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_event_state", file: !4, line: 35, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/clockchips.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "CLOCK_EVT_STATE_DETACHED", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "CLOCK_EVT_STATE_SHUTDOWN", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "CLOCK_EVT_STATE_PERIODIC", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "CLOCK_EVT_STATE_ONESHOT", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "CLOCK_EVT_STATE_ONESHOT_STOPPED", value: 4, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vdso_clock_mode", file: !13, line: 11, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/vdso/clocksource.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18, !19, !20}
!15 = !DIEnumerator(name: "VDSO_CLOCKMODE_NONE", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "VDSO_CLOCKMODE_TSC", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "VDSO_CLOCKMODE_PVCLOCK", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "VDSO_CLOCKMODE_HVCLOCK", value: 3, isUnsigned: true)
!19 = !DIEnumerator(name: "VDSO_CLOCKMODE_MAX", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "VDSO_CLOCKMODE_TIMENS", value: 2147483647, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !22, line: 305, baseType: !5, size: 32, elements: !23)
!22 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!25 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!26 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!27 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irqreturn", file: !29, line: 11, baseType: !5, size: 32, elements: !30)
!29 = !DIFile(filename: "./include/linux/irqreturn.h", directory: "/home/lizy2001/genbc/linux")
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "IRQ_NONE", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "IRQ_HANDLED", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "IRQ_WAKE_THREAD", value: 2, isUnsigned: true)
!34 = !{!35, !37, !47, !48, !53, !54, !55, !135, !137}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !36, line: 148, baseType: !5)
!36 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !40, line: 17, size: 64, elements: !41)
!40 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!41 = !{!42}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !39, file: !40, line: 17, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 64, elements: !45)
!44 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!45 = !{!46}
!46 = !DISubrange(count: 1)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !49, line: 23, baseType: !50)
!49 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !51, line: 31, baseType: !52)
!51 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!52 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dw_apb_clock_event_device", file: !57, line: 25, size: 2560, elements: !58)
!57 = !DIFile(filename: "./include/linux/dw_apb_timer.h", directory: "/home/lizy2001/genbc/linux")
!58 = !{!59, !124, !130}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ced", scope: !56, file: !57, line: 26, baseType: !60, size: 2048, align: 512)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_event_device", file: !4, line: 100, size: 2048, align: 512, elements: !61)
!61 = !{!62, !67, !71, !80, !81, !82, !83, !86, !87, !88, !89, !90, !94, !95, !96, !97, !98, !102, !103, !104, !105, !106, !110, !111, !112, !113, !114, !120}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "event_handler", scope: !60, file: !4, line: 101, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "set_next_event", scope: !60, file: !4, line: 102, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{!47, !44, !66}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "set_next_ktime", scope: !60, file: !4, line: 103, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!47, !75, !66}
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !76, line: 29, baseType: !77)
!76 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !49, line: 22, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !51, line: 30, baseType: !79)
!79 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next_event", scope: !60, file: !4, line: 104, baseType: !75, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "max_delta_ns", scope: !60, file: !4, line: 105, baseType: !48, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "min_delta_ns", scope: !60, file: !4, line: 106, baseType: !48, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !60, file: !4, line: 107, baseType: !84, size: 32, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !49, line: 21, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !51, line: 27, baseType: !5)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !60, file: !4, line: 108, baseType: !84, size: 32, offset: 416)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "state_use_accessors", scope: !60, file: !4, line: 109, baseType: !3, size: 32, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !60, file: !4, line: 110, baseType: !5, size: 32, offset: 480)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !60, file: !4, line: 111, baseType: !44, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_periodic", scope: !60, file: !4, line: 113, baseType: !91, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{!47, !66}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_oneshot", scope: !60, file: !4, line: 114, baseType: !91, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_oneshot_stopped", scope: !60, file: !4, line: 115, baseType: !91, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_shutdown", scope: !60, file: !4, line: 116, baseType: !91, size: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tick_resume", scope: !60, file: !4, line: 117, baseType: !91, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !60, file: !4, line: 119, baseType: !99, size: 64, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !37}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !60, file: !4, line: 120, baseType: !63, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !60, file: !4, line: 121, baseType: !63, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "min_delta_ticks", scope: !60, file: !4, line: 122, baseType: !44, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_delta_ticks", scope: !60, file: !4, line: 123, baseType: !44, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !60, file: !4, line: 125, baseType: !107, size: 64, offset: 1216)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !60, file: !4, line: 126, baseType: !47, size: 32, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !60, file: !4, line: 127, baseType: !47, size: 32, offset: 1312)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "bound_on", scope: !60, file: !4, line: 128, baseType: !47, size: 32, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "cpumask", scope: !60, file: !4, line: 129, baseType: !37, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !60, file: !4, line: 130, baseType: !115, size: 128, offset: 1472)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !36, line: 178, size: 128, elements: !116)
!116 = !{!117, !119}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !36, line: 179, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !36, line: 179, baseType: !118, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !60, file: !4, line: 131, baseType: !121, size: 64, offset: 1600)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !123, line: 76, flags: DIFlagFwdDecl)
!123 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!124 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !56, file: !57, line: 27, baseType: !125, size: 192, offset: 2048)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dw_apb_timer", file: !57, line: 19, size: 192, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !125, file: !57, line: 20, baseType: !53, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !125, file: !57, line: 21, baseType: !44, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !125, file: !57, line: 22, baseType: !47, size: 32, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "eoi", scope: !56, file: !57, line: 28, baseType: !131, size: 64, offset: 2240)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !5)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dw_apb_clocksource", file: !57, line: 31, size: 1600, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !138, file: !57, line: 32, baseType: !125, size: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !138, file: !57, line: 33, baseType: !142, size: 1408, offset: 192)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clocksource", file: !143, line: 89, size: 1408, elements: !144)
!143 = !DIFile(filename: "./include/linux/clocksource.h", directory: "/home/lizy2001/genbc/linux")
!144 = !{!145, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !165, !169, !170, !171, !172, !173, !174, !175, !176}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !142, file: !143, line: 90, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!48, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !142, file: !143, line: 91, baseType: !48, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !142, file: !143, line: 92, baseType: !84, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !142, file: !143, line: 93, baseType: !84, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "max_idle_ns", scope: !142, file: !143, line: 94, baseType: !48, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "maxadj", scope: !142, file: !143, line: 95, baseType: !84, size: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "max_cycles", scope: !142, file: !143, line: 99, baseType: !48, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !143, line: 100, baseType: !107, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !142, file: !143, line: 101, baseType: !115, size: 128, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !142, file: !143, line: 102, baseType: !47, size: 32, offset: 576)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_clock_mode", scope: !142, file: !143, line: 103, baseType: !12, size: 32, offset: 608)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !143, line: 104, baseType: !44, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !142, file: !143, line: 106, baseType: !162, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!47, !149}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !142, file: !143, line: 107, baseType: !166, size: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !149}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !142, file: !143, line: 108, baseType: !166, size: 64, offset: 832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !142, file: !143, line: 109, baseType: !166, size: 64, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mark_unstable", scope: !142, file: !143, line: 110, baseType: !166, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "tick_stable", scope: !142, file: !143, line: 111, baseType: !166, size: 64, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "wd_list", scope: !142, file: !143, line: 116, baseType: !115, size: 128, offset: 1088)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "cs_last", scope: !142, file: !143, line: 117, baseType: !48, size: 64, offset: 1216)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "wd_last", scope: !142, file: !143, line: 118, baseType: !48, size: 64, offset: 1280)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !142, file: !143, line: 120, baseType: !121, size: 64, offset: 1344)
!177 = !{i32 7, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{i32 1, !"wchar_size", i32 2}
!180 = !{i32 1, !"Code Model", i32 2}
!181 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!182 = distinct !DISubprogram(name: "dw_apb_clockevent_pause", scope: !1, file: !1, line: 84, type: !183, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !185)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !55}
!185 = !{}
!186 = !DILocalVariable(name: "dw_ced", arg: 1, scope: !182, file: !1, line: 84, type: !55)
!187 = !DILocation(line: 84, column: 64, scope: !182)
!188 = !DILocation(line: 86, column: 14, scope: !182)
!189 = !DILocation(line: 86, column: 22, scope: !182)
!190 = !DILocation(line: 86, column: 28, scope: !182)
!191 = !DILocation(line: 86, column: 2, scope: !182)
!192 = !DILocation(line: 87, column: 20, scope: !182)
!193 = !DILocation(line: 87, column: 28, scope: !182)
!194 = !DILocation(line: 87, column: 2, scope: !182)
!195 = !DILocation(line: 88, column: 1, scope: !182)
!196 = distinct !DISubprogram(name: "apbt_disable_int", scope: !1, file: !1, line: 71, type: !132, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !185)
!197 = !DILocalVariable(name: "timer", arg: 1, scope: !196, file: !1, line: 71, type: !134)
!198 = !DILocation(line: 71, column: 51, scope: !196)
!199 = !DILocalVariable(name: "ctrl", scope: !196, file: !1, line: 73, type: !84)
!200 = !DILocation(line: 73, column: 6, scope: !196)
!201 = !DILocation(line: 73, column: 24, scope: !196)
!202 = !DILocation(line: 73, column: 13, scope: !196)
!203 = !DILocation(line: 75, column: 7, scope: !196)
!204 = !DILocation(line: 76, column: 14, scope: !196)
!205 = !DILocation(line: 76, column: 21, scope: !196)
!206 = !DILocation(line: 76, column: 2, scope: !196)
!207 = !DILocation(line: 77, column: 1, scope: !196)
!208 = distinct !DISubprogram(name: "dw_apb_clockevent_init", scope: !1, file: !1, line: 241, type: !209, scopeLine: 243, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !185)
!209 = !DISubroutineType(types: !210)
!210 = !{!55, !47, !107, !5, !53, !47, !44}
!211 = !DILocalVariable(name: "cpu", arg: 1, scope: !208, file: !1, line: 241, type: !47)
!212 = !DILocation(line: 241, column: 28, scope: !208)
!213 = !DILocalVariable(name: "name", arg: 2, scope: !208, file: !1, line: 241, type: !107)
!214 = !DILocation(line: 241, column: 45, scope: !208)
!215 = !DILocalVariable(name: "rating", arg: 3, scope: !208, file: !1, line: 241, type: !5)
!216 = !DILocation(line: 241, column: 60, scope: !208)
!217 = !DILocalVariable(name: "base", arg: 4, scope: !208, file: !1, line: 242, type: !53)
!218 = !DILocation(line: 242, column: 24, scope: !208)
!219 = !DILocalVariable(name: "irq", arg: 5, scope: !208, file: !1, line: 242, type: !47)
!220 = !DILocation(line: 242, column: 34, scope: !208)
!221 = !DILocalVariable(name: "freq", arg: 6, scope: !208, file: !1, line: 242, type: !44)
!222 = !DILocation(line: 242, column: 53, scope: !208)
!223 = !DILocalVariable(name: "dw_ced", scope: !208, file: !1, line: 244, type: !55)
!224 = !DILocation(line: 244, column: 36, scope: !208)
!225 = !DILocation(line: 245, column: 3, scope: !208)
!226 = !DILocalVariable(name: "err", scope: !208, file: !1, line: 246, type: !47)
!227 = !DILocation(line: 246, column: 6, scope: !208)
!228 = !DILocation(line: 248, column: 7, scope: !229)
!229 = distinct !DILexicalBlock(scope: !208, file: !1, line: 248, column: 6)
!230 = !DILocation(line: 248, column: 6, scope: !208)
!231 = !DILocation(line: 249, column: 3, scope: !229)
!232 = !DILocation(line: 251, column: 23, scope: !208)
!233 = !DILocation(line: 251, column: 2, scope: !208)
