; ModuleID = '../bcout/drivers/clocksource/hyperv_timer.llvm.bc'
source_filename = "drivers/clocksource/hyperv_timer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.clock_event_device = type { void (%struct.clock_event_device*)*, i32 (i64, %struct.clock_event_device*)*, i32 (i64, %struct.clock_event_device*)*, i64, i64, i64, i32, i32, i32, i32, i64, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, void (%struct.cpumask*)*, void (%struct.clock_event_device*)*, void (%struct.clock_event_device*)*, i64, i64, i8*, i32, i32, i32, %struct.cpumask*, %struct.list_head, %struct.module*, [48 x i8] }
%struct.cpumask = type { [1 x i64] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.module = type opaque
%struct.ms_hyperv_info = type { i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct.ms_hyperv_tsc_page, [4072 x i8] }
%struct.ms_hyperv_tsc_page = type { i32, i32, i64, i64 }
%struct.clocksource = type { i64 (%struct.clocksource*)*, i64, i32, i32, i64, i32, i64, i8*, %struct.list_head, i32, i32, i64, i32 (%struct.clocksource*)*, void (%struct.clocksource*)*, void (%struct.clocksource*)*, void (%struct.clocksource*)*, void (%struct.clocksource*)*, void (%struct.clocksource*)*, %struct.list_head, i64, i64, %struct.module* }

!130 = !DIEnumerator(name: "CPUHP_AP_HYPERV_TIMER_STARTING", value: 130)
!131 = !DIEnumerator(name: "CPUHP_AP_KVM_STARTING", value: 131)
!132 = !DIEnumerator(name: "CPUHP_AP_KVM_ARM_VGIC_INIT_STARTING", value: 132)
!133 = !DIEnumerator(name: "CPUHP_AP_KVM_ARM_VGIC_STARTING", value: 133)
!134 = !DIEnumerator(name: "CPUHP_AP_KVM_ARM_TIMER_STARTING", value: 134)
!135 = !DIEnumerator(name: "CPUHP_AP_DUMMY_TIMER_STARTING", value: 135)
!136 = !DIEnumerator(name: "CPUHP_AP_ARM_XEN_STARTING", value: 136)
!137 = !DIEnumerator(name: "CPUHP_AP_ARM_CORESIGHT_STARTING", value: 137)
!138 = !DIEnumerator(name: "CPUHP_AP_ARM_CORESIGHT_CTI_STARTING", value: 138)
!139 = !DIEnumerator(name: "CPUHP_AP_ARM64_ISNDEP_STARTING", value: 139)
!140 = !DIEnumerator(name: "CPUHP_AP_SMPCFD_DYING", value: 140)
!141 = !DIEnumerator(name: "CPUHP_AP_X86_TBOOT_DYING", value: 141)
!142 = !DIEnumerator(name: "CPUHP_AP_ARM_CACHE_B15_RAC_DYING", value: 142)
!143 = !DIEnumerator(name: "CPUHP_AP_ONLINE", value: 143)
!144 = !DIEnumerator(name: "CPUHP_TEARDOWN_CPU", value: 144)
!145 = !DIEnumerator(name: "CPUHP_AP_ONLINE_IDLE", value: 145)
!146 = !DIEnumerator(name: "CPUHP_AP_SMPBOOT_THREADS", value: 146)
!147 = !DIEnumerator(name: "CPUHP_AP_X86_VDSO_VMA_ONLINE", value: 147)
!148 = !DIEnumerator(name: "CPUHP_AP_IRQ_AFFINITY_ONLINE", value: 148)
!149 = !DIEnumerator(name: "CPUHP_AP_BLK_MQ_ONLINE", value: 149)
!150 = !DIEnumerator(name: "CPUHP_AP_ARM_MVEBU_SYNC_CLOCKS", value: 150)
!151 = !DIEnumerator(name: "CPUHP_AP_X86_INTEL_EPB_ONLINE", value: 151)
!152 = !DIEnumerator(name: "CPUHP_AP_PERF_ONLINE", value: 152)
!153 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_ONLINE", value: 153)
!154 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_UNCORE_ONLINE", value: 154)
!155 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_AMD_UNCORE_ONLINE", value: 155)
!156 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_AMD_POWER_ONLINE", value: 156)
!157 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_RAPL_ONLINE", value: 157)
!158 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_CQM_ONLINE", value: 158)
!159 = !DIEnumerator(name: "CPUHP_AP_PERF_X86_CSTATE_ONLINE", value: 159)
!160 = !DIEnumerator(name: "CPUHP_AP_PERF_S390_CF_ONLINE", value: 160)
!161 = !DIEnumerator(name: "CPUHP_AP_PERF_S390_SF_ONLINE", value: 161)
!162 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_CCI_ONLINE", value: 162)
!163 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_CCN_ONLINE", value: 163)
!164 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_HISI_DDRC_ONLINE", value: 164)
!165 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_HISI_HHA_ONLINE", value: 165)
!166 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_HISI_L3_ONLINE", value: 166)
!167 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_L2X0_ONLINE", value: 167)
!168 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_QCOM_L2_ONLINE", value: 168)
!169 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_QCOM_L3_ONLINE", value: 169)
!170 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_APM_XGENE_ONLINE", value: 170)
!171 = !DIEnumerator(name: "CPUHP_AP_PERF_ARM_CAVIUM_TX2_UNCORE_ONLINE", value: 171)
!172 = !DIEnumerator(name: "CPUHP_AP_PERF_POWERPC_NEST_IMC_ONLINE", value: 172)
!173 = !DIEnumerator(name: "CPUHP_AP_PERF_POWERPC_CORE_IMC_ONLINE", value: 173)
!174 = !DIEnumerator(name: "CPUHP_AP_PERF_POWERPC_THREAD_IMC_ONLINE", value: 174)
!175 = !DIEnumerator(name: "CPUHP_AP_PERF_POWERPC_TRACE_IMC_ONLINE", value: 175)
!176 = !DIEnumerator(name: "CPUHP_AP_PERF_POWERPC_HV_24x7_ONLINE", value: 176)
!177 = !DIEnumerator(name: "CPUHP_AP_PERF_POWERPC_HV_GPCI_ONLINE", value: 177)
!178 = !DIEnumerator(name: "CPUHP_AP_WATCHDOG_ONLINE", value: 178)
!179 = !DIEnumerator(name: "CPUHP_AP_WORKQUEUE_ONLINE", value: 179)
!180 = !DIEnumerator(name: "CPUHP_AP_RCUTREE_ONLINE", value: 180)
!181 = !DIEnumerator(name: "CPUHP_AP_BASE_CACHEINFO_ONLINE", value: 181)
!182 = !DIEnumerator(name: "CPUHP_AP_ONLINE_DYN", value: 182)
!183 = !DIEnumerator(name: "CPUHP_AP_ONLINE_DYN_END", value: 212)
!184 = !DIEnumerator(name: "CPUHP_AP_X86_HPET_ONLINE", value: 213)
!185 = !DIEnumerator(name: "CPUHP_AP_X86_KVM_CLK_ONLINE", value: 214)
!186 = !DIEnumerator(name: "CPUHP_AP_ACTIVE", value: 215)
!187 = !DIEnumerator(name: "CPUHP_ONLINE", value: 216)
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !189, line: 10, baseType: !7, size: 32, elements: !190)
!189 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!190 = !{!191, !192}
!191 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!192 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!193 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vdso_clock_mode", file: !194, line: 11, baseType: !7, size: 32, elements: !195)
!194 = !DIFile(filename: "./include/vdso/clocksource.h", directory: "/home/lizy2001/genbc/linux")
!195 = !{!196, !197, !198, !199, !200, !201}
!196 = !DIEnumerator(name: "VDSO_CLOCKMODE_NONE", value: 0, isUnsigned: true)
!197 = !DIEnumerator(name: "VDSO_CLOCKMODE_TSC", value: 1, isUnsigned: true)
!198 = !DIEnumerator(name: "VDSO_CLOCKMODE_PVCLOCK", value: 2, isUnsigned: true)
!199 = !DIEnumerator(name: "VDSO_CLOCKMODE_HVCLOCK", value: 3, isUnsigned: true)
!200 = !DIEnumerator(name: "VDSO_CLOCKMODE_MAX", value: 4, isUnsigned: true)
!201 = !DIEnumerator(name: "VDSO_CLOCKMODE_TIMENS", value: 2147483647, isUnsigned: true)
!202 = !{!203, !283, !251, !233, !214, !284, !16, !228, !285, !288, !291, !294, !295}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_event_device", file: !6, line: 100, size: 2048, align: 512, elements: !205)
!205 = !{!206, !210, !215, !226, !227, !231, !232, !235, !236, !237, !238, !239, !243, !244, !245, !246, !247, !260, !261, !262, !263, !264, !268, !269, !270, !271, !272, !279}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "event_handler", scope: !204, file: !6, line: 101, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !203}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "set_next_event", scope: !204, file: !6, line: 102, baseType: !211, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!16, !214, !203}
!214 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "set_next_ktime", scope: !204, file: !6, line: 103, baseType: !216, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!16, !219, !203}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !220, line: 29, baseType: !221)
!220 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !222, line: 22, baseType: !223)
!222 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !224, line: 30, baseType: !225)
!224 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!225 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next_event", scope: !204, file: !6, line: 104, baseType: !219, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "max_delta_ns", scope: !204, file: !6, line: 105, baseType: !228, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !222, line: 23, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !224, line: 31, baseType: !230)
!230 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "min_delta_ns", scope: !204, file: !6, line: 106, baseType: !228, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !204, file: !6, line: 107, baseType: !233, size: 32, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !222, line: 21, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !224, line: 27, baseType: !7)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !204, file: !6, line: 108, baseType: !233, size: 32, offset: 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "state_use_accessors", scope: !204, file: !6, line: 109, baseType: !5, size: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !204, file: !6, line: 110, baseType: !7, size: 32, offset: 480)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !204, file: !6, line: 111, baseType: !214, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_periodic", scope: !204, file: !6, line: 113, baseType: !240, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!16, !203}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_oneshot", scope: !204, file: !6, line: 114, baseType: !240, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_oneshot_stopped", scope: !204, file: !6, line: 115, baseType: !240, size: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_shutdown", scope: !204, file: !6, line: 116, baseType: !240, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tick_resume", scope: !204, file: !6, line: 117, baseType: !240, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !204, file: !6, line: 119, baseType: !248, size: 64, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !254, line: 17, size: 64, elements: !255)
!254 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !253, file: !254, line: 17, baseType: !257, size: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 64, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 1)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !204, file: !6, line: 120, baseType: !207, size: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !204, file: !6, line: 121, baseType: !207, size: 64, offset: 1024)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "min_delta_ticks", scope: !204, file: !6, line: 122, baseType: !214, size: 64, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "max_delta_ticks", scope: !204, file: !6, line: 123, baseType: !214, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !6, line: 125, baseType: !265, size: 64, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !204, file: !6, line: 126, baseType: !16, size: 32, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !204, file: !6, line: 127, baseType: !16, size: 32, offset: 1312)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bound_on", scope: !204, file: !6, line: 128, baseType: !16, size: 32, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cpumask", scope: !204, file: !6, line: 129, baseType: !251, size: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !204, file: !6, line: 130, baseType: !273, size: 128, offset: 1472)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !274, line: 178, size: 128, elements: !275)
!274 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!275 = !{!276, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !274, line: 179, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !273, file: !274, line: 179, baseType: !277, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !204, file: !6, line: 131, baseType: !280, size: 64, offset: 1600)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !282, line: 76, flags: DIFlagFwdDecl)
!282 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !230)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !225)
!294 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!296 = !{!0, !297, !299, !303, !305, !307, !309, !314, !336, !373}
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "hv_sched_clock_offset", scope: !2, file: !3, line: 26, type: !228, isLocal: true, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "direct_mode_enabled", scope: !2, file: !3, line: 44, type: !301, isLocal: true, isDefinition: true)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !274, line: 30, baseType: !302)
!302 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "stimer0_irq", scope: !2, file: !3, line: 46, type: !16, isLocal: true, isDefinition: true)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "stimer0_vector", scope: !2, file: !3, line: 47, type: !16, isLocal: true, isDefinition: true)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "stimer0_message_sint", scope: !2, file: !3, line: 48, type: !16, isLocal: true, isDefinition: true)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "hv_read_reference_counter", scope: !2, file: !3, line: 315, type: !311, isLocal: false, isDefinition: true)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!228}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "tsc_pg", scope: !2, file: !3, line: 321, type: !316, isLocal: true, isDefinition: true, align: 32768)
!316 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !3, line: 318, size: 32768, elements: !317)
!317 = !{!318, !329}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !316, file: !3, line: 319, baseType: !319, size: 192)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ms_hyperv_tsc_page", file: !320, line: 97, size: 192, elements: !321)
!320 = !DIFile(filename: "./include/asm-generic/hyperv-tlfs.h", directory: "/home/lizy2001/genbc/linux")
!321 = !{!322, !324, !325, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_sequence", scope: !319, file: !320, line: 98, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !233)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !319, file: !320, line: 99, baseType: !233, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_scale", scope: !319, file: !320, line: 100, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !228)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tsc_offset", scope: !319, file: !320, line: 101, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !221)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !316, file: !3, line: 320, baseType: !330, size: 32768)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32768, elements: !334)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !222, line: 17, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !224, line: 21, baseType: !333)
!333 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!334 = !{!335}
!335 = !DISubrange(count: 4096)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "hyperv_cs_tsc", scope: !2, file: !3, line: 379, type: !338, isLocal: true, isDefinition: true)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clocksource", file: !339, line: 89, size: 1408, elements: !340)
!339 = !DIFile(filename: "./include/linux/clocksource.h", directory: "/home/lizy2001/genbc/linux")
!340 = !{!341, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !361, !365, !366, !367, !368, !369, !370, !371, !372}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !338, file: !339, line: 90, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DISubroutineType(types: !344)
!344 = !{!228, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !338, file: !339, line: 91, baseType: !228, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !338, file: !339, line: 92, baseType: !233, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !338, file: !339, line: 93, baseType: !233, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "max_idle_ns", scope: !338, file: !339, line: 94, baseType: !228, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "maxadj", scope: !338, file: !339, line: 95, baseType: !233, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "max_cycles", scope: !338, file: !339, line: 99, baseType: !228, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !338, file: !339, line: 100, baseType: !265, size: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !338, file: !339, line: 101, baseType: !273, size: 128, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !338, file: !339, line: 102, baseType: !16, size: 32, offset: 576)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_clock_mode", scope: !338, file: !339, line: 103, baseType: !193, size: 32, offset: 608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !338, file: !339, line: 104, baseType: !214, size: 64, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !338, file: !339, line: 106, baseType: !358, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!16, !345}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !338, file: !339, line: 107, baseType: !362, size: 64, offset: 768)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !345}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !338, file: !339, line: 108, baseType: !362, size: 64, offset: 832)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !338, file: !339, line: 109, baseType: !362, size: 64, offset: 896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mark_unstable", scope: !338, file: !339, line: 110, baseType: !362, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tick_stable", scope: !338, file: !339, line: 111, baseType: !362, size: 64, offset: 1024)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "wd_list", scope: !338, file: !339, line: 116, baseType: !273, size: 128, offset: 1088)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cs_last", scope: !338, file: !339, line: 117, baseType: !228, size: 64, offset: 1216)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "wd_last", scope: !338, file: !339, line: 118, baseType: !228, size: 64, offset: 1280)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !338, file: !339, line: 120, baseType: !280, size: 64, offset: 1344)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "hyperv_cs_msr", scope: !2, file: !3, line: 413, type: !338, isLocal: true, isDefinition: true)
!375 = !{!"rsp"}
!376 = !{i32 7, !"Dwarf Version", i32 4}
!377 = !{i32 2, !"Debug Info Version", i32 3}
!378 = !{i32 1, !"wchar_size", i32 2}
!379 = !{i32 1, !"Code Model", i32 2}
!380 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!381 = distinct !DISubprogram(name: "hv_stimer0_isr", scope: !3, file: !3, line: 55, type: !382, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{null}
!384 = !{}
!385 = !DILocalVariable(name: "ce", scope: !381, file: !3, line: 57, type: !203)
!386 = !DILocation(line: 57, column: 29, scope: !381)
!387 = !DILocation(line: 59, column: 7, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !3, line: 59, column: 7)
!389 = distinct !DILexicalBlock(scope: !381, file: !3, line: 59, column: 7)
!390 = !DILocalVariable(name: "__vpp_verify", scope: !391, file: !3, line: 59, type: !392)
!391 = distinct !DILexicalBlock(scope: !388, file: !3, line: 59, column: 7)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!394 = !DILocation(line: 59, column: 7, scope: !391)
!395 = !DILocation(line: 59, column: 7, scope: !389)
!396 = !DILocation(line: 59, column: 5, scope: !381)
!397 = !DILocation(line: 60, column: 2, scope: !381)
!398 = !DILocation(line: 60, column: 6, scope: !381)
!399 = !DILocation(line: 60, column: 20, scope: !381)
!400 = !DILocation(line: 61, column: 1, scope: !381)
!401 = distinct !DISubprogram(name: "hv_stimer_cleanup", scope: !3, file: !3, line: 141, type: !402, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!402 = !DISubroutineType(types: !403)
!403 = !{!16, !7}
!404 = !DILocalVariable(name: "cpu", arg: 1, scope: !401, file: !3, line: 141, type: !7)
!405 = !DILocation(line: 141, column: 36, scope: !401)
!406 = !DILocalVariable(name: "ce", scope: !401, file: !3, line: 143, type: !203)
!407 = !DILocation(line: 143, column: 29, scope: !401)
!408 = !DILocation(line: 145, column: 7, scope: !409)
!409 = distinct !DILexicalBlock(scope: !401, file: !3, line: 145, column: 6)
!410 = !DILocation(line: 145, column: 6, scope: !401)
!411 = !DILocation(line: 146, column: 3, scope: !409)
!412 = !DILocation(line: 162, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !401, file: !3, line: 162, column: 7)
!414 = !DILocation(line: 162, column: 7, scope: !415)
!415 = distinct !DILexicalBlock(scope: !413, file: !3, line: 162, column: 7)
!416 = !DILocalVariable(name: "__vpp_verify", scope: !417, file: !3, line: 162, type: !392)
!417 = distinct !DILexicalBlock(scope: !415, file: !3, line: 162, column: 7)
!418 = !DILocation(line: 162, column: 7, scope: !417)
!419 = !DILocation(line: 162, column: 5, scope: !401)
!420 = !DILocation(line: 163, column: 6, scope: !421)
!421 = distinct !DILexicalBlock(scope: !401, file: !3, line: 163, column: 6)
!422 = !DILocation(line: 163, column: 6, scope: !401)
!423 = !DILocation(line: 164, column: 18, scope: !421)
!424 = !DILocation(line: 164, column: 3, scope: !421)
!425 = !DILocation(line: 166, column: 29, scope: !421)
!426 = !DILocation(line: 166, column: 33, scope: !421)
!427 = !DILocation(line: 166, column: 3, scope: !421)
!428 = !DILocation(line: 168, column: 2, scope: !401)
!429 = !DILocation(line: 169, column: 1, scope: !401)
!430 = distinct !DISubprogram(name: "hv_ce_shutdown", scope: !3, file: !3, line: 75, type: !241, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!431 = !DILocalVariable(name: "evt", arg: 1, scope: !430, file: !3, line: 75, type: !203)
!432 = !DILocation(line: 75, column: 54, scope: !430)
!433 = !DILocation(line: 77, column: 2, scope: !430)
!434 = !DILocation(line: 78, column: 2, scope: !430)
!435 = !DILocation(line: 79, column: 6, scope: !436)
!436 = distinct !DILexicalBlock(scope: !430, file: !3, line: 79, column: 6)
!437 = !DILocation(line: 79, column: 6, scope: !430)
!438 = !DILocation(line: 80, column: 33, scope: !436)
!439 = !DILocation(line: 80, column: 3, scope: !436)
!440 = !DILocation(line: 82, column: 2, scope: !430)
!441 = distinct !DISubprogram(name: "hv_stimer_alloc", scope: !3, file: !3, line: 173, type: !442, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!442 = !DISubroutineType(types: !443)
!443 = !{!16}
!444 = !DILocalVariable(name: "ret", scope: !441, file: !3, line: 175, type: !16)
!445 = !DILocation(line: 175, column: 6, scope: !441)
!446 = !DILocation(line: 182, column: 18, scope: !447)
!447 = distinct !DILexicalBlock(scope: !441, file: !3, line: 182, column: 6)
!448 = !DILocation(line: 182, column: 8, scope: !447)
!449 = !DILocation(line: 182, column: 27, scope: !447)
!450 = !DILocation(line: 182, column: 6, scope: !441)
!451 = !DILocation(line: 183, column: 3, scope: !447)
!452 = !DILocation(line: 185, column: 19, scope: !441)
!453 = !DILocation(line: 185, column: 17, scope: !441)
!454 = !DILocation(line: 186, column: 7, scope: !455)
!455 = distinct !DILexicalBlock(scope: !441, file: !3, line: 186, column: 6)
!456 = !DILocation(line: 186, column: 6, scope: !441)
!457 = !DILocation(line: 187, column: 3, scope: !455)
!458 = !DILocation(line: 189, column: 34, scope: !441)
!459 = !DILocation(line: 189, column: 24, scope: !441)
!460 = !DILocation(line: 189, column: 48, scope: !441)
!461 = !DILocation(line: 189, column: 22, scope: !441)
!462 = !DILocation(line: 191, column: 6, scope: !463)
!463 = distinct !DILexicalBlock(scope: !441, file: !3, line: 191, column: 6)
!464 = !DILocation(line: 191, column: 6, scope: !441)
!465 = !DILocation(line: 192, column: 9, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !3, line: 191, column: 27)
!467 = !DILocation(line: 192, column: 7, scope: !466)
!468 = !DILocation(line: 194, column: 7, scope: !469)
!469 = distinct !DILexicalBlock(scope: !466, file: !3, line: 194, column: 7)
!470 = !DILocation(line: 194, column: 7, scope: !466)
!471 = !DILocation(line: 195, column: 4, scope: !469)
!472 = !DILocation(line: 202, column: 9, scope: !466)
!473 = !DILocation(line: 202, column: 7, scope: !466)
!474 = !DILocation(line: 205, column: 7, scope: !475)
!475 = distinct !DILexicalBlock(scope: !466, file: !3, line: 205, column: 7)
!476 = !DILocation(line: 205, column: 11, scope: !475)
!477 = !DILocation(line: 205, column: 7, scope: !466)
!478 = !DILocation(line: 206, column: 4, scope: !475)
!479 = !DILocation(line: 207, column: 2, scope: !466)
!480 = !DILocation(line: 208, column: 9, scope: !441)
!481 = !DILocation(line: 208, column: 2, scope: !441)
!482 = !DILabel(scope: !441, name: "free_stimer0_irq", file: !3, line: 210)
!483 = !DILocation(line: 210, column: 1, scope: !441)
!484 = !DILocation(line: 211, column: 24, scope: !441)
!485 = !DILocation(line: 211, column: 2, scope: !441)
!486 = !DILocation(line: 212, column: 14, scope: !441)
!487 = !DILocation(line: 212, column: 2, scope: !441)
!488 = !DILabel(scope: !441, name: "free_percpu", file: !3, line: 213)
!489 = !DILocation(line: 213, column: 1, scope: !441)
!490 = !DILocation(line: 214, column: 14, scope: !441)
!491 = !DILocation(line: 214, column: 2, scope: !441)
!492 = !DILocation(line: 215, column: 17, scope: !441)
!493 = !DILocation(line: 216, column: 9, scope: !441)
!494 = !DILocation(line: 216, column: 2, scope: !441)
!495 = !DILocation(line: 217, column: 1, scope: !441)
!496 = distinct !DISubprogram(name: "cpuhp_setup_state", scope: !15, file: !15, line: 218, type: !497, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!497 = !DISubroutineType(types: !498)
!498 = !{!16, !14, !265, !499, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!500 = !DILocalVariable(name: "state", arg: 1, scope: !496, file: !15, line: 218, type: !14)
!501 = !DILocation(line: 218, column: 54, scope: !496)
!502 = !DILocalVariable(name: "name", arg: 2, scope: !496, file: !15, line: 219, type: !265)
!503 = !DILocation(line: 219, column: 21, scope: !496)
!504 = !DILocalVariable(name: "startup", arg: 3, scope: !496, file: !15, line: 220, type: !499)
!505 = !DILocation(line: 220, column: 15, scope: !496)
!506 = !DILocalVariable(name: "teardown", arg: 4, scope: !496, file: !15, line: 221, type: !499)
!507 = !DILocation(line: 221, column: 15, scope: !496)
!508 = !DILocation(line: 223, column: 29, scope: !496)
!509 = !DILocation(line: 223, column: 36, scope: !496)
!510 = !DILocation(line: 223, column: 48, scope: !496)
!511 = !DILocation(line: 223, column: 57, scope: !496)
!512 = !DILocation(line: 223, column: 9, scope: !496)
!513 = !DILocation(line: 223, column: 2, scope: !496)
!514 = distinct !DISubprogram(name: "hv_stimer_init", scope: !3, file: !3, line: 115, type: !402, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!515 = !DILocalVariable(name: "cpu", arg: 1, scope: !514, file: !3, line: 115, type: !7)
!516 = !DILocation(line: 115, column: 40, scope: !514)
!517 = !DILocalVariable(name: "ce", scope: !514, file: !3, line: 117, type: !203)
!518 = !DILocation(line: 117, column: 29, scope: !514)
!519 = !DILocation(line: 119, column: 7, scope: !520)
!520 = distinct !DILexicalBlock(scope: !514, file: !3, line: 119, column: 6)
!521 = !DILocation(line: 119, column: 6, scope: !514)
!522 = !DILocation(line: 120, column: 3, scope: !520)
!523 = !DILocation(line: 122, column: 7, scope: !524)
!524 = distinct !DILexicalBlock(scope: !514, file: !3, line: 122, column: 7)
!525 = !DILocation(line: 122, column: 7, scope: !526)
!526 = distinct !DILexicalBlock(scope: !524, file: !3, line: 122, column: 7)
!527 = !DILocalVariable(name: "__vpp_verify", scope: !528, file: !3, line: 122, type: !392)
!528 = distinct !DILexicalBlock(scope: !526, file: !3, line: 122, column: 7)
!529 = !DILocation(line: 122, column: 7, scope: !528)
!530 = !DILocation(line: 122, column: 5, scope: !514)
!531 = !DILocation(line: 123, column: 2, scope: !514)
!532 = !DILocation(line: 123, column: 6, scope: !514)
!533 = !DILocation(line: 123, column: 11, scope: !514)
!534 = !DILocation(line: 124, column: 2, scope: !514)
!535 = !DILocation(line: 124, column: 6, scope: !514)
!536 = !DILocation(line: 124, column: 15, scope: !514)
!537 = !DILocation(line: 125, column: 16, scope: !514)
!538 = !DILocation(line: 125, column: 2, scope: !514)
!539 = !DILocation(line: 125, column: 6, scope: !514)
!540 = !DILocation(line: 125, column: 14, scope: !514)
!541 = !DILocation(line: 126, column: 2, scope: !514)
!542 = !DILocation(line: 126, column: 6, scope: !514)
!543 = !DILocation(line: 126, column: 13, scope: !514)
!544 = !DILocation(line: 127, column: 2, scope: !514)
!545 = !DILocation(line: 127, column: 6, scope: !514)
!546 = !DILocation(line: 127, column: 25, scope: !514)
!547 = !DILocation(line: 128, column: 2, scope: !514)
!548 = !DILocation(line: 128, column: 6, scope: !514)
!549 = !DILocation(line: 128, column: 24, scope: !514)
!550 = !DILocation(line: 129, column: 2, scope: !514)
!551 = !DILocation(line: 129, column: 6, scope: !514)
!552 = !DILocation(line: 129, column: 21, scope: !514)
!553 = !DILocation(line: 131, column: 34, scope: !514)
!554 = !DILocation(line: 131, column: 2, scope: !514)
!555 = !DILocation(line: 135, column: 2, scope: !514)
!556 = !DILocation(line: 136, column: 1, scope: !514)
!557 = distinct !DISubprogram(name: "hv_stimer_legacy_init", scope: !3, file: !3, line: 226, type: !558, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !7, !16}
!560 = !DILocalVariable(name: "cpu", arg: 1, scope: !557, file: !3, line: 226, type: !7)
!561 = !DILocation(line: 226, column: 41, scope: !557)
!562 = !DILocalVariable(name: "sint", arg: 2, scope: !557, file: !3, line: 226, type: !16)
!563 = !DILocation(line: 226, column: 50, scope: !557)
!564 = !DILocation(line: 228, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !557, file: !3, line: 228, column: 6)
!566 = !DILocation(line: 228, column: 6, scope: !557)
!567 = !DILocation(line: 229, column: 3, scope: !565)
!568 = !DILocation(line: 238, column: 25, scope: !557)
!569 = !DILocation(line: 238, column: 23, scope: !557)
!570 = !DILocation(line: 239, column: 23, scope: !557)
!571 = !DILocation(line: 239, column: 8, scope: !557)
!572 = !DILocation(line: 240, column: 1, scope: !557)
!573 = distinct !DISubprogram(name: "hv_stimer_legacy_cleanup", scope: !3, file: !3, line: 249, type: !574, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!574 = !DISubroutineType(types: !575)
!575 = !{null, !7}
!576 = !DILocalVariable(name: "cpu", arg: 1, scope: !573, file: !3, line: 249, type: !7)
!577 = !DILocation(line: 249, column: 44, scope: !573)
!578 = !DILocation(line: 251, column: 6, scope: !579)
!579 = distinct !DILexicalBlock(scope: !573, file: !3, line: 251, column: 6)
!580 = !DILocation(line: 251, column: 6, scope: !573)
!581 = !DILocation(line: 252, column: 3, scope: !579)
!582 = !DILocation(line: 253, column: 26, scope: !573)
!583 = !DILocation(line: 253, column: 8, scope: !573)
!584 = !DILocation(line: 254, column: 1, scope: !573)
!585 = distinct !DISubprogram(name: "hv_stimer_free", scope: !3, file: !3, line: 259, type: !382, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!586 = !DILocation(line: 261, column: 7, scope: !587)
!587 = distinct !DILexicalBlock(scope: !585, file: !3, line: 261, column: 6)
!588 = !DILocation(line: 261, column: 6, scope: !585)
!589 = !DILocation(line: 262, column: 3, scope: !587)
!590 = !DILocation(line: 264, column: 6, scope: !591)
!591 = distinct !DILexicalBlock(scope: !585, file: !3, line: 264, column: 6)
!592 = !DILocation(line: 264, column: 6, scope: !585)
!593 = !DILocation(line: 265, column: 3, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !3, line: 264, column: 27)
!595 = !DILocation(line: 266, column: 25, scope: !594)
!596 = !DILocation(line: 266, column: 3, scope: !594)
!597 = !DILocation(line: 267, column: 15, scope: !594)
!598 = !DILocation(line: 268, column: 2, scope: !594)
!599 = !DILocation(line: 269, column: 14, scope: !585)
!600 = !DILocation(line: 269, column: 2, scope: !585)
!601 = !DILocation(line: 270, column: 17, scope: !585)
!602 = !DILocation(line: 271, column: 1, scope: !585)
!603 = distinct !DISubprogram(name: "cpuhp_remove_state", scope: !15, file: !15, line: 341, type: !604, scopeLine: 342, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!604 = !DISubroutineType(types: !605)
!605 = !{null, !14}
!606 = !DILocalVariable(name: "state", arg: 1, scope: !603, file: !15, line: 341, type: !14)
!607 = !DILocation(line: 341, column: 56, scope: !603)
!608 = !DILocation(line: 343, column: 23, scope: !603)
!609 = !DILocation(line: 343, column: 2, scope: !603)
!610 = !DILocation(line: 344, column: 1, scope: !603)
!611 = distinct !DISubprogram(name: "hv_stimer_global_cleanup", scope: !3, file: !3, line: 278, type: !382, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!612 = !DILocalVariable(name: "cpu", scope: !611, file: !3, line: 280, type: !16)
!613 = !DILocation(line: 280, column: 6, scope: !611)
!614 = !DILocation(line: 286, column: 2, scope: !615)
!615 = distinct !DILexicalBlock(scope: !611, file: !3, line: 286, column: 2)
!616 = !DILocation(line: 286, column: 2, scope: !617)
!617 = distinct !DILexicalBlock(scope: !615, file: !3, line: 286, column: 2)
!618 = !DILocation(line: 287, column: 28, scope: !619)
!619 = distinct !DILexicalBlock(scope: !617, file: !3, line: 286, column: 28)
!620 = !DILocation(line: 287, column: 3, scope: !619)
!621 = !DILocation(line: 288, column: 2, scope: !619)
!622 = distinct !{!622, !614, !623}
!623 = !DILocation(line: 288, column: 2, scope: !615)
!624 = !DILocation(line: 295, column: 2, scope: !611)
!625 = !DILocation(line: 296, column: 1, scope: !611)
!626 = distinct !DISubprogram(name: "hv_get_tsc_page", scope: !3, file: !3, line: 323, type: !627, scopeLine: 324, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!627 = !DISubroutineType(types: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!630 = !DILocation(line: 325, column: 2, scope: !626)
!631 = distinct !DISubprogram(name: "hv_init_clocksource", scope: !3, file: !3, line: 453, type: !382, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !384)
!632 = !DILocalVariable(name: "sched_clock", arg: 1, scope: !633, file: !634, line: 63, type: !283)
!633 = distinct !DISubprogram(name: "hv_setup_sched_clock", scope: !634, file: !634, line: 63, type: !635, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!634 = !DIFile(filename: "./arch/x86/include/asm/mshyperv.h", directory: "/home/lizy2001/genbc/linux")
!635 = !DISubroutineType(types: !636)
!636 = !{null, !283}
!637 = !DILocation(line: 63, column: 56, scope: !633, inlinedAt: !638)
!638 = distinct !DILocation(line: 473, column: 2, scope: !631)
!639 = !DILocation(line: 463, column: 6, scope: !640)
!640 = distinct !DILexicalBlock(scope: !631, file: !3, line: 463, column: 6)
!641 = !DILocation(line: 463, column: 6, scope: !631)
!642 = !DILocation(line: 464, column: 3, scope: !640)
!643 = !DILocation(line: 466, column: 18, scope: !644)
!644 = distinct !DILexicalBlock(scope: !631, file: !3, line: 466, column: 6)
!645 = !DILocation(line: 466, column: 8, scope: !644)
!646 = !DILocation(line: 466, column: 27, scope: !644)
!647 = !DILocation(line: 466, column: 6, scope: !631)
!648 = !DILocation(line: 467, column: 3, scope: !644)
!649 = !DILocation(line: 469, column: 28, scope: !631)
!650 = !DILocation(line: 470, column: 2, scope: !631)
!651 = !DILocation(line: 472, column: 26, scope: !631)
!652 = !DILocation(line: 472, column: 24, scope: !631)
!653 = !DILocation(line: 66, column: 28, scope: !633, inlinedAt: !638)
!654 = !DILocation(line: 66, column: 26, scope: !633, inlinedAt: !638)
!655 = !DILocation(line: 474, column: 1, scope: !631)
!656 = distinct !DISubprogram(name: "hv_init_tsc_clocksource", scope: !3, file: !3, line: 421, type: !657, scopeLine: 422, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!657 = !DISubroutineType(types: !658)
!658 = !{!301}
!659 = !DILocation(line: 63, column: 56, scope: !633, inlinedAt: !660)
!660 = distinct !DILocation(line: 448, column: 2, scope: !656)
!661 = !DILocalVariable(name: "tsc_msr", scope: !656, file: !3, line: 423, type: !228)
!662 = !DILocation(line: 423, column: 7, scope: !656)
!663 = !DILocalVariable(name: "phys_addr", scope: !656, file: !3, line: 424, type: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !274, line: 153, baseType: !228)
!665 = !DILocation(line: 424, column: 14, scope: !656)
!666 = !DILocation(line: 426, column: 18, scope: !667)
!667 = distinct !DILexicalBlock(scope: !656, file: !3, line: 426, column: 6)
!668 = !DILocation(line: 426, column: 8, scope: !667)
!669 = !DILocation(line: 426, column: 27, scope: !667)
!670 = !DILocation(line: 426, column: 6, scope: !656)
!671 = !DILocation(line: 427, column: 3, scope: !667)
!672 = !DILocation(line: 429, column: 28, scope: !656)
!673 = !DILocation(line: 430, column: 27, scope: !656)
!674 = !DILocation(line: 430, column: 14, scope: !656)
!675 = !DILocation(line: 430, column: 12, scope: !656)
!676 = !DILocation(line: 439, column: 2, scope: !656)
!677 = !DILocation(line: 439, column: 2, scope: !678)
!678 = distinct !DILexicalBlock(scope: !656, file: !3, line: 439, column: 2)
!679 = !DILocation(line: 440, column: 10, scope: !656)
!680 = !DILocation(line: 441, column: 12, scope: !656)
!681 = !DILocation(line: 441, column: 20, scope: !656)
!682 = !DILocation(line: 441, column: 33, scope: !656)
!683 = !DILocation(line: 441, column: 26, scope: !656)
!684 = !DILocation(line: 441, column: 10, scope: !656)
!685 = !DILocation(line: 442, column: 2, scope: !656)
!686 = !DILocation(line: 444, column: 2, scope: !656)
!687 = !DILocation(line: 445, column: 2, scope: !656)
!688 = !DILocation(line: 447, column: 26, scope: !656)
!689 = !DILocation(line: 447, column: 24, scope: !656)
!690 = !DILocation(line: 66, column: 28, scope: !633, inlinedAt: !660)
!691 = !DILocation(line: 66, column: 26, scope: !633, inlinedAt: !660)
!692 = !DILocation(line: 450, column: 2, scope: !656)
!693 = !DILocation(line: 451, column: 1, scope: !656)
!694 = distinct !DISubprogram(name: "read_hv_clock_msr", scope: !3, file: !3, line: 390, type: !312, scopeLine: 391, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!695 = !DILocalVariable(name: "current_tick", scope: !694, file: !3, line: 392, type: !228)
!696 = !DILocation(line: 392, column: 6, scope: !694)
!697 = !DILocation(line: 398, column: 2, scope: !694)
!698 = !DILocation(line: 398, column: 2, scope: !699)
!699 = distinct !DILexicalBlock(scope: !694, file: !3, line: 398, column: 2)
!700 = !DILocation(line: 399, column: 9, scope: !694)
!701 = !DILocation(line: 399, column: 2, scope: !694)
!702 = distinct !DISubprogram(name: "clocksource_register_hz", scope: !339, file: !339, line: 235, type: !703, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!703 = !DISubroutineType(types: !704)
!704 = !{!16, !345, !233}
!705 = !DILocalVariable(name: "cs", arg: 1, scope: !702, file: !339, line: 235, type: !345)
!706 = !DILocation(line: 235, column: 63, scope: !702)
!707 = !DILocalVariable(name: "hz", arg: 2, scope: !702, file: !339, line: 235, type: !233)
!708 = !DILocation(line: 235, column: 71, scope: !702)
!709 = !DILocation(line: 237, column: 38, scope: !702)
!710 = !DILocation(line: 237, column: 45, scope: !702)
!711 = !DILocation(line: 237, column: 9, scope: !702)
!712 = !DILocation(line: 237, column: 2, scope: !702)
!713 = distinct !DISubprogram(name: "read_hv_sched_clock_msr", scope: !3, file: !3, line: 407, type: !312, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!714 = !DILocation(line: 409, column: 10, scope: !713)
!715 = !DILocation(line: 409, column: 32, scope: !713)
!716 = !DILocation(line: 409, column: 30, scope: !713)
!717 = !DILocation(line: 409, column: 55, scope: !713)
!718 = !DILocation(line: 409, column: 2, scope: !713)
!719 = distinct !DISubprogram(name: "wrmsrl", scope: !720, file: !720, line: 202, type: !721, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!720 = !DIFile(filename: "./arch/x86/include/asm/paravirt.h", directory: "/home/lizy2001/genbc/linux")
!721 = !DISubroutineType(types: !722)
!722 = !{null, !7, !228}
!723 = !DILocalVariable(name: "msr", arg: 1, scope: !719, file: !720, line: 202, type: !7)
!724 = !DILocation(line: 202, column: 36, scope: !719)
!725 = !DILocalVariable(name: "val", arg: 2, scope: !719, file: !720, line: 202, type: !228)
!726 = !DILocation(line: 202, column: 45, scope: !719)
!727 = !DILocation(line: 204, column: 2, scope: !719)
!728 = !DILocation(line: 204, column: 2, scope: !729)
!729 = distinct !DILexicalBlock(scope: !719, file: !720, line: 204, column: 2)
!730 = !DILocation(line: 205, column: 1, scope: !719)
!731 = distinct !DISubprogram(name: "hv_disable_stimer0_percpu_irq", scope: !634, file: !634, line: 73, type: !732, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !16}
!734 = !DILocalVariable(name: "irq", arg: 1, scope: !731, file: !634, line: 73, type: !16)
!735 = !DILocation(line: 73, column: 54, scope: !731)
!736 = !DILocation(line: 73, column: 60, scope: !731)
!737 = distinct !DISubprogram(name: "paravirt_write_msr", scope: !720, file: !720, line: 168, type: !738, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !7, !7, !7}
!740 = !DILocalVariable(name: "msr", arg: 1, scope: !737, file: !720, line: 168, type: !7)
!741 = !DILocation(line: 168, column: 48, scope: !737)
!742 = !DILocalVariable(name: "low", arg: 2, scope: !737, file: !720, line: 169, type: !7)
!743 = !DILocation(line: 169, column: 20, scope: !737)
!744 = !DILocalVariable(name: "high", arg: 3, scope: !737, file: !720, line: 169, type: !7)
!745 = !DILocation(line: 169, column: 34, scope: !737)
!746 = !DILocalVariable(name: "__edi", scope: !747, file: !720, line: 171, type: !214)
!747 = distinct !DILexicalBlock(scope: !737, file: !720, line: 171, column: 2)
!748 = !DILocation(line: 171, column: 2, scope: !747)
!749 = !DILocalVariable(name: "__esi", scope: !747, file: !720, line: 171, type: !214)
!750 = !DILocalVariable(name: "__edx", scope: !747, file: !720, line: 171, type: !214)
!751 = !DILocalVariable(name: "__ecx", scope: !747, file: !720, line: 171, type: !214)
!752 = !DILocalVariable(name: "__eax", scope: !747, file: !720, line: 171, type: !214)
!753 = !{i32 -2145992479, i32 -2145987450, i32 -2145987216, i32 -2145987165, i32 -2145987137, i32 -2145987112, i32 -2145987428, i32 -2145987415, i32 -2145986977, i32 -2145986858, i32 -2145987323, i32 -2145987296, i32 -2145987268, i32 -2145987238}
!754 = !DILocation(line: 172, column: 1, scope: !737)
!755 = distinct !DISubprogram(name: "get_cpu_mask", scope: !254, file: !254, line: 884, type: !756, scopeLine: 885, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!756 = !DISubroutineType(types: !757)
!757 = !{!251, !7}
!758 = !DILocalVariable(name: "cpu", arg: 1, scope: !755, file: !254, line: 884, type: !7)
!759 = !DILocation(line: 884, column: 63, scope: !755)
!760 = !DILocalVariable(name: "p", scope: !755, file: !254, line: 886, type: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!763 = !DILocation(line: 886, column: 23, scope: !755)
!764 = !DILocation(line: 886, column: 46, scope: !755)
!765 = !DILocation(line: 886, column: 50, scope: !755)
!766 = !DILocation(line: 886, column: 44, scope: !755)
!767 = !DILocation(line: 886, column: 27, scope: !755)
!768 = !DILocation(line: 887, column: 7, scope: !755)
!769 = !DILocation(line: 887, column: 11, scope: !755)
!770 = !DILocation(line: 887, column: 4, scope: !755)
!771 = !DILocation(line: 888, column: 9, scope: !755)
!772 = !DILocation(line: 888, column: 2, scope: !755)
!773 = distinct !DISubprogram(name: "hv_ce_set_oneshot", scope: !3, file: !3, line: 85, type: !241, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!774 = !DILocalVariable(name: "evt", arg: 1, scope: !773, file: !3, line: 85, type: !203)
!775 = !DILocation(line: 85, column: 57, scope: !773)
!776 = !DILocalVariable(name: "timer_cfg", scope: !773, file: !3, line: 87, type: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "hv_stimer_config", file: !320, line: 275, size: 64, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "as_uint64", scope: !777, file: !320, line: 276, baseType: !228, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, scope: !777, file: !320, line: 277, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !777, file: !320, line: 277, size: 64, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !781, file: !320, line: 278, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !781, file: !320, line: 279, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lazy", scope: !781, file: !320, line: 280, baseType: !228, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "auto_enable", scope: !781, file: !320, line: 281, baseType: !228, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "apic_vector", scope: !781, file: !320, line: 282, baseType: !228, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "direct_mode", scope: !781, file: !320, line: 283, baseType: !228, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_z0", scope: !781, file: !320, line: 284, baseType: !228, size: 3, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sintx", scope: !781, file: !320, line: 285, baseType: !228, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_z1", scope: !781, file: !320, line: 286, baseType: !228, size: 44, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!792 = !DILocation(line: 87, column: 25, scope: !773)
!793 = !DILocation(line: 89, column: 12, scope: !773)
!794 = !DILocation(line: 89, column: 22, scope: !773)
!795 = !DILocation(line: 90, column: 12, scope: !773)
!796 = !DILocation(line: 90, column: 19, scope: !773)
!797 = !DILocation(line: 91, column: 12, scope: !773)
!798 = !DILocation(line: 91, column: 24, scope: !773)
!799 = !DILocation(line: 92, column: 6, scope: !800)
!800 = distinct !DILexicalBlock(scope: !773, file: !3, line: 92, column: 6)
!801 = !DILocation(line: 92, column: 6, scope: !773)
!802 = !DILocation(line: 97, column: 13, scope: !803)
!803 = distinct !DILexicalBlock(scope: !800, file: !3, line: 92, column: 27)
!804 = !DILocation(line: 97, column: 25, scope: !803)
!805 = !DILocation(line: 98, column: 27, scope: !803)
!806 = !DILocation(line: 98, column: 13, scope: !803)
!807 = !DILocation(line: 98, column: 25, scope: !803)
!808 = !DILocation(line: 99, column: 32, scope: !803)
!809 = !DILocation(line: 99, column: 3, scope: !803)
!810 = !DILocation(line: 100, column: 2, scope: !803)
!811 = !DILocation(line: 105, column: 13, scope: !812)
!812 = distinct !DILexicalBlock(scope: !800, file: !3, line: 100, column: 9)
!813 = !DILocation(line: 105, column: 25, scope: !812)
!814 = !DILocation(line: 106, column: 21, scope: !812)
!815 = !DILocation(line: 106, column: 13, scope: !812)
!816 = !DILocation(line: 106, column: 19, scope: !812)
!817 = !DILocation(line: 108, column: 2, scope: !773)
!818 = !DILocation(line: 109, column: 2, scope: !773)
!819 = distinct !DISubprogram(name: "hv_ce_set_next_event", scope: !3, file: !3, line: 64, type: !212, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!820 = !DILocalVariable(name: "delta", arg: 1, scope: !819, file: !3, line: 64, type: !214)
!821 = !DILocation(line: 64, column: 47, scope: !819)
!822 = !DILocalVariable(name: "evt", arg: 2, scope: !819, file: !3, line: 65, type: !203)
!823 = !DILocation(line: 65, column: 32, scope: !819)
!824 = !DILocalVariable(name: "current_tick", scope: !819, file: !3, line: 67, type: !228)
!825 = !DILocation(line: 67, column: 6, scope: !819)
!826 = !DILocation(line: 69, column: 17, scope: !819)
!827 = !DILocation(line: 69, column: 15, scope: !819)
!828 = !DILocation(line: 70, column: 18, scope: !819)
!829 = !DILocation(line: 70, column: 15, scope: !819)
!830 = !DILocation(line: 71, column: 2, scope: !819)
!831 = !DILocation(line: 72, column: 2, scope: !819)
!832 = distinct !DISubprogram(name: "hv_enable_stimer0_percpu_irq", scope: !634, file: !634, line: 72, type: !732, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!833 = !DILocalVariable(name: "irq", arg: 1, scope: !832, file: !634, line: 72, type: !16)
!834 = !DILocation(line: 72, column: 53, scope: !832)
!835 = !DILocation(line: 72, column: 59, scope: !832)
!836 = distinct !DISubprogram(name: "read_hv_clock_tsc", scope: !3, file: !3, line: 329, type: !312, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !384)
!837 = !DILocalVariable(name: "current_tick", scope: !836, file: !3, line: 331, type: !228)
!838 = !DILocation(line: 331, column: 6, scope: !836)
!839 = !DILocation(line: 331, column: 38, scope: !836)
!840 = !DILocation(line: 331, column: 21, scope: !836)
!841 = !DILocation(line: 333, column: 6, scope: !842)
!842 = distinct !DILexicalBlock(scope: !836, file: !3, line: 333, column: 6)
!843 = !DILocation(line: 333, column: 19, scope: !842)
!844 = !DILocation(line: 333, column: 6, scope: !836)
!845 = !DILocation(line: 334, column: 3, scope: !842)
!846 = !DILocation(line: 334, column: 3, scope: !847)
