; ModuleID = '../bcout/drivers/clocksource/i8253.llvm.bc'
source_filename = "drivers/clocksource/i8253.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.clock_event_device = type { {}*, i32 (i64, %struct.clock_event_device*)*, i32 (i64, %struct.clock_event_device*)*, i64, i64, i64, i32, i32, i32, i32, i64, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, i32 (%struct.clock_event_device*)*, void (%struct.cpumask*)*, {}*, {}*, i64, i64, i8*, i32, i32, i32, %struct.cpumask*, %struct.list_head, %struct.module*, [48 x i8] }
%struct.cpumask = type { [1 x i64] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.module = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "i8253_lock", scope: !2, file: !3, line: 20, type: !104, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/clocksource/i8253.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_event_state", file: !6, line: 35, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/clockchips.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "CLOCK_EVT_STATE_DETACHED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "CLOCK_EVT_STATE_SHUTDOWN", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "CLOCK_EVT_STATE_PERIODIC", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "CLOCK_EVT_STATE_ONESHOT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "CLOCK_EVT_STATE_ONESHOT_STOPPED", value: 4, isUnsigned: true)
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !17, line: 17, size: 64, elements: !18)
!17 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !16, file: !17, line: 17, baseType: !20, size: 64)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !22)
!21 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!22 = !{!23}
!23 = !DISubrange(count: 1)
!24 = !{!0, !25, !30}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "i8253_clear_counter_on_shutdown", scope: !2, file: !3, line: 28, type: !27, isLocal: false, isDefinition: true)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !28, line: 30, baseType: !29)
!28 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "i8253_clockevent", scope: !2, file: !3, line: 169, type: !32, isLocal: false, isDefinition: true)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_event_device", file: !6, line: 100, size: 2048, align: 512, elements: !33)
!33 = !{!34, !39, !44, !55, !56, !60, !61, !64, !65, !66, !67, !68, !72, !73, !74, !75, !76, !82, !83, !84, !85, !86, !90, !91, !92, !93, !94, !100}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "event_handler", scope: !32, file: !6, line: 101, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "set_next_event", scope: !32, file: !6, line: 102, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !21, !38}
!43 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "set_next_ktime", scope: !32, file: !6, line: 103, baseType: !45, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DISubroutineType(types: !47)
!47 = !{!43, !48, !38}
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !49, line: 29, baseType: !50)
!49 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !51, line: 22, baseType: !52)
!51 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !53, line: 30, baseType: !54)
!53 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!54 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next_event", scope: !32, file: !6, line: 104, baseType: !48, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "max_delta_ns", scope: !32, file: !6, line: 105, baseType: !57, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !51, line: 23, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !53, line: 31, baseType: !59)
!59 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "min_delta_ns", scope: !32, file: !6, line: 106, baseType: !57, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mult", scope: !32, file: !6, line: 107, baseType: !62, size: 32, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !51, line: 21, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !53, line: 27, baseType: !7)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !32, file: !6, line: 108, baseType: !62, size: 32, offset: 416)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "state_use_accessors", scope: !32, file: !6, line: 109, baseType: !5, size: 32, offset: 448)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !32, file: !6, line: 110, baseType: !7, size: 32, offset: 480)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "retries", scope: !32, file: !6, line: 111, baseType: !21, size: 64, offset: 512)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_periodic", scope: !32, file: !6, line: 113, baseType: !69, size: 64, offset: 576)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!43, !38}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_oneshot", scope: !32, file: !6, line: 114, baseType: !69, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_oneshot_stopped", scope: !32, file: !6, line: 115, baseType: !69, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_shutdown", scope: !32, file: !6, line: 116, baseType: !69, size: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tick_resume", scope: !32, file: !6, line: 117, baseType: !69, size: 64, offset: 832)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !32, file: !6, line: 119, baseType: !77, size: 64, offset: 896)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "suspend", scope: !32, file: !6, line: 120, baseType: !35, size: 64, offset: 960)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "resume", scope: !32, file: !6, line: 121, baseType: !35, size: 64, offset: 1024)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "min_delta_ticks", scope: !32, file: !6, line: 122, baseType: !21, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "max_delta_ticks", scope: !32, file: !6, line: 123, baseType: !21, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !6, line: 125, baseType: !87, size: 64, offset: 1216)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !32, file: !6, line: 126, baseType: !43, size: 32, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !32, file: !6, line: 127, baseType: !43, size: 32, offset: 1312)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "bound_on", scope: !32, file: !6, line: 128, baseType: !43, size: 32, offset: 1344)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "cpumask", scope: !32, file: !6, line: 129, baseType: !80, size: 64, offset: 1408)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !32, file: !6, line: 130, baseType: !95, size: 128, offset: 1472)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !28, line: 178, size: 128, elements: !96)
!96 = !{!97, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !28, line: 179, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !28, line: 179, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !32, file: !6, line: 131, baseType: !101, size: 64, offset: 1600)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !103, line: 76, flags: DIFlagFwdDecl)
!103 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !105, line: 29, baseType: !106)
!105 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !105, line: 20, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !106, file: !105, line: 21, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !110, line: 25, baseType: !111)
!110 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 25, elements: !112)
!112 = !{}
!113 = !{i32 7, !"Dwarf Version", i32 4}
!114 = !{i32 2, !"Debug Info Version", i32 3}
!115 = !{i32 1, !"wchar_size", i32 2}
!116 = !{i32 1, !"Code Model", i32 2}
!117 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!118 = distinct !DISubprogram(name: "pit_next_event", scope: !3, file: !3, line: 155, type: !41, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !112)
!119 = !DILocalVariable(name: "delta", arg: 1, scope: !118, file: !3, line: 155, type: !21)
!120 = !DILocation(line: 155, column: 41, scope: !118)
!121 = !DILocalVariable(name: "evt", arg: 2, scope: !118, file: !3, line: 155, type: !38)
!122 = !DILocation(line: 155, column: 75, scope: !118)
!123 = !DILocation(line: 157, column: 2, scope: !118)
!124 = !DILocation(line: 157, column: 2, scope: !125)
!125 = distinct !DILexicalBlock(scope: !118, file: !3, line: 157, column: 2)
!126 = !{i32 -2144105779}
!127 = !DILocation(line: 157, column: 2, scope: !128)
!128 = distinct !DILexicalBlock(scope: !125, file: !3, line: 157, column: 2)
!129 = !DILocation(line: 158, column: 9, scope: !118)
!130 = !DILocation(line: 158, column: 15, scope: !118)
!131 = !DILocation(line: 158, column: 2, scope: !118)
!132 = !DILocation(line: 159, column: 9, scope: !118)
!133 = !DILocation(line: 159, column: 15, scope: !118)
!134 = !DILocation(line: 159, column: 2, scope: !118)
!135 = !DILocation(line: 160, column: 2, scope: !118)
!136 = !DILocation(line: 160, column: 2, scope: !137)
!137 = distinct !DILexicalBlock(scope: !118, file: !3, line: 160, column: 2)
!138 = !{i32 -2144105501}
!139 = !DILocation(line: 160, column: 2, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !3, line: 160, column: 2)
!141 = !DILocation(line: 162, column: 2, scope: !118)
!142 = distinct !DISubprogram(name: "pit_set_periodic", scope: !3, file: !3, line: 137, type: !70, scopeLine: 138, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !112)
!143 = !DILocalVariable(name: "evt", arg: 1, scope: !142, file: !3, line: 137, type: !38)
!144 = !DILocation(line: 137, column: 56, scope: !142)
!145 = !DILocation(line: 139, column: 2, scope: !142)
!146 = !DILocation(line: 139, column: 2, scope: !147)
!147 = distinct !DILexicalBlock(scope: !142, file: !3, line: 139, column: 2)
!148 = !{i32 -2144106454}
!149 = !DILocation(line: 139, column: 2, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !3, line: 139, column: 2)
!151 = !DILocation(line: 142, column: 2, scope: !142)
!152 = !DILocation(line: 143, column: 2, scope: !142)
!153 = !DILocation(line: 144, column: 2, scope: !142)
!154 = !DILocation(line: 146, column: 2, scope: !142)
