; ModuleID = '../bcout/drivers/tty/vt/conmakehash.llvm.bc'
source_filename = "drivers/tty/vt/conmakehash.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [2 x i8] c"-\00", align 1
@stdin = external dso_local global %struct._IO_FILE*, align 8
@.str.1 = private unnamed_addr constant [6 x i8] c"stdin\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@unicount = common dso_local global [256 x i32] zeroinitializer, align 16, !dbg !0
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [28 x i8] c"%s: Warning: line too long\0A\00", align 1
@.str.4 = private unnamed_addr constant [20 x i8] c"Bad input line: %s\0A\00", align 1
@.str.5 = private unnamed_addr constant [49 x i8] c"%s: Glyph number (0x%x) larger than font length\0A\00", align 1
@.str.6 = private unnamed_addr constant [29 x i8] c"%s: Bad end of range (0x%x)\0A\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"idem\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "unicount", scope: !2, file: !3, line: 47, type: !33, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/tty/vt/conmakehash.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !{!26, !0}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "unitable", scope: !2, file: !3, line: 45, type: !28, isLocal: false, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1044480, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "unicode", file: !3, line: 22, baseType: !24)
!30 = !{!31, !32}
!31 = !DISubrange(count: 256)
!32 = !DISubrange(count: 255)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !34)
!34 = !{!31}
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!39 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 76, type: !40, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !45)
!40 = !DISubroutineType(types: !41)
!41 = !{!23, !23, !42}
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !{}
!46 = !DILocalVariable(name: "argc", arg: 1, scope: !39, file: !3, line: 76, type: !23)
!47 = !DILocation(line: 76, column: 14, scope: !39)
!48 = !DILocalVariable(name: "argv", arg: 2, scope: !39, file: !3, line: 76, type: !42)
!49 = !DILocation(line: 76, column: 26, scope: !39)
!50 = !DILocalVariable(name: "ctbl", scope: !39, file: !3, line: 78, type: !51)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !53, line: 7, baseType: !54)
!53 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !55, line: 49, size: 1728, elements: !56)
!55 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !72, !74, !75, !76, !80, !81, !83, !87, !90, !92, !95, !98, !99, !100, !104, !105}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !54, file: !55, line: 51, baseType: !23, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !54, file: !55, line: 54, baseType: !43, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !54, file: !55, line: 55, baseType: !43, size: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !54, file: !55, line: 56, baseType: !43, size: 64, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !54, file: !55, line: 57, baseType: !43, size: 64, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !54, file: !55, line: 58, baseType: !43, size: 64, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !54, file: !55, line: 59, baseType: !43, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !54, file: !55, line: 60, baseType: !43, size: 64, offset: 448)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !54, file: !55, line: 61, baseType: !43, size: 64, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !54, file: !55, line: 64, baseType: !43, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !54, file: !55, line: 65, baseType: !43, size: 64, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !54, file: !55, line: 66, baseType: !43, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !54, file: !55, line: 68, baseType: !70, size: 64, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !55, line: 36, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !54, file: !55, line: 70, baseType: !73, size: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !54, file: !55, line: 72, baseType: !23, size: 32, offset: 896)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !54, file: !55, line: 73, baseType: !23, size: 32, offset: 928)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !54, file: !55, line: 74, baseType: !77, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !78, line: 152, baseType: !79)
!78 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!79 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !54, file: !55, line: 77, baseType: !24, size: 16, offset: 1024)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !54, file: !55, line: 78, baseType: !82, size: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !54, file: !55, line: 79, baseType: !84, size: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !54, file: !55, line: 81, baseType: !88, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !55, line: 43, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !54, file: !55, line: 89, baseType: !91, size: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !78, line: 153, baseType: !79)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !54, file: !55, line: 91, baseType: !93, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !55, line: 37, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !54, file: !55, line: 92, baseType: !96, size: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !55, line: 38, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !54, file: !55, line: 93, baseType: !73, size: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !54, file: !55, line: 94, baseType: !22, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !54, file: !55, line: 95, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "llvm-project/build_10/lib/clang/10.0.1/include/stddef.h", directory: "/home/lizy2001")
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !54, file: !55, line: 96, baseType: !23, size: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !54, file: !55, line: 98, baseType: !106, size: 160, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !DILocation(line: 78, column: 9, scope: !39)
!110 = !DILocalVariable(name: "tblname", scope: !39, file: !3, line: 79, type: !43)
!111 = !DILocation(line: 79, column: 9, scope: !39)
!112 = !DILocalVariable(name: "buffer", scope: !39, file: !3, line: 80, type: !113)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 524288, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 65536)
!116 = !DILocation(line: 80, column: 8, scope: !39)
!117 = !DILocalVariable(name: "fontlen", scope: !39, file: !3, line: 81, type: !23)
!118 = !DILocation(line: 81, column: 7, scope: !39)
!119 = !DILocalVariable(name: "i", scope: !39, file: !3, line: 82, type: !23)
!120 = !DILocation(line: 82, column: 7, scope: !39)
!121 = !DILocalVariable(name: "nuni", scope: !39, file: !3, line: 82, type: !23)
!122 = !DILocation(line: 82, column: 10, scope: !39)
!123 = !DILocalVariable(name: "nent", scope: !39, file: !3, line: 82, type: !23)
!124 = !DILocation(line: 82, column: 16, scope: !39)
!125 = !DILocalVariable(name: "fp0", scope: !39, file: !3, line: 83, type: !23)
!126 = !DILocation(line: 83, column: 7, scope: !39)
!127 = !DILocalVariable(name: "fp1", scope: !39, file: !3, line: 83, type: !23)
!128 = !DILocation(line: 83, column: 12, scope: !39)
!129 = !DILocalVariable(name: "un0", scope: !39, file: !3, line: 83, type: !23)
!130 = !DILocation(line: 83, column: 17, scope: !39)
!131 = !DILocalVariable(name: "un1", scope: !39, file: !3, line: 83, type: !23)
!132 = !DILocation(line: 83, column: 22, scope: !39)
!133 = !DILocalVariable(name: "p", scope: !39, file: !3, line: 84, type: !43)
!134 = !DILocation(line: 84, column: 9, scope: !39)
!135 = !DILocalVariable(name: "p1", scope: !39, file: !3, line: 84, type: !43)
!136 = !DILocation(line: 84, column: 13, scope: !39)
!137 = !DILocation(line: 86, column: 8, scope: !138)
!138 = distinct !DILexicalBlock(scope: !39, file: !3, line: 86, column: 8)
!139 = !DILocation(line: 86, column: 13, scope: !138)
!140 = !DILocation(line: 86, column: 17, scope: !138)
!141 = !DILocation(line: 86, column: 20, scope: !138)
!142 = !DILocation(line: 86, column: 25, scope: !138)
!143 = !DILocation(line: 86, column: 8, scope: !39)
!144 = !DILocation(line: 87, column: 11, scope: !138)
!145 = !DILocation(line: 87, column: 5, scope: !138)
!146 = !DILocation(line: 89, column: 16, scope: !147)
!147 = distinct !DILexicalBlock(scope: !39, file: !3, line: 89, column: 8)
!148 = !DILocation(line: 89, column: 9, scope: !147)
!149 = !DILocation(line: 89, column: 8, scope: !39)
!150 = !DILocation(line: 91, column: 14, scope: !151)
!151 = distinct !DILexicalBlock(scope: !147, file: !3, line: 90, column: 5)
!152 = !DILocation(line: 91, column: 12, scope: !151)
!153 = !DILocation(line: 92, column: 15, scope: !151)
!154 = !DILocation(line: 93, column: 5, scope: !151)
!155 = !DILocation(line: 96, column: 30, scope: !156)
!156 = distinct !DILexicalBlock(scope: !147, file: !3, line: 95, column: 5)
!157 = !DILocation(line: 96, column: 28, scope: !156)
!158 = !DILocation(line: 96, column: 14, scope: !156)
!159 = !DILocation(line: 96, column: 12, scope: !156)
!160 = !DILocation(line: 97, column: 13, scope: !161)
!161 = distinct !DILexicalBlock(scope: !156, file: !3, line: 97, column: 12)
!162 = !DILocation(line: 97, column: 12, scope: !156)
!163 = !DILocation(line: 99, column: 11, scope: !164)
!164 = distinct !DILexicalBlock(scope: !161, file: !3, line: 98, column: 2)
!165 = !DILocation(line: 99, column: 4, scope: !164)
!166 = !DILocation(line: 100, column: 4, scope: !164)
!167 = !DILocation(line: 105, column: 11, scope: !39)
!168 = !DILocation(line: 109, column: 11, scope: !169)
!169 = distinct !DILexicalBlock(scope: !39, file: !3, line: 109, column: 3)
