; ModuleID = '../bcout/drivers/tty/vt/keyboard.llvm.bc'
source_filename = "drivers/tty/vt/keyboard.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.vt_spawn_console = type { %struct.spinlock, %struct.pid*, i32 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.pid = type { %struct.refcount_struct, i32, %struct.spinlock, [4 x %struct.hlist_head], %struct.hlist_head, %struct.wait_queue_head, %struct.callback_head, [1 x %struct.upid] }
%struct.refcount_struct = type { %struct.atomic_t }
%struct.atomic_t = type { i32 }
%struct.hlist_head = type { %struct.hlist_node* }
%struct.hlist_node = type { %struct.hlist_node*, %struct.hlist_node** }
%struct.wait_queue_head = type { %struct.spinlock, %struct.list_head }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.callback_head = type { %struct.callback_head*, void (%struct.callback_head*)* }
%struct.upid = type { i32, %struct.pid_namespace* }
%struct.pid_namespace = type opaque
%struct.atomic_notifier_head = type { %struct.spinlock, %struct.notifier_block* }
%struct.notifier_block = type { i32 (%struct.notifier_block*, i64, i8*)*, %struct.notifier_block*, i32 }
%struct.timer_list = type { %struct.hlist_node, i64, void (%struct.timer_list*)*, i32 }

!92 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !94, line: 10, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!95 = !{!96, !97}
!96 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vc_intensity", file: !99, line: 26, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "./include/linux/console_struct.h", directory: "/home/lizy2001/genbc/linux")
!100 = !{!101, !102, !103, !104}
!101 = !DIEnumerator(name: "VCI_HALF_BRIGHT", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "VCI_NORMAL", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "VCI_BOLD", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "VCI_MASK", value: 3, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 30, baseType: !107, size: 64, elements: !108)
!106 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!109 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!110 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!111 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!112 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!113 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!114 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!115 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!116 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!117 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!118 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!119 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!120 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!121 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!122 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!123 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!124 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!125 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!126 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!127 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!128 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!129 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!130 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!131 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!132 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!133 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!134 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!135 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!136 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!137 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !139, line: 651, baseType: !7, size: 32, elements: !140)
!139 = !DIFile(filename: "./include/linux/interrupt.h", directory: "/home/lizy2001/genbc/linux")
!140 = !{!141, !142}
!141 = !DIEnumerator(name: "TASKLET_STATE_SCHED", value: 0, isUnsigned: true)
!142 = !DIEnumerator(name: "TASKLET_STATE_RUN", value: 1, isUnsigned: true)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !144, line: 305, baseType: !7, size: 32, elements: !145)
!144 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!145 = !{!146, !147, !148, !149}
!146 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!147 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!148 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!149 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!150 = !{!151, !153, !7, !154, !155, !157, !158, !159, !160, !161, !163, !165, !166, !167, !107}
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !152, line: 148, baseType: !7)
!152 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!154 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!165 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_regs", file: !169, line: 56, size: 1344, elements: !170)
!169 = !DIFile(filename: "./arch/x86/include/asm/ptrace.h", directory: "/home/lizy2001/genbc/linux")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "r15", scope: !168, file: !169, line: 61, baseType: !158, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "r14", scope: !168, file: !169, line: 62, baseType: !158, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "r13", scope: !168, file: !169, line: 63, baseType: !158, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "r12", scope: !168, file: !169, line: 64, baseType: !158, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bp", scope: !168, file: !169, line: 65, baseType: !158, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "bx", scope: !168, file: !169, line: 66, baseType: !158, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "r11", scope: !168, file: !169, line: 68, baseType: !158, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "r10", scope: !168, file: !169, line: 69, baseType: !158, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "r9", scope: !168, file: !169, line: 70, baseType: !158, size: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "r8", scope: !168, file: !169, line: 71, baseType: !158, size: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ax", scope: !168, file: !169, line: 72, baseType: !158, size: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cx", scope: !168, file: !169, line: 73, baseType: !158, size: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dx", scope: !168, file: !169, line: 74, baseType: !158, size: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "si", scope: !168, file: !169, line: 75, baseType: !158, size: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "di", scope: !168, file: !169, line: 76, baseType: !158, size: 64, offset: 896)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "orig_ax", scope: !168, file: !169, line: 81, baseType: !158, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ip", scope: !168, file: !169, line: 83, baseType: !158, size: 64, offset: 1024)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !168, file: !169, line: 84, baseType: !158, size: 64, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !169, line: 85, baseType: !158, size: 64, offset: 1152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !168, file: !169, line: 86, baseType: !158, size: 64, offset: 1216)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !168, file: !169, line: 87, baseType: !158, size: 64, offset: 1280)
!192 = !{!0, !193, !199, !265, !270, !272, !274, !279, !306, !309, !324, !326, !358, !379, !382, !384, !389, !394, !399, !401, !406, !408, !410, !413, !415, !4512, !4514, !4520, !4522, !4524, !4638, !4645, !4651, !4654, !4656, !4662, !4666, !4668, !4670, !4673, !4675, !4677, !4682, !4684, !4687, !4692, !4694}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_brl_timeout232", scope: !2, file: !3, line: 927, type: !195, isLocal: true, isDefinition: true, align: 8)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 760, elements: !197)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!197 = !{!198}
!198 = !DISubrange(count: 95)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "__param_brl_timeout", scope: !2, file: !3, line: 928, type: !201, isLocal: true, isDefinition: true, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !203, line: 69, size: 320, elements: !204)
!203 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!204 = !{!205, !207, !211, !230, !237, !241, !244}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 70, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !202, file: !203, line: 71, baseType: !208, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !210, line: 76, flags: DIFlagFwdDecl)
!210 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !202, file: !203, line: 72, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !203, line: 47, size: 256, elements: !215)
!215 = !{!216, !217, !222, !226}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !214, file: !203, line: 49, baseType: !7, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !214, file: !203, line: 51, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!165, !206, !221}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !214, file: !203, line: 53, baseType: !223, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!165, !155, !221}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !214, file: !203, line: 55, baseType: !227, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !153}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !202, file: !203, line: 73, baseType: !231, size: 16, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !233, line: 19, baseType: !234)
!233 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !235, line: 24, baseType: !236)
!235 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!236 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 74, baseType: !238, size: 8, offset: 208)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !233, line: 16, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !235, line: 20, baseType: !240)
!240 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !202, file: !203, line: 75, baseType: !242, size: 8, offset: 216)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !233, line: 17, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !235, line: 21, baseType: !154)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !203, line: 76, baseType: !245, size: 64, offset: 256)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !203, line: 76, size: 64, elements: !246)
!246 = !{!247, !248, !255}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !245, file: !203, line: 77, baseType: !153, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !245, file: !203, line: 78, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !203, line: 86, size: 128, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !251, file: !203, line: 87, baseType: !7, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !251, file: !203, line: 88, baseType: !155, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !245, file: !203, line: 79, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !203, line: 92, size: 256, elements: !259)
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !258, file: !203, line: 94, baseType: !7, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !258, file: !203, line: 95, baseType: !7, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !258, file: !203, line: 96, baseType: !159, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !258, file: !203, line: 97, baseType: !212, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !258, file: !203, line: 98, baseType: !153, size: 64, offset: 192)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_brl_timeouttype233", scope: !2, file: !3, line: 928, type: !267, isLocal: true, isDefinition: true, align: 8)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 280, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 35)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_brl_nbchords234", scope: !2, file: !3, line: 931, type: !195, isLocal: true, isDefinition: true, align: 8)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "__param_brl_nbchords", scope: !2, file: !3, line: 932, type: !201, isLocal: true, isDefinition: true, align: 64)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_brl_nbchordstype235", scope: !2, file: !3, line: 932, type: !276, isLocal: true, isDefinition: true, align: 8)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 288, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 36)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "keyboard_tasklet", scope: !2, file: !3, line: 1245, type: !281, isLocal: false, isDefinition: true)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tasklet_struct", file: !139, line: 609, size: 320, elements: !282)
!282 = !{!283, !285, !286, !291, !294, !305}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !139, line: 611, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !281, file: !139, line: 612, baseType: !158, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !281, file: !139, line: 613, baseType: !287, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !152, line: 168, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 166, size: 32, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !288, file: !152, line: 167, baseType: !165, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "use_callback", scope: !281, file: !139, line: 614, baseType: !292, size: 8, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !152, line: 30, baseType: !293)
!293 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!294 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !139, line: 615, baseType: !295, size: 64, offset: 192)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !139, line: 615, size: 64, elements: !296)
!296 = !{!297, !301}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !295, file: !139, line: 616, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !158}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !295, file: !139, line: 617, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !284}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !281, file: !139, line: 619, baseType: !158, size: 64, offset: 256)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression(DW_OP_constu, 15, DW_OP_stack_value))
!307 = distinct !DIGlobalVariable(name: "NR_TYPES", scope: !2, file: !3, line: 122, type: !308, isLocal: true, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "kbd_table", scope: !2, file: !3, line: 112, type: !311, isLocal: true, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 2520, elements: !322)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kbd_struct", file: !313, line: 25, size: 40, elements: !314)
!313 = !DIFile(filename: "./include/linux/kbd_kern.h", directory: "/home/lizy2001/genbc/linux")
!314 = !{!315, !316, !317, !318, !319, !320, !321}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lockstate", scope: !312, file: !313, line: 27, baseType: !154, size: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "slockstate", scope: !312, file: !313, line: 38, baseType: !154, size: 8, offset: 8)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ledmode", scope: !312, file: !313, line: 40, baseType: !154, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ledflagstate", scope: !312, file: !313, line: 44, baseType: !154, size: 4, offset: 17, flags: DIFlagBitField, extraData: i64 16)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "default_ledflagstate", scope: !312, file: !313, line: 45, baseType: !154, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "kbdmode", scope: !312, file: !313, line: 51, baseType: !154, size: 3, offset: 28, flags: DIFlagBitField, extraData: i64 24)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "modeflags", scope: !312, file: !313, line: 58, baseType: !154, size: 5, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!322 = !{!323}
!323 = !DISubrange(count: 63)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ledioctl", scope: !2, file: !3, line: 142, type: !154, isLocal: true, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "keyboard_notifier_list", scope: !2, file: !3, line: 147, type: !328, isLocal: true, isDefinition: true)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "atomic_notifier_head", file: !329, line: 60, size: 64, elements: !330)
!329 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!330 = !{!331, !347}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !328, file: !329, line: 61, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !333, line: 83, baseType: !334)
!333 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !333, line: 71, elements: !335)
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !333, line: 72, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !333, line: 72, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !337, file: !333, line: 73, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !333, line: 20, elements: !341)
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !340, file: !333, line: 21, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !344, line: 25, baseType: !345)
!344 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 25, elements: !346)
!346 = !{}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !328, file: !329, line: 62, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !329, line: 54, size: 192, elements: !350)
!350 = !{!351, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !349, file: !329, line: 55, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !329, line: 51, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!165, !348, !158, !153}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !329, line: 56, baseType: !348, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !349, file: !329, line: 57, baseType: !165, size: 32, offset: 128)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "kd_mksound_timer", scope: !2, file: !3, line: 260, type: !360, isLocal: true, isDefinition: true)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_list", file: !361, line: 11, size: 320, elements: !362)
!361 = !DIFile(filename: "./include/linux/timer.h", directory: "/home/lizy2001/genbc/linux")
!362 = !{!363, !370, !371, !376}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !360, file: !361, line: 16, baseType: !364, size: 128)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !152, line: 186, size: 128, elements: !365)
!365 = !{!366, !368}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !152, line: 187, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !364, file: !152, line: 187, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !360, file: !361, line: 17, baseType: !158, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !360, file: !361, line: 18, baseType: !372, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375}
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !360, file: !361, line: 19, baseType: !377, size: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !233, line: 21, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !235, line: 27, baseType: !7)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "zero", scope: !381, file: !3, line: 255, type: !7, isLocal: true, isDefinition: true)
!381 = distinct !DISubprogram(name: "kd_nosound", scope: !3, file: !3, line: 253, type: !373, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !346)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "kbd_event_lock", scope: !2, file: !3, line: 125, type: !332, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "shift_down", scope: !2, file: !3, line: 129, type: !386, isLocal: true, isDefinition: true)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 72, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 9)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "key_down", scope: !2, file: !3, line: 128, type: !391, isLocal: true, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 768, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 12)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "__param_str_brl_timeout", scope: !2, file: !3, line: 928, type: !396, isLocal: true, isDefinition: true)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 168, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 21)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "brl_timeout", scope: !2, file: !3, line: 926, type: !7, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "__param_str_brl_nbchords", scope: !2, file: !3, line: 932, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 176, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 22)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "brl_nbchords", scope: !2, file: !3, line: 930, type: !7, isLocal: true, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "led_lock", scope: !2, file: !3, line: 126, type: !332, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "kbd", scope: !2, file: !3, line: 113, type: !412, isLocal: true, isDefinition: true)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "ledstate", scope: !2, file: !3, line: 141, type: !7, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "kbd_handler", scope: !2, file: !3, line: 1609, type: !417, isLocal: true, isDefinition: true)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_handler", file: !418, line: 302, size: 960, elements: !419)
!418 = !DIFile(filename: "./include/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!419 = !{!420, !421, !4460, !4466, !4470, !4474, !4501, !4505, !4506, !4507, !4508, !4509, !4510, !4511}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !417, file: !418, line: 304, baseType: !153, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !417, file: !418, line: 306, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425, !7, !7, !165}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_handle", file: !418, line: 337, size: 576, elements: !427)
!427 = !{!428, !429, !430, !431, !4456, !4458, !4459}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !426, file: !418, line: 339, baseType: !153, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !426, file: !418, line: 341, baseType: !165, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !418, line: 342, baseType: !206, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !426, file: !418, line: 344, baseType: !432, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_dev", file: !418, line: 131, size: 10432, elements: !434)
!434 = !{!435, !436, !437, !438, !446, !450, !451, !452, !453, !454, !455, !456, !457, !461, !462, !463, !464, !465, !466, !482, !487, !4396, !4399, !4400, !4401, !4403, !4406, !4416, !4417, !4418, !4419, !4420, !4424, !4428, !4432, !4436, !4437, !4438, !4439, !4440, !4441, !4442, !4443, !4444, !4445, !4446, !4453, !4454}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !418, line: 132, baseType: !206, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !433, file: !418, line: 133, baseType: !206, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "uniq", scope: !433, file: !418, line: 134, baseType: !206, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !433, file: !418, line: 135, baseType: !439, size: 64, offset: 192)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_id", file: !440, line: 59, size: 64, elements: !441)
!440 = !DIFile(filename: "./include/uapi/linux/input.h", directory: "/home/lizy2001/genbc/linux")
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bustype", scope: !439, file: !440, line: 60, baseType: !234, size: 16)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !439, file: !440, line: 61, baseType: !234, size: 16, offset: 16)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "product", scope: !439, file: !440, line: 62, baseType: !234, size: 16, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !439, file: !440, line: 63, baseType: !234, size: 16, offset: 48)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "propbit", scope: !433, file: !418, line: 137, baseType: !447, size: 64, offset: 256)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 1)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "evbit", scope: !433, file: !418, line: 139, baseType: !447, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "keybit", scope: !433, file: !418, line: 140, baseType: !391, size: 768, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "relbit", scope: !433, file: !418, line: 141, baseType: !447, size: 64, offset: 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "absbit", scope: !433, file: !418, line: 142, baseType: !447, size: 64, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mscbit", scope: !433, file: !418, line: 143, baseType: !447, size: 64, offset: 1280)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ledbit", scope: !433, file: !418, line: 144, baseType: !447, size: 64, offset: 1344)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sndbit", scope: !433, file: !418, line: 145, baseType: !447, size: 64, offset: 1408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !433, file: !418, line: 146, baseType: !458, size: 128, offset: 1472)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 128, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 2)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "swbit", scope: !433, file: !418, line: 147, baseType: !447, size: 64, offset: 1600)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "hint_events_per_packet", scope: !433, file: !418, line: 149, baseType: !7, size: 32, offset: 1664)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "keycodemax", scope: !433, file: !418, line: 151, baseType: !7, size: 32, offset: 1696)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "keycodesize", scope: !433, file: !418, line: 152, baseType: !7, size: 32, offset: 1728)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !433, file: !418, line: 153, baseType: !153, size: 64, offset: 1792)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "setkeycode", scope: !433, file: !418, line: 155, baseType: !467, size: 64, offset: 1856)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!165, !432, !470, !159}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "input_keymap_entry", file: !440, line: 114, size: 320, elements: !473)
!473 = !{!474, !475, !476, !477, !478}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !440, line: 116, baseType: !243, size: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !472, file: !440, line: 117, baseType: !243, size: 8, offset: 8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !472, file: !440, line: 118, baseType: !234, size: 16, offset: 16)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "keycode", scope: !472, file: !440, line: 119, baseType: !378, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scancode", scope: !472, file: !440, line: 120, baseType: !479, size: 256, offset: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 256, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "getkeycode", scope: !433, file: !418, line: 158, baseType: !483, size: 64, offset: 1920)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DISubroutineType(types: !485)
!485 = !{!165, !432, !486}
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ff", scope: !433, file: !418, line: 161, baseType: !488, size: 64, offset: 1984)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_device", file: !418, line: 534, size: 896, elements: !490)
!490 = !{!491, !560, !564, !568, !572, !573, !577, !578, !579, !600, !601, !602}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "upload", scope: !489, file: !418, line: 535, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DISubroutineType(types: !494)
!494 = !{!165, !432, !495, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_effect", file: !440, line: 450, size: 384, elements: !497)
!497 = !{!498, !499, !502, !503, !508, !513}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !440, line: 451, baseType: !234, size: 16)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !496, file: !440, line: 452, baseType: !500, size: 16, offset: 16)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !235, line: 23, baseType: !501)
!501 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !496, file: !440, line: 453, baseType: !234, size: 16, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "trigger", scope: !496, file: !440, line: 454, baseType: !504, size: 32, offset: 48)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_trigger", file: !440, line: 316, size: 32, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "button", scope: !504, file: !440, line: 317, baseType: !234, size: 16)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !504, file: !440, line: 318, baseType: !234, size: 16, offset: 16)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "replay", scope: !496, file: !440, line: 455, baseType: !509, size: 32, offset: 80)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_replay", file: !440, line: 306, size: 32, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !509, file: !440, line: 307, baseType: !234, size: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !509, file: !440, line: 308, baseType: !234, size: 16, offset: 16)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !496, file: !440, line: 463, baseType: !514, size: 256, offset: 128)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !496, file: !440, line: 457, size: 256, elements: !515)
!515 = !{!516, !527, !533, !545, !555}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !514, file: !440, line: 458, baseType: !517, size: 80)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_constant_effect", file: !440, line: 345, size: 80, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !517, file: !440, line: 346, baseType: !500, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !517, file: !440, line: 347, baseType: !521, size: 64, offset: 16)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_envelope", file: !440, line: 333, size: 64, elements: !522)
!522 = !{!523, !524, !525, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "attack_length", scope: !521, file: !440, line: 334, baseType: !234, size: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "attack_level", scope: !521, file: !440, line: 335, baseType: !234, size: 16, offset: 16)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "fade_length", scope: !521, file: !440, line: 336, baseType: !234, size: 16, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "fade_level", scope: !521, file: !440, line: 337, baseType: !234, size: 16, offset: 48)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ramp", scope: !514, file: !440, line: 459, baseType: !528, size: 96)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_ramp_effect", file: !440, line: 356, size: 96, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "start_level", scope: !528, file: !440, line: 357, baseType: !500, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "end_level", scope: !528, file: !440, line: 358, baseType: !500, size: 16, offset: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !528, file: !440, line: 359, baseType: !521, size: 64, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "periodic", scope: !514, file: !440, line: 460, baseType: !534, size: 256)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_periodic_effect", file: !440, line: 401, size: 256, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "waveform", scope: !534, file: !440, line: 402, baseType: !234, size: 16)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !534, file: !440, line: 403, baseType: !234, size: 16, offset: 16)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "magnitude", scope: !534, file: !440, line: 404, baseType: !500, size: 16, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !534, file: !440, line: 405, baseType: !500, size: 16, offset: 48)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !534, file: !440, line: 406, baseType: !234, size: 16, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "envelope", scope: !534, file: !440, line: 408, baseType: !521, size: 64, offset: 80)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "custom_len", scope: !534, file: !440, line: 410, baseType: !378, size: 32, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !534, file: !440, line: 411, baseType: !544, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "condition", scope: !514, file: !440, line: 461, baseType: !546, size: 192)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 192, elements: !459)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_condition_effect", file: !440, line: 372, size: 96, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "right_saturation", scope: !547, file: !440, line: 373, baseType: !234, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "left_saturation", scope: !547, file: !440, line: 374, baseType: !234, size: 16, offset: 16)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "right_coeff", scope: !547, file: !440, line: 376, baseType: !500, size: 16, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "left_coeff", scope: !547, file: !440, line: 377, baseType: !500, size: 16, offset: 48)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "deadband", scope: !547, file: !440, line: 379, baseType: !234, size: 16, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !547, file: !440, line: 380, baseType: !500, size: 16, offset: 80)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rumble", scope: !514, file: !440, line: 462, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ff_rumble_effect", file: !440, line: 422, size: 32, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "strong_magnitude", scope: !556, file: !440, line: 423, baseType: !234, size: 16)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "weak_magnitude", scope: !556, file: !440, line: 424, baseType: !234, size: 16, offset: 16)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "erase", scope: !489, file: !418, line: 537, baseType: !561, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!165, !432, !165}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "playback", scope: !489, file: !418, line: 539, baseType: !565, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!165, !432, !165, !165}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "set_gain", scope: !489, file: !418, line: 540, baseType: !569, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !432, !232}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "set_autocenter", scope: !489, file: !418, line: 541, baseType: !569, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !489, file: !418, line: 543, baseType: !574, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !488}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !489, file: !418, line: 545, baseType: !153, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ffbit", scope: !489, file: !418, line: 547, baseType: !458, size: 128, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !489, file: !418, line: 549, baseType: !580, size: 192, offset: 576)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !581, line: 53, size: 192, elements: !582)
!581 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!582 = !{!583, !593, !594}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !580, file: !581, line: 54, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !585, line: 13, baseType: !586)
!585 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !152, line: 175, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 173, size: 64, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !587, file: !152, line: 174, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !233, line: 22, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !235, line: 30, baseType: !592)
!592 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !580, file: !581, line: 55, baseType: !332, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !580, file: !581, line: 59, baseType: !595, size: 128, offset: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !152, line: 178, size: 128, elements: !596)
!596 = !{!597, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !152, line: 179, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !595, file: !152, line: 179, baseType: !598, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "max_effects", scope: !489, file: !418, line: 551, baseType: !165, size: 32, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "effects", scope: !489, file: !418, line: 552, baseType: !495, size: 64, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "effect_owners", scope: !489, file: !418, line: 553, baseType: !603, offset: 896)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, elements: !3016)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !77, line: 916, size: 1856, align: 32, elements: !606)
!606 = !{!607, !625, !4361, !4362, !4363, !4364, !4365, !4366, !4367, !4368, !4369, !4370, !4379, !4380, !4389, !4390, !4391, !4392, !4393, !4394, !4395}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !605, file: !77, line: 920, baseType: !608, size: 128)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !605, file: !77, line: 917, size: 128, elements: !609)
!609 = !{!610, !616}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !608, file: !77, line: 918, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !612, line: 58, size: 64, elements: !613)
!612 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !612, line: 59, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !608, file: !77, line: 919, baseType: !617, size: 128, align: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !152, line: 216, size: 128, align: 64, elements: !618)
!618 = !{!619, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !152, line: 217, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !617, file: !152, line: 218, baseType: !622, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{null, !620}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !605, file: !77, line: 921, baseType: !626, size: 128, offset: 128)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !627, line: 8, size: 128, elements: !628)
!627 = !DIFile(filename: "./include/linux/path.h", directory: "/home/lizy2001/genbc/linux")
!628 = !{!629, !633}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !626, file: !627, line: 9, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !632, line: 18, flags: DIFlagFwdDecl)
!632 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/lizy2001/genbc/linux")
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !626, file: !627, line: 10, baseType: !634, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !632, line: 89, size: 1536, elements: !636)
!636 = !{!637, !638, !648, !656, !657, !675, !4329, !4331, !4343, !4344, !4345, !4346, !4347, !4353, !4354, !4355}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !635, file: !632, line: 91, baseType: !7, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !635, file: !632, line: 92, baseType: !639, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_spinlock_t", file: !640, line: 277, baseType: !641)
!640 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_spinlock", file: !640, line: 277, size: 32, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !641, file: !640, line: 277, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !640, line: 70, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !640, line: 65, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !645, file: !640, line: 66, baseType: !7, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !635, file: !632, line: 93, baseType: !649, size: 128, offset: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !650, line: 38, size: 128, elements: !651)
!650 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/lizy2001/genbc/linux")
!651 = !{!652, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !650, line: 39, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !649, file: !650, line: 39, baseType: !655, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !635, file: !632, line: 94, baseType: !634, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !635, file: !632, line: 95, baseType: !658, size: 128, offset: 256)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !632, line: 47, size: 128, elements: !659)
!659 = !{!660, !672}
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !658, file: !632, line: 48, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !658, file: !632, line: 48, size: 64, elements: !662)
!662 = !{!663, !668}
!663 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !632, line: 49, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !661, file: !632, line: 49, size: 64, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !664, file: !632, line: 50, baseType: !377, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !664, file: !632, line: 50, baseType: !377, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !661, file: !632, line: 52, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !233, line: 23, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !235, line: 31, baseType: !671)
!671 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !658, file: !632, line: 54, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !635, file: !632, line: 96, baseType: !676, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !77, line: 610, size: 4224, elements: !678)
!678 = !{!679, !681, !682, !691, !698, !699, !846, !4264, !4265, !4266, !4272, !4273, !4274, !4275, !4276, !4277, !4278, !4279, !4280, !4281, !4282, !4283, !4284, !4285, !4286, !4287, !4288, !4289, !4290, !4291, !4296, !4297, !4298, !4299, !4300, !4301, !4302, !4307, !4315, !4316, !4317, !4325, !4326, !4327, !4328}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !677, file: !77, line: 611, baseType: !680, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !152, line: 19, baseType: !236)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !677, file: !77, line: 612, baseType: !236, size: 16, offset: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !677, file: !77, line: 613, baseType: !683, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !684, line: 23, baseType: !685)
!684 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 21, size: 32, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !685, file: !684, line: 22, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !152, line: 32, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !690, line: 49, baseType: !7)
!690 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !677, file: !77, line: 614, baseType: !692, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !684, line: 28, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 26, size: 32, elements: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !693, file: !684, line: 27, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !152, line: 33, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !690, line: 50, baseType: !7)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !677, file: !77, line: 615, baseType: !7, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !677, file: !77, line: 622, baseType: !700, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !77, line: 1864, size: 1536, align: 512, elements: !703)
!703 = !{!704, !708, !718, !722, !728, !732, !736, !740, !744, !748, !752, !753, !759, !763, !787, !816, !826, !832, !837, !841, !842}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !702, file: !77, line: 1865, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!634, !676, !634, !7}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !702, file: !77, line: 1866, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!206, !634, !676, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !714, line: 10, size: 128, elements: !715)
!714 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/lizy2001/genbc/linux")
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !713, file: !714, line: 11, baseType: !227, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !713, file: !714, line: 12, baseType: !153, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !702, file: !77, line: 1867, baseType: !719, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!165, !676, !165}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !702, file: !77, line: 1868, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !676, !165}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !77, line: 581, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !702, file: !77, line: 1870, baseType: !729, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!165, !634, !155, !165}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !702, file: !77, line: 1872, baseType: !733, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!165, !676, !634, !680, !292}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !702, file: !77, line: 1873, baseType: !737, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!165, !634, !676, !634}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !702, file: !77, line: 1874, baseType: !741, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!165, !676, !634}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !702, file: !77, line: 1875, baseType: !745, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!165, !676, !634, !206}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !702, file: !77, line: 1876, baseType: !749, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!165, !676, !634, !680}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !702, file: !77, line: 1877, baseType: !741, size: 64, offset: 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !702, file: !77, line: 1878, baseType: !754, size: 64, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!165, !676, !634, !680, !757}
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !152, line: 16, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !152, line: 13, baseType: !377)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !702, file: !77, line: 1879, baseType: !760, size: 64, offset: 768)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!165, !676, !634, !676, !634, !7}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !702, file: !77, line: 1881, baseType: !764, size: 64, offset: 832)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!165, !634, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !77, line: 219, size: 640, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !777, !784, !785, !786}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !768, file: !77, line: 220, baseType: !7, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !768, file: !77, line: 221, baseType: !680, size: 16, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !768, file: !77, line: 222, baseType: !683, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !768, file: !77, line: 223, baseType: !692, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !768, file: !77, line: 224, baseType: !775, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !152, line: 46, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !690, line: 88, baseType: !592)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !768, file: !77, line: 225, baseType: !778, size: 128, offset: 192)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !779, line: 13, size: 128, elements: !780)
!779 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/lizy2001/genbc/linux")
!780 = !{!781, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !778, file: !779, line: 14, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !779, line: 8, baseType: !591)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !778, file: !779, line: 15, baseType: !107, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !768, file: !77, line: 226, baseType: !778, size: 128, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !768, file: !77, line: 227, baseType: !778, size: 128, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !768, file: !77, line: 234, baseType: !604, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !702, file: !77, line: 1882, baseType: !788, size: 64, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!165, !791, !793, !377, !7}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !795, line: 22, size: 1152, elements: !796)
!795 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/lizy2001/genbc/linux")
!796 = !{!797, !798, !799, !800, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !794, file: !795, line: 23, baseType: !377, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !795, line: 24, baseType: !680, size: 16, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !794, file: !795, line: 25, baseType: !7, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !794, file: !795, line: 26, baseType: !801, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !152, line: 104, baseType: !377)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !794, file: !795, line: 27, baseType: !669, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !794, file: !795, line: 28, baseType: !669, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !794, file: !795, line: 37, baseType: !669, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !794, file: !795, line: 38, baseType: !757, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !794, file: !795, line: 39, baseType: !757, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !794, file: !795, line: 40, baseType: !683, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !794, file: !795, line: 41, baseType: !692, size: 32, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !795, line: 42, baseType: !775, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !794, file: !795, line: 43, baseType: !778, size: 128, offset: 512)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !794, file: !795, line: 44, baseType: !778, size: 128, offset: 640)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !794, file: !795, line: 45, baseType: !778, size: 128, offset: 768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !794, file: !795, line: 46, baseType: !778, size: 128, offset: 896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !794, file: !795, line: 47, baseType: !669, size: 64, offset: 1024)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mnt_id", scope: !794, file: !795, line: 48, baseType: !669, size: 64, offset: 1088)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !702, file: !77, line: 1883, baseType: !817, size: 64, offset: 960)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!820, !634, !155, !823}
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !152, line: 60, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !690, line: 73, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !690, line: 15, baseType: !107)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !152, line: 55, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !690, line: 72, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !690, line: 16, baseType: !158)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !702, file: !77, line: 1884, baseType: !827, size: 64, offset: 1024)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{!165, !676, !830, !669, !669}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !77, line: 50, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !702, file: !77, line: 1886, baseType: !833, size: 64, offset: 1088)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!165, !676, !836, !165}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !702, file: !77, line: 1887, baseType: !838, size: 64, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!165, !676, !634, !604, !7, !680}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !702, file: !77, line: 1890, baseType: !749, size: 64, offset: 1216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !702, file: !77, line: 1891, baseType: !843, size: 64, offset: 1280)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!165, !676, !726, !165}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !677, file: !77, line: 623, baseType: !847, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !77, line: 1416, size: 9472, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !898, !3873, !3955, !4038, !4042, !4043, !4044, !4045, !4046, !4047, !4048, !4049, !4054, !4058, !4059, !4062, !4063, !4066, !4067, !4068, !4109, !4135, !4136, !4137, !4138, !4139, !4140, !4143, !4144, !4151, !4152, !4154, !4155, !4156, !4215, !4216, !4231, !4232, !4233, !4234, !4235, !4238, !4239, !4240, !4255, !4256, !4257, !4258, !4259, !4260, !4261, !4262, !4263}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !848, file: !77, line: 1417, baseType: !595, size: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !848, file: !77, line: 1418, baseType: !757, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !848, file: !77, line: 1419, baseType: !154, size: 8, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !848, file: !77, line: 1420, baseType: !158, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !848, file: !77, line: 1421, baseType: !775, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !848, file: !77, line: 1422, baseType: !856, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !77, line: 2228, size: 576, elements: !858)
!858 = !{!859, !860, !861, !868, !872, !876, !880, !881, !882, !886, !889, !890, !891, !895, !896, !897}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !857, file: !77, line: 2229, baseType: !206, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !857, file: !77, line: 2230, baseType: !165, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "init_fs_context", scope: !857, file: !77, line: 2238, baseType: !862, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!165, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_context", file: !867, line: 28, flags: DIFlagFwdDecl)
!867 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!868 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !857, file: !77, line: 2239, baseType: !869, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_parameter_spec", file: !77, line: 70, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !857, file: !77, line: 2240, baseType: !873, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!634, !856, !165, !206, !153}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !857, file: !77, line: 2242, baseType: !877, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !847}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !857, file: !77, line: 2243, baseType: !208, size: 64, offset: 384)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !77, line: 2244, baseType: !856, size: 64, offset: 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !857, file: !77, line: 2245, baseType: !883, size: 64, offset: 512)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !152, line: 182, size: 64, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !883, file: !152, line: 183, baseType: !367, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !857, file: !77, line: 2247, baseType: !887, offset: 576)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !888, line: 187, elements: !346)
!888 = !DIFile(filename: "./include/linux/lockdep_types.h", directory: "/home/lizy2001/genbc/linux")
!889 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !857, file: !77, line: 2248, baseType: !887, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !857, file: !77, line: 2249, baseType: !887, offset: 576)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !857, file: !77, line: 2250, baseType: !892, offset: 576)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 3)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !857, file: !77, line: 2252, baseType: !887, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !857, file: !77, line: 2253, baseType: !887, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !857, file: !77, line: 2254, baseType: !887, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !848, file: !77, line: 1423, baseType: !899, size: 64, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !77, line: 1935, size: 1472, elements: !902)
!902 = !{!903, !907, !911, !912, !916, !922, !926, !927, !928, !932, !936, !937, !938, !939, !945, !950, !951, !994, !995, !996, !997, !3857, !3872}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !901, file: !77, line: 1936, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!676, !847}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !901, file: !77, line: 1937, baseType: !908, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !676}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "free_inode", scope: !901, file: !77, line: 1938, baseType: !908, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !901, file: !77, line: 1940, baseType: !913, size: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !676, !165}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !901, file: !77, line: 1941, baseType: !917, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!165, !676, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !77, line: 289, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !901, file: !77, line: 1942, baseType: !923, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!165, !676}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !901, file: !77, line: 1943, baseType: !908, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !901, file: !77, line: 1944, baseType: !877, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !901, file: !77, line: 1945, baseType: !929, size: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!165, !847, !165}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !901, file: !77, line: 1946, baseType: !933, size: 64, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!165, !847}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !901, file: !77, line: 1947, baseType: !933, size: 64, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !901, file: !77, line: 1948, baseType: !933, size: 64, offset: 704)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !901, file: !77, line: 1949, baseType: !933, size: 64, offset: 768)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !901, file: !77, line: 1950, baseType: !940, size: 64, offset: 832)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!165, !634, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !77, line: 57, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !901, file: !77, line: 1951, baseType: !946, size: 64, offset: 896)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!165, !847, !949, !155}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !901, file: !77, line: 1952, baseType: !877, size: 64, offset: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !901, file: !77, line: 1954, baseType: !952, size: 64, offset: 1024)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!165, !955, !634}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !957, line: 16, size: 896, elements: !958)
!957 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/home/lizy2001/genbc/linux")
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !989, !990, !993}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !956, file: !957, line: 17, baseType: !155, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !956, file: !957, line: 18, baseType: !823, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !956, file: !957, line: 19, baseType: !823, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !956, file: !957, line: 20, baseType: !823, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !956, file: !957, line: 21, baseType: !823, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !956, file: !957, line: 22, baseType: !775, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !956, file: !957, line: 23, baseType: !775, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !956, file: !957, line: 24, baseType: !580, size: 192, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !956, file: !957, line: 25, baseType: !968, size: 64, offset: 640)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !957, line: 31, size: 256, elements: !971)
!971 = !{!972, !977, !981, !985}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !970, file: !957, line: 32, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!153, !955, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !970, file: !957, line: 33, baseType: !978, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !955, !153}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !957, line: 34, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!153, !955, !153, !976}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !970, file: !957, line: 35, baseType: !986, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!165, !955, !153}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !956, file: !957, line: 26, baseType: !165, size: 32, offset: 704)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !956, file: !957, line: 27, baseType: !991, size: 64, offset: 768)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !956, file: !957, line: 28, baseType: !153, size: 64, offset: 832)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !901, file: !77, line: 1955, baseType: !952, size: 64, offset: 1088)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !901, file: !77, line: 1956, baseType: !952, size: 64, offset: 1152)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !901, file: !77, line: 1957, baseType: !952, size: 64, offset: 1216)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "bdev_try_to_free_page", scope: !901, file: !77, line: 1963, baseType: !998, size: 64, offset: 1280)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!165, !847, !1001, !151}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "page", file: !1003, line: 68, size: 512, align: 128, elements: !1004)
!1003 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!1004 = !{!1005, !1006, !3849, !3856}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1002, file: !1003, line: 69, baseType: !158, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, scope: !1002, file: !1003, line: 77, baseType: !1007, size: 320, offset: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1002, file: !1003, line: 77, size: 320, elements: !1008)
!1008 = !{!1009, !1183, !1188, !1216, !1224, !1230, !3780, !3848}
!1009 = !DIDerivedType(tag: DW_TAG_member, scope: !1007, file: !1003, line: 78, baseType: !1010, size: 320)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1007, file: !1003, line: 78, size: 320, elements: !1011)
!1011 = !{!1012, !1013, !1181, !1182}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lru", scope: !1010, file: !1003, line: 84, baseType: !595, size: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !1010, file: !1003, line: 86, baseType: !1014, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space", file: !77, line: 451, size: 1216, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1025, !1026, !1027, !1042, !1051, !1052, !1053, !1054, !1174, !1175, !1178, !1179, !1180}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1015, file: !77, line: 452, baseType: !676, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "i_pages", scope: !1015, file: !77, line: 453, baseType: !1019, size: 128, offset: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !1020, line: 292, size: 128, elements: !1021)
!1020 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !1019, file: !1020, line: 293, baseType: !332)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !1019, file: !1020, line: 295, baseType: !151, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !1019, file: !1020, line: 296, baseType: !153, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gfp_mask", scope: !1015, file: !77, line: 454, baseType: !151, size: 32, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_writable", scope: !1015, file: !77, line: 455, baseType: !287, size: 32, offset: 224)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap", scope: !1015, file: !77, line: 460, baseType: !1028, size: 128, offset: 256)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !1029, line: 125, size: 128, elements: !1030)
!1029 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!1030 = !{!1031, !1041}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !1028, file: !1029, line: 126, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !1029, line: 31, size: 64, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !1032, file: !1029, line: 32, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !1029, line: 24, size: 192, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !1036, file: !1029, line: 25, baseType: !158, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !1036, file: !1029, line: 26, baseType: !1035, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !1036, file: !1029, line: 27, baseType: !1035, size: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !1028, file: !1029, line: 127, baseType: !1035, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmap_rwsem", scope: !1015, file: !77, line: 461, baseType: !1043, size: 256, offset: 384)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !1044, line: 35, size: 256, elements: !1045)
!1044 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!1045 = !{!1046, !1047, !1048, !1050}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1043, file: !1044, line: 36, baseType: !584, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1043, file: !1044, line: 42, baseType: !584, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !1043, file: !1044, line: 46, baseType: !1049, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !333, line: 29, baseType: !340)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !1043, file: !1044, line: 47, baseType: !595, size: 128, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nrpages", scope: !1015, file: !77, line: 462, baseType: !158, size: 64, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nrexceptional", scope: !1015, file: !77, line: 463, baseType: !158, size: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "writeback_index", scope: !1015, file: !77, line: 464, baseType: !158, size: 64, offset: 768)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "a_ops", scope: !1015, file: !77, line: 465, baseType: !1055, size: 64, offset: 832)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "address_space_operations", file: !77, line: 367, size: 1408, elements: !1058)
!1058 = !{!1059, !1063, !1067, !1071, !1075, !1079, !1085, !1091, !1095, !1100, !1104, !1108, !1112, !1138, !1142, !1148, !1149, !1150, !1154, !1159, !1163, !1170}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "writepage", scope: !1057, file: !77, line: 368, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!165, !1001, !920}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "readpage", scope: !1057, file: !77, line: 369, baseType: !1064, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!165, !604, !1001}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "writepages", scope: !1057, file: !77, line: 372, baseType: !1068, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!165, !1014, !920}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "set_page_dirty", scope: !1057, file: !77, line: 375, baseType: !1072, size: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!165, !1001}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "readpages", scope: !1057, file: !77, line: 381, baseType: !1076, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!165, !604, !1014, !598, !7}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !1057, file: !77, line: 383, baseType: !1080, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "readahead_control", file: !77, line: 290, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "write_begin", scope: !1057, file: !77, line: 385, baseType: !1086, size: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!165, !604, !1014, !775, !7, !7, !1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "write_end", scope: !1057, file: !77, line: 388, baseType: !1092, size: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!165, !604, !1014, !775, !7, !7, !1001, !153}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "bmap", scope: !1057, file: !77, line: 393, baseType: !1096, size: 64, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1099, !1014, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "sector_t", file: !152, line: 125, baseType: !669)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "invalidatepage", scope: !1057, file: !77, line: 394, baseType: !1101, size: 64, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{null, !1001, !7, !7}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "releasepage", scope: !1057, file: !77, line: 395, baseType: !1105, size: 64, offset: 640)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!165, !1001, !151}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "freepage", scope: !1057, file: !77, line: 396, baseType: !1109, size: 64, offset: 704)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !1001}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "direct_IO", scope: !1057, file: !77, line: 397, baseType: !1113, size: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!820, !1116, !1136}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kiocb", file: !77, line: 320, size: 384, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1125, !1126, !1127, !1128, !1129}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ki_filp", scope: !1117, file: !77, line: 321, baseType: !604, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ki_pos", scope: !1117, file: !77, line: 326, baseType: !775, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ki_complete", scope: !1117, file: !77, line: 327, baseType: !1122, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1116, !107, !107}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1117, file: !77, line: 328, baseType: !153, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ki_flags", scope: !1117, file: !77, line: 329, baseType: !165, size: 32, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "ki_hint", scope: !1117, file: !77, line: 330, baseType: !232, size: 16, offset: 288)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ki_ioprio", scope: !1117, file: !77, line: 331, baseType: !232, size: 16, offset: 304)
!1129 = !DIDerivedType(tag: DW_TAG_member, scope: !1117, file: !77, line: 332, baseType: !1130, size: 64, offset: 320)
!1130 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1117, file: !77, line: 332, size: 64, elements: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "ki_cookie", scope: !1130, file: !77, line: 333, baseType: !7, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ki_waitq", scope: !1130, file: !77, line: 334, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "wait_page_queue", file: !77, line: 334, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "iov_iter", file: !77, line: 64, flags: DIFlagFwdDecl)
