; ModuleID = '../bcout/drivers/w1/w1_io.llvm.bc'
source_filename = "drivers/w1/w1_io.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__param_str_delay_coef", scope: !2, file: !3, line: 15, type: !158, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !50, globals: !60, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/w1/w1_io.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !30, !38, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !24, line: 343, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !31, line: 524, baseType: !7, size: 32, elements: !32)
!31 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!35 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!36 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!37 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !31, line: 502, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !45, line: 44, baseType: !7, size: 32, elements: !46)
!45 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!50 = !{!51, !54, !56, !59}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !52, line: 31, baseType: !53)
!52 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!53 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le64", file: !55, line: 33, baseType: !51)
!55 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !58, line: 23, baseType: !51)
!58 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!59 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !{!61, !132, !137, !139, !0, !144, !146, !151, !153}
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "__param_delay_coef", scope: !2, file: !3, line: 15, type: !63, isLocal: true, isDefinition: true, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !65, line: 69, size: 320, elements: !66)
!65 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !71, !75, !97, !102, !106, !110}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !64, file: !65, line: 70, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !64, file: !65, line: 71, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !74, line: 189, flags: DIFlagFwdDecl)
!74 = !DIFile(filename: "./include/linux/jump_label.h", directory: "/home/lizy2001/genbc/linux")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !64, file: !65, line: 72, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !65, line: 47, size: 256, elements: !79)
!79 = !{!80, !81, !87, !92}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !78, file: !65, line: 49, baseType: !7, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !78, file: !65, line: 51, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!85, !68, !86}
!85 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !78, file: !65, line: 53, baseType: !88, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!85, !91, !86}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !78, file: !65, line: 55, baseType: !93, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !64, file: !65, line: 73, baseType: !98, size: 16, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !58, line: 19, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !52, line: 24, baseType: !101)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !64, file: !65, line: 74, baseType: !103, size: 8, offset: 208)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !58, line: 16, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !52, line: 20, baseType: !105)
!105 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !65, line: 75, baseType: !107, size: 8, offset: 216)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !58, line: 17, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !52, line: 21, baseType: !109)
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !DIDerivedType(tag: DW_TAG_member, scope: !64, file: !65, line: 76, baseType: !111, size: 64, offset: 256)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !64, file: !65, line: 76, size: 64, elements: !112)
!112 = !{!113, !114, !121}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !111, file: !65, line: 77, baseType: !96, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !111, file: !65, line: 78, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !65, line: 86, size: 128, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !117, file: !65, line: 87, baseType: !7, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !117, file: !65, line: 88, baseType: !91, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !111, file: !65, line: 79, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !65, line: 92, size: 256, elements: !125)
!125 = !{!126, !127, !128, !130, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !124, file: !65, line: 94, baseType: !7, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !124, file: !65, line: 95, baseType: !7, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !124, file: !65, line: 96, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !124, file: !65, line: 97, baseType: !76, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !124, file: !65, line: 98, baseType: !96, size: 64, offset: 192)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_delay_coeftype162", scope: !2, file: !3, line: 15, type: !134, isLocal: true, isDefinition: true, align: 8)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 232, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 29)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "__param_disable_irqs", scope: !2, file: !3, line: 18, type: !63, isLocal: true, isDefinition: true, align: 64)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_disable_irqstype163", scope: !2, file: !3, line: 18, type: !141, isLocal: true, isDefinition: true, align: 8)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 248, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 31)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "w1_delay_parm", scope: !2, file: !3, line: 14, type: !85, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "__param_str_disable_irqs", scope: !2, file: !3, line: 18, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 144, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 18)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "w1_disable_irqs", scope: !2, file: !3, line: 17, type: !85, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "w1_crc8_table", scope: !2, file: !3, line: 20, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 2048, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 256)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 128, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 16)
!161 = !{!"rsp"}
!162 = !{i32 7, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 2}
!165 = !{i32 1, !"Code Model", i32 2}
!166 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!167 = distinct !DISubprogram(name: "w1_touch_bit", scope: !3, file: !3, line: 52, type: !168, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !215)
!168 = !DISubroutineType(types: !169)
!169 = !{!107, !170, !85}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "w1_master", file: !172, line: 199, size: 7680, elements: !173)
!172 = !DIFile(filename: "./include/linux/w1.h", directory: "/home/lizy2001/genbc/linux")
!173 = !{!174, !181, !182, !186, !217, !218, !219, !220, !221, !222, !223, !224, !227, !228, !229, !234, !235, !236, !237, !239, !1355, !1356, !1357, !2119, !2120, !2165}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "w1_master_entry", scope: !171, file: !172, line: 200, baseType: !175, size: 128)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !176, line: 178, size: 128, elements: !177)
!176 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!177 = !{!178, !180}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !175, file: !176, line: 179, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !175, file: !176, line: 179, baseType: !179, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !171, file: !172, line: 201, baseType: !72, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !172, line: 202, baseType: !183, size: 256, offset: 192)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 256, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "list_mutex", scope: !171, file: !172, line: 208, baseType: !187, size: 192, offset: 448)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !188, line: 53, size: 192, elements: !189)
!188 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!189 = !{!190, !200, !216}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !187, file: !188, line: 54, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !192, line: 13, baseType: !193)
!192 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !176, line: 175, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 173, size: 64, elements: !195)
!195 = !{!196}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !194, file: !176, line: 174, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !58, line: 22, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !52, line: 30, baseType: !199)
!199 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !187, file: !188, line: 55, baseType: !201, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !202, line: 83, baseType: !203)
!202 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !202, line: 71, elements: !204)
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, scope: !203, file: !202, line: 72, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !203, file: !202, line: 72, elements: !207)
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !206, file: !202, line: 73, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !202, line: 20, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !209, file: !202, line: 21, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !213, line: 25, baseType: !214)
!213 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !213, line: 25, elements: !215)
!215 = !{}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !187, file: !188, line: 59, baseType: !175, size: 128, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "slist", scope: !171, file: !172, line: 209, baseType: !175, size: 128, offset: 640)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "async_list", scope: !171, file: !172, line: 210, baseType: !175, size: 128, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "max_slave_count", scope: !171, file: !172, line: 211, baseType: !85, size: 32, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "slave_count", scope: !171, file: !172, line: 211, baseType: !85, size: 32, offset: 928)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "attempts", scope: !171, file: !172, line: 212, baseType: !59, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "slave_ttl", scope: !171, file: !172, line: 213, baseType: !85, size: 32, offset: 1024)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !171, file: !172, line: 214, baseType: !85, size: 32, offset: 1056)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !171, file: !172, line: 215, baseType: !225, size: 32, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !58, line: 21, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !52, line: 27, baseType: !7)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "search_count", scope: !171, file: !172, line: 216, baseType: !85, size: 32, offset: 1120)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "search_id", scope: !171, file: !172, line: 218, baseType: !57, size: 64, offset: 1152)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !171, file: !172, line: 220, baseType: !230, size: 32, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !176, line: 168, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 166, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !231, file: !176, line: 167, baseType: !85, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !171, file: !172, line: 222, baseType: !96, size: 64, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "enable_pullup", scope: !171, file: !172, line: 225, baseType: !85, size: 32, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pullup_duration", scope: !171, file: !172, line: 227, baseType: !85, size: 32, offset: 1376)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !171, file: !172, line: 229, baseType: !238, size: 64, offset: 1408)
!238 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !171, file: !172, line: 231, baseType: !240, size: 64, offset: 1472)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !242, line: 640, size: 48640, elements: !243)
!242 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!243 = !{!244, !250, !252, !253, !259, !260, !261, !262, !263, !264, !265, !266, !270, !295, !306, !403, !404, !405, !416, !417, !419, !420, !637, !638, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !717, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !773, !775, !776, !777, !779, !781, !782, !783, !784, !785, !791, !792, !793, !794, !795, !796, !797, !811, !816, !821, !822, !823, !826, !828, !831, !834, !837, !840, !844, !847, !850, !856, !857, !858, !864, !865, !869, !870, !871, !880, !881, !882, !883, !884, !889, !890, !891, !894, !895, !898, !901, !904, !907, !910, !913, !914, !995, !998, !1001, !1002, !1005, !1006, !1007, !1013, !1014, !1015, !1028, !1029, !1030, !1040, !1045, !1048, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !241, file: !242, line: 646, baseType: !245, size: 128)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !246, line: 56, size: 128, elements: !247)
!246 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !245, file: !246, line: 57, baseType: !59, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !245, file: !246, line: 58, baseType: !225, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !241, file: !242, line: 649, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !238)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !241, file: !242, line: 657, baseType: !96, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !241, file: !242, line: 658, baseType: !254, size: 32, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !255, line: 113, baseType: !256)
!255 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !255, line: 111, size: 32, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !256, file: !255, line: 112, baseType: !230, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !242, line: 660, baseType: !7, size: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !241, file: !242, line: 661, baseType: !7, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !241, file: !242, line: 684, baseType: !85, size: 32, offset: 352)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !241, file: !242, line: 686, baseType: !85, size: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !241, file: !242, line: 687, baseType: !85, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !241, file: !242, line: 688, baseType: !85, size: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !241, file: !242, line: 689, baseType: !7, size: 32, offset: 480)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !241, file: !242, line: 691, baseType: !267, size: 64, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !242, line: 691, flags: DIFlagFwdDecl)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !241, file: !242, line: 692, baseType: !271, size: 832, offset: 576)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !242, line: 451, size: 832, elements: !272)
!272 = !{!273, !278, !286, !287, !288, !289, !290, !291, !292, !293}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !271, file: !242, line: 453, baseType: !274, size: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !242, line: 325, size: 128, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !274, file: !242, line: 326, baseType: !59, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !274, file: !242, line: 327, baseType: !225, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !271, file: !242, line: 454, baseType: !279, size: 192, align: 64, offset: 128)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !280, line: 24, size: 192, align: 64, elements: !281)
!280 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!281 = !{!282, !283, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !279, file: !280, line: 25, baseType: !59, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !279, file: !280, line: 26, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !279, file: !280, line: 27, baseType: !284, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !271, file: !242, line: 455, baseType: !175, size: 128, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !271, file: !242, line: 456, baseType: !7, size: 32, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !271, file: !242, line: 458, baseType: !57, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !271, file: !242, line: 459, baseType: !57, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !271, file: !242, line: 460, baseType: !57, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !271, file: !242, line: 461, baseType: !57, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !271, file: !242, line: 463, baseType: !57, size: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !271, file: !242, line: 465, baseType: !294, offset: 832)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !242, line: 415, elements: !215)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !241, file: !242, line: 693, baseType: !296, size: 384, offset: 1408)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !242, line: 489, size: 384, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !304}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !296, file: !242, line: 490, baseType: !175, size: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !296, file: !242, line: 491, baseType: !59, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !296, file: !242, line: 492, baseType: !59, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !296, file: !242, line: 493, baseType: !7, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !296, file: !242, line: 494, baseType: !101, size: 16, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !296, file: !242, line: 495, baseType: !101, size: 16, offset: 304)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !296, file: !242, line: 497, baseType: !305, size: 64, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !241, file: !242, line: 697, baseType: !307, size: 1792, offset: 1792)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !242, line: 507, size: 1792, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !400, !401}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !307, file: !242, line: 508, baseType: !279, size: 192, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !307, file: !242, line: 515, baseType: !57, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !307, file: !242, line: 516, baseType: !57, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !307, file: !242, line: 517, baseType: !57, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !307, file: !242, line: 518, baseType: !57, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !307, file: !242, line: 519, baseType: !57, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !307, file: !242, line: 526, baseType: !197, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !307, file: !242, line: 527, baseType: !57, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !242, line: 528, baseType: !7, size: 32, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !307, file: !242, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !307, file: !242, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !307, file: !242, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !307, file: !242, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !307, file: !242, line: 563, baseType: !323, size: 512, offset: 704)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !324)
!324 = !{!325, !333, !334, !339, !396, !397, !398, !399}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !323, file: !6, line: 119, baseType: !326, size: 256)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !327, line: 9, size: 256, elements: !328)
!327 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !326, file: !327, line: 10, baseType: !279, size: 192, align: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !326, file: !327, line: 11, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !332, line: 29, baseType: !197)
!332 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !323, file: !6, line: 120, baseType: !331, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !323, file: !6, line: 121, baseType: !335, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!5, !338}
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !323, file: !6, line: 122, baseType: !340, size: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !342)
!342 = !{!343, !364, !365, !369, !379, !380, !391, !395}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !341, file: !6, line: 160, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !346)
!346 = !{!347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !6, line: 215, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !202, line: 29, baseType: !209)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !345, file: !6, line: 216, baseType: !7, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !345, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !345, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !345, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !345, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !345, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !345, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !345, file: !6, line: 233, baseType: !331, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !345, file: !6, line: 234, baseType: !338, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !345, file: !6, line: 235, baseType: !331, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !345, file: !6, line: 236, baseType: !338, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !345, file: !6, line: 237, baseType: !361, size: 4096, offset: 512)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 4096, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !341, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !341, file: !6, line: 162, baseType: !366, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !176, line: 27, baseType: !367)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !368, line: 96, baseType: !85)
!368 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !341, file: !6, line: 163, baseType: !370, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !371, line: 276, baseType: !372)
!371 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !371, line: 276, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !372, file: !371, line: 276, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !371, line: 70, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !371, line: 65, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !376, file: !371, line: 66, baseType: !7, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !341, file: !6, line: 164, baseType: !338, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !341, file: !6, line: 165, baseType: !381, size: 128, offset: 256)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !327, line: 14, size: 128, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !381, file: !327, line: 15, baseType: !384, size: 128)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !280, line: 125, size: 128, elements: !385)
!385 = !{!386, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !384, file: !280, line: 126, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !280, line: 31, size: 64, elements: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !387, file: !280, line: 32, baseType: !284, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !384, file: !280, line: 127, baseType: !284, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !341, file: !6, line: 166, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!331}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !341, file: !6, line: 167, baseType: !331, size: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !323, file: !6, line: 123, baseType: !107, size: 8, offset: 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !323, file: !6, line: 124, baseType: !107, size: 8, offset: 456)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !323, file: !6, line: 125, baseType: !107, size: 8, offset: 464)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !323, file: !6, line: 126, baseType: !107, size: 8, offset: 472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !307, file: !242, line: 572, baseType: !323, size: 512, offset: 1216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !307, file: !242, line: 580, baseType: !402, size: 64, offset: 1728)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !241, file: !242, line: 721, baseType: !7, size: 32, offset: 3584)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !241, file: !242, line: 722, baseType: !85, size: 32, offset: 3616)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !241, file: !242, line: 723, baseType: !406, size: 64, offset: 3648)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !409, line: 17, baseType: !410)
!409 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !409, line: 17, size: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !410, file: !409, line: 17, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 64, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 1)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !241, file: !242, line: 724, baseType: !408, size: 64, offset: 3712)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !241, file: !242, line: 749, baseType: !418, offset: 3776)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !242, line: 290, elements: !215)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !241, file: !242, line: 751, baseType: !175, size: 128, offset: 3776)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !241, file: !242, line: 757, baseType: !421, size: 64, offset: 3904)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !423, line: 388, size: 7296, elements: !424)
!423 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!424 = !{!425, !633}
!425 = !DIDerivedType(tag: DW_TAG_member, scope: !422, file: !423, line: 389, baseType: !426, size: 7296)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !423, line: 389, size: 7296, elements: !427)
!427 = !{!428, !469, !470, !471, !475, !476, !477, !478, !479, !486, !487, !488, !489, !490, !491, !492, !493, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !535, !538, !578, !579, !601, !602, !605, !609, !610, !613, !614, !617, !620, !632}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !426, file: !423, line: 390, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !423, line: 305, size: 1472, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !447, !448, !453, !454, !457, !461, !462, !465, !466, !467}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !430, file: !423, line: 308, baseType: !59, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !430, file: !423, line: 309, baseType: !59, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !430, file: !423, line: 313, baseType: !429, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !430, file: !423, line: 313, baseType: !429, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !430, file: !423, line: 315, baseType: !279, size: 192, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !430, file: !423, line: 323, baseType: !59, size: 64, offset: 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !430, file: !423, line: 327, baseType: !421, size: 64, offset: 512)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !430, file: !423, line: 333, baseType: !440, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !441, line: 284, baseType: !442)
!441 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !441, line: 284, size: 64, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !442, file: !441, line: 284, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !446, line: 19, baseType: !59)
!446 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!447 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !430, file: !423, line: 334, baseType: !59, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !430, file: !423, line: 343, baseType: !449, size: 256, offset: 704)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !423, line: 340, size: 256, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !449, file: !423, line: 341, baseType: !279, size: 192, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !449, file: !423, line: 342, baseType: !59, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !430, file: !423, line: 351, baseType: !175, size: 128, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !430, file: !423, line: 353, baseType: !455, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !423, line: 353, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !430, file: !423, line: 356, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !423, line: 356, flags: DIFlagFwdDecl)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !430, file: !423, line: 359, baseType: !59, size: 64, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !430, file: !423, line: 361, baseType: !463, size: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !441, line: 526, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !430, file: !423, line: 362, baseType: !96, size: 64, offset: 1344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !430, file: !423, line: 365, baseType: !191, size: 64, offset: 1408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !430, file: !423, line: 373, baseType: !468, offset: 1472)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !423, line: 296, elements: !215)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !426, file: !423, line: 391, baseType: !387, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !426, file: !423, line: 392, baseType: !57, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !426, file: !423, line: 394, baseType: !472, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DISubroutineType(types: !474)
!474 = !{!59, !463, !59, !59, !59, !59}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !426, file: !423, line: 398, baseType: !59, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !426, file: !423, line: 399, baseType: !59, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !426, file: !423, line: 405, baseType: !59, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !426, file: !423, line: 406, baseType: !59, size: 64, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !426, file: !423, line: 407, baseType: !480, size: 64, offset: 512)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !441, line: 286, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 286, size: 64, elements: !483)
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !482, file: !441, line: 286, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !446, line: 18, baseType: !59)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !426, file: !423, line: 416, baseType: !230, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !426, file: !423, line: 428, baseType: !230, size: 32, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !426, file: !423, line: 437, baseType: !230, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !426, file: !423, line: 447, baseType: !230, size: 32, offset: 672)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !426, file: !423, line: 450, baseType: !191, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !426, file: !423, line: 452, baseType: !85, size: 32, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !426, file: !423, line: 454, baseType: !201, offset: 800)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !426, file: !423, line: 457, baseType: !494, size: 256, offset: 832)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !495, line: 35, size: 256, elements: !496)
!495 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!496 = !{!497, !498, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !494, file: !495, line: 36, baseType: !191, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !494, file: !495, line: 42, baseType: !191, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !494, file: !495, line: 46, baseType: !348, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !494, file: !495, line: 47, baseType: !175, size: 128, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !426, file: !423, line: 459, baseType: !175, size: 128, offset: 1088)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !426, file: !423, line: 466, baseType: !59, size: 64, offset: 1216)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !426, file: !423, line: 467, baseType: !59, size: 64, offset: 1280)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !426, file: !423, line: 469, baseType: !59, size: 64, offset: 1344)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !426, file: !423, line: 470, baseType: !59, size: 64, offset: 1408)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !426, file: !423, line: 471, baseType: !193, size: 64, offset: 1472)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !426, file: !423, line: 472, baseType: !59, size: 64, offset: 1536)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !426, file: !423, line: 473, baseType: !59, size: 64, offset: 1600)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !426, file: !423, line: 474, baseType: !59, size: 64, offset: 1664)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !426, file: !423, line: 475, baseType: !59, size: 64, offset: 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !426, file: !423, line: 477, baseType: !201, offset: 1792)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !426, file: !423, line: 478, baseType: !59, size: 64, offset: 1792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !426, file: !423, line: 478, baseType: !59, size: 64, offset: 1856)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !426, file: !423, line: 478, baseType: !59, size: 64, offset: 1920)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !426, file: !423, line: 478, baseType: !59, size: 64, offset: 1984)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !426, file: !423, line: 479, baseType: !59, size: 64, offset: 2048)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !426, file: !423, line: 479, baseType: !59, size: 64, offset: 2112)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !426, file: !423, line: 479, baseType: !59, size: 64, offset: 2176)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !426, file: !423, line: 480, baseType: !59, size: 64, offset: 2240)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !426, file: !423, line: 480, baseType: !59, size: 64, offset: 2304)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !426, file: !423, line: 480, baseType: !59, size: 64, offset: 2368)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !426, file: !423, line: 480, baseType: !59, size: 64, offset: 2432)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !426, file: !423, line: 482, baseType: !524, size: 2816, offset: 2496)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 2816, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 44)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !426, file: !423, line: 488, baseType: !528, size: 256, offset: 5312)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !529, line: 60, size: 256, elements: !530)
!529 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !528, file: !529, line: 61, baseType: !532, size: 256)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 256, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 4)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !426, file: !423, line: 490, baseType: !536, size: 64, offset: 5568)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !423, line: 490, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !426, file: !423, line: 493, baseType: !539, size: 896, offset: 5632)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !540, line: 53, baseType: !541)
!540 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !540, line: 13, size: 896, elements: !542)
!542 = !{!543, !544, !545, !546, !549, !550, !551, !552, !572, !573, !574}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !541, file: !540, line: 18, baseType: !57, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !541, file: !540, line: 28, baseType: !193, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !541, file: !540, line: 31, baseType: !494, size: 256, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !541, file: !540, line: 32, baseType: !547, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !540, line: 32, flags: DIFlagFwdDecl)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !541, file: !540, line: 37, baseType: !101, size: 16, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !541, file: !540, line: 40, baseType: !187, size: 192, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !541, file: !540, line: 41, baseType: !96, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !541, file: !540, line: 42, baseType: !553, size: 64, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !556, line: 13, size: 896, elements: !557)
!556 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !555, file: !556, line: 14, baseType: !96, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !555, file: !556, line: 15, baseType: !59, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !555, file: !556, line: 17, baseType: !59, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !555, file: !556, line: 17, baseType: !59, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !555, file: !556, line: 19, baseType: !238, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !555, file: !556, line: 21, baseType: !238, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !555, file: !556, line: 22, baseType: !238, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !555, file: !556, line: 23, baseType: !238, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !555, file: !556, line: 24, baseType: !238, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !555, file: !556, line: 25, baseType: !238, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !555, file: !556, line: 26, baseType: !238, size: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !555, file: !556, line: 27, baseType: !238, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !555, file: !556, line: 28, baseType: !238, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !555, file: !556, line: 29, baseType: !238, size: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !541, file: !540, line: 44, baseType: !230, size: 32, offset: 832)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !541, file: !540, line: 50, baseType: !99, size: 16, offset: 864)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !541, file: !540, line: 51, baseType: !575, size: 16, offset: 880)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !58, line: 18, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !52, line: 23, baseType: !577)
!577 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !426, file: !423, line: 495, baseType: !59, size: 64, offset: 6528)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !426, file: !423, line: 497, baseType: !580, size: 64, offset: 6592)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !423, line: 381, size: 384, elements: !582)
!582 = !{!583, !584, !590}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !581, file: !423, line: 382, baseType: !230, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !581, file: !423, line: 383, baseType: !585, size: 128, offset: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !423, line: 376, size: 128, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !585, file: !423, line: 377, baseType: !240, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !585, file: !423, line: 378, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !581, file: !423, line: 384, baseType: !591, size: 192, offset: 192)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !592, line: 26, size: 192, elements: !593)
!592 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !591, file: !592, line: 27, baseType: !7, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !591, file: !592, line: 28, baseType: !596, size: 128, offset: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !597, line: 43, size: 128, elements: !598)
!597 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !596, file: !597, line: 44, baseType: !348)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !596, file: !597, line: 45, baseType: !175, size: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_lock", scope: !426, file: !423, line: 500, baseType: !201, offset: 6656)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_table", scope: !426, file: !423, line: 501, baseType: !603, size: 64, offset: 6656)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "kioctx_table", file: !423, line: 387, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !426, file: !423, line: 516, baseType: !606, size: 64, offset: 6720)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !608, line: 18, flags: DIFlagFwdDecl)
!608 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!609 = !DIDerivedType(tag: DW_TAG_member, name: "exe_file", scope: !426, file: !423, line: 519, baseType: !463, size: 64, offset: 6784)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_subscriptions", scope: !426, file: !423, line: 521, baseType: !611, size: 64, offset: 6848)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmu_notifier_subscriptions", file: !423, line: 521, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_pending", scope: !426, file: !423, line: 545, baseType: !230, size: 32, offset: 6912)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_batched", scope: !426, file: !423, line: 548, baseType: !615, size: 8, offset: 6944)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !176, line: 30, baseType: !616)
!616 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "uprobes_state", scope: !426, file: !423, line: 550, baseType: !618, offset: 6952)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uprobes_state", file: !619, line: 142, elements: !215)
!619 = !DIFile(filename: "./include/linux/uprobes.h", directory: "/home/lizy2001/genbc/linux")
!620 = !DIDerivedType(tag: DW_TAG_member, name: "async_put_work", scope: !426, file: !423, line: 554, baseType: !621, size: 256, offset: 6976)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !622, line: 102, size: 256, elements: !623)
!622 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !622, line: 103, baseType: !191, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !621, file: !622, line: 104, baseType: !175, size: 128, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !621, file: !622, line: 105, baseType: !627, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !622, line: 21, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pasid", scope: !426, file: !423, line: 557, baseType: !225, size: 32, offset: 7232)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_bitmap", scope: !422, file: !423, line: 565, baseType: !634, offset: 7296)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: -1)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !241, file: !242, line: 758, baseType: !421, size: 64, offset: 3968)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !241, file: !242, line: 761, baseType: !639, size: 320, offset: 4032)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !529, line: 34, size: 320, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !639, file: !529, line: 35, baseType: !57, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !639, file: !529, line: 36, baseType: !643, size: 256, offset: 64)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 256, elements: !533)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !241, file: !242, line: 766, baseType: !85, size: 32, offset: 4352)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !241, file: !242, line: 767, baseType: !85, size: 32, offset: 4384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !241, file: !242, line: 768, baseType: !85, size: 32, offset: 4416)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !241, file: !242, line: 770, baseType: !85, size: 32, offset: 4448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !241, file: !242, line: 772, baseType: !59, size: 64, offset: 4480)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !241, file: !242, line: 775, baseType: !7, size: 32, offset: 4544)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !241, file: !242, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !241, file: !242, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !241, file: !242, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !241, file: !242, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !241, file: !242, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !241, file: !242, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !241, file: !242, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !241, file: !242, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !241, file: !242, line: 831, baseType: !59, size: 64, offset: 4672)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !241, file: !242, line: 833, baseType: !660, size: 384, offset: 4736)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !661)
!661 = !{!662, !667}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !660, file: !12, line: 26, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{!238, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, scope: !660, file: !12, line: 27, baseType: !668, size: 320, offset: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !12, line: 27, size: 320, elements: !669)
!669 = !{!670, !680, !707}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !668, file: !12, line: 36, baseType: !671, size: 320)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !12, line: 29, size: 320, elements: !672)
!672 = !{!673, !675, !676, !677, !678, !679}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !671, file: !12, line: 30, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !671, file: !12, line: 31, baseType: !225, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !671, file: !12, line: 32, baseType: !225, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !671, file: !12, line: 33, baseType: !225, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !671, file: !12, line: 34, baseType: !57, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !671, file: !12, line: 35, baseType: !674, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !668, file: !12, line: 46, baseType: !681, size: 192)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !12, line: 38, size: 192, elements: !682)
!682 = !{!683, !684, !685, !706}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !681, file: !12, line: 39, baseType: !366, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !681, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, scope: !681, file: !12, line: 41, baseType: !686, size: 64, offset: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !681, file: !12, line: 41, size: 64, elements: !687)
!687 = !{!688, !696}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !686, file: !12, line: 42, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !691, line: 7, size: 128, elements: !692)
!691 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!692 = !{!693, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !690, file: !691, line: 8, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !368, line: 93, baseType: !199)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !690, file: !691, line: 9, baseType: !199, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !686, file: !12, line: 43, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !699, line: 7, size: 64, elements: !700)
!699 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!700 = !{!701, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !698, file: !699, line: 8, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !699, line: 5, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !58, line: 20, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !52, line: 26, baseType: !85)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !698, file: !699, line: 9, baseType: !703, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !681, file: !12, line: 45, baseType: !57, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !668, file: !12, line: 54, baseType: !708, size: 256)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !12, line: 48, size: 256, elements: !709)
!709 = !{!710, !713, !714, !715, !716}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !708, file: !12, line: 49, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !708, file: !12, line: 50, baseType: !85, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !708, file: !12, line: 51, baseType: !85, size: 32, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !708, file: !12, line: 52, baseType: !59, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !708, file: !12, line: 53, baseType: !59, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !241, file: !242, line: 835, baseType: !718, size: 32, offset: 5120)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !176, line: 22, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !368, line: 28, baseType: !85)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !241, file: !242, line: 836, baseType: !718, size: 32, offset: 5152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !241, file: !242, line: 840, baseType: !59, size: 64, offset: 5184)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !241, file: !242, line: 849, baseType: !240, size: 64, offset: 5248)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !241, file: !242, line: 852, baseType: !240, size: 64, offset: 5312)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !241, file: !242, line: 857, baseType: !175, size: 128, offset: 5376)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !241, file: !242, line: 858, baseType: !175, size: 128, offset: 5504)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !241, file: !242, line: 859, baseType: !240, size: 64, offset: 5632)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !241, file: !242, line: 867, baseType: !175, size: 128, offset: 5696)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !241, file: !242, line: 868, baseType: !175, size: 128, offset: 5824)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !241, file: !242, line: 871, baseType: !730, size: 64, offset: 5952)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !732, line: 59, size: 768, elements: !733)
!732 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!733 = !{!734, !735, !736, !737, !748, !749, !756, !765}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !731, file: !732, line: 61, baseType: !254, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !731, file: !732, line: 62, baseType: !7, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !731, file: !732, line: 63, baseType: !201, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !731, file: !732, line: 65, baseType: !738, size: 256, offset: 64)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 256, elements: !533)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !176, line: 182, size: 64, elements: !740)
!740 = !{!741}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !739, file: !176, line: 183, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !176, line: 186, size: 128, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !743, file: !176, line: 187, baseType: !742, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !743, file: !176, line: 187, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !731, file: !732, line: 66, baseType: !739, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !731, file: !732, line: 68, baseType: !750, size: 128, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !751, line: 40, baseType: !752)
!751 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !751, line: 36, size: 128, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !752, file: !751, line: 37, baseType: !201)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !752, file: !751, line: 38, baseType: !175, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !731, file: !732, line: 69, baseType: !757, size: 128, align: 64, offset: 512)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !176, line: 216, size: 128, align: 64, elements: !758)
!758 = !{!759, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !757, file: !176, line: 217, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !757, file: !176, line: 218, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !760}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !731, file: !732, line: 70, baseType: !766, size: 128, offset: 640)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 128, elements: !414)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !732, line: 54, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !767, file: !732, line: 55, baseType: !85, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !767, file: !732, line: 56, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !732, line: 56, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !241, file: !242, line: 872, baseType: !774, size: 512, offset: 6016)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 512, elements: !533)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !241, file: !242, line: 873, baseType: !175, size: 128, offset: 6528)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !241, file: !242, line: 874, baseType: !175, size: 128, offset: 6656)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !241, file: !242, line: 876, baseType: !778, size: 64, offset: 6784)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !241, file: !242, line: 879, baseType: !780, size: 64, offset: 6848)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !241, file: !242, line: 882, baseType: !780, size: 64, offset: 6912)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !241, file: !242, line: 884, baseType: !57, size: 64, offset: 6976)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !241, file: !242, line: 885, baseType: !57, size: 64, offset: 7040)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !241, file: !242, line: 890, baseType: !57, size: 64, offset: 7104)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !241, file: !242, line: 891, baseType: !786, size: 128, offset: 7168)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !242, line: 242, size: 128, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !786, file: !242, line: 244, baseType: !57, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !786, file: !242, line: 245, baseType: !57, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !786, file: !242, line: 246, baseType: !348, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !241, file: !242, line: 900, baseType: !59, size: 64, offset: 7296)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !241, file: !242, line: 901, baseType: !59, size: 64, offset: 7360)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !241, file: !242, line: 904, baseType: !57, size: 64, offset: 7424)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !241, file: !242, line: 907, baseType: !57, size: 64, offset: 7488)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !241, file: !242, line: 910, baseType: !59, size: 64, offset: 7552)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !241, file: !242, line: 911, baseType: !59, size: 64, offset: 7616)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !241, file: !242, line: 914, baseType: !798, size: 640, offset: 7680)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !799, line: 123, size: 640, elements: !800)
!799 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!800 = !{!801, !809, !810}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !798, file: !799, line: 124, baseType: !802, size: 576)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 576, elements: !807)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !799, line: 108, size: 192, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !803, file: !799, line: 109, baseType: !57, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !803, file: !799, line: 110, baseType: !381, size: 128, offset: 64)
!807 = !{!808}
!808 = !DISubrange(count: 3)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !798, file: !799, line: 125, baseType: !7, size: 32, offset: 576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !798, file: !799, line: 126, baseType: !7, size: 32, offset: 608)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !241, file: !242, line: 917, baseType: !812, size: 192, offset: 8320)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !799, line: 134, size: 192, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !812, file: !799, line: 135, baseType: !757, size: 128, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !812, file: !799, line: 136, baseType: !7, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !241, file: !242, line: 923, baseType: !817, size: 64, offset: 8512)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !820, line: 11, flags: DIFlagFwdDecl)
!820 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!821 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !241, file: !242, line: 926, baseType: !817, size: 64, offset: 8576)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !241, file: !242, line: 929, baseType: !817, size: 64, offset: 8640)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !241, file: !242, line: 933, baseType: !824, size: 64, offset: 8704)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !242, line: 933, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !241, file: !242, line: 943, baseType: !827, size: 128, offset: 8768)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !159)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !241, file: !242, line: 945, baseType: !829, size: 64, offset: 8896)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !242, line: 49, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !241, file: !242, line: 956, baseType: !832, size: 64, offset: 8960)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !242, line: 45, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !241, file: !242, line: 959, baseType: !835, size: 64, offset: 9024)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !242, line: 959, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !241, file: !242, line: 962, baseType: !838, size: 64, offset: 9088)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !242, line: 66, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !241, file: !242, line: 966, baseType: !841, size: 64, offset: 9152)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !843, line: 35, flags: DIFlagFwdDecl)
!843 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!844 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !241, file: !242, line: 969, baseType: !845, size: 64, offset: 9216)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !799, line: 223, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !241, file: !242, line: 970, baseType: !848, size: 64, offset: 9280)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !242, line: 62, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !241, file: !242, line: 971, baseType: !851, size: 64, offset: 9344)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !852, line: 25, baseType: !853)
!852 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !852, line: 23, size: 64, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !853, file: !852, line: 24, baseType: !413, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !241, file: !242, line: 972, baseType: !851, size: 64, offset: 9408)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !241, file: !242, line: 974, baseType: !851, size: 64, offset: 9472)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !241, file: !242, line: 975, baseType: !859, size: 192, offset: 9536)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !860, line: 30, size: 192, elements: !861)
!860 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !859, file: !860, line: 31, baseType: !175, size: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !859, file: !860, line: 32, baseType: !851, size: 64, offset: 128)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !241, file: !242, line: 976, baseType: !59, size: 64, offset: 9728)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !241, file: !242, line: 977, baseType: !866, size: 64, offset: 9792)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !176, line: 55, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !368, line: 72, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !368, line: 16, baseType: !59)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !241, file: !242, line: 978, baseType: !7, size: 32, offset: 9856)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !241, file: !242, line: 980, baseType: !760, size: 64, offset: 9920)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !241, file: !242, line: 989, baseType: !872, size: 128, offset: 9984)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !873, line: 35, size: 128, elements: !874)
!873 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!874 = !{!875, !876, !877}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !872, file: !873, line: 36, baseType: !85, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !872, file: !873, line: 37, baseType: !230, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !872, file: !873, line: 38, baseType: !878, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !873, line: 23, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !241, file: !242, line: 992, baseType: !57, size: 64, offset: 10112)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !241, file: !242, line: 993, baseType: !57, size: 64, offset: 10176)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !241, file: !242, line: 996, baseType: !201, offset: 10240)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !241, file: !242, line: 999, baseType: !348, offset: 10240)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !241, file: !242, line: 1001, baseType: !885, size: 64, offset: 10240)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !242, line: 636, size: 64, elements: !886)
!886 = !{!887}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !885, file: !242, line: 637, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !241, file: !242, line: 1005, baseType: !384, size: 128, offset: 10304)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !241, file: !242, line: 1007, baseType: !240, size: 64, offset: 10432)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !241, file: !242, line: 1009, baseType: !892, size: 64, offset: 10496)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !242, line: 1009, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !241, file: !242, line: 1043, baseType: !96, size: 64, offset: 10560)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !241, file: !242, line: 1046, baseType: !896, size: 64, offset: 10624)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !242, line: 41, flags: DIFlagFwdDecl)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !241, file: !242, line: 1050, baseType: !899, size: 64, offset: 10688)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !242, line: 42, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !241, file: !242, line: 1054, baseType: !902, size: 64, offset: 10752)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !242, line: 55, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !241, file: !242, line: 1056, baseType: !905, size: 64, offset: 10816)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !242, line: 40, flags: DIFlagFwdDecl)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !241, file: !242, line: 1058, baseType: !908, size: 64, offset: 10880)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !242, line: 47, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !241, file: !242, line: 1061, baseType: !911, size: 64, offset: 10944)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !242, line: 43, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !241, file: !242, line: 1064, baseType: !59, size: 64, offset: 11008)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !241, file: !242, line: 1065, baseType: !915, size: 64, offset: 11072)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !860, line: 14, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !860, line: 12, size: 384, elements: !918)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_member, scope: !917, file: !860, line: 13, baseType: !920, size: 384)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !917, file: !860, line: 13, size: 384, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !920, file: !860, line: 13, baseType: !85, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !920, file: !860, line: 13, baseType: !85, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !920, file: !860, line: 13, baseType: !85, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !920, file: !860, line: 13, baseType: !926, size: 256, offset: 128)
