; ModuleID = '../bcout/drivers/mtd/maps/map_funcs.llvm.bc'
source_filename = "drivers/mtd/maps/map_funcs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.map_info = type { i8*, i64, i64, i8*, i8*, i32, i32, i64 (%struct.map_info*, i64)*, void (%struct.map_info*, i8*, i64, i64)*, void (%struct.map_info*, i64, i64)*, void (%struct.map_info*, i64, i8*, i64)*, void (%struct.map_info*, i64, i64)*, void (%struct.map_info*, i32)*, i64, i64, i64, %struct.device_node*, i8*, %struct.mtd_chip_driver* }
%struct.device_node = type opaque
%struct.mtd_chip_driver = type { %struct.mtd_info* (%struct.map_info*)*, void (%struct.mtd_info*)*, %struct.module*, i8*, %struct.list_head }
%struct.mtd_info = type opaque
%struct.module = type opaque
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%union.map_word = type { [1 x i64] }

@.str = private unnamed_addr constant [29 x i8] c"drivers/mtd/maps/map_funcs.c\00", align 1
@__UNIQUE_ID_file108 = internal constant [42 x i8] c"map_funcs.file=drivers/mtd/maps/map_funcs\00", section ".modinfo", align 1, !dbg !0
@__UNIQUE_ID_license109 = internal constant [22 x i8] c"map_funcs.license=GPL\00", section ".modinfo", align 1, !dbg !18
@.str.1 = private unnamed_addr constant [24 x i8] c"include/linux/mtd/map.h\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_file108", scope: !2, file: !3, line: 44, type: !24, isLocal: true, isDefinition: true, align: 8)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/mtd/maps/map_funcs.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !9, !12, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!11 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!0, !18}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "__UNIQUE_ID_license109", scope: !2, file: !3, line: 44, type: !20, isLocal: true, isDefinition: true, align: 8)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 176, elements: !22)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!22 = !{!23}
!23 = !DISubrange(count: 22)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 336, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 42)
!27 = !{i32 7, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 2}
!30 = !{i32 1, !"Code Model", i32 2}
!31 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!32 = distinct !DISubprogram(name: "simple_map_init", scope: !3, file: !3, line: 33, type: !33, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_info", file: !37, line: 191, size: 1152, elements: !38)
!37 = !DIFile(filename: "./include/linux/mtd/map.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !41, !43, !52, !54, !55, !57, !58, !69, !78, !83, !89, !93, !97, !98, !99, !100, !104, !105}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !36, file: !37, line: 192, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !37, line: 193, baseType: !42, size: 64, offset: 64)
!42 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "phys", scope: !36, file: !37, line: 194, baseType: !44, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !45, line: 158, baseType: !46)
!45 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !45, line: 153, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !48, line: 23, baseType: !49)
!48 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !50, line: 31, baseType: !51)
!50 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!51 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "virt", scope: !36, file: !37, line: 197, baseType: !53, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "cached", scope: !36, file: !37, line: 198, baseType: !53, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !36, file: !37, line: 200, baseType: !56, size: 32, offset: 320)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "bankwidth", scope: !36, file: !37, line: 201, baseType: !56, size: 32, offset: 352)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !36, file: !37, line: 207, baseType: !59, size: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !35, !42}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "map_word", file: !37, line: 171, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !37, line: 169, size: 64, elements: !64)
!64 = !{!65}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !37, line: 170, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 1)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "copy_from", scope: !36, file: !37, line: 208, baseType: !70, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !35, !53, !42, !73}
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !45, line: 60, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !75, line: 73, baseType: !76)
!75 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !75, line: 15, baseType: !77)
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !36, file: !37, line: 210, baseType: !79, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !35, !82, !42}
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "copy_to", scope: !36, file: !37, line: 211, baseType: !84, size: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !35, !42, !87, !73}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "inval_cache", scope: !36, file: !37, line: 222, baseType: !90, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !35, !42, !73}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "set_vpp", scope: !36, file: !37, line: 229, baseType: !94, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !35, !56}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pfow_base", scope: !36, file: !37, line: 231, baseType: !42, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "map_priv_1", scope: !36, file: !37, line: 232, baseType: !42, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "map_priv_2", scope: !36, file: !37, line: 233, baseType: !42, size: 64, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !36, file: !37, line: 234, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !103, line: 14, flags: DIFlagFwdDecl)
!103 = !DIFile(filename: "./include/linux/arch_topology.h", directory: "/home/lizy2001/genbc/linux")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "fldrv_priv", scope: !36, file: !37, line: 235, baseType: !53, size: 64, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "fldrv", scope: !36, file: !37, line: 236, baseType: !106, size: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_chip_driver", file: !37, line: 239, size: 384, elements: !108)
!108 = !{!109, !115, !119, !123, !124}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "probe", scope: !107, file: !37, line: 240, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !35}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "mtd_info", file: !37, line: 240, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !107, file: !37, line: 241, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !113}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !107, file: !37, line: 242, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !122, line: 76, flags: DIFlagFwdDecl)
!122 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !37, line: 243, baseType: !15, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !107, file: !37, line: 244, baseType: !125, size: 128, offset: 256)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !45, line: 178, size: 128, elements: !126)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !45, line: 179, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !45, line: 179, baseType: !128, size: 64, offset: 64)
!130 = !DILocalVariable(name: "map", arg: 1, scope: !32, file: !3, line: 33, type: !35)
!131 = !DILocation(line: 33, column: 39, scope: !32)
!132 = !DILocation(line: 35, column: 2, scope: !32)
!133 = !DILocation(line: 35, column: 2, scope: !134)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 35, column: 2)
!135 = distinct !DILexicalBlock(scope: !32, file: !3, line: 35, column: 2)
!136 = !DILocation(line: 35, column: 2, scope: !135)
!137 = !DILocation(line: 35, column: 2, scope: !138)
!138 = distinct !DILexicalBlock(scope: !134, file: !3, line: 35, column: 2)
!139 = !DILocation(line: 35, column: 2, scope: !140)
!140 = distinct !DILexicalBlock(scope: !138, file: !3, line: 35, column: 2)
!141 = !DILocation(line: 35, column: 2, scope: !142)
!142 = distinct !DILexicalBlock(scope: !138, file: !3, line: 35, column: 2)
!143 = !{i32 -2144213115, i32 -2144213086, i32 -2144213040, i32 -2144212982, i32 -2144212928, i32 -2144212874, i32 -2144212819, i32 -2144212788}
!144 = !DILocation(line: 35, column: 2, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !3, line: 35, column: 2)
!146 = distinct !DILexicalBlock(scope: !138, file: !3, line: 35, column: 2)
!147 = !{i32 -2144212338, i32 -2144212331, i32 -2144212277, i32 -2144212246, i32 -2144212216}
!148 = !DILocation(line: 35, column: 2, scope: !146)
!149 = !DILocation(line: 37, column: 2, scope: !32)
!150 = !DILocation(line: 37, column: 7, scope: !32)
!151 = !DILocation(line: 37, column: 12, scope: !32)
!152 = !DILocation(line: 38, column: 2, scope: !32)
!153 = !DILocation(line: 38, column: 7, scope: !32)
!154 = !DILocation(line: 38, column: 13, scope: !32)
!155 = !DILocation(line: 39, column: 2, scope: !32)
!156 = !DILocation(line: 39, column: 7, scope: !32)
!157 = !DILocation(line: 39, column: 17, scope: !32)
!158 = !DILocation(line: 40, column: 2, scope: !32)
!159 = !DILocation(line: 40, column: 7, scope: !32)
!160 = !DILocation(line: 40, column: 15, scope: !32)
!161 = !DILocation(line: 41, column: 1, scope: !32)
!162 = distinct !DISubprogram(name: "map_bankwidth_supported", scope: !37, file: !37, line: 139, type: !163, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!56, !56}
!165 = !DILocalVariable(name: "w", arg: 1, scope: !162, file: !37, line: 139, type: !56)
!166 = !DILocation(line: 139, column: 47, scope: !162)
!167 = !DILocation(line: 141, column: 10, scope: !162)
!168 = !DILocation(line: 141, column: 2, scope: !162)
!169 = !DILocation(line: 160, column: 3, scope: !170)
!170 = distinct !DILexicalBlock(scope: !162, file: !37, line: 141, column: 13)
!171 = !DILocation(line: 163, column: 3, scope: !170)
!172 = !DILocation(line: 165, column: 1, scope: !162)
!173 = distinct !DISubprogram(name: "simple_map_read", scope: !3, file: !3, line: 13, type: !60, scopeLine: 14, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!174 = !DILocalVariable(name: "map", arg: 1, scope: !173, file: !3, line: 13, type: !35)
!175 = !DILocation(line: 13, column: 59, scope: !173)
!176 = !DILocalVariable(name: "ofs", arg: 2, scope: !173, file: !3, line: 13, type: !42)
!177 = !DILocation(line: 13, column: 78, scope: !173)
!178 = !DILocation(line: 15, column: 25, scope: !173)
!179 = !DILocation(line: 15, column: 30, scope: !173)
!180 = !DILocation(line: 15, column: 9, scope: !173)
!181 = !DILocation(line: 15, column: 2, scope: !173)
!182 = distinct !DISubprogram(name: "simple_map_write", scope: !3, file: !3, line: 18, type: !80, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!183 = !DILocalVariable(name: "map", arg: 1, scope: !182, file: !3, line: 18, type: !35)
!184 = !DILocation(line: 18, column: 56, scope: !182)
