; ModuleID = '../bcout/drivers/pnp/pnpacpi/core.llvm.bc'
source_filename = "drivers/pnp/pnpacpi/core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall5.init\22, \22a\22\09"
module asm "__initcall_pnpacpi_init5:\09\09\09"
module asm ".long\09pnpacpi_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.pnp_dev = type { %struct.device, i64, i32, i32, %struct.list_head, %struct.list_head, %struct.list_head, %struct.list_head, %struct.pnp_protocol*, %struct.pnp_card*, %struct.pnp_driver*, %struct.pnp_card_link*, %struct.pnp_id*, i32, i32, i32, %struct.list_head, %struct.list_head, [50 x i8], i32, %struct.proc_dir_entry*, i8* }
%struct.pnp_protocol = type { %struct.list_head, i8*, {}*, {}*, {}*, i1 (%struct.pnp_dev*)*, i32 (%struct.pnp_dev*, i32)*, {}*, i8, %struct.device, %struct.list_head, %struct.list_head }
%struct.pnp_card = type { %struct.device, i8, %struct.list_head, %struct.list_head, %struct.list_head, %struct.pnp_protocol*, %struct.pnp_id*, [50 x i8], i8, i8, i32, i8, %struct.proc_dir_entry* }
%struct.pnp_driver = type { i8*, %struct.pnp_device_id*, i32, i32 (%struct.pnp_dev*, %struct.pnp_device_id*)*, void (%struct.pnp_dev*)*, void (%struct.pnp_dev*)*, i32 (%struct.pnp_dev*, i32)*, {}*, %struct.device_driver }
%struct.pnp_device_id = type { [8 x i8], i64 }

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !69, globals: !2425, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/pnp/pnpacpi/core.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11, !17, !23, !29, !36, !44, !50, !64}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 65, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !18, line: 26, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 10, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!69 = !{!70, !71, !591, !2419, !2420}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !73, line: 351, size: 10880, elements: !74)
!73 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!74 = !{!75, !77, !80, !2146, !2147, !2148, !2149, !2150, !2151, !2160, !2177, !2251, !2280, !2304, !2325, !2331, !2340, !2372, !2386, !2408, !2412, !2413, !2414, !2415, !2416, !2417, !2418}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !72, file: !73, line: 352, baseType: !76, size: 32)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !72, file: !73, line: 353, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !79, line: 424, baseType: !70)
!79 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !72, file: !73, line: 354, baseType: !81, size: 192, offset: 128)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !82, line: 17, size: 192, elements: !83)
!82 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!83 = !{!84, !86, !2145}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !81, file: !82, line: 18, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !81, file: !82, line: 19, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !82, line: 110, size: 1152, elements: !90)
!90 = !{!91, !95, !99, !108, !2087, !2091, !2095, !2100, !2104, !2105, !2109, !2113, !2117, !2128, !2129, !2130, !2131, !2141}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !89, file: !82, line: 111, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!85, !85}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !89, file: !82, line: 112, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !85}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !89, file: !82, line: 113, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !106}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !104, line: 30, baseType: !105)
!104 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!105 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !89, file: !82, line: 114, baseType: !109, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !106, !114}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !117)
!117 = !{!118, !1620, !1622, !1625, !1626, !1677, !1774, !1775, !1776, !1777, !1778, !1787, !1892, !1905, !2012, !2013, !2017, !2019, !2020, !2021, !2025, !2031, !2032, !2035, !2036, !2037, !2040, !2041, !2042, !2043, !2075, !2076, !2077, !2080, !2083, !2084, !2085, !2086}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !116, file: !30, line: 462, baseType: !119, size: 512)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !120, line: 64, size: 512, elements: !121)
!120 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!121 = !{!122, !126, !132, !134, !194, !1456, !1610, !1615, !1616, !1617, !1618, !1619}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 65, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !119, file: !120, line: 66, baseType: !127, size: 128, offset: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !104, line: 178, size: 128, elements: !128)
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !104, line: 179, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !127, file: !104, line: 179, baseType: !130, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !119, file: !120, line: 67, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !119, file: !120, line: 68, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !120, line: 192, size: 704, elements: !137)
!137 = !{!138, !139, !155, !156}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !136, file: !120, line: 193, baseType: !127, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !136, file: !120, line: 194, baseType: !140, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !141, line: 83, baseType: !142)
!141 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !141, line: 71, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, scope: !142, file: !141, line: 72, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !141, line: 72, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !145, file: !141, line: 73, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !141, line: 20, elements: !149)
!149 = !{!150}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !148, file: !141, line: 21, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !152, line: 25, baseType: !153)
!152 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !152, line: 25, elements: !154)
!154 = !{}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !136, file: !120, line: 195, baseType: !119, size: 512, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !136, file: !120, line: 196, baseType: !157, size: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !120, line: 156, size: 192, elements: !160)
!160 = !{!161, !166, !171}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !159, file: !120, line: 157, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!76, !135, !133}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !120, line: 158, baseType: !167, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!123, !135, !133}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !159, file: !120, line: 159, baseType: !172, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!76, !135, !133, !176}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !120, line: 148, size: 20736, elements: !178)
!178 = !{!179, !184, !188, !189, !193}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !177, file: !120, line: 149, baseType: !180, size: 192)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 192, elements: !182)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!182 = !{!183}
!183 = !DISubrange(count: 3)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !177, file: !120, line: 150, baseType: !185, size: 4096, offset: 192)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 4096, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !177, file: !120, line: 151, baseType: !76, size: 32, offset: 4288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !177, file: !120, line: 152, baseType: !190, size: 16384, offset: 4320)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 16384, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 2048)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !177, file: !120, line: 153, baseType: !76, size: 32, offset: 20704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !119, file: !120, line: 69, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !120, line: 138, size: 448, elements: !197)
!197 = !{!198, !202, !232, !234, !1403, !1434, !1438}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !196, file: !120, line: 139, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !133}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !196, file: !120, line: 140, baseType: !203, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !206, line: 230, size: 128, elements: !207)
!206 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!207 = !{!208, !224}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !205, file: !206, line: 231, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!212, !133, !217, !181}
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !104, line: 60, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !214, line: 73, baseType: !215)
!214 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !214, line: 15, baseType: !216)
!216 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !206, line: 30, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !218, file: !206, line: 31, baseType: !123, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !218, file: !206, line: 32, baseType: !222, size: 16, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !104, line: 19, baseType: !223)
!223 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !205, file: !206, line: 232, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{!212, !133, !217, !123, !228}
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 55, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !214, line: 72, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !214, line: 16, baseType: !231)
!231 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !196, file: !120, line: 141, baseType: !233, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !196, file: !120, line: 142, baseType: !235, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !206, line: 84, size: 320, elements: !239)
!239 = !{!240, !241, !245, !1400, !1401}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !206, line: 85, baseType: !123, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !238, file: !206, line: 86, baseType: !242, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!222, !133, !217, !76}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !238, file: !206, line: 88, baseType: !246, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!222, !133, !249, !76}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !206, line: 168, size: 448, elements: !251)
!251 = !{!252, !253, !254, !255, !265, !266}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !250, file: !206, line: 169, baseType: !218, size: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !206, line: 170, baseType: !228, size: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !250, file: !206, line: 171, baseType: !70, size: 64, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !250, file: !206, line: 172, baseType: !256, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!212, !259, !133, !249, !181, !262, !228}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !261, line: 526, flags: DIFlagFwdDecl)
!261 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !104, line: 46, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !214, line: 88, baseType: !264)
!264 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !250, file: !206, line: 174, baseType: !256, size: 64, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !250, file: !206, line: 176, baseType: !267, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!76, !259, !133, !249, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !272, line: 305, size: 1472, elements: !273)
!272 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !275, !276, !277, !278, !286, !287, !1374, !1380, !1381, !1386, !1387, !1390, !1394, !1395, !1396, !1397, !1398}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !271, file: !272, line: 308, baseType: !231, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !271, file: !272, line: 309, baseType: !231, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !271, file: !272, line: 313, baseType: !270, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !271, file: !272, line: 313, baseType: !270, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !271, file: !272, line: 315, baseType: !279, size: 192, align: 64, offset: 256)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !280, line: 24, size: 192, align: 64, elements: !281)
!280 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!281 = !{!282, !283, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !279, file: !280, line: 25, baseType: !231, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !279, file: !280, line: 26, baseType: !284, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !279, file: !280, line: 27, baseType: !284, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !271, file: !272, line: 323, baseType: !231, size: 64, offset: 448)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !271, file: !272, line: 327, baseType: !288, size: 64, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !272, line: 388, size: 7296, elements: !290)
!290 = !{!291, !1370}
!291 = !DIDerivedType(tag: DW_TAG_member, scope: !289, file: !272, line: 389, baseType: !292, size: 7296)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !272, line: 389, size: 7296, elements: !293)
!293 = !{!294, !295, !299, !305, !309, !310, !311, !312, !313, !321, !326, !327, !328, !329, !338, !339, !340, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !383, !386, !434, !435, !1341, !1342, !1345, !1348, !1349, !1352, !1353, !1354, !1357, !1369}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !292, file: !272, line: 390, baseType: !270, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !292, file: !272, line: 391, baseType: !296, size: 64, offset: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !280, line: 31, size: 64, elements: !297)
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !296, file: !280, line: 32, baseType: !284, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !292, file: !272, line: 392, baseType: !300, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !301, line: 23, baseType: !302)
!301 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !303, line: 31, baseType: !304)
!303 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!304 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !292, file: !272, line: 394, baseType: !306, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{!231, !259, !231, !231, !231, !231}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !292, file: !272, line: 398, baseType: !231, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !292, file: !272, line: 399, baseType: !231, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !292, file: !272, line: 405, baseType: !231, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !292, file: !272, line: 406, baseType: !231, size: 64, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !292, file: !272, line: 407, baseType: !314, size: 64, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !261, line: 286, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 286, size: 64, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !316, file: !261, line: 286, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !320, line: 18, baseType: !231)
!320 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!321 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !292, file: !272, line: 416, baseType: !322, size: 32, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !104, line: 168, baseType: !323)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 166, size: 32, elements: !324)
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !323, file: !104, line: 167, baseType: !76, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !292, file: !272, line: 428, baseType: !322, size: 32, offset: 608)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !292, file: !272, line: 437, baseType: !322, size: 32, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !292, file: !272, line: 447, baseType: !322, size: 32, offset: 672)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !292, file: !272, line: 450, baseType: !330, size: 64, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !331, line: 13, baseType: !332)
!331 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !104, line: 175, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !104, line: 173, size: 64, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !333, file: !104, line: 174, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !301, line: 22, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !303, line: 30, baseType: !264)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !292, file: !272, line: 452, baseType: !76, size: 32, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !292, file: !272, line: 454, baseType: !140, offset: 800)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !292, file: !272, line: 457, baseType: !341, size: 256, offset: 832)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !342, line: 35, size: 256, elements: !343)
!342 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!343 = !{!344, !345, !346, !348}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !341, file: !342, line: 36, baseType: !330, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !341, file: !342, line: 42, baseType: !330, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !341, file: !342, line: 46, baseType: !347, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !141, line: 29, baseType: !148)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !341, file: !342, line: 47, baseType: !127, size: 128, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !292, file: !272, line: 459, baseType: !127, size: 128, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !292, file: !272, line: 466, baseType: !231, size: 64, offset: 1216)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !292, file: !272, line: 467, baseType: !231, size: 64, offset: 1280)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !292, file: !272, line: 469, baseType: !231, size: 64, offset: 1344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !292, file: !272, line: 470, baseType: !231, size: 64, offset: 1408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !292, file: !272, line: 471, baseType: !332, size: 64, offset: 1472)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !292, file: !272, line: 472, baseType: !231, size: 64, offset: 1536)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !292, file: !272, line: 473, baseType: !231, size: 64, offset: 1600)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !292, file: !272, line: 474, baseType: !231, size: 64, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !292, file: !272, line: 475, baseType: !231, size: 64, offset: 1728)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !292, file: !272, line: 477, baseType: !140, offset: 1792)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !292, file: !272, line: 478, baseType: !231, size: 64, offset: 1792)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !292, file: !272, line: 478, baseType: !231, size: 64, offset: 1856)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !292, file: !272, line: 478, baseType: !231, size: 64, offset: 1920)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !292, file: !272, line: 478, baseType: !231, size: 64, offset: 1984)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !292, file: !272, line: 479, baseType: !231, size: 64, offset: 2048)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !292, file: !272, line: 479, baseType: !231, size: 64, offset: 2112)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !292, file: !272, line: 479, baseType: !231, size: 64, offset: 2176)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !292, file: !272, line: 480, baseType: !231, size: 64, offset: 2240)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !292, file: !272, line: 480, baseType: !231, size: 64, offset: 2304)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !292, file: !272, line: 480, baseType: !231, size: 64, offset: 2368)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !292, file: !272, line: 480, baseType: !231, size: 64, offset: 2432)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !292, file: !272, line: 482, baseType: !372, size: 2816, offset: 2496)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 2816, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 44)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !292, file: !272, line: 488, baseType: !376, size: 256, offset: 5312)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !377, line: 60, size: 256, elements: !378)
!377 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !376, file: !377, line: 61, baseType: !380, size: 256)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 256, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 4)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !292, file: !272, line: 490, baseType: !384, size: 64, offset: 5568)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !272, line: 490, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !292, file: !272, line: 493, baseType: !387, size: 896, offset: 5632)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !388, line: 53, baseType: !389)
!388 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !388, line: 13, size: 896, elements: !390)
!390 = !{!391, !392, !393, !394, !397, !398, !405, !406, !426, !427, !430}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !389, file: !388, line: 18, baseType: !300, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !389, file: !388, line: 28, baseType: !332, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !389, file: !388, line: 31, baseType: !341, size: 256, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !389, file: !388, line: 32, baseType: !395, size: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !388, line: 32, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !389, file: !388, line: 37, baseType: !223, size: 16, offset: 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !389, file: !388, line: 40, baseType: !399, size: 192, offset: 512)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !400, line: 53, size: 192, elements: !401)
!400 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !399, file: !400, line: 54, baseType: !330, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !399, file: !400, line: 55, baseType: !140, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !399, file: !400, line: 59, baseType: !127, size: 128, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !389, file: !388, line: 41, baseType: !70, size: 64, offset: 704)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !389, file: !388, line: 42, baseType: !407, size: 64, offset: 768)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !410, line: 13, size: 896, elements: !411)
!410 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !409, file: !410, line: 14, baseType: !70, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !410, line: 15, baseType: !231, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !409, file: !410, line: 17, baseType: !231, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !409, file: !410, line: 17, baseType: !231, size: 64, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !409, file: !410, line: 19, baseType: !216, size: 64, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !409, file: !410, line: 21, baseType: !216, size: 64, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !409, file: !410, line: 22, baseType: !216, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !409, file: !410, line: 23, baseType: !216, size: 64, offset: 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !409, file: !410, line: 24, baseType: !216, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !409, file: !410, line: 25, baseType: !216, size: 64, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !409, file: !410, line: 26, baseType: !216, size: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !409, file: !410, line: 27, baseType: !216, size: 64, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !409, file: !410, line: 28, baseType: !216, size: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !409, file: !410, line: 29, baseType: !216, size: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !389, file: !388, line: 44, baseType: !322, size: 32, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !389, file: !388, line: 50, baseType: !428, size: 16, offset: 864)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !301, line: 19, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !303, line: 24, baseType: !223)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !389, file: !388, line: 51, baseType: !431, size: 16, offset: 880)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !301, line: 18, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !303, line: 23, baseType: !433)
!433 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !272, line: 495, baseType: !231, size: 64, offset: 6528)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !292, file: !272, line: 497, baseType: !436, size: 64, offset: 6592)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !272, line: 381, size: 384, elements: !438)
!438 = !{!439, !440, !1340}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !437, file: !272, line: 382, baseType: !322, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !437, file: !272, line: 383, baseType: !441, size: 128, offset: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !272, line: 376, size: 128, elements: !442)
!442 = !{!443, !1338}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !441, file: !272, line: 377, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !446, line: 640, size: 48640, elements: !447)
!446 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!447 = !{!448, !456, !458, !459, !465, !466, !467, !468, !469, !470, !471, !472, !476, !494, !505, !600, !601, !602, !613, !614, !616, !617, !618, !619, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !698, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !754, !756, !757, !758, !770, !772, !773, !774, !775, !776, !782, !783, !784, !785, !786, !787, !788, !800, !805, !809, !810, !811, !814, !818, !821, !824, !827, !830, !833, !836, !839, !845, !846, !847, !853, !854, !855, !856, !857, !866, !867, !868, !869, !870, !875, !876, !877, !880, !881, !884, !887, !890, !893, !896, !899, !900, !980, !983, !986, !987, !990, !991, !992, !998, !999, !1000, !1013, !1014, !1015, !1025, !1030, !1033, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !445, file: !446, line: 646, baseType: !449, size: 128)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !450, line: 56, size: 128, elements: !451)
!450 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !450, line: 57, baseType: !231, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !449, file: !450, line: 58, baseType: !454, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !301, line: 21, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !303, line: 27, baseType: !7)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !445, file: !446, line: 649, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !445, file: !446, line: 657, baseType: !70, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !445, file: !446, line: 658, baseType: !460, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !461, line: 113, baseType: !462)
!461 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !461, line: 111, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !462, file: !461, line: 112, baseType: !322, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !445, file: !446, line: 660, baseType: !7, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !445, file: !446, line: 661, baseType: !7, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !445, file: !446, line: 684, baseType: !76, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !445, file: !446, line: 686, baseType: !76, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !445, file: !446, line: 687, baseType: !76, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !445, file: !446, line: 688, baseType: !76, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !445, file: !446, line: 689, baseType: !7, size: 32, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !445, file: !446, line: 691, baseType: !473, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !446, line: 691, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !445, file: !446, line: 692, baseType: !477, size: 832, offset: 576)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !446, line: 451, size: 832, elements: !478)
!478 = !{!479, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !477, file: !446, line: 453, baseType: !480, size: 128)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !446, line: 325, size: 128, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !480, file: !446, line: 326, baseType: !231, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !480, file: !446, line: 327, baseType: !454, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !477, file: !446, line: 454, baseType: !279, size: 192, align: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !477, file: !446, line: 455, baseType: !127, size: 128, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !477, file: !446, line: 456, baseType: !7, size: 32, offset: 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !477, file: !446, line: 458, baseType: !300, size: 64, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !477, file: !446, line: 459, baseType: !300, size: 64, offset: 576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !477, file: !446, line: 460, baseType: !300, size: 64, offset: 640)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !477, file: !446, line: 461, baseType: !300, size: 64, offset: 704)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !477, file: !446, line: 463, baseType: !300, size: 64, offset: 768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !477, file: !446, line: 465, baseType: !493, offset: 832)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !446, line: 415, elements: !154)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !445, file: !446, line: 693, baseType: !495, size: 384, offset: 1408)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !446, line: 489, size: 384, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !495, file: !446, line: 490, baseType: !127, size: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !495, file: !446, line: 491, baseType: !231, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !495, file: !446, line: 492, baseType: !231, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !495, file: !446, line: 493, baseType: !7, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !495, file: !446, line: 494, baseType: !223, size: 16, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !495, file: !446, line: 495, baseType: !223, size: 16, offset: 304)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !495, file: !446, line: 497, baseType: !504, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !445, file: !446, line: 697, baseType: !506, size: 1792, offset: 1792)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !446, line: 507, size: 1792, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !597, !598}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !506, file: !446, line: 508, baseType: !279, size: 192, align: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !506, file: !446, line: 515, baseType: !300, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !506, file: !446, line: 516, baseType: !300, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !506, file: !446, line: 517, baseType: !300, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !506, file: !446, line: 518, baseType: !300, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !506, file: !446, line: 519, baseType: !300, size: 64, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !506, file: !446, line: 526, baseType: !336, size: 64, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !506, file: !446, line: 527, baseType: !300, size: 64, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !506, file: !446, line: 528, baseType: !7, size: 32, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !506, file: !446, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !506, file: !446, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !506, file: !446, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !506, file: !446, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !506, file: !446, line: 563, baseType: !522, size: 512, offset: 704)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !523)
!523 = !{!524, !532, !533, !538, !590, !594, !595, !596}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !522, file: !6, line: 119, baseType: !525, size: 256)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !526, line: 9, size: 256, elements: !527)
!526 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !525, file: !526, line: 10, baseType: !279, size: 192, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !525, file: !526, line: 11, baseType: !530, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !531, line: 29, baseType: !336)
!531 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !522, file: !6, line: 120, baseType: !530, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !522, file: !6, line: 121, baseType: !534, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DISubroutineType(types: !536)
!536 = !{!5, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !522, file: !6, line: 122, baseType: !539, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !541)
!541 = !{!542, !562, !563, !566, !576, !577, !585, !589}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !540, file: !6, line: 160, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !544, file: !6, line: 215, baseType: !347)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !544, file: !6, line: 216, baseType: !7, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !544, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !544, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !544, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !544, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !544, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !544, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !544, file: !6, line: 233, baseType: !530, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !544, file: !6, line: 234, baseType: !537, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !544, file: !6, line: 235, baseType: !530, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !544, file: !6, line: 236, baseType: !537, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !544, file: !6, line: 237, baseType: !559, size: 4096, offset: 512)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 4096, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !540, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !540, file: !6, line: 162, baseType: !564, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !104, line: 27, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !214, line: 96, baseType: !76)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !540, file: !6, line: 163, baseType: !567, size: 32, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !568, line: 276, baseType: !569)
!568 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !568, line: 276, size: 32, elements: !570)
!570 = !{!571}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !569, file: !568, line: 276, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !568, line: 70, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !568, line: 65, size: 32, elements: !574)
!574 = !{!575}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !573, file: !568, line: 66, baseType: !7, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !540, file: !6, line: 164, baseType: !537, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !540, file: !6, line: 165, baseType: !578, size: 128, offset: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !526, line: 14, size: 128, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !578, file: !526, line: 15, baseType: !581, size: 128)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !280, line: 125, size: 128, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !581, file: !280, line: 126, baseType: !296, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !581, file: !280, line: 127, baseType: !284, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !540, file: !6, line: 166, baseType: !586, size: 64, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!530}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !540, file: !6, line: 167, baseType: !530, size: 64, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !522, file: !6, line: 123, baseType: !591, size: 8, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !301, line: 17, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !303, line: 21, baseType: !593)
!593 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !522, file: !6, line: 124, baseType: !591, size: 8, offset: 456)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !522, file: !6, line: 125, baseType: !591, size: 8, offset: 464)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !522, file: !6, line: 126, baseType: !591, size: 8, offset: 472)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !506, file: !446, line: 572, baseType: !522, size: 512, offset: 1216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !506, file: !446, line: 580, baseType: !599, size: 64, offset: 1728)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !445, file: !446, line: 721, baseType: !7, size: 32, offset: 3584)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !445, file: !446, line: 722, baseType: !76, size: 32, offset: 3616)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !445, file: !446, line: 723, baseType: !603, size: 64, offset: 3648)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !606, line: 17, baseType: !607)
!606 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !606, line: 17, size: 64, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !607, file: !606, line: 17, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 64, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 1)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !445, file: !446, line: 724, baseType: !605, size: 64, offset: 3712)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !445, file: !446, line: 749, baseType: !615, offset: 3776)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !446, line: 290, elements: !154)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !445, file: !446, line: 751, baseType: !127, size: 128, offset: 3776)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !445, file: !446, line: 757, baseType: !288, size: 64, offset: 3904)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !445, file: !446, line: 758, baseType: !288, size: 64, offset: 3968)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !445, file: !446, line: 761, baseType: !620, size: 320, offset: 4032)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !377, line: 34, size: 320, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !620, file: !377, line: 35, baseType: !300, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !620, file: !377, line: 36, baseType: !624, size: 256, offset: 64)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 256, elements: !381)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !445, file: !446, line: 766, baseType: !76, size: 32, offset: 4352)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !445, file: !446, line: 767, baseType: !76, size: 32, offset: 4384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !445, file: !446, line: 768, baseType: !76, size: 32, offset: 4416)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !445, file: !446, line: 770, baseType: !76, size: 32, offset: 4448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !445, file: !446, line: 772, baseType: !231, size: 64, offset: 4480)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !445, file: !446, line: 775, baseType: !7, size: 32, offset: 4544)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !445, file: !446, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !445, file: !446, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !445, file: !446, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !445, file: !446, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !445, file: !446, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !445, file: !446, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !445, file: !446, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !445, file: !446, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !445, file: !446, line: 831, baseType: !231, size: 64, offset: 4672)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !445, file: !446, line: 833, baseType: !641, size: 384, offset: 4736)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !642)
!642 = !{!643, !648}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !641, file: !12, line: 26, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!216, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !12, line: 27, baseType: !649, size: 320, offset: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !12, line: 27, size: 320, elements: !650)
!650 = !{!651, !661, !688}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !649, file: !12, line: 36, baseType: !652, size: 320)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !12, line: 29, size: 320, elements: !653)
!653 = !{!654, !656, !657, !658, !659, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !652, file: !12, line: 30, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !652, file: !12, line: 31, baseType: !454, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !652, file: !12, line: 32, baseType: !454, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !652, file: !12, line: 33, baseType: !454, size: 32, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !652, file: !12, line: 34, baseType: !300, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !652, file: !12, line: 35, baseType: !655, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !649, file: !12, line: 46, baseType: !662, size: 192)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !12, line: 38, size: 192, elements: !663)
!663 = !{!664, !665, !666, !687}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !662, file: !12, line: 39, baseType: !564, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, scope: !662, file: !12, line: 41, baseType: !667, size: 64, offset: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !662, file: !12, line: 41, size: 64, elements: !668)
!668 = !{!669, !677}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !667, file: !12, line: 42, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !672, line: 7, size: 128, elements: !673)
!672 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!673 = !{!674, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !671, file: !672, line: 8, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !214, line: 93, baseType: !264)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !671, file: !672, line: 9, baseType: !264, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !667, file: !12, line: 43, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !680, line: 7, size: 64, elements: !681)
!680 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!681 = !{!682, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !679, file: !680, line: 8, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !680, line: 5, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !301, line: 20, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !303, line: 26, baseType: !76)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !679, file: !680, line: 9, baseType: !684, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !662, file: !12, line: 45, baseType: !300, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !649, file: !12, line: 54, baseType: !689, size: 256)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !12, line: 48, size: 256, elements: !690)
!690 = !{!691, !694, !695, !696, !697}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !689, file: !12, line: 49, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !689, file: !12, line: 50, baseType: !76, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !689, file: !12, line: 51, baseType: !76, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !689, file: !12, line: 52, baseType: !231, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !689, file: !12, line: 53, baseType: !231, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !445, file: !446, line: 835, baseType: !699, size: 32, offset: 5120)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !104, line: 22, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !214, line: 28, baseType: !76)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !445, file: !446, line: 836, baseType: !699, size: 32, offset: 5152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !445, file: !446, line: 840, baseType: !231, size: 64, offset: 5184)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !445, file: !446, line: 849, baseType: !444, size: 64, offset: 5248)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !445, file: !446, line: 852, baseType: !444, size: 64, offset: 5312)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !445, file: !446, line: 857, baseType: !127, size: 128, offset: 5376)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !445, file: !446, line: 858, baseType: !127, size: 128, offset: 5504)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !445, file: !446, line: 859, baseType: !444, size: 64, offset: 5632)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !445, file: !446, line: 867, baseType: !127, size: 128, offset: 5696)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !445, file: !446, line: 868, baseType: !127, size: 128, offset: 5824)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !445, file: !446, line: 871, baseType: !711, size: 64, offset: 5952)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !713, line: 59, size: 768, elements: !714)
!713 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!714 = !{!715, !716, !717, !718, !729, !730, !737, !746}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !712, file: !713, line: 61, baseType: !460, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !712, file: !713, line: 62, baseType: !7, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !712, file: !713, line: 63, baseType: !140, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !712, file: !713, line: 65, baseType: !719, size: 256, offset: 64)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 256, elements: !381)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !104, line: 182, size: 64, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !720, file: !104, line: 183, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !104, line: 186, size: 128, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !104, line: 187, baseType: !723, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !724, file: !104, line: 187, baseType: !728, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !712, file: !713, line: 66, baseType: !720, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !712, file: !713, line: 68, baseType: !731, size: 128, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !732, line: 40, baseType: !733)
!732 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !732, line: 36, size: 128, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !733, file: !732, line: 37, baseType: !140)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !733, file: !732, line: 38, baseType: !127, size: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !712, file: !713, line: 69, baseType: !738, size: 128, align: 64, offset: 512)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !104, line: 216, size: 128, align: 64, elements: !739)
!739 = !{!740, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !104, line: 217, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !738, file: !104, line: 218, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !741}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !712, file: !713, line: 70, baseType: !747, size: 128, offset: 640)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !611)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !713, line: 54, size: 128, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !748, file: !713, line: 55, baseType: !76, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !748, file: !713, line: 56, baseType: !752, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !713, line: 56, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !445, file: !446, line: 872, baseType: !755, size: 512, offset: 6016)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 512, elements: !381)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !445, file: !446, line: 873, baseType: !127, size: 128, offset: 6528)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !445, file: !446, line: 874, baseType: !127, size: 128, offset: 6656)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !445, file: !446, line: 876, baseType: !759, size: 64, offset: 6784)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !761, line: 26, size: 192, elements: !762)
!761 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !760, file: !761, line: 27, baseType: !7, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !760, file: !761, line: 28, baseType: !765, size: 128, offset: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !766, line: 43, size: 128, elements: !767)
!766 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !765, file: !766, line: 44, baseType: !347)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !765, file: !766, line: 45, baseType: !127, size: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !445, file: !446, line: 879, baseType: !771, size: 64, offset: 6848)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !445, file: !446, line: 882, baseType: !771, size: 64, offset: 6912)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !445, file: !446, line: 884, baseType: !300, size: 64, offset: 6976)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !445, file: !446, line: 885, baseType: !300, size: 64, offset: 7040)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !445, file: !446, line: 890, baseType: !300, size: 64, offset: 7104)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !445, file: !446, line: 891, baseType: !777, size: 128, offset: 7168)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !446, line: 242, size: 128, elements: !778)
!778 = !{!779, !780, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !777, file: !446, line: 244, baseType: !300, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !777, file: !446, line: 245, baseType: !300, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !777, file: !446, line: 246, baseType: !347, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !445, file: !446, line: 900, baseType: !231, size: 64, offset: 7296)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !445, file: !446, line: 901, baseType: !231, size: 64, offset: 7360)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !445, file: !446, line: 904, baseType: !300, size: 64, offset: 7424)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !445, file: !446, line: 907, baseType: !300, size: 64, offset: 7488)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !445, file: !446, line: 910, baseType: !231, size: 64, offset: 7552)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !445, file: !446, line: 911, baseType: !231, size: 64, offset: 7616)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !445, file: !446, line: 914, baseType: !789, size: 640, offset: 7680)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !790, line: 123, size: 640, elements: !791)
!790 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!791 = !{!792, !798, !799}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !789, file: !790, line: 124, baseType: !793, size: 576)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 576, elements: !182)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !790, line: 108, size: 192, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !794, file: !790, line: 109, baseType: !300, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !794, file: !790, line: 110, baseType: !578, size: 128, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !789, file: !790, line: 125, baseType: !7, size: 32, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !789, file: !790, line: 126, baseType: !7, size: 32, offset: 608)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !445, file: !446, line: 917, baseType: !801, size: 192, offset: 8320)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !790, line: 134, size: 192, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !801, file: !790, line: 135, baseType: !738, size: 128, align: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !801, file: !790, line: 136, baseType: !7, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !445, file: !446, line: 923, baseType: !806, size: 64, offset: 8512)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !446, line: 923, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !445, file: !446, line: 926, baseType: !806, size: 64, offset: 8576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !445, file: !446, line: 929, baseType: !806, size: 64, offset: 8640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !445, file: !446, line: 933, baseType: !812, size: 64, offset: 8704)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !446, line: 933, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !445, file: !446, line: 943, baseType: !815, size: 128, offset: 8768)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 16)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !445, file: !446, line: 945, baseType: !819, size: 64, offset: 8896)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !446, line: 49, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !445, file: !446, line: 956, baseType: !822, size: 64, offset: 8960)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !446, line: 45, flags: DIFlagFwdDecl)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !445, file: !446, line: 959, baseType: !825, size: 64, offset: 9024)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !446, line: 959, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !445, file: !446, line: 962, baseType: !828, size: 64, offset: 9088)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !446, line: 66, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !445, file: !446, line: 966, baseType: !831, size: 64, offset: 9152)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !446, line: 50, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !445, file: !446, line: 969, baseType: !834, size: 64, offset: 9216)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !790, line: 223, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !445, file: !446, line: 970, baseType: !837, size: 64, offset: 9280)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !446, line: 62, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !445, file: !446, line: 971, baseType: !840, size: 64, offset: 9344)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !841, line: 25, baseType: !842)
!841 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !841, line: 23, size: 64, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !842, file: !841, line: 24, baseType: !610, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !445, file: !446, line: 972, baseType: !840, size: 64, offset: 9408)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !445, file: !446, line: 974, baseType: !840, size: 64, offset: 9472)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !445, file: !446, line: 975, baseType: !848, size: 192, offset: 9536)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !849, line: 30, size: 192, elements: !850)
!849 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !848, file: !849, line: 31, baseType: !127, size: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !848, file: !849, line: 32, baseType: !840, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !445, file: !446, line: 976, baseType: !231, size: 64, offset: 9728)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !445, file: !446, line: 977, baseType: !228, size: 64, offset: 9792)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !445, file: !446, line: 978, baseType: !7, size: 32, offset: 9856)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !445, file: !446, line: 980, baseType: !741, size: 64, offset: 9920)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !445, file: !446, line: 989, baseType: !858, size: 128, offset: 9984)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !859, line: 35, size: 128, elements: !860)
!859 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !858, file: !859, line: 36, baseType: !76, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !858, file: !859, line: 37, baseType: !322, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !858, file: !859, line: 38, baseType: !864, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !859, line: 23, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !445, file: !446, line: 992, baseType: !300, size: 64, offset: 10112)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !445, file: !446, line: 993, baseType: !300, size: 64, offset: 10176)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !445, file: !446, line: 996, baseType: !140, offset: 10240)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !445, file: !446, line: 999, baseType: !347, offset: 10240)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !445, file: !446, line: 1001, baseType: !871, size: 64, offset: 10240)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !446, line: 636, size: 64, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !446, line: 637, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !445, file: !446, line: 1005, baseType: !581, size: 128, offset: 10304)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !445, file: !446, line: 1007, baseType: !444, size: 64, offset: 10432)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !445, file: !446, line: 1009, baseType: !878, size: 64, offset: 10496)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !446, line: 1009, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !445, file: !446, line: 1043, baseType: !70, size: 64, offset: 10560)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !445, file: !446, line: 1046, baseType: !882, size: 64, offset: 10624)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !446, line: 41, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !445, file: !446, line: 1050, baseType: !885, size: 64, offset: 10688)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !446, line: 42, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !445, file: !446, line: 1054, baseType: !888, size: 64, offset: 10752)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !446, line: 55, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !445, file: !446, line: 1056, baseType: !891, size: 64, offset: 10816)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !446, line: 40, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !445, file: !446, line: 1058, baseType: !894, size: 64, offset: 10880)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !446, line: 47, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !445, file: !446, line: 1061, baseType: !897, size: 64, offset: 10944)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !446, line: 43, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !445, file: !446, line: 1064, baseType: !231, size: 64, offset: 11008)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !445, file: !446, line: 1065, baseType: !901, size: 64, offset: 11072)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !849, line: 14, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !849, line: 12, size: 384, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, scope: !903, file: !849, line: 13, baseType: !906, size: 384)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !903, file: !849, line: 13, size: 384, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !906, file: !849, line: 13, baseType: !76, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !906, file: !849, line: 13, baseType: !76, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !906, file: !849, line: 13, baseType: !76, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !906, file: !849, line: 13, baseType: !912, size: 256, offset: 128)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !913, line: 32, size: 256, elements: !914)
!913 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!914 = !{!915, !921, !934, !940, !949, !969, !974}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !912, file: !913, line: 37, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 34, size: 64, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !916, file: !913, line: 35, baseType: !700, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !916, file: !913, line: 36, baseType: !920, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !214, line: 49, baseType: !7)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !912, file: !913, line: 45, baseType: !922, size: 192)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 40, size: 192, elements: !923)
!923 = !{!924, !926, !927, !933}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !922, file: !913, line: 41, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !214, line: 95, baseType: !76)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !922, file: !913, line: 42, baseType: !76, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !922, file: !913, line: 43, baseType: !928, size: 64, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !913, line: 11, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !913, line: 8, size: 64, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !929, file: !913, line: 9, baseType: !76, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !929, file: !913, line: 10, baseType: !70, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !922, file: !913, line: 44, baseType: !76, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !912, file: !913, line: 52, baseType: !935, size: 128)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 48, size: 128, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !935, file: !913, line: 49, baseType: !700, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !935, file: !913, line: 50, baseType: !920, size: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !935, file: !913, line: 51, baseType: !928, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !912, file: !913, line: 61, baseType: !941, size: 256)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !912, file: !913, line: 55, size: 256, elements: !942)
!942 = !{!943, !944, !945, !946, !948}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !941, file: !913, line: 56, baseType: !700, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !941, file: !913, line: 57, baseType: !920, size: 32, offset: 32)
