; ModuleID = '../bcout/drivers/acpi/ac.llvm.bc'
source_filename = "drivers/acpi/ac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_acpi_ac_init6:\09\09\09"
module asm ".long\09acpi_ac_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.acpi_driver = type { [80 x i8], [80 x i8], %struct.acpi_device_id*, i32, %struct.acpi_device_ops, %struct.device_driver, %struct.module* }
%struct.acpi_device_id = type { [9 x i8], i64, i32, i32 }
%struct.acpi_device_ops = type { i32 (%struct.acpi_device*)*, i32 (%struct.acpi_device*)*, void (%struct.acpi_device*, i32)* }
%struct.acpi_device = type { i32, i8*, %struct.fwnode_handle, %struct.acpi_device*, %struct.list_head, %struct.list_head, %struct.list_head, %struct.list_head, %struct.acpi_device_status, %struct.acpi_device_flags, %struct.acpi_device_pnp, %struct.acpi_device_power, %struct.acpi_device_wakeup, %struct.acpi_device_perf, %struct.acpi_device_dir, %struct.acpi_device_data, %struct.acpi_scan_handler*, %struct.acpi_hotplug_context*, %struct.acpi_driver*, %struct.acpi_gpio_mapping*, i8*, %struct.device, i32, i32, %struct.list_head, %struct.mutex, void (%struct.acpi_device*)* }
%struct.fwnode_handle = type { %struct.fwnode_handle*, %struct.fwnode_operations*, %struct.device* }

!148 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_ALERT_MIN", value: 54, isUnsigned: true)
!149 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_ALERT_MAX", value: 55, isUnsigned: true)
!150 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_AMBIENT", value: 56, isUnsigned: true)
!151 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_AMBIENT_ALERT_MIN", value: 57, isUnsigned: true)
!152 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TEMP_AMBIENT_ALERT_MAX", value: 58, isUnsigned: true)
!153 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_EMPTY_NOW", value: 59, isUnsigned: true)
!154 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_EMPTY_AVG", value: 60, isUnsigned: true)
!155 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_FULL_NOW", value: 61, isUnsigned: true)
!156 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TIME_TO_FULL_AVG", value: 62, isUnsigned: true)
!157 = !DIEnumerator(name: "POWER_SUPPLY_PROP_TYPE", value: 63, isUnsigned: true)
!158 = !DIEnumerator(name: "POWER_SUPPLY_PROP_USB_TYPE", value: 64, isUnsigned: true)
!159 = !DIEnumerator(name: "POWER_SUPPLY_PROP_SCOPE", value: 65, isUnsigned: true)
!160 = !DIEnumerator(name: "POWER_SUPPLY_PROP_PRECHARGE_CURRENT", value: 66, isUnsigned: true)
!161 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CHARGE_TERM_CURRENT", value: 67, isUnsigned: true)
!162 = !DIEnumerator(name: "POWER_SUPPLY_PROP_CALIBRATE", value: 68, isUnsigned: true)
!163 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURE_YEAR", value: 69, isUnsigned: true)
!164 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURE_MONTH", value: 70, isUnsigned: true)
!165 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURE_DAY", value: 71, isUnsigned: true)
!166 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MODEL_NAME", value: 72, isUnsigned: true)
!167 = !DIEnumerator(name: "POWER_SUPPLY_PROP_MANUFACTURER", value: 73, isUnsigned: true)
!168 = !DIEnumerator(name: "POWER_SUPPLY_PROP_SERIAL_NUMBER", value: 74, isUnsigned: true)
!169 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !170, line: 305, baseType: !7, size: 32, elements: !171)
!170 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!171 = !{!172, !173, !174, !175}
!172 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!173 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!174 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!175 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobject_action", file: !177, line: 53, baseType: !7, size: 32, elements: !178)
!177 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186}
!179 = !DIEnumerator(name: "KOBJ_ADD", value: 0, isUnsigned: true)
!180 = !DIEnumerator(name: "KOBJ_REMOVE", value: 1, isUnsigned: true)
!181 = !DIEnumerator(name: "KOBJ_CHANGE", value: 2, isUnsigned: true)
!182 = !DIEnumerator(name: "KOBJ_MOVE", value: 3, isUnsigned: true)
!183 = !DIEnumerator(name: "KOBJ_ONLINE", value: 4, isUnsigned: true)
!184 = !DIEnumerator(name: "KOBJ_OFFLINE", value: 5, isUnsigned: true)
!185 = !DIEnumerator(name: "KOBJ_BIND", value: 6, isUnsigned: true)
!186 = !DIEnumerator(name: "KOBJ_UNBIND", value: 7, isUnsigned: true)
!187 = !{!188, !190, !191, !192, !198, !199, !200, !2631, !194, !2337}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !189, line: 148, baseType: !7)
!189 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!190 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !193, line: 421, baseType: !194)
!193 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !195, line: 21, baseType: !196)
!195 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !197, line: 27, baseType: !7)
!197 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!198 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!199 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_ac", file: !3, line: 81, size: 1152, elements: !202)
!202 = !{!203, !2335, !2336, !2618, !2619}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "charger", scope: !201, file: !3, line: 82, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "power_supply", file: !65, line: 273, size: 7168, elements: !206)
!206 = !{!207, !257, !260, !261, !262, !263, !2312, !2313, !2314, !2315, !2324, !2325, !2326, !2327, !2328, !2329, !2332}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !205, file: !65, line: 274, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "power_supply_desc", file: !65, line: 233, size: 768, elements: !211)
!211 = !{!212, !216, !217, !220, !225, !228, !229, !238, !244, !248, !252, !253, !256}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !65, line: 234, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !210, file: !65, line: 235, baseType: !64, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "usb_types", scope: !210, file: !65, line: 236, baseType: !218, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_usb_types", scope: !210, file: !65, line: 237, baseType: !221, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !189, line: 55, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !223, line: 72, baseType: !224)
!223 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !223, line: 16, baseType: !198)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !210, file: !65, line: 238, baseType: !226, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "num_properties", scope: !210, file: !65, line: 239, baseType: !221, size: 64, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "get_property", scope: !210, file: !65, line: 247, baseType: !230, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{!190, !204, !92, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "power_supply_propval", file: !65, line: 209, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !234, file: !65, line: 210, baseType: !190, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "strval", scope: !234, file: !65, line: 211, baseType: !213, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "set_property", scope: !210, file: !65, line: 250, baseType: !239, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!190, !204, !92, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "property_is_writeable", scope: !210, file: !65, line: 258, baseType: !245, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!190, !204, !92}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "external_power_changed", scope: !210, file: !65, line: 260, baseType: !249, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !204}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "set_charged", scope: !210, file: !65, line: 261, baseType: !249, size: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "no_thermal", scope: !210, file: !65, line: 268, baseType: !254, size: 8, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !189, line: 30, baseType: !255)
!255 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "use_for_apm", scope: !210, file: !65, line: 270, baseType: !190, size: 32, offset: 736)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "supplied_to", scope: !205, file: !65, line: 276, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num_supplicants", scope: !205, file: !65, line: 277, baseType: !221, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "supplied_from", scope: !205, file: !65, line: 279, baseType: !258, size: 64, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_supplies", scope: !205, file: !65, line: 280, baseType: !221, size: 64, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "of_node", scope: !205, file: !65, line: 281, baseType: !264, size: 64, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_node", file: !266, line: 51, size: 1344, elements: !267)
!266 = !DIFile(filename: "./include/linux/of.h", directory: "/home/lizy2001/genbc/linux")
!267 = !{!268, !269, !271, !272, !2296, !2305, !2306, !2307, !2308, !2309, !2310, !2311}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !266, line: 52, baseType: !213, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "phandle", scope: !265, file: !266, line: 53, baseType: !270, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "phandle", file: !266, line: 28, baseType: !194)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !265, file: !266, line: 54, baseType: !213, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !265, file: !266, line: 55, baseType: !273, size: 192, offset: 192)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !274, line: 17, size: 192, elements: !275)
!274 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!275 = !{!276, !278, !2295}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !273, file: !274, line: 18, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !273, file: !274, line: 19, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !274, line: 110, size: 1152, elements: !282)
!282 = !{!283, !287, !291, !297, !2237, !2241, !2245, !2250, !2254, !2255, !2259, !2263, !2267, !2278, !2279, !2280, !2281, !2291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !281, file: !274, line: 111, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!277, !277}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !281, file: !274, line: 112, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !277}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !281, file: !274, line: 113, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!254, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !281, file: !274, line: 114, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !295, !303}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !306)
!306 = !{!307, !1795, !1797, !1800, !1801, !1852, !1949, !1950, !1951, !1952, !1953, !1962, !2067, !2080, !2162, !2163, !2167, !2169, !2170, !2171, !2175, !2181, !2182, !2185, !2186, !2187, !2190, !2191, !2192, !2193, !2225, !2226, !2227, !2230, !2233, !2234, !2235, !2236}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !305, file: !30, line: 462, baseType: !308, size: 512)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !177, line: 64, size: 512, elements: !309)
!309 = !{!310, !311, !317, !319, !378, !1632, !1785, !1790, !1791, !1792, !1793, !1794}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !177, line: 65, baseType: !213, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !308, file: !177, line: 66, baseType: !312, size: 128, offset: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !189, line: 178, size: 128, elements: !313)
!313 = !{!314, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !189, line: 179, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !189, line: 179, baseType: !315, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !177, line: 67, baseType: !318, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !308, file: !177, line: 68, baseType: !320, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !177, line: 192, size: 704, elements: !322)
!322 = !{!323, !324, !340, !341}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !321, file: !177, line: 193, baseType: !312, size: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !321, file: !177, line: 194, baseType: !325, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !326, line: 83, baseType: !327)
!326 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !326, line: 71, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !327, file: !326, line: 72, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !327, file: !326, line: 72, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !330, file: !326, line: 73, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !326, line: 20, elements: !334)
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !333, file: !326, line: 21, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !337, line: 25, baseType: !338)
!337 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !337, line: 25, elements: !339)
!339 = !{}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !321, file: !177, line: 195, baseType: !308, size: 512, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !321, file: !177, line: 196, baseType: !342, size: 64, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !177, line: 156, size: 192, elements: !345)
!345 = !{!346, !351, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !344, file: !177, line: 157, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!190, !320, !318}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !177, line: 158, baseType: !352, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!213, !320, !318}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !344, file: !177, line: 159, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!190, !320, !318, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !177, line: 148, size: 20736, elements: !363)
!363 = !{!364, !368, !372, !373, !377}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !362, file: !177, line: 149, baseType: !365, size: 192)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 192, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 3)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !362, file: !177, line: 150, baseType: !369, size: 4096, offset: 192)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 4096, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !362, file: !177, line: 151, baseType: !190, size: 32, offset: 4288)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !362, file: !177, line: 152, baseType: !374, size: 16384, offset: 4320)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 16384, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 2048)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !362, file: !177, line: 153, baseType: !190, size: 32, offset: 20704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !308, file: !177, line: 69, baseType: !379, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !177, line: 138, size: 448, elements: !381)
!381 = !{!382, !386, !410, !412, !1580, !1611, !1615}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !380, file: !177, line: 139, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !318}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !380, file: !177, line: 140, baseType: !387, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !390, line: 230, size: 128, elements: !391)
!390 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!391 = !{!392, !406}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !389, file: !390, line: 231, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!396, !318, !399, !259}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !189, line: 60, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !223, line: 73, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !223, line: 15, baseType: !199)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !390, line: 30, size: 128, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !390, line: 31, baseType: !213, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !400, file: !390, line: 32, baseType: !404, size: 16, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !189, line: 19, baseType: !405)
!405 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !389, file: !390, line: 232, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!396, !318, !399, !213, !221}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !380, file: !177, line: 141, baseType: !411, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !380, file: !177, line: 142, baseType: !413, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !390, line: 84, size: 320, elements: !417)
!417 = !{!418, !419, !423, !1577, !1578}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !416, file: !390, line: 85, baseType: !213, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !416, file: !390, line: 86, baseType: !420, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!404, !318, !399, !190}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !416, file: !390, line: 88, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{!404, !318, !427, !190}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !390, line: 168, size: 448, elements: !429)
!429 = !{!430, !431, !432, !433, !443, !444}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !428, file: !390, line: 169, baseType: !400, size: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !428, file: !390, line: 170, baseType: !221, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !428, file: !390, line: 171, baseType: !191, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !428, file: !390, line: 172, baseType: !434, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DISubroutineType(types: !436)
!436 = !{!396, !437, !318, !427, !259, !440, !221}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !439, line: 526, flags: DIFlagFwdDecl)
!439 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !189, line: 46, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !223, line: 88, baseType: !442)
!442 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !428, file: !390, line: 174, baseType: !434, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !428, file: !390, line: 176, baseType: !445, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!190, !437, !318, !427, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !450, line: 305, size: 1472, elements: !451)
!450 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!451 = !{!452, !453, !454, !455, !456, !464, !465, !1551, !1557, !1558, !1563, !1564, !1567, !1571, !1572, !1573, !1574, !1575}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !449, file: !450, line: 308, baseType: !198, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !449, file: !450, line: 309, baseType: !198, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !449, file: !450, line: 313, baseType: !448, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !449, file: !450, line: 313, baseType: !448, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !449, file: !450, line: 315, baseType: !457, size: 192, align: 64, offset: 256)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !458, line: 24, size: 192, align: 64, elements: !459)
!458 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!459 = !{!460, !461, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !457, file: !458, line: 25, baseType: !198, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !457, file: !458, line: 26, baseType: !462, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !457, file: !458, line: 27, baseType: !462, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !449, file: !450, line: 323, baseType: !198, size: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !449, file: !450, line: 327, baseType: !466, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !450, line: 388, size: 7296, elements: !468)
!468 = !{!469, !1547}
!469 = !DIDerivedType(tag: DW_TAG_member, scope: !467, file: !450, line: 389, baseType: !470, size: 7296)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !467, file: !450, line: 389, size: 7296, elements: !471)
!471 = !{!472, !473, !477, !481, !485, !486, !487, !488, !489, !497, !502, !503, !504, !505, !514, !515, !516, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !551, !559, !562, !610, !611, !1517, !1518, !1521, !1525, !1526, !1529, !1530, !1531, !1534, !1546}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !470, file: !450, line: 390, baseType: !448, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !470, file: !450, line: 391, baseType: !474, size: 64, offset: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !458, line: 31, size: 64, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !474, file: !458, line: 32, baseType: !462, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !470, file: !450, line: 392, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !195, line: 23, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !197, line: 31, baseType: !480)
!480 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !470, file: !450, line: 394, baseType: !482, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!198, !437, !198, !198, !198, !198}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !470, file: !450, line: 398, baseType: !198, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !470, file: !450, line: 399, baseType: !198, size: 64, offset: 320)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !470, file: !450, line: 405, baseType: !198, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !470, file: !450, line: 406, baseType: !198, size: 64, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !470, file: !450, line: 407, baseType: !490, size: 64, offset: 512)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !439, line: 286, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 286, size: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !492, file: !439, line: 286, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !496, line: 18, baseType: !198)
!496 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !470, file: !450, line: 416, baseType: !498, size: 32, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !189, line: 168, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !189, line: 166, size: 32, elements: !500)
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !499, file: !189, line: 167, baseType: !190, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !470, file: !450, line: 428, baseType: !498, size: 32, offset: 608)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !470, file: !450, line: 437, baseType: !498, size: 32, offset: 640)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !470, file: !450, line: 447, baseType: !498, size: 32, offset: 672)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !470, file: !450, line: 450, baseType: !506, size: 64, offset: 704)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !507, line: 13, baseType: !508)
!507 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !189, line: 175, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !189, line: 173, size: 64, elements: !510)
!510 = !{!511}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !509, file: !189, line: 174, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !195, line: 22, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !197, line: 30, baseType: !442)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !470, file: !450, line: 452, baseType: !190, size: 32, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !470, file: !450, line: 454, baseType: !325, offset: 800)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !470, file: !450, line: 457, baseType: !517, size: 256, offset: 832)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !518, line: 35, size: 256, elements: !519)
!518 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!519 = !{!520, !521, !522, !524}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !517, file: !518, line: 36, baseType: !506, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !517, file: !518, line: 42, baseType: !506, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !517, file: !518, line: 46, baseType: !523, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !326, line: 29, baseType: !333)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !517, file: !518, line: 47, baseType: !312, size: 128, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !470, file: !450, line: 459, baseType: !312, size: 128, offset: 1088)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !470, file: !450, line: 466, baseType: !198, size: 64, offset: 1216)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !470, file: !450, line: 467, baseType: !198, size: 64, offset: 1280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !470, file: !450, line: 469, baseType: !198, size: 64, offset: 1344)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !470, file: !450, line: 470, baseType: !198, size: 64, offset: 1408)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !470, file: !450, line: 471, baseType: !508, size: 64, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !470, file: !450, line: 472, baseType: !198, size: 64, offset: 1536)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !470, file: !450, line: 473, baseType: !198, size: 64, offset: 1600)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !470, file: !450, line: 474, baseType: !198, size: 64, offset: 1664)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !470, file: !450, line: 475, baseType: !198, size: 64, offset: 1728)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !470, file: !450, line: 477, baseType: !325, offset: 1792)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !470, file: !450, line: 478, baseType: !198, size: 64, offset: 1792)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !470, file: !450, line: 478, baseType: !198, size: 64, offset: 1856)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !470, file: !450, line: 478, baseType: !198, size: 64, offset: 1920)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !470, file: !450, line: 478, baseType: !198, size: 64, offset: 1984)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !470, file: !450, line: 479, baseType: !198, size: 64, offset: 2048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !470, file: !450, line: 479, baseType: !198, size: 64, offset: 2112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !470, file: !450, line: 479, baseType: !198, size: 64, offset: 2176)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !470, file: !450, line: 480, baseType: !198, size: 64, offset: 2240)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !470, file: !450, line: 480, baseType: !198, size: 64, offset: 2304)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !470, file: !450, line: 480, baseType: !198, size: 64, offset: 2368)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !470, file: !450, line: 480, baseType: !198, size: 64, offset: 2432)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !470, file: !450, line: 482, baseType: !548, size: 2816, offset: 2496)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 2816, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 44)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !470, file: !450, line: 488, baseType: !552, size: 256, offset: 5312)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !553, line: 60, size: 256, elements: !554)
!553 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !552, file: !553, line: 61, baseType: !556, size: 256)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 256, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 4)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !470, file: !450, line: 490, baseType: !560, size: 64, offset: 5568)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !450, line: 490, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !470, file: !450, line: 493, baseType: !563, size: 896, offset: 5632)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !564, line: 53, baseType: !565)
!564 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !564, line: 13, size: 896, elements: !566)
!566 = !{!567, !568, !569, !570, !573, !574, !581, !582, !602, !603, !606}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !565, file: !564, line: 18, baseType: !478, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !565, file: !564, line: 28, baseType: !508, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !565, file: !564, line: 31, baseType: !517, size: 256, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !565, file: !564, line: 32, baseType: !571, size: 64, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !564, line: 32, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !565, file: !564, line: 37, baseType: !405, size: 16, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !565, file: !564, line: 40, baseType: !575, size: 192, offset: 512)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !576, line: 53, size: 192, elements: !577)
!576 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!577 = !{!578, !579, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !575, file: !576, line: 54, baseType: !506, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !575, file: !576, line: 55, baseType: !325, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !575, file: !576, line: 59, baseType: !312, size: 128, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !565, file: !564, line: 41, baseType: !191, size: 64, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !565, file: !564, line: 42, baseType: !583, size: 64, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !586, line: 13, size: 896, elements: !587)
!586 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !585, file: !586, line: 14, baseType: !191, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !585, file: !586, line: 15, baseType: !198, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !585, file: !586, line: 17, baseType: !198, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !585, file: !586, line: 17, baseType: !198, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !585, file: !586, line: 19, baseType: !199, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !585, file: !586, line: 21, baseType: !199, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !585, file: !586, line: 22, baseType: !199, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !585, file: !586, line: 23, baseType: !199, size: 64, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !585, file: !586, line: 24, baseType: !199, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !585, file: !586, line: 25, baseType: !199, size: 64, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !585, file: !586, line: 26, baseType: !199, size: 64, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !585, file: !586, line: 27, baseType: !199, size: 64, offset: 704)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !585, file: !586, line: 28, baseType: !199, size: 64, offset: 768)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !585, file: !586, line: 29, baseType: !199, size: 64, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !565, file: !564, line: 44, baseType: !498, size: 32, offset: 832)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !565, file: !564, line: 50, baseType: !604, size: 16, offset: 864)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !195, line: 19, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !197, line: 24, baseType: !405)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !565, file: !564, line: 51, baseType: !607, size: 16, offset: 880)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !195, line: 18, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !197, line: 23, baseType: !609)
!609 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !450, line: 495, baseType: !198, size: 64, offset: 6528)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !470, file: !450, line: 497, baseType: !612, size: 64, offset: 6592)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !450, line: 381, size: 384, elements: !614)
!614 = !{!615, !616, !1516}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !613, file: !450, line: 382, baseType: !498, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !613, file: !450, line: 383, baseType: !617, size: 128, offset: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !450, line: 376, size: 128, elements: !618)
!618 = !{!619, !1514}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !617, file: !450, line: 377, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !622, line: 640, size: 48640, elements: !623)
!622 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!623 = !{!624, !630, !632, !633, !639, !640, !641, !642, !643, !644, !645, !646, !650, !668, !679, !774, !775, !776, !787, !788, !790, !791, !792, !793, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !872, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !928, !930, !931, !932, !944, !946, !947, !948, !949, !950, !956, !957, !958, !959, !960, !961, !962, !974, !979, !984, !985, !986, !989, !993, !996, !999, !1002, !1005, !1009, !1012, !1015, !1021, !1022, !1023, !1029, !1030, !1031, !1032, !1033, !1042, !1043, !1044, !1045, !1046, !1051, !1052, !1053, !1056, !1057, !1060, !1063, !1066, !1069, !1072, !1075, !1076, !1156, !1159, !1162, !1163, !1166, !1167, !1168, !1174, !1175, !1176, !1189, !1190, !1191, !1201, !1206, !1209, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !621, file: !622, line: 646, baseType: !625, size: 128)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !626, line: 56, size: 128, elements: !627)
!626 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !625, file: !626, line: 57, baseType: !198, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !625, file: !626, line: 58, baseType: !194, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !621, file: !622, line: 649, baseType: !631, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !199)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !621, file: !622, line: 657, baseType: !191, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !621, file: !622, line: 658, baseType: !634, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !635, line: 113, baseType: !636)
!635 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !635, line: 111, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !636, file: !635, line: 112, baseType: !498, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !621, file: !622, line: 660, baseType: !7, size: 32, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !621, file: !622, line: 661, baseType: !7, size: 32, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !621, file: !622, line: 684, baseType: !190, size: 32, offset: 352)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !621, file: !622, line: 686, baseType: !190, size: 32, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !621, file: !622, line: 687, baseType: !190, size: 32, offset: 416)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !621, file: !622, line: 688, baseType: !190, size: 32, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !621, file: !622, line: 689, baseType: !7, size: 32, offset: 480)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !621, file: !622, line: 691, baseType: !647, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !622, line: 691, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !621, file: !622, line: 692, baseType: !651, size: 832, offset: 576)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !622, line: 451, size: 832, elements: !652)
!652 = !{!653, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !651, file: !622, line: 453, baseType: !654, size: 128)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !622, line: 325, size: 128, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !654, file: !622, line: 326, baseType: !198, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !654, file: !622, line: 327, baseType: !194, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !651, file: !622, line: 454, baseType: !457, size: 192, align: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !651, file: !622, line: 455, baseType: !312, size: 128, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !651, file: !622, line: 456, baseType: !7, size: 32, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !651, file: !622, line: 458, baseType: !478, size: 64, offset: 512)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !651, file: !622, line: 459, baseType: !478, size: 64, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !651, file: !622, line: 460, baseType: !478, size: 64, offset: 640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !651, file: !622, line: 461, baseType: !478, size: 64, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !651, file: !622, line: 463, baseType: !478, size: 64, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !651, file: !622, line: 465, baseType: !667, offset: 832)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !622, line: 415, elements: !339)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !621, file: !622, line: 693, baseType: !669, size: 384, offset: 1408)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !622, line: 489, size: 384, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !669, file: !622, line: 490, baseType: !312, size: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !669, file: !622, line: 491, baseType: !198, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !669, file: !622, line: 492, baseType: !198, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !669, file: !622, line: 493, baseType: !7, size: 32, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !669, file: !622, line: 494, baseType: !405, size: 16, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !669, file: !622, line: 495, baseType: !405, size: 16, offset: 304)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !669, file: !622, line: 497, baseType: !678, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !621, file: !622, line: 697, baseType: !680, size: 1792, offset: 1792)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !622, line: 507, size: 1792, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !771, !772}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !680, file: !622, line: 508, baseType: !457, size: 192, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !680, file: !622, line: 515, baseType: !478, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !680, file: !622, line: 516, baseType: !478, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !680, file: !622, line: 517, baseType: !478, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !680, file: !622, line: 518, baseType: !478, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !680, file: !622, line: 519, baseType: !478, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !680, file: !622, line: 526, baseType: !512, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !680, file: !622, line: 527, baseType: !478, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !622, line: 528, baseType: !7, size: 32, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !680, file: !622, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !680, file: !622, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !680, file: !622, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !680, file: !622, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !680, file: !622, line: 563, baseType: !696, size: 512, offset: 704)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !697)
!697 = !{!698, !706, !707, !712, !764, !768, !769, !770}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !6, line: 119, baseType: !699, size: 256)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !700, line: 9, size: 256, elements: !701)
!700 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !699, file: !700, line: 10, baseType: !457, size: 192, align: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !699, file: !700, line: 11, baseType: !704, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !705, line: 29, baseType: !512)
!705 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !696, file: !6, line: 120, baseType: !704, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !696, file: !6, line: 121, baseType: !708, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!5, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !6, line: 122, baseType: !713, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !715)
!715 = !{!716, !736, !737, !740, !750, !751, !759, !763}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !714, file: !6, line: 160, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !718, file: !6, line: 215, baseType: !523)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !718, file: !6, line: 216, baseType: !7, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !718, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !718, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !718, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !718, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !718, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !718, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !718, file: !6, line: 233, baseType: !704, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !718, file: !6, line: 234, baseType: !711, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !718, file: !6, line: 235, baseType: !704, size: 64, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !718, file: !6, line: 236, baseType: !711, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !718, file: !6, line: 237, baseType: !733, size: 4096, offset: 512)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 4096, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 8)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !714, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !714, file: !6, line: 162, baseType: !738, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !189, line: 27, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !223, line: 96, baseType: !190)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !714, file: !6, line: 163, baseType: !741, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !742, line: 276, baseType: !743)
!742 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !742, line: 276, size: 32, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !743, file: !742, line: 276, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !742, line: 70, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !742, line: 65, size: 32, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !747, file: !742, line: 66, baseType: !7, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !714, file: !6, line: 164, baseType: !711, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !714, file: !6, line: 165, baseType: !752, size: 128, offset: 256)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !700, line: 14, size: 128, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !752, file: !700, line: 15, baseType: !755, size: 128)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !458, line: 125, size: 128, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !755, file: !458, line: 126, baseType: !474, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !755, file: !458, line: 127, baseType: !462, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !714, file: !6, line: 166, baseType: !760, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!704}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !714, file: !6, line: 167, baseType: !704, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !696, file: !6, line: 123, baseType: !765, size: 8, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !195, line: 17, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !197, line: 21, baseType: !767)
!767 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !696, file: !6, line: 124, baseType: !765, size: 8, offset: 456)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !696, file: !6, line: 125, baseType: !765, size: 8, offset: 464)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !696, file: !6, line: 126, baseType: !765, size: 8, offset: 472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !680, file: !622, line: 572, baseType: !696, size: 512, offset: 1216)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !680, file: !622, line: 580, baseType: !773, size: 64, offset: 1728)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !621, file: !622, line: 721, baseType: !7, size: 32, offset: 3584)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !621, file: !622, line: 722, baseType: !190, size: 32, offset: 3616)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !621, file: !622, line: 723, baseType: !777, size: 64, offset: 3648)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !780, line: 17, baseType: !781)
!780 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !780, line: 17, size: 64, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !781, file: !780, line: 17, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 64, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 1)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !621, file: !622, line: 724, baseType: !779, size: 64, offset: 3712)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !621, file: !622, line: 749, baseType: !789, offset: 3776)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !622, line: 290, elements: !339)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !621, file: !622, line: 751, baseType: !312, size: 128, offset: 3776)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !621, file: !622, line: 757, baseType: !466, size: 64, offset: 3904)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !621, file: !622, line: 758, baseType: !466, size: 64, offset: 3968)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !621, file: !622, line: 761, baseType: !794, size: 320, offset: 4032)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !553, line: 34, size: 320, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !794, file: !553, line: 35, baseType: !478, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !794, file: !553, line: 36, baseType: !798, size: 256, offset: 64)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 256, elements: !557)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !621, file: !622, line: 766, baseType: !190, size: 32, offset: 4352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !621, file: !622, line: 767, baseType: !190, size: 32, offset: 4384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !621, file: !622, line: 768, baseType: !190, size: 32, offset: 4416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !621, file: !622, line: 770, baseType: !190, size: 32, offset: 4448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !621, file: !622, line: 772, baseType: !198, size: 64, offset: 4480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !621, file: !622, line: 775, baseType: !7, size: 32, offset: 4544)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !621, file: !622, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !621, file: !622, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !621, file: !622, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !621, file: !622, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !621, file: !622, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !621, file: !622, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !621, file: !622, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !621, file: !622, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !621, file: !622, line: 831, baseType: !198, size: 64, offset: 4672)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !621, file: !622, line: 833, baseType: !815, size: 384, offset: 4736)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !816)
!816 = !{!817, !822}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !815, file: !12, line: 26, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!199, !821}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, scope: !815, file: !12, line: 27, baseType: !823, size: 320, offset: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !815, file: !12, line: 27, size: 320, elements: !824)
!824 = !{!825, !835, !862}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !823, file: !12, line: 36, baseType: !826, size: 320)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !12, line: 29, size: 320, elements: !827)
!827 = !{!828, !830, !831, !832, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !826, file: !12, line: 30, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !826, file: !12, line: 31, baseType: !194, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !826, file: !12, line: 32, baseType: !194, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !826, file: !12, line: 33, baseType: !194, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !826, file: !12, line: 34, baseType: !478, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !826, file: !12, line: 35, baseType: !829, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !823, file: !12, line: 46, baseType: !836, size: 192)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !12, line: 38, size: 192, elements: !837)
!837 = !{!838, !839, !840, !861}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !836, file: !12, line: 39, baseType: !738, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !836, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, scope: !836, file: !12, line: 41, baseType: !841, size: 64, offset: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !836, file: !12, line: 41, size: 64, elements: !842)
!842 = !{!843, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !841, file: !12, line: 42, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !846, line: 7, size: 128, elements: !847)
!846 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!847 = !{!848, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !845, file: !846, line: 8, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !223, line: 93, baseType: !442)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !845, file: !846, line: 9, baseType: !442, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !841, file: !12, line: 43, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !854, line: 7, size: 64, elements: !855)
!854 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!855 = !{!856, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !853, file: !854, line: 8, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !854, line: 5, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !195, line: 20, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !197, line: 26, baseType: !190)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !853, file: !854, line: 9, baseType: !858, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !836, file: !12, line: 45, baseType: !478, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !823, file: !12, line: 54, baseType: !863, size: 256)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !12, line: 48, size: 256, elements: !864)
!864 = !{!865, !868, !869, !870, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !863, file: !12, line: 49, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !863, file: !12, line: 50, baseType: !190, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !863, file: !12, line: 51, baseType: !190, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !863, file: !12, line: 52, baseType: !198, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !863, file: !12, line: 53, baseType: !198, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !621, file: !622, line: 835, baseType: !873, size: 32, offset: 5120)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !189, line: 22, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !223, line: 28, baseType: !190)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !621, file: !622, line: 836, baseType: !873, size: 32, offset: 5152)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !621, file: !622, line: 840, baseType: !198, size: 64, offset: 5184)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !621, file: !622, line: 849, baseType: !620, size: 64, offset: 5248)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !621, file: !622, line: 852, baseType: !620, size: 64, offset: 5312)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !621, file: !622, line: 857, baseType: !312, size: 128, offset: 5376)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !621, file: !622, line: 858, baseType: !312, size: 128, offset: 5504)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !621, file: !622, line: 859, baseType: !620, size: 64, offset: 5632)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !621, file: !622, line: 867, baseType: !312, size: 128, offset: 5696)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !621, file: !622, line: 868, baseType: !312, size: 128, offset: 5824)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !621, file: !622, line: 871, baseType: !885, size: 64, offset: 5952)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !887, line: 59, size: 768, elements: !888)
!887 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!888 = !{!889, !890, !891, !892, !903, !904, !911, !920}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !886, file: !887, line: 61, baseType: !634, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !886, file: !887, line: 62, baseType: !7, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !886, file: !887, line: 63, baseType: !325, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !886, file: !887, line: 65, baseType: !893, size: 256, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 256, elements: !557)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !189, line: 182, size: 64, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !894, file: !189, line: 183, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !189, line: 186, size: 128, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !898, file: !189, line: 187, baseType: !897, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !898, file: !189, line: 187, baseType: !902, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !886, file: !887, line: 66, baseType: !894, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !886, file: !887, line: 68, baseType: !905, size: 128, offset: 384)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !906, line: 40, baseType: !907)
!906 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !906, line: 36, size: 128, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !907, file: !906, line: 37, baseType: !325)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !907, file: !906, line: 38, baseType: !312, size: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !886, file: !887, line: 69, baseType: !912, size: 128, align: 64, offset: 512)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !189, line: 216, size: 128, align: 64, elements: !913)
!913 = !{!914, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !189, line: 217, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !912, file: !189, line: 218, baseType: !917, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !915}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !886, file: !887, line: 70, baseType: !921, size: 128, offset: 640)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 128, elements: !785)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !887, line: 54, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !922, file: !887, line: 55, baseType: !190, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !922, file: !887, line: 56, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !887, line: 56, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !621, file: !622, line: 872, baseType: !929, size: 512, offset: 6016)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 512, elements: !557)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !621, file: !622, line: 873, baseType: !312, size: 128, offset: 6528)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !621, file: !622, line: 874, baseType: !312, size: 128, offset: 6656)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !621, file: !622, line: 876, baseType: !933, size: 64, offset: 6784)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !935, line: 26, size: 192, elements: !936)
!935 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !934, file: !935, line: 27, baseType: !7, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !934, file: !935, line: 28, baseType: !939, size: 128, offset: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !940, line: 43, size: 128, elements: !941)
!940 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !939, file: !940, line: 44, baseType: !523)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !939, file: !940, line: 45, baseType: !312, size: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !621, file: !622, line: 879, baseType: !945, size: 64, offset: 6848)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !621, file: !622, line: 882, baseType: !945, size: 64, offset: 6912)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !621, file: !622, line: 884, baseType: !478, size: 64, offset: 6976)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !621, file: !622, line: 885, baseType: !478, size: 64, offset: 7040)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !621, file: !622, line: 890, baseType: !478, size: 64, offset: 7104)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !621, file: !622, line: 891, baseType: !951, size: 128, offset: 7168)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !622, line: 242, size: 128, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !951, file: !622, line: 244, baseType: !478, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !951, file: !622, line: 245, baseType: !478, size: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !951, file: !622, line: 246, baseType: !523, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !621, file: !622, line: 900, baseType: !198, size: 64, offset: 7296)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !621, file: !622, line: 901, baseType: !198, size: 64, offset: 7360)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !621, file: !622, line: 904, baseType: !478, size: 64, offset: 7424)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !621, file: !622, line: 907, baseType: !478, size: 64, offset: 7488)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !621, file: !622, line: 910, baseType: !198, size: 64, offset: 7552)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !621, file: !622, line: 911, baseType: !198, size: 64, offset: 7616)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !621, file: !622, line: 914, baseType: !963, size: 640, offset: 7680)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !964, line: 123, size: 640, elements: !965)
!964 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!965 = !{!966, !972, !973}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !963, file: !964, line: 124, baseType: !967, size: 576)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 576, elements: !366)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !964, line: 108, size: 192, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !968, file: !964, line: 109, baseType: !478, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !968, file: !964, line: 110, baseType: !752, size: 128, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !963, file: !964, line: 125, baseType: !7, size: 32, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !963, file: !964, line: 126, baseType: !7, size: 32, offset: 608)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !621, file: !622, line: 917, baseType: !975, size: 192, offset: 8320)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !964, line: 134, size: 192, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !975, file: !964, line: 135, baseType: !912, size: 128, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !975, file: !964, line: 136, baseType: !7, size: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !621, file: !622, line: 923, baseType: !980, size: 64, offset: 8512)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !983, line: 11, flags: DIFlagFwdDecl)
!983 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!984 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !621, file: !622, line: 926, baseType: !980, size: 64, offset: 8576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !621, file: !622, line: 929, baseType: !980, size: 64, offset: 8640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !621, file: !622, line: 933, baseType: !987, size: 64, offset: 8704)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !622, line: 933, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !621, file: !622, line: 943, baseType: !990, size: 128, offset: 8768)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 128, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 16)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !621, file: !622, line: 945, baseType: !994, size: 64, offset: 8896)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !622, line: 49, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !621, file: !622, line: 956, baseType: !997, size: 64, offset: 8960)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !622, line: 45, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !621, file: !622, line: 959, baseType: !1000, size: 64, offset: 9024)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !622, line: 959, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !621, file: !622, line: 962, baseType: !1003, size: 64, offset: 9088)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !622, line: 66, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !621, file: !622, line: 966, baseType: !1006, size: 64, offset: 9152)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !1008, line: 35, flags: DIFlagFwdDecl)
!1008 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !621, file: !622, line: 969, baseType: !1010, size: 64, offset: 9216)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !964, line: 223, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !621, file: !622, line: 970, baseType: !1013, size: 64, offset: 9280)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !622, line: 62, flags: DIFlagFwdDecl)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !621, file: !622, line: 971, baseType: !1016, size: 64, offset: 9344)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !1017, line: 25, baseType: !1018)
!1017 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1017, line: 23, size: 64, elements: !1019)
!1019 = !{!1020}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1018, file: !1017, line: 24, baseType: !784, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !621, file: !622, line: 972, baseType: !1016, size: 64, offset: 9408)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !621, file: !622, line: 974, baseType: !1016, size: 64, offset: 9472)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !621, file: !622, line: 975, baseType: !1024, size: 192, offset: 9536)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !1025, line: 30, size: 192, elements: !1026)
!1025 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1024, file: !1025, line: 31, baseType: !312, size: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1024, file: !1025, line: 32, baseType: !1016, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !621, file: !622, line: 976, baseType: !198, size: 64, offset: 9728)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !621, file: !622, line: 977, baseType: !221, size: 64, offset: 9792)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !621, file: !622, line: 978, baseType: !7, size: 32, offset: 9856)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !621, file: !622, line: 980, baseType: !915, size: 64, offset: 9920)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !621, file: !622, line: 989, baseType: !1034, size: 128, offset: 9984)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !1035, line: 35, size: 128, elements: !1036)
!1035 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1034, file: !1035, line: 36, baseType: !190, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !1034, file: !1035, line: 37, baseType: !498, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1034, file: !1035, line: 38, baseType: !1040, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !1035, line: 23, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !621, file: !622, line: 992, baseType: !478, size: 64, offset: 10112)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !621, file: !622, line: 993, baseType: !478, size: 64, offset: 10176)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !621, file: !622, line: 996, baseType: !325, offset: 10240)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !621, file: !622, line: 999, baseType: !523, offset: 10240)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !621, file: !622, line: 1001, baseType: !1047, size: 64, offset: 10240)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !622, line: 636, size: 64, elements: !1048)
!1048 = !{!1049}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !622, line: 637, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !621, file: !622, line: 1005, baseType: !755, size: 128, offset: 10304)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !621, file: !622, line: 1007, baseType: !620, size: 64, offset: 10432)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !621, file: !622, line: 1009, baseType: !1054, size: 64, offset: 10496)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !622, line: 1009, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !621, file: !622, line: 1043, baseType: !191, size: 64, offset: 10560)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !621, file: !622, line: 1046, baseType: !1058, size: 64, offset: 10624)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !622, line: 41, flags: DIFlagFwdDecl)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !621, file: !622, line: 1050, baseType: !1061, size: 64, offset: 10688)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !622, line: 42, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !621, file: !622, line: 1054, baseType: !1064, size: 64, offset: 10752)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !622, line: 55, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !621, file: !622, line: 1056, baseType: !1067, size: 64, offset: 10816)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !622, line: 40, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !621, file: !622, line: 1058, baseType: !1070, size: 64, offset: 10880)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !622, line: 47, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !621, file: !622, line: 1061, baseType: !1073, size: 64, offset: 10944)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !622, line: 43, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !621, file: !622, line: 1064, baseType: !198, size: 64, offset: 11008)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !621, file: !622, line: 1065, baseType: !1077, size: 64, offset: 11072)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !1025, line: 14, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !1025, line: 12, size: 384, elements: !1080)
!1080 = !{!1081}
!1081 = !DIDerivedType(tag: DW_TAG_member, scope: !1079, file: !1025, line: 13, baseType: !1082, size: 384)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1079, file: !1025, line: 13, size: 384, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1082, file: !1025, line: 13, baseType: !190, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1082, file: !1025, line: 13, baseType: !190, size: 32, offset: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1082, file: !1025, line: 13, baseType: !190, size: 32, offset: 64)
