; ModuleID = '../bcout/drivers/acpi/acpi_apd.llvm.bc'
source_filename = "drivers/acpi/acpi_apd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_scan_handler = type { %struct.acpi_device_id*, %struct.list_head, i1 (i8*, %struct.acpi_device_id**)*, i32 (%struct.acpi_device*, %struct.acpi_device_id*)*, void (%struct.acpi_device*)*, void (%struct.device*)*, void (%struct.device*)*, %struct.acpi_hotplug_profile }
%struct.acpi_device_id = type { [9 x i8], i64, i32, i32 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.acpi_device = type { i32, i8*, %struct.fwnode_handle, %struct.acpi_device*, %struct.list_head, %struct.list_head, %struct.list_head, %struct.list_head, %struct.acpi_device_status, %struct.acpi_device_flags, %struct.acpi_device_pnp, %struct.acpi_device_power, %struct.acpi_device_wakeup, %struct.acpi_device_perf, %struct.acpi_device_dir, %struct.acpi_device_data, %struct.acpi_scan_handler*, %struct.acpi_hotplug_context*, %struct.acpi_driver*, %struct.acpi_gpio_mapping*, i8*, %struct.device, i32, i32, %struct.list_head, %struct.mutex, void (%struct.acpi_device*)* }
%struct.fwnode_handle = type { %struct.fwnode_handle*, %struct.fwnode_operations*, %struct.device* }

!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_prop_type", file: !65, line: 19, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "./include/linux/property.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !68, !69, !70, !71, !72}
!67 = !DIEnumerator(name: "DEV_PROP_U8", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "DEV_PROP_U16", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "DEV_PROP_U32", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "DEV_PROP_U64", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "DEV_PROP_STRING", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "DEV_PROP_REF", value: 5, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !74, line: 305, baseType: !7, size: 32, elements: !75)
!74 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76, !77, !78, !79}
!76 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!77 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!80 = !{!81, !82, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !83, line: 148, baseType: !7)
!83 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!86 = !{!0, !87}
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "acpi_apd_device_ids", scope: !2, file: !3, line: 222, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 256, elements: !106)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device_id", file: !92, line: 210, size: 256, elements: !93)
!92 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!93 = !{!94, !101, !103, !105}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !91, file: !92, line: 211, baseType: !95, size: 72)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 72, elements: !99)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !97, line: 21, baseType: !98)
!97 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !{!100}
!100 = !DISubrange(count: 9)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !91, file: !92, line: 212, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_ulong_t", file: !92, line: 14, baseType: !84)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cls", scope: !91, file: !92, line: 213, baseType: !104, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !97, line: 27, baseType: !7)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cls_msk", scope: !91, file: !92, line: 214, baseType: !104, size: 32, offset: 224)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scan_handler", file: !109, line: 122, size: 1216, elements: !110)
!109 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!110 = !{!111, !113, !119, !129, !2423, !2424, !2425, !2426}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ids", scope: !108, file: !109, line: 123, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "list_node", scope: !108, file: !109, line: 124, baseType: !114, size: 128, offset: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !83, line: 178, size: 128, elements: !115)
!115 = !{!116, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !83, line: 179, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !83, line: 179, baseType: !117, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !108, file: !109, line: 125, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!123, !125, !128}
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !83, line: 30, baseType: !124)
!124 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "attach", scope: !108, file: !109, line: 126, baseType: !130, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !134, !112}
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !109, line: 351, size: 10880, elements: !136)
!136 = !{!137, !138, !141, !2174, !2175, !2176, !2177, !2178, !2179, !2188, !2205, !2279, !2308, !2332, !2353, !2359, !2368, !2370, !2387, !2412, !2416, !2417, !2418, !2419, !2420, !2421, !2422}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !135, file: !109, line: 352, baseType: !133, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !135, file: !109, line: 353, baseType: !139, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !140, line: 424, baseType: !81)
!140 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !135, file: !109, line: 354, baseType: !142, size: 192, offset: 128)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !143, line: 17, size: 192, elements: !144)
!143 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!144 = !{!145, !147, !2173}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !142, file: !143, line: 18, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !142, file: !143, line: 19, baseType: !148, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !143, line: 110, size: 1152, elements: !151)
!151 = !{!152, !156, !160, !166, !2115, !2119, !2123, !2128, !2132, !2133, !2137, !2141, !2145, !2156, !2157, !2158, !2159, !2169}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !150, file: !143, line: 111, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!146, !146}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !150, file: !143, line: 112, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !146}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !150, file: !143, line: 113, baseType: !161, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !150, file: !143, line: 114, baseType: !167, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !164, !172}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !175)
!175 = !{!176, !1661, !1663, !1666, !1667, !1718, !1802, !1803, !1804, !1805, !1806, !1815, !1920, !1933, !2040, !2041, !2045, !2047, !2048, !2049, !2053, !2059, !2060, !2063, !2064, !2065, !2068, !2069, !2070, !2071, !2103, !2104, !2105, !2108, !2111, !2112, !2113, !2114}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !174, file: !30, line: 462, baseType: !177, size: 512)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !178, line: 64, size: 512, elements: !179)
!178 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!179 = !{!180, !181, !182, !184, !244, !1498, !1651, !1656, !1657, !1658, !1659, !1660}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !178, line: 65, baseType: !125, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !177, file: !178, line: 66, baseType: !114, size: 128, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !177, file: !178, line: 67, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !177, file: !178, line: 68, baseType: !185, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !178, line: 192, size: 704, elements: !187)
!187 = !{!188, !189, !205, !206}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !186, file: !178, line: 193, baseType: !114, size: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !186, file: !178, line: 194, baseType: !190, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !191, line: 83, baseType: !192)
!191 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !191, line: 71, elements: !193)
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, scope: !192, file: !191, line: 72, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !192, file: !191, line: 72, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !195, file: !191, line: 73, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !191, line: 20, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !198, file: !191, line: 21, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !202, line: 25, baseType: !203)
!202 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !202, line: 25, elements: !204)
!204 = !{}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !186, file: !178, line: 195, baseType: !177, size: 512, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !186, file: !178, line: 196, baseType: !207, size: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !178, line: 156, size: 192, elements: !210)
!210 = !{!211, !216, !221}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !209, file: !178, line: 157, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!133, !185, !183}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !178, line: 158, baseType: !217, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!125, !185, !183}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !209, file: !178, line: 159, baseType: !222, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!133, !185, !183, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !178, line: 148, size: 20736, elements: !228)
!228 = !{!229, !234, !238, !239, !243}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !227, file: !178, line: 149, baseType: !230, size: 192)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 192, elements: !232)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!232 = !{!233}
!233 = !DISubrange(count: 3)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !227, file: !178, line: 150, baseType: !235, size: 4096, offset: 192)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !231, size: 4096, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !227, file: !178, line: 151, baseType: !133, size: 32, offset: 4288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !227, file: !178, line: 152, baseType: !240, size: 16384, offset: 4320)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 16384, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 2048)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !227, file: !178, line: 153, baseType: !133, size: 32, offset: 20704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !177, file: !178, line: 69, baseType: !245, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !178, line: 138, size: 448, elements: !247)
!247 = !{!248, !252, !280, !282, !1445, !1476, !1480}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !246, file: !178, line: 139, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !183}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !246, file: !178, line: 140, baseType: !253, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !256, line: 230, size: 128, elements: !257)
!256 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!257 = !{!258, !273}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !255, file: !256, line: 231, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{!262, !183, !266, !231}
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 60, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !264, line: 73, baseType: !265)
!264 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !264, line: 15, baseType: !85)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !256, line: 30, size: 128, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !256, line: 31, baseType: !125, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !267, file: !256, line: 32, baseType: !271, size: 16, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !83, line: 19, baseType: !272)
!272 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !255, file: !256, line: 232, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!262, !183, !266, !125, !277}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 55, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !264, line: 72, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !264, line: 16, baseType: !84)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !246, file: !178, line: 141, baseType: !281, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !246, file: !178, line: 142, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !256, line: 84, size: 320, elements: !287)
!287 = !{!288, !289, !293, !1442, !1443}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !286, file: !256, line: 85, baseType: !125, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !286, file: !256, line: 86, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!271, !183, !266, !133}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !286, file: !256, line: 88, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{!271, !183, !297, !133}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !256, line: 168, size: 448, elements: !299)
!299 = !{!300, !301, !302, !303, !313, !314}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !298, file: !256, line: 169, baseType: !267, size: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !298, file: !256, line: 170, baseType: !277, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !298, file: !256, line: 171, baseType: !81, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !298, file: !256, line: 172, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!262, !307, !183, !297, !231, !310, !277}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !309, line: 526, flags: DIFlagFwdDecl)
!309 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !83, line: 46, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !264, line: 88, baseType: !312)
!312 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !298, file: !256, line: 174, baseType: !304, size: 64, offset: 320)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !298, file: !256, line: 176, baseType: !315, size: 64, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DISubroutineType(types: !317)
!317 = !{!133, !307, !183, !297, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !320, line: 305, size: 1472, elements: !321)
!320 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!321 = !{!322, !323, !324, !325, !326, !334, !335, !1416, !1422, !1423, !1428, !1429, !1432, !1436, !1437, !1438, !1439, !1440}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !319, file: !320, line: 308, baseType: !84, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !319, file: !320, line: 309, baseType: !84, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !319, file: !320, line: 313, baseType: !318, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !319, file: !320, line: 313, baseType: !318, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !319, file: !320, line: 315, baseType: !327, size: 192, align: 64, offset: 256)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !328, line: 24, size: 192, align: 64, elements: !329)
!328 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!329 = !{!330, !331, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !327, file: !328, line: 25, baseType: !84, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !327, file: !328, line: 26, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !327, file: !328, line: 27, baseType: !332, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !319, file: !320, line: 323, baseType: !84, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !319, file: !320, line: 327, baseType: !336, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !320, line: 388, size: 7296, elements: !338)
!338 = !{!339, !1412}
!339 = !DIDerivedType(tag: DW_TAG_member, scope: !337, file: !320, line: 389, baseType: !340, size: 7296)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !337, file: !320, line: 389, size: 7296, elements: !341)
!341 = !{!342, !343, !347, !352, !356, !357, !358, !359, !360, !368, !373, !374, !375, !376, !385, !386, !387, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !422, !430, !433, !481, !482, !1383, !1384, !1387, !1390, !1391, !1394, !1395, !1396, !1399, !1411}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !340, file: !320, line: 390, baseType: !318, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !340, file: !320, line: 391, baseType: !344, size: 64, offset: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !328, line: 31, size: 64, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !344, file: !328, line: 32, baseType: !332, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !340, file: !320, line: 392, baseType: !348, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !349, line: 23, baseType: !350)
!349 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !97, line: 31, baseType: !351)
!351 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !340, file: !320, line: 394, baseType: !353, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!84, !307, !84, !84, !84, !84}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !340, file: !320, line: 398, baseType: !84, size: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !340, file: !320, line: 399, baseType: !84, size: 64, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !340, file: !320, line: 405, baseType: !84, size: 64, offset: 384)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !340, file: !320, line: 406, baseType: !84, size: 64, offset: 448)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !340, file: !320, line: 407, baseType: !361, size: 64, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !309, line: 286, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 286, size: 64, elements: !364)
!364 = !{!365}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !363, file: !309, line: 286, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !367, line: 18, baseType: !84)
!367 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!368 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !340, file: !320, line: 416, baseType: !369, size: 32, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !83, line: 168, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 166, size: 32, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !370, file: !83, line: 167, baseType: !133, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !340, file: !320, line: 428, baseType: !369, size: 32, offset: 608)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !340, file: !320, line: 437, baseType: !369, size: 32, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !340, file: !320, line: 447, baseType: !369, size: 32, offset: 672)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !340, file: !320, line: 450, baseType: !377, size: 64, offset: 704)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !378, line: 13, baseType: !379)
!378 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !83, line: 175, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 173, size: 64, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !380, file: !83, line: 174, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !349, line: 22, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !97, line: 30, baseType: !312)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !340, file: !320, line: 452, baseType: !133, size: 32, offset: 768)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !340, file: !320, line: 454, baseType: !190, offset: 800)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !340, file: !320, line: 457, baseType: !388, size: 256, offset: 832)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !389, line: 35, size: 256, elements: !390)
!389 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!390 = !{!391, !392, !393, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !388, file: !389, line: 36, baseType: !377, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !388, file: !389, line: 42, baseType: !377, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !388, file: !389, line: 46, baseType: !394, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !191, line: 29, baseType: !198)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !388, file: !389, line: 47, baseType: !114, size: 128, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !340, file: !320, line: 459, baseType: !114, size: 128, offset: 1088)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !340, file: !320, line: 466, baseType: !84, size: 64, offset: 1216)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !340, file: !320, line: 467, baseType: !84, size: 64, offset: 1280)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !340, file: !320, line: 469, baseType: !84, size: 64, offset: 1344)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !340, file: !320, line: 470, baseType: !84, size: 64, offset: 1408)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !340, file: !320, line: 471, baseType: !379, size: 64, offset: 1472)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !340, file: !320, line: 472, baseType: !84, size: 64, offset: 1536)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !340, file: !320, line: 473, baseType: !84, size: 64, offset: 1600)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !340, file: !320, line: 474, baseType: !84, size: 64, offset: 1664)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !340, file: !320, line: 475, baseType: !84, size: 64, offset: 1728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !340, file: !320, line: 477, baseType: !190, offset: 1792)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !340, file: !320, line: 478, baseType: !84, size: 64, offset: 1792)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !340, file: !320, line: 478, baseType: !84, size: 64, offset: 1856)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !340, file: !320, line: 478, baseType: !84, size: 64, offset: 1920)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !340, file: !320, line: 478, baseType: !84, size: 64, offset: 1984)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !340, file: !320, line: 479, baseType: !84, size: 64, offset: 2048)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !340, file: !320, line: 479, baseType: !84, size: 64, offset: 2112)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !340, file: !320, line: 479, baseType: !84, size: 64, offset: 2176)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !340, file: !320, line: 480, baseType: !84, size: 64, offset: 2240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !340, file: !320, line: 480, baseType: !84, size: 64, offset: 2304)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !340, file: !320, line: 480, baseType: !84, size: 64, offset: 2368)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !340, file: !320, line: 480, baseType: !84, size: 64, offset: 2432)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !340, file: !320, line: 482, baseType: !419, size: 2816, offset: 2496)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2816, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 44)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !340, file: !320, line: 488, baseType: !423, size: 256, offset: 5312)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !424, line: 60, size: 256, elements: !425)
!424 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !423, file: !424, line: 61, baseType: !427, size: 256)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 256, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 4)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !340, file: !320, line: 490, baseType: !431, size: 64, offset: 5568)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !320, line: 490, flags: DIFlagFwdDecl)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !340, file: !320, line: 493, baseType: !434, size: 896, offset: 5632)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !435, line: 53, baseType: !436)
!435 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !435, line: 13, size: 896, elements: !437)
!437 = !{!438, !439, !440, !441, !444, !445, !452, !453, !473, !474, !477}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !436, file: !435, line: 18, baseType: !348, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !436, file: !435, line: 28, baseType: !379, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !436, file: !435, line: 31, baseType: !388, size: 256, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !436, file: !435, line: 32, baseType: !442, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !435, line: 32, flags: DIFlagFwdDecl)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !436, file: !435, line: 37, baseType: !272, size: 16, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !436, file: !435, line: 40, baseType: !446, size: 192, offset: 512)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !447, line: 53, size: 192, elements: !448)
!447 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!448 = !{!449, !450, !451}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !446, file: !447, line: 54, baseType: !377, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !446, file: !447, line: 55, baseType: !190, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !446, file: !447, line: 59, baseType: !114, size: 128, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !436, file: !435, line: 41, baseType: !81, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !436, file: !435, line: 42, baseType: !454, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !457, line: 13, size: 896, elements: !458)
!457 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !456, file: !457, line: 14, baseType: !81, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !456, file: !457, line: 15, baseType: !84, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !456, file: !457, line: 17, baseType: !84, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !456, file: !457, line: 17, baseType: !84, size: 64, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !456, file: !457, line: 19, baseType: !85, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !456, file: !457, line: 21, baseType: !85, size: 64, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !456, file: !457, line: 22, baseType: !85, size: 64, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !456, file: !457, line: 23, baseType: !85, size: 64, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !456, file: !457, line: 24, baseType: !85, size: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !456, file: !457, line: 25, baseType: !85, size: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !456, file: !457, line: 26, baseType: !85, size: 64, offset: 640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !456, file: !457, line: 27, baseType: !85, size: 64, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !456, file: !457, line: 28, baseType: !85, size: 64, offset: 768)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !456, file: !457, line: 29, baseType: !85, size: 64, offset: 832)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !436, file: !435, line: 44, baseType: !369, size: 32, offset: 832)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !436, file: !435, line: 50, baseType: !475, size: 16, offset: 864)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !349, line: 19, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !97, line: 24, baseType: !272)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !436, file: !435, line: 51, baseType: !478, size: 16, offset: 880)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !349, line: 18, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !97, line: 23, baseType: !480)
!480 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !320, line: 495, baseType: !84, size: 64, offset: 6528)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !340, file: !320, line: 497, baseType: !483, size: 64, offset: 6592)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !320, line: 381, size: 384, elements: !485)
!485 = !{!486, !487, !1382}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !484, file: !320, line: 382, baseType: !369, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !484, file: !320, line: 383, baseType: !488, size: 128, offset: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !320, line: 376, size: 128, elements: !489)
!489 = !{!490, !1380}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !488, file: !320, line: 377, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !493, line: 640, size: 48640, elements: !494)
!493 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!494 = !{!495, !502, !504, !505, !511, !512, !513, !514, !515, !516, !517, !518, !522, !540, !551, !644, !645, !646, !655, !656, !658, !659, !660, !661, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !740, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !796, !798, !799, !800, !812, !814, !815, !816, !817, !818, !824, !825, !826, !827, !828, !829, !830, !842, !847, !851, !852, !853, !856, !860, !863, !866, !869, !872, !875, !878, !881, !887, !888, !889, !895, !896, !897, !898, !899, !908, !909, !910, !911, !912, !917, !918, !919, !922, !923, !926, !929, !932, !935, !938, !941, !942, !1022, !1025, !1028, !1029, !1032, !1033, !1034, !1040, !1041, !1042, !1055, !1056, !1057, !1067, !1072, !1075, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !492, file: !493, line: 646, baseType: !496, size: 128)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !497, line: 56, size: 128, elements: !498)
!497 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !497, line: 57, baseType: !84, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !496, file: !497, line: 58, baseType: !501, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !349, line: 21, baseType: !104)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !492, file: !493, line: 649, baseType: !503, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !492, file: !493, line: 657, baseType: !81, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !492, file: !493, line: 658, baseType: !506, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !507, line: 113, baseType: !508)
!507 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !507, line: 111, size: 32, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !508, file: !507, line: 112, baseType: !369, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !493, line: 660, baseType: !7, size: 32, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !492, file: !493, line: 661, baseType: !7, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !492, file: !493, line: 684, baseType: !133, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !492, file: !493, line: 686, baseType: !133, size: 32, offset: 384)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !492, file: !493, line: 687, baseType: !133, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !492, file: !493, line: 688, baseType: !133, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !492, file: !493, line: 689, baseType: !7, size: 32, offset: 480)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !492, file: !493, line: 691, baseType: !519, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !493, line: 691, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !492, file: !493, line: 692, baseType: !523, size: 832, offset: 576)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !493, line: 451, size: 832, elements: !524)
!524 = !{!525, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !523, file: !493, line: 453, baseType: !526, size: 128)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !493, line: 325, size: 128, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !526, file: !493, line: 326, baseType: !84, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !526, file: !493, line: 327, baseType: !501, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !523, file: !493, line: 454, baseType: !327, size: 192, align: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !523, file: !493, line: 455, baseType: !114, size: 128, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !523, file: !493, line: 456, baseType: !7, size: 32, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !523, file: !493, line: 458, baseType: !348, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !523, file: !493, line: 459, baseType: !348, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !523, file: !493, line: 460, baseType: !348, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !523, file: !493, line: 461, baseType: !348, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !523, file: !493, line: 463, baseType: !348, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !523, file: !493, line: 465, baseType: !539, offset: 832)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !493, line: 415, elements: !204)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !492, file: !493, line: 693, baseType: !541, size: 384, offset: 1408)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !493, line: 489, size: 384, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !541, file: !493, line: 490, baseType: !114, size: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !541, file: !493, line: 491, baseType: !84, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !541, file: !493, line: 492, baseType: !84, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !541, file: !493, line: 493, baseType: !7, size: 32, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !541, file: !493, line: 494, baseType: !272, size: 16, offset: 288)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !541, file: !493, line: 495, baseType: !272, size: 16, offset: 304)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !541, file: !493, line: 497, baseType: !550, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !492, file: !493, line: 697, baseType: !552, size: 1792, offset: 1792)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !493, line: 507, size: 1792, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !641, !642}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !552, file: !493, line: 508, baseType: !327, size: 192, align: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !552, file: !493, line: 515, baseType: !348, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !552, file: !493, line: 516, baseType: !348, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !552, file: !493, line: 517, baseType: !348, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !552, file: !493, line: 518, baseType: !348, size: 64, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !552, file: !493, line: 519, baseType: !348, size: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !552, file: !493, line: 526, baseType: !383, size: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !552, file: !493, line: 527, baseType: !348, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !552, file: !493, line: 528, baseType: !7, size: 32, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !552, file: !493, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !552, file: !493, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !552, file: !493, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !552, file: !493, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !552, file: !493, line: 563, baseType: !568, size: 512, offset: 704)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !569)
!569 = !{!570, !578, !579, !584, !636, !638, !639, !640}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !568, file: !6, line: 119, baseType: !571, size: 256)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !572, line: 9, size: 256, elements: !573)
!572 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !571, file: !572, line: 10, baseType: !327, size: 192, align: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !571, file: !572, line: 11, baseType: !576, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !577, line: 29, baseType: !383)
!577 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !568, file: !6, line: 120, baseType: !576, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !568, file: !6, line: 121, baseType: !580, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!5, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !568, file: !6, line: 122, baseType: !585, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !587)
!587 = !{!588, !608, !609, !612, !622, !623, !631, !635}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !586, file: !6, line: 160, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !590, file: !6, line: 215, baseType: !394)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !590, file: !6, line: 216, baseType: !7, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !590, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !590, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !590, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !590, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !590, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !590, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !590, file: !6, line: 233, baseType: !576, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !590, file: !6, line: 234, baseType: !583, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !590, file: !6, line: 235, baseType: !576, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !590, file: !6, line: 236, baseType: !583, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !590, file: !6, line: 237, baseType: !605, size: 4096, offset: 512)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 4096, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !586, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !586, file: !6, line: 162, baseType: !610, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !83, line: 27, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !264, line: 96, baseType: !133)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !586, file: !6, line: 163, baseType: !613, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !614, line: 276, baseType: !615)
!614 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !614, line: 276, size: 32, elements: !616)
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !615, file: !614, line: 276, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !614, line: 70, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !614, line: 65, size: 32, elements: !620)
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !619, file: !614, line: 66, baseType: !7, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !586, file: !6, line: 164, baseType: !583, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !586, file: !6, line: 165, baseType: !624, size: 128, offset: 256)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !572, line: 14, size: 128, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !624, file: !572, line: 15, baseType: !627, size: 128)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !328, line: 125, size: 128, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !627, file: !328, line: 126, baseType: !344, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !627, file: !328, line: 127, baseType: !332, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !586, file: !6, line: 166, baseType: !632, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{!576}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !586, file: !6, line: 167, baseType: !576, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !568, file: !6, line: 123, baseType: !637, size: 8, offset: 448)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !349, line: 17, baseType: !96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !568, file: !6, line: 124, baseType: !637, size: 8, offset: 456)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !568, file: !6, line: 125, baseType: !637, size: 8, offset: 464)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !568, file: !6, line: 126, baseType: !637, size: 8, offset: 472)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !552, file: !493, line: 572, baseType: !568, size: 512, offset: 1216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !552, file: !493, line: 580, baseType: !643, size: 64, offset: 1728)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !492, file: !493, line: 721, baseType: !7, size: 32, offset: 3584)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !492, file: !493, line: 722, baseType: !133, size: 32, offset: 3616)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !492, file: !493, line: 723, baseType: !647, size: 64, offset: 3648)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !650, line: 17, baseType: !651)
!650 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !650, line: 17, size: 64, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !651, file: !650, line: 17, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !106)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !492, file: !493, line: 724, baseType: !649, size: 64, offset: 3712)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !492, file: !493, line: 749, baseType: !657, offset: 3776)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !493, line: 290, elements: !204)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !492, file: !493, line: 751, baseType: !114, size: 128, offset: 3776)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !492, file: !493, line: 757, baseType: !336, size: 64, offset: 3904)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !492, file: !493, line: 758, baseType: !336, size: 64, offset: 3968)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !492, file: !493, line: 761, baseType: !662, size: 320, offset: 4032)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !424, line: 34, size: 320, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !662, file: !424, line: 35, baseType: !348, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !662, file: !424, line: 36, baseType: !666, size: 256, offset: 64)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 256, elements: !428)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !492, file: !493, line: 766, baseType: !133, size: 32, offset: 4352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !492, file: !493, line: 767, baseType: !133, size: 32, offset: 4384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !492, file: !493, line: 768, baseType: !133, size: 32, offset: 4416)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !492, file: !493, line: 770, baseType: !133, size: 32, offset: 4448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !492, file: !493, line: 772, baseType: !84, size: 64, offset: 4480)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !492, file: !493, line: 775, baseType: !7, size: 32, offset: 4544)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !492, file: !493, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !492, file: !493, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !492, file: !493, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !492, file: !493, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !492, file: !493, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !492, file: !493, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !492, file: !493, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !492, file: !493, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !492, file: !493, line: 831, baseType: !84, size: 64, offset: 4672)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !492, file: !493, line: 833, baseType: !683, size: 384, offset: 4736)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !684)
!684 = !{!685, !690}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !683, file: !12, line: 26, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!85, !689}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !12, line: 27, baseType: !691, size: 320, offset: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !683, file: !12, line: 27, size: 320, elements: !692)
!692 = !{!693, !703, !730}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !691, file: !12, line: 36, baseType: !694, size: 320)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !12, line: 29, size: 320, elements: !695)
!695 = !{!696, !698, !699, !700, !701, !702}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !694, file: !12, line: 30, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !694, file: !12, line: 31, baseType: !501, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !12, line: 32, baseType: !501, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !694, file: !12, line: 33, baseType: !501, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !694, file: !12, line: 34, baseType: !348, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !694, file: !12, line: 35, baseType: !697, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !691, file: !12, line: 46, baseType: !704, size: 192)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !12, line: 38, size: 192, elements: !705)
!705 = !{!706, !707, !708, !729}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !704, file: !12, line: 39, baseType: !610, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !704, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, scope: !704, file: !12, line: 41, baseType: !709, size: 64, offset: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !704, file: !12, line: 41, size: 64, elements: !710)
!710 = !{!711, !719}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !709, file: !12, line: 42, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !714, line: 7, size: 128, elements: !715)
!714 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!715 = !{!716, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !713, file: !714, line: 8, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !264, line: 93, baseType: !312)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !713, file: !714, line: 9, baseType: !312, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !709, file: !12, line: 43, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !722, line: 7, size: 64, elements: !723)
!722 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!723 = !{!724, !728}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !721, file: !722, line: 8, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !722, line: 5, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !349, line: 20, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !97, line: 26, baseType: !133)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !721, file: !722, line: 9, baseType: !726, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !704, file: !12, line: 45, baseType: !348, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !691, file: !12, line: 54, baseType: !731, size: 256)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !12, line: 48, size: 256, elements: !732)
!732 = !{!733, !736, !737, !738, !739}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !731, file: !12, line: 49, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !731, file: !12, line: 50, baseType: !133, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !731, file: !12, line: 51, baseType: !133, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !731, file: !12, line: 52, baseType: !84, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !731, file: !12, line: 53, baseType: !84, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !492, file: !493, line: 835, baseType: !741, size: 32, offset: 5120)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !83, line: 22, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !264, line: 28, baseType: !133)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !492, file: !493, line: 836, baseType: !741, size: 32, offset: 5152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !492, file: !493, line: 840, baseType: !84, size: 64, offset: 5184)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !492, file: !493, line: 849, baseType: !491, size: 64, offset: 5248)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !492, file: !493, line: 852, baseType: !491, size: 64, offset: 5312)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !492, file: !493, line: 857, baseType: !114, size: 128, offset: 5376)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !492, file: !493, line: 858, baseType: !114, size: 128, offset: 5504)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !492, file: !493, line: 859, baseType: !491, size: 64, offset: 5632)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !492, file: !493, line: 867, baseType: !114, size: 128, offset: 5696)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !492, file: !493, line: 868, baseType: !114, size: 128, offset: 5824)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !492, file: !493, line: 871, baseType: !753, size: 64, offset: 5952)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !755, line: 59, size: 768, elements: !756)
!755 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!756 = !{!757, !758, !759, !760, !771, !772, !779, !788}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !754, file: !755, line: 61, baseType: !506, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !754, file: !755, line: 62, baseType: !7, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !754, file: !755, line: 63, baseType: !190, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !754, file: !755, line: 65, baseType: !761, size: 256, offset: 64)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 256, elements: !428)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !83, line: 182, size: 64, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !762, file: !83, line: 183, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !83, line: 186, size: 128, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !83, line: 187, baseType: !765, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !766, file: !83, line: 187, baseType: !770, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !754, file: !755, line: 66, baseType: !762, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !754, file: !755, line: 68, baseType: !773, size: 128, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !774, line: 40, baseType: !775)
!774 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !774, line: 36, size: 128, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !775, file: !774, line: 37, baseType: !190)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !775, file: !774, line: 38, baseType: !114, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !754, file: !755, line: 69, baseType: !780, size: 128, align: 64, offset: 512)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !83, line: 216, size: 128, align: 64, elements: !781)
!781 = !{!782, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !780, file: !83, line: 217, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !780, file: !83, line: 218, baseType: !785, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !783}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !754, file: !755, line: 70, baseType: !789, size: 128, offset: 640)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 128, elements: !106)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !755, line: 54, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !790, file: !755, line: 55, baseType: !133, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !790, file: !755, line: 56, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !755, line: 56, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !492, file: !493, line: 872, baseType: !797, size: 512, offset: 6016)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 512, elements: !428)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !492, file: !493, line: 873, baseType: !114, size: 128, offset: 6528)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !492, file: !493, line: 874, baseType: !114, size: 128, offset: 6656)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !492, file: !493, line: 876, baseType: !801, size: 64, offset: 6784)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !803, line: 26, size: 192, elements: !804)
!803 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !802, file: !803, line: 27, baseType: !7, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !802, file: !803, line: 28, baseType: !807, size: 128, offset: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !808, line: 43, size: 128, elements: !809)
!808 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !807, file: !808, line: 44, baseType: !394)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !807, file: !808, line: 45, baseType: !114, size: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !492, file: !493, line: 879, baseType: !813, size: 64, offset: 6848)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !492, file: !493, line: 882, baseType: !813, size: 64, offset: 6912)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !492, file: !493, line: 884, baseType: !348, size: 64, offset: 6976)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !492, file: !493, line: 885, baseType: !348, size: 64, offset: 7040)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !492, file: !493, line: 890, baseType: !348, size: 64, offset: 7104)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !492, file: !493, line: 891, baseType: !819, size: 128, offset: 7168)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !493, line: 242, size: 128, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !819, file: !493, line: 244, baseType: !348, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !819, file: !493, line: 245, baseType: !348, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !819, file: !493, line: 246, baseType: !394, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !492, file: !493, line: 900, baseType: !84, size: 64, offset: 7296)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !492, file: !493, line: 901, baseType: !84, size: 64, offset: 7360)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !492, file: !493, line: 904, baseType: !348, size: 64, offset: 7424)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !492, file: !493, line: 907, baseType: !348, size: 64, offset: 7488)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !492, file: !493, line: 910, baseType: !84, size: 64, offset: 7552)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !492, file: !493, line: 911, baseType: !84, size: 64, offset: 7616)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !492, file: !493, line: 914, baseType: !831, size: 640, offset: 7680)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !832, line: 123, size: 640, elements: !833)
!832 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!833 = !{!834, !840, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !831, file: !832, line: 124, baseType: !835, size: 576)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 576, elements: !232)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !832, line: 108, size: 192, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !836, file: !832, line: 109, baseType: !348, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !836, file: !832, line: 110, baseType: !624, size: 128, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !831, file: !832, line: 125, baseType: !7, size: 32, offset: 576)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !831, file: !832, line: 126, baseType: !7, size: 32, offset: 608)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !492, file: !493, line: 917, baseType: !843, size: 192, offset: 8320)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !832, line: 134, size: 192, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !843, file: !832, line: 135, baseType: !780, size: 128, align: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !843, file: !832, line: 136, baseType: !7, size: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !492, file: !493, line: 923, baseType: !848, size: 64, offset: 8512)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !493, line: 923, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !492, file: !493, line: 926, baseType: !848, size: 64, offset: 8576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !492, file: !493, line: 929, baseType: !848, size: 64, offset: 8640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !492, file: !493, line: 933, baseType: !854, size: 64, offset: 8704)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !493, line: 933, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !492, file: !493, line: 943, baseType: !857, size: 128, offset: 8768)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 128, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !492, file: !493, line: 945, baseType: !861, size: 64, offset: 8896)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !493, line: 49, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !492, file: !493, line: 956, baseType: !864, size: 64, offset: 8960)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !493, line: 45, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !492, file: !493, line: 959, baseType: !867, size: 64, offset: 9024)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !493, line: 959, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !492, file: !493, line: 962, baseType: !870, size: 64, offset: 9088)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !493, line: 66, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !492, file: !493, line: 966, baseType: !873, size: 64, offset: 9152)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !493, line: 50, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !492, file: !493, line: 969, baseType: !876, size: 64, offset: 9216)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !832, line: 223, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !492, file: !493, line: 970, baseType: !879, size: 64, offset: 9280)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !493, line: 62, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !492, file: !493, line: 971, baseType: !882, size: 64, offset: 9344)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !883, line: 25, baseType: !884)
!883 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !883, line: 23, size: 64, elements: !885)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !884, file: !883, line: 24, baseType: !654, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !492, file: !493, line: 972, baseType: !882, size: 64, offset: 9408)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !492, file: !493, line: 974, baseType: !882, size: 64, offset: 9472)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !492, file: !493, line: 975, baseType: !890, size: 192, offset: 9536)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !891, line: 30, size: 192, elements: !892)
!891 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !890, file: !891, line: 31, baseType: !114, size: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !890, file: !891, line: 32, baseType: !882, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !492, file: !493, line: 976, baseType: !84, size: 64, offset: 9728)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !492, file: !493, line: 977, baseType: !277, size: 64, offset: 9792)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !492, file: !493, line: 978, baseType: !7, size: 32, offset: 9856)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !492, file: !493, line: 980, baseType: !783, size: 64, offset: 9920)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !492, file: !493, line: 989, baseType: !900, size: 128, offset: 9984)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !901, line: 35, size: 128, elements: !902)
!901 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !900, file: !901, line: 36, baseType: !133, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !900, file: !901, line: 37, baseType: !369, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !900, file: !901, line: 38, baseType: !906, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !901, line: 23, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !492, file: !493, line: 992, baseType: !348, size: 64, offset: 10112)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !492, file: !493, line: 993, baseType: !348, size: 64, offset: 10176)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !492, file: !493, line: 996, baseType: !190, offset: 10240)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !492, file: !493, line: 999, baseType: !394, offset: 10240)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !492, file: !493, line: 1001, baseType: !913, size: 64, offset: 10240)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !493, line: 636, size: 64, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !913, file: !493, line: 637, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !492, file: !493, line: 1005, baseType: !627, size: 128, offset: 10304)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !492, file: !493, line: 1007, baseType: !491, size: 64, offset: 10432)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !492, file: !493, line: 1009, baseType: !920, size: 64, offset: 10496)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !493, line: 1009, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !492, file: !493, line: 1043, baseType: !81, size: 64, offset: 10560)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !492, file: !493, line: 1046, baseType: !924, size: 64, offset: 10624)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !493, line: 41, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !492, file: !493, line: 1050, baseType: !927, size: 64, offset: 10688)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !493, line: 42, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !492, file: !493, line: 1054, baseType: !930, size: 64, offset: 10752)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !493, line: 55, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !492, file: !493, line: 1056, baseType: !933, size: 64, offset: 10816)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !493, line: 40, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !492, file: !493, line: 1058, baseType: !936, size: 64, offset: 10880)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !493, line: 47, flags: DIFlagFwdDecl)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !492, file: !493, line: 1061, baseType: !939, size: 64, offset: 10944)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !493, line: 43, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !492, file: !493, line: 1064, baseType: !84, size: 64, offset: 11008)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !492, file: !493, line: 1065, baseType: !943, size: 64, offset: 11072)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !891, line: 14, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !891, line: 12, size: 384, elements: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, scope: !945, file: !891, line: 13, baseType: !948, size: 384)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !945, file: !891, line: 13, size: 384, elements: !949)
!949 = !{!950, !951, !952, !953}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !948, file: !891, line: 13, baseType: !133, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !948, file: !891, line: 13, baseType: !133, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !948, file: !891, line: 13, baseType: !133, size: 32, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !948, file: !891, line: 13, baseType: !954, size: 256, offset: 128)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !955, line: 32, size: 256, elements: !956)
!955 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!956 = !{!957, !963, !976, !982, !991, !1011, !1016}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !954, file: !955, line: 37, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !954, file: !955, line: 34, size: 64, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !958, file: !955, line: 35, baseType: !742, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !958, file: !955, line: 36, baseType: !962, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !264, line: 49, baseType: !7)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !954, file: !955, line: 45, baseType: !964, size: 192)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !954, file: !955, line: 40, size: 192, elements: !965)
!965 = !{!966, !968, !969, !975}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !964, file: !955, line: 41, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !264, line: 95, baseType: !133)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !964, file: !955, line: 42, baseType: !133, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !964, file: !955, line: 43, baseType: !970, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !955, line: 11, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !955, line: 8, size: 64, elements: !972)
!972 = !{!973, !974}
