; ModuleID = '../bcout/drivers/acpi/acpi_lpat.llvm.bc'
source_filename = "drivers/acpi/acpi_lpat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_buffer = type { i64, i8* }
%struct.kmem_cache = type opaque
%struct.acpi_lpat_conversion_table = type { %struct.acpi_lpat*, i32 }
%struct.acpi_lpat = type { i32, i32 }
%union.acpi_object = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i32, i64, i32 }
%struct.acpi_object_list = type { i32, %union.acpi_object* }
%struct.anon.2 = type { i32, i32, %union.acpi_object* }
%struct.anon = type { i32, i64 }

@__const.acpi_lpat_get_conversion_table.buffer = private unnamed_addr constant %struct.acpi_buffer { i64 -1, i8* null }, align 8
@.str = private unnamed_addr constant [5 x i8] c"LPAT\00", align 1
@kmalloc_caches = external dso_local global [3 x [14 x %struct.kmem_cache*]], align 16
@.str.1 = private unnamed_addr constant [21 x i8] c"include/linux/slab.h\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @acpi_lpat_raw_to_temp(%struct.acpi_lpat_conversion_table* %lpat_table, i32 %raw) #0 !dbg !93 {
entry:
  %retval = alloca i32, align 4
  %lpat_table.addr = alloca %struct.acpi_lpat_conversion_table*, align 8
  %raw.addr = alloca i32, align 4
  %i = alloca i32, align 4
  %delta_temp = alloca i32, align 4
  %delta_raw = alloca i32, align 4
  %temp = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/acpi/acpi_lpat.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !4, line: 305, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!11 = !{!12, !76, !78, !81, !61}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !14, line: 899, size: 192, elements: !15)
!14 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !22, !30, !38, !48, !54, !62, !70}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !13, file: !14, line: 900, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !14, line: 635, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !19, line: 21, baseType: !20)
!19 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !21, line: 27, baseType: !5)
!21 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !13, file: !14, line: 904, baseType: !23, size: 128)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 901, size: 128, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, file: !14, line: 902, baseType: !17, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !23, file: !14, line: 903, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !19, line: 23, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !21, line: 31, baseType: !29)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !13, file: !14, line: 910, baseType: !31, size: 128)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 906, size: 128, elements: !32)
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !31, file: !14, line: 907, baseType: !17, size: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !31, file: !14, line: 908, baseType: !18, size: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !31, file: !14, line: 909, baseType: !36, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !13, file: !14, line: 916, baseType: !39, size: 128)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 912, size: 128, elements: !40)
!40 = !{!41, !42, !43}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !39, file: !14, line: 913, baseType: !17, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !39, file: !14, line: 914, baseType: !18, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !39, file: !14, line: 915, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !19, line: 17, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !21, line: 21, baseType: !47)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !13, file: !14, line: 922, baseType: !49, size: 128)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 918, size: 128, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !14, line: 919, baseType: !17, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !49, file: !14, line: 920, baseType: !18, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !49, file: !14, line: 921, baseType: !12, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !13, file: !14, line: 928, baseType: !55, size: 128)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 924, size: 128, elements: !56)
!56 = !{!57, !58, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !14, line: 925, baseType: !17, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !55, file: !14, line: 926, baseType: !17, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !55, file: !14, line: 927, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !14, line: 424, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !13, file: !14, line: 935, baseType: !63, size: 192)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 930, size: 192, elements: !64)
!64 = !{!65, !66, !67, !69}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !14, line: 931, baseType: !17, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !63, file: !14, line: 932, baseType: !18, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !63, file: !14, line: 933, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !14, line: 128, baseType: !27)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !63, file: !14, line: 934, baseType: !18, size: 32, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !13, file: !14, line: 941, baseType: !71, size: 96)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !13, file: !14, line: 937, size: 96, elements: !72)
!72 = !{!73, !74, !75}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !14, line: 938, baseType: !17, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !71, file: !14, line: 939, baseType: !18, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !71, file: !14, line: 940, baseType: !18, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !77, line: 148, baseType: !5)
!77 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !19, line: 22, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !21, line: 30, baseType: !80)
!80 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_lpat", file: !83, line: 11, size: 64, elements: !84)
!83 = !DIFile(filename: "./include/acpi/acpi_lpat.h", directory: "/home/lizy2001/genbc/linux")
!84 = !{!85, !87}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !82, file: !83, line: 12, baseType: !86, size: 32)
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !82, file: !83, line: 13, baseType: !86, size: 32, offset: 32)
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 2}
!91 = !{i32 1, !"Code Model", i32 2}
!92 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!93 = distinct !DISubprogram(name: "acpi_lpat_raw_to_temp", scope: !1, file: !1, line: 23, type: !94, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !101)
!94 = !DISubroutineType(types: !95)
!95 = !{!86, !96, !86}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_lpat_conversion_table", file: !83, line: 16, size: 128, elements: !98)
!98 = !{!99, !100}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lpat", scope: !97, file: !83, line: 17, baseType: !81, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "lpat_count", scope: !97, file: !83, line: 18, baseType: !86, size: 32, offset: 64)
!101 = !{}
!102 = !DILocalVariable(name: "lpat_table", arg: 1, scope: !93, file: !1, line: 23, type: !96)
!103 = !DILocation(line: 23, column: 62, scope: !93)
!104 = !DILocalVariable(name: "raw", arg: 2, scope: !93, file: !1, line: 24, type: !86)
!105 = !DILocation(line: 24, column: 10, scope: !93)
!106 = !DILocalVariable(name: "i", scope: !93, file: !1, line: 26, type: !86)
!107 = !DILocation(line: 26, column: 6, scope: !93)
!108 = !DILocalVariable(name: "delta_temp", scope: !93, file: !1, line: 26, type: !86)
!109 = !DILocation(line: 26, column: 9, scope: !93)
!110 = !DILocalVariable(name: "delta_raw", scope: !93, file: !1, line: 26, type: !86)
!111 = !DILocation(line: 26, column: 21, scope: !93)
!112 = !DILocalVariable(name: "temp", scope: !93, file: !1, line: 26, type: !86)
!113 = !DILocation(line: 26, column: 32, scope: !93)
!114 = !DILocalVariable(name: "lpat", scope: !93, file: !1, line: 27, type: !81)
!115 = !DILocation(line: 27, column: 20, scope: !93)
!116 = !DILocation(line: 27, column: 27, scope: !93)
!117 = !DILocation(line: 27, column: 39, scope: !93)
!118 = !DILocation(line: 29, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !93, file: !1, line: 29, column: 2)
!120 = !DILocation(line: 29, column: 7, scope: !119)
!121 = !DILocation(line: 29, column: 14, scope: !122)
!122 = distinct !DILexicalBlock(scope: !119, file: !1, line: 29, column: 2)
!123 = !DILocation(line: 29, column: 18, scope: !122)
!124 = !DILocation(line: 29, column: 30, scope: !122)
!125 = !DILocation(line: 29, column: 41, scope: !122)
!126 = !DILocation(line: 29, column: 16, scope: !122)
!127 = !DILocation(line: 29, column: 2, scope: !119)
!128 = !DILocation(line: 30, column: 8, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !1, line: 30, column: 7)
!130 = distinct !DILexicalBlock(scope: !122, file: !1, line: 29, column: 51)
!131 = !DILocation(line: 30, column: 15, scope: !129)
!132 = !DILocation(line: 30, column: 20, scope: !129)
!133 = !DILocation(line: 30, column: 23, scope: !129)
!134 = !DILocation(line: 30, column: 12, scope: !129)
!135 = !DILocation(line: 30, column: 27, scope: !129)
!136 = !DILocation(line: 30, column: 30, scope: !129)
!137 = !DILocation(line: 30, column: 37, scope: !129)
!138 = !DILocation(line: 30, column: 42, scope: !129)
!139 = !DILocation(line: 30, column: 43, scope: !129)
!140 = !DILocation(line: 30, column: 47, scope: !129)
!141 = !DILocation(line: 30, column: 34, scope: !129)
!142 = !DILocation(line: 30, column: 52, scope: !129)
!143 = !DILocation(line: 31, column: 8, scope: !129)
!144 = !DILocation(line: 31, column: 15, scope: !129)
!145 = !DILocation(line: 31, column: 20, scope: !129)
!146 = !DILocation(line: 31, column: 23, scope: !129)
!147 = !DILocation(line: 31, column: 12, scope: !129)
!148 = !DILocation(line: 31, column: 27, scope: !129)
!149 = !DILocation(line: 31, column: 30, scope: !129)
!150 = !DILocation(line: 31, column: 37, scope: !129)
!151 = !DILocation(line: 31, column: 42, scope: !129)
!152 = !DILocation(line: 31, column: 43, scope: !129)
!153 = !DILocation(line: 31, column: 47, scope: !129)
!154 = !DILocation(line: 31, column: 34, scope: !129)
!155 = !DILocation(line: 30, column: 7, scope: !130)
!156 = !DILocation(line: 32, column: 4, scope: !129)
!157 = !DILocation(line: 33, column: 2, scope: !130)
!158 = !DILocation(line: 29, column: 47, scope: !122)
!159 = !DILocation(line: 29, column: 2, scope: !122)
!160 = distinct !{!160, !127, !161}
!161 = !DILocation(line: 33, column: 2, scope: !119)
!162 = !DILocation(line: 35, column: 6, scope: !163)
!163 = distinct !DILexicalBlock(scope: !93, file: !1, line: 35, column: 6)
!164 = !DILocation(line: 35, column: 11, scope: !163)
!165 = !DILocation(line: 35, column: 23, scope: !163)
!166 = !DILocation(line: 35, column: 34, scope: !163)
!167 = !DILocation(line: 35, column: 8, scope: !163)
!168 = !DILocation(line: 35, column: 6, scope: !93)
!169 = !DILocation(line: 36, column: 3, scope: !163)
!170 = !DILocation(line: 38, column: 15, scope: !93)
!171 = !DILocation(line: 38, column: 20, scope: !93)
!172 = !DILocation(line: 38, column: 21, scope: !93)
!173 = !DILocation(line: 38, column: 25, scope: !93)
!174 = !DILocation(line: 38, column: 32, scope: !93)
!175 = !DILocation(line: 38, column: 37, scope: !93)
!176 = !DILocation(line: 38, column: 40, scope: !93)
!177 = !DILocation(line: 38, column: 30, scope: !93)
!178 = !DILocation(line: 38, column: 13, scope: !93)
!179 = !DILocation(line: 39, column: 14, scope: !93)
!180 = !DILocation(line: 39, column: 19, scope: !93)
!181 = !DILocation(line: 39, column: 20, scope: !93)
!182 = !DILocation(line: 39, column: 24, scope: !93)
!183 = !DILocation(line: 39, column: 30, scope: !93)
!184 = !DILocation(line: 39, column: 35, scope: !93)
!185 = !DILocation(line: 39, column: 38, scope: !93)
!186 = !DILocation(line: 39, column: 28, scope: !93)
!187 = !DILocation(line: 39, column: 12, scope: !93)
!188 = !DILocation(line: 40, column: 9, scope: !93)
!189 = !DILocation(line: 40, column: 14, scope: !93)
!190 = !DILocation(line: 40, column: 17, scope: !93)
!191 = !DILocation(line: 40, column: 25, scope: !93)
!192 = !DILocation(line: 40, column: 31, scope: !93)
!193 = !DILocation(line: 40, column: 36, scope: !93)
!194 = !DILocation(line: 40, column: 39, scope: !93)
!195 = !DILocation(line: 40, column: 29, scope: !93)
!196 = !DILocation(line: 40, column: 46, scope: !93)
!197 = !DILocation(line: 40, column: 44, scope: !93)
!198 = !DILocation(line: 40, column: 59, scope: !93)
!199 = !DILocation(line: 40, column: 57, scope: !93)
!200 = !DILocation(line: 40, column: 22, scope: !93)
!201 = !DILocation(line: 40, column: 7, scope: !93)
!202 = !DILocation(line: 42, column: 9, scope: !93)
!203 = !DILocation(line: 42, column: 2, scope: !93)
!204 = !DILocation(line: 43, column: 1, scope: !93)
!205 = distinct !DISubprogram(name: "acpi_lpat_temp_to_raw", scope: !1, file: !1, line: 57, type: !94, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !101)
!206 = !DILocalVariable(name: "lpat_table", arg: 1, scope: !205, file: !1, line: 57, type: !96)
!207 = !DILocation(line: 57, column: 62, scope: !205)
!208 = !DILocalVariable(name: "temp", arg: 2, scope: !205, file: !1, line: 58, type: !86)
!209 = !DILocation(line: 58, column: 10, scope: !205)
!210 = !DILocalVariable(name: "i", scope: !205, file: !1, line: 60, type: !86)
!211 = !DILocation(line: 60, column: 6, scope: !205)
!212 = !DILocalVariable(name: "delta_temp", scope: !205, file: !1, line: 60, type: !86)
!213 = !DILocation(line: 60, column: 9, scope: !205)
!214 = !DILocalVariable(name: "delta_raw", scope: !205, file: !1, line: 60, type: !86)
!215 = !DILocation(line: 60, column: 21, scope: !205)
!216 = !DILocalVariable(name: "raw", scope: !205, file: !1, line: 60, type: !86)
!217 = !DILocation(line: 60, column: 32, scope: !205)
!218 = !DILocalVariable(name: "lpat", scope: !205, file: !1, line: 61, type: !81)
!219 = !DILocation(line: 61, column: 20, scope: !205)
!220 = !DILocation(line: 61, column: 27, scope: !205)
!221 = !DILocation(line: 61, column: 39, scope: !205)
!222 = !DILocation(line: 63, column: 9, scope: !223)
!223 = distinct !DILexicalBlock(scope: !205, file: !1, line: 63, column: 2)
!224 = !DILocation(line: 63, column: 7, scope: !223)
!225 = !DILocation(line: 63, column: 14, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !1, line: 63, column: 2)
!227 = !DILocation(line: 63, column: 18, scope: !226)
!228 = !DILocation(line: 63, column: 30, scope: !226)
!229 = !DILocation(line: 63, column: 41, scope: !226)
!230 = !DILocation(line: 63, column: 16, scope: !226)
!231 = !DILocation(line: 63, column: 2, scope: !223)
!232 = !DILocation(line: 64, column: 7, scope: !233)
!233 = distinct !DILexicalBlock(scope: !234, file: !1, line: 64, column: 7)
!234 = distinct !DILexicalBlock(scope: !226, file: !1, line: 63, column: 51)
!235 = !DILocation(line: 64, column: 15, scope: !233)
!236 = !DILocation(line: 64, column: 20, scope: !233)
!237 = !DILocation(line: 64, column: 23, scope: !233)
!238 = !DILocation(line: 64, column: 12, scope: !233)
!239 = !DILocation(line: 64, column: 28, scope: !233)
!240 = !DILocation(line: 64, column: 31, scope: !233)
!241 = !DILocation(line: 64, column: 39, scope: !233)
!242 = !DILocation(line: 64, column: 44, scope: !233)
!243 = !DILocation(line: 64, column: 45, scope: !233)
!244 = !DILocation(line: 64, column: 49, scope: !233)
!245 = !DILocation(line: 64, column: 36, scope: !233)
!246 = !DILocation(line: 64, column: 7, scope: !234)
!247 = !DILocation(line: 65, column: 4, scope: !233)
!248 = !DILocation(line: 66, column: 2, scope: !234)
!249 = !DILocation(line: 63, column: 47, scope: !226)
!250 = !DILocation(line: 63, column: 2, scope: !226)
!251 = distinct !{!251, !231, !252}
!252 = !DILocation(line: 66, column: 2, scope: !223)
!253 = !DILocation(line: 68, column: 6, scope: !254)
!254 = distinct !DILexicalBlock(scope: !205, file: !1, line: 68, column: 6)
!255 = !DILocation(line: 68, column: 12, scope: !254)
!256 = !DILocation(line: 68, column: 24, scope: !254)
!257 = !DILocation(line: 68, column: 35, scope: !254)
!258 = !DILocation(line: 68, column: 8, scope: !254)
!259 = !DILocation(line: 68, column: 6, scope: !205)
!260 = !DILocation(line: 69, column: 3, scope: !254)
!261 = !DILocation(line: 71, column: 15, scope: !205)
!262 = !DILocation(line: 71, column: 20, scope: !205)
!263 = !DILocation(line: 71, column: 21, scope: !205)
!264 = !DILocation(line: 71, column: 25, scope: !205)
!265 = !DILocation(line: 71, column: 32, scope: !205)
!266 = !DILocation(line: 71, column: 37, scope: !205)
!267 = !DILocation(line: 71, column: 40, scope: !205)
!268 = !DILocation(line: 71, column: 30, scope: !205)
!269 = !DILocation(line: 71, column: 13, scope: !205)
!270 = !DILocation(line: 72, column: 14, scope: !205)
!271 = !DILocation(line: 72, column: 19, scope: !205)
!272 = !DILocation(line: 72, column: 20, scope: !205)
!273 = !DILocation(line: 72, column: 24, scope: !205)
!274 = !DILocation(line: 72, column: 30, scope: !205)
!275 = !DILocation(line: 72, column: 35, scope: !205)
!276 = !DILocation(line: 72, column: 38, scope: !205)
!277 = !DILocation(line: 72, column: 28, scope: !205)
!278 = !DILocation(line: 72, column: 12, scope: !205)
!279 = !DILocation(line: 73, column: 8, scope: !205)
!280 = !DILocation(line: 73, column: 13, scope: !205)
!281 = !DILocation(line: 73, column: 16, scope: !205)
!282 = !DILocation(line: 73, column: 23, scope: !205)
!283 = !DILocation(line: 73, column: 30, scope: !205)
!284 = !DILocation(line: 73, column: 35, scope: !205)
!285 = !DILocation(line: 73, column: 38, scope: !205)
!286 = !DILocation(line: 73, column: 28, scope: !205)
!287 = !DILocation(line: 73, column: 46, scope: !205)
!288 = !DILocation(line: 73, column: 44, scope: !205)
!289 = !DILocation(line: 73, column: 58, scope: !205)
!290 = !DILocation(line: 73, column: 56, scope: !205)
!291 = !DILocation(line: 73, column: 20, scope: !205)
!292 = !DILocation(line: 73, column: 6, scope: !205)
!293 = !DILocation(line: 75, column: 9, scope: !205)
!294 = !DILocation(line: 75, column: 2, scope: !205)
!295 = !DILocation(line: 76, column: 1, scope: !205)
!296 = distinct !DISubprogram(name: "acpi_lpat_get_conversion_table", scope: !1, file: !1, line: 89, type: !297, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !101)
!297 = !DISubroutineType(types: !298)
!298 = !{!96, !60}
!299 = !DILocalVariable(name: "handle", arg: 1, scope: !296, file: !1, line: 90, type: !60)
!300 = !DILocation(line: 90, column: 11, scope: !296)
!301 = !DILocalVariable(name: "lpat_table", scope: !296, file: !1, line: 92, type: !96)
!302 = !DILocation(line: 92, column: 37, scope: !296)
!303 = !DILocalVariable(name: "buffer", scope: !296, file: !1, line: 93, type: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_buffer", file: !14, line: 969, size: 128, elements: !305)
!305 = !{!306, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !304, file: !14, line: 970, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !14, line: 127, baseType: !27)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !304, file: !14, line: 971, baseType: !61, size: 64, offset: 64)
!309 = !DILocation(line: 93, column: 21, scope: !296)
!310 = !DILocalVariable(name: "obj_p", scope: !296, file: !1, line: 94, type: !12)
!311 = !DILocation(line: 94, column: 21, scope: !296)
!312 = !DILocalVariable(name: "obj_e", scope: !296, file: !1, line: 94, type: !12)
!313 = !DILocation(line: 94, column: 29, scope: !296)
!314 = !DILocalVariable(name: "lpat", scope: !296, file: !1, line: 95, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!316 = !DILocation(line: 95, column: 7, scope: !296)
!317 = !DILocalVariable(name: "i", scope: !296, file: !1, line: 95, type: !86)
!318 = !DILocation(line: 95, column: 13, scope: !296)
!319 = !DILocalVariable(name: "status", scope: !296, file: !1, line: 96, type: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !14, line: 421, baseType: !18)
!321 = !DILocation(line: 96, column: 14, scope: !296)
!322 = !DILocation(line: 98, column: 32, scope: !296)
!323 = !DILocation(line: 98, column: 11, scope: !296)
!324 = !DILocation(line: 98, column: 9, scope: !296)
!325 = !DILocation(line: 99, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !296, file: !1, line: 99, column: 6)
!327 = !DILocation(line: 99, column: 6, scope: !296)
!328 = !DILocation(line: 100, column: 3, scope: !326)
!329 = !DILocation(line: 102, column: 38, scope: !296)
!330 = !DILocation(line: 102, column: 10, scope: !296)
!331 = !DILocation(line: 102, column: 8, scope: !296)
!332 = !DILocation(line: 103, column: 7, scope: !333)
!333 = distinct !DILexicalBlock(scope: !296, file: !1, line: 103, column: 6)
!334 = !DILocation(line: 103, column: 13, scope: !333)
!335 = !DILocation(line: 103, column: 17, scope: !333)
!336 = !DILocation(line: 103, column: 24, scope: !333)
!337 = !DILocation(line: 103, column: 29, scope: !333)
!338 = !DILocation(line: 103, column: 51, scope: !333)
!339 = !DILocation(line: 104, column: 7, scope: !333)
!340 = !DILocation(line: 104, column: 14, scope: !333)
!341 = !DILocation(line: 104, column: 22, scope: !333)
!342 = !DILocation(line: 104, column: 28, scope: !333)
!343 = !DILocation(line: 104, column: 33, scope: !333)
!344 = !DILocation(line: 104, column: 37, scope: !333)
!345 = !DILocation(line: 104, column: 44, scope: !333)
!346 = !DILocation(line: 104, column: 52, scope: !333)
!347 = !DILocation(line: 104, column: 58, scope: !333)
!348 = !DILocation(line: 103, column: 6, scope: !296)
!349 = !DILocation(line: 105, column: 3, scope: !333)
!350 = !DILocation(line: 107, column: 17, scope: !296)
!351 = !DILocation(line: 107, column: 24, scope: !296)
!352 = !DILocation(line: 107, column: 32, scope: !296)
!353 = !DILocation(line: 107, column: 9, scope: !296)
!354 = !DILocation(line: 107, column: 7, scope: !296)
!355 = !DILocation(line: 108, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !296, file: !1, line: 108, column: 6)
!357 = !DILocation(line: 108, column: 6, scope: !296)
!358 = !DILocation(line: 109, column: 3, scope: !356)
!359 = !DILocation(line: 111, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !296, file: !1, line: 111, column: 2)
!361 = !DILocation(line: 111, column: 7, scope: !360)
!362 = !DILocation(line: 111, column: 14, scope: !363)
!363 = distinct !DILexicalBlock(scope: !360, file: !1, line: 111, column: 2)
!364 = !DILocation(line: 111, column: 18, scope: !363)
!365 = !DILocation(line: 111, column: 25, scope: !363)
!366 = !DILocation(line: 111, column: 33, scope: !363)
!367 = !DILocation(line: 111, column: 16, scope: !363)
!368 = !DILocation(line: 111, column: 2, scope: !360)
!369 = !DILocation(line: 112, column: 12, scope: !370)
!370 = distinct !DILexicalBlock(scope: !363, file: !1, line: 111, column: 45)
!371 = !DILocation(line: 112, column: 19, scope: !370)
!372 = !DILocation(line: 112, column: 27, scope: !370)
!373 = !DILocation(line: 112, column: 36, scope: !370)
