; ModuleID = '../bcout/drivers/acpi/event.llvm.bc'
source_filename = "drivers/acpi/event.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall5.init\22, \22a\22\09"
module asm "__initcall_acpi_event_init5:\09\09\09"
module asm ".long\09acpi_event_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.blocking_notifier_head = type { %struct.rw_semaphore, %struct.notifier_block* }
%struct.rw_semaphore = type { %struct.atomic64_t, %struct.atomic64_t, %struct.raw_spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.notifier_block = type { i32 (%struct.notifier_block*, i64, i8*)*, %struct.notifier_block*, i32 }
%struct.genl_family = type { i32, i32, [16 x i8], i32, i32, i32, i8, i8, i8, i8, %struct.nla_policy*, i32 (%struct.genl_ops*, %struct.sk_buff*, %struct.genl_info*)*, void (%struct.genl_ops*, %struct.sk_buff*, %struct.genl_info*)*, %struct.genl_ops*, %struct.genl_small_ops*, %struct.genl_multicast_group*, %struct.module* }
%struct.nla_policy = type { i8, i8, i16, %union.anon.94 }
%union.anon.94 = type { i8* }

!65 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !67, line: 44, baseType: !7, size: 32, elements: !68)
!67 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !70, !71}
!69 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!72 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !73, line: 343, baseType: !7, size: 32, elements: !74)
!73 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !80, line: 524, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !80, line: 502, baseType: !7, size: 32, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !94, line: 76, baseType: !7, size: 32, elements: !95)
!94 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!95 = !{!96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!96 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!97 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!102 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!103 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!104 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!105 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!106 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 68, baseType: !7, size: 32, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "ACPI_GENL_CMD_UNSPEC", value: 0, isUnsigned: true)
!110 = !DIEnumerator(name: "ACPI_GENL_CMD_EVENT", value: 1, isUnsigned: true)
!111 = !DIEnumerator(name: "__ACPI_GENL_CMD_MAX", value: 2, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 60, baseType: !7, size: 32, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIEnumerator(name: "ACPI_GENL_ATTR_UNSPEC", value: 0, isUnsigned: true)
!115 = !DIEnumerator(name: "ACPI_GENL_ATTR_EVENT", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "__ACPI_GENL_ATTR_MAX", value: 2, isUnsigned: true)
!117 = !{!118, !119, !121, !122, !124, !126}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !120, line: 148, baseType: !7)
!120 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!121 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_skb_parms", file: !128, line: 23, size: 320, elements: !129)
!128 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!129 = !{!130, !155, !156, !157, !158, !161, !164}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "creds", scope: !127, file: !128, line: 24, baseType: !131, size: 96)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "scm_creds", file: !132, line: 18, size: 96, elements: !133)
!132 = !DIFile(filename: "./include/net/scm.h", directory: "/home/lizy2001/genbc/linux")
!133 = !{!134, !139, !148}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !131, file: !132, line: 19, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !136, line: 21, baseType: !137)
!136 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !138, line: 27, baseType: !7)
!138 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !131, file: !132, line: 20, baseType: !140, size: 32, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !141, line: 23, baseType: !142)
!141 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 21, size: 32, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !142, file: !141, line: 22, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !120, line: 32, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !147, line: 49, baseType: !7)
!147 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !131, file: !132, line: 21, baseType: !149, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !141, line: 28, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 26, size: 32, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !150, file: !141, line: 27, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !120, line: 33, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !147, line: 50, baseType: !7)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "portid", scope: !127, file: !128, line: 25, baseType: !137, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dst_group", scope: !127, file: !128, line: 26, baseType: !137, size: 32, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !128, line: 27, baseType: !137, size: 32, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !127, file: !128, line: 28, baseType: !159, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !61, line: 19, flags: DIFlagFwdDecl)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "nsid_is_set", scope: !127, file: !128, line: 29, baseType: !162, size: 8, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !120, line: 30, baseType: !163)
!163 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "nsid", scope: !127, file: !128, line: 30, baseType: !121, size: 32, offset: 288)
!165 = !{!166, !168, !0, !170, !1451}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__UNIQUE_ID___addressable_acpi_event_init284", scope: !2, file: !3, line: 181, type: !118, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "acpi_event_seqnum", scope: !2, file: !3, line: 51, type: !7, isLocal: true, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "acpi_event_genl_family", scope: !2, file: !3, line: 83, type: !172, isLocal: true, isDefinition: true)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "genl_family", file: !173, line: 47, size: 768, elements: !174)
!173 = !DIFile(filename: "./include/net/genetlink.h", directory: "/home/lizy2001/genbc/linux")
!174 = !{!175, !176, !177, !181, !182, !183, !184, !187, !188, !189, !190, !191, !262, !1428, !1432, !1433, !1444, !1450}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !172, file: !173, line: 48, baseType: !121, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "hdrsize", scope: !172, file: !173, line: 49, baseType: !7, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !172, file: !173, line: 50, baseType: !178, size: 128, offset: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !172, file: !173, line: 51, baseType: !7, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "maxattr", scope: !172, file: !173, line: 52, baseType: !7, size: 32, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mcgrp_offset", scope: !172, file: !173, line: 53, baseType: !7, size: 32, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "netnsok", scope: !172, file: !173, line: 54, baseType: !185, size: 1, offset: 288, flags: DIFlagBitField, extraData: i64 288)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !136, line: 17, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !138, line: 21, baseType: !125)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parallel_ops", scope: !172, file: !173, line: 55, baseType: !185, size: 1, offset: 289, flags: DIFlagBitField, extraData: i64 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "n_ops", scope: !172, file: !173, line: 56, baseType: !185, size: 8, offset: 296)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "n_small_ops", scope: !172, file: !173, line: 57, baseType: !185, size: 8, offset: 304)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "n_mcgrps", scope: !172, file: !173, line: 58, baseType: !185, size: 8, offset: 312)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !172, file: !173, line: 59, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !195, line: 315, size: 128, elements: !196)
!195 = !DIFile(filename: "./include/net/netlink.h", directory: "/home/lizy2001/genbc/linux")
!196 = !{!197, !198, !199, !203}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !195, line: 316, baseType: !185, size: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "validation_type", scope: !194, file: !195, line: 317, baseType: !185, size: 8, offset: 8)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !194, file: !195, line: 318, baseType: !200, size: 16, offset: 16)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !136, line: 19, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !138, line: 24, baseType: !202)
!202 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !195, line: 319, baseType: !204, size: 64, offset: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !194, file: !195, line: 319, size: 64, elements: !205)
!205 = !{!206, !208, !209, !212, !213, !222, !231, !239, !261}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bitfield32_valid", scope: !204, file: !195, line: 320, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !204, file: !195, line: 321, baseType: !207, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reject_message", scope: !204, file: !195, line: 322, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nested_policy", scope: !204, file: !195, line: 323, baseType: !192, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !204, file: !195, line: 324, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_range_validation", file: !195, line: 189, size: 128, elements: !216)
!216 = !{!217, !221}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !215, file: !195, line: 190, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !136, line: 23, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !138, line: 31, baseType: !220)
!220 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !215, file: !195, line: 190, baseType: !218, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "range_signed", scope: !204, file: !195, line: 325, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_range_validation_signed", file: !195, line: 193, size: 128, elements: !225)
!225 = !{!226, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !224, file: !195, line: 194, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !136, line: 22, baseType: !228)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !138, line: 30, baseType: !229)
!229 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !224, file: !195, line: 194, baseType: !227, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, scope: !204, file: !195, line: 326, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !195, line: 326, size: 32, elements: !233)
!233 = !{!234, !238}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !232, file: !195, line: 327, baseType: !235, size: 16)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !136, line: 18, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !138, line: 23, baseType: !237)
!237 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !232, file: !195, line: 327, baseType: !235, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "validate", scope: !204, file: !195, line: 329, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!121, !243, !250}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !246, line: 213, size: 32, elements: !247)
!246 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !245, file: !246, line: 214, baseType: !201, size: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !245, file: !246, line: 215, baseType: !201, size: 16, offset: 16)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !128, line: 75, size: 384, elements: !252)
!252 = !{!253, !254, !255, !256, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !251, file: !128, line: 76, baseType: !210, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !251, file: !128, line: 77, baseType: !243, size: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !251, file: !128, line: 78, baseType: !192, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !251, file: !128, line: 79, baseType: !257, size: 160, offset: 192)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 160, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 20)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !251, file: !128, line: 80, baseType: !185, size: 8, offset: 352)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "strict_start_type", scope: !204, file: !195, line: 349, baseType: !200, size: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pre_doit", scope: !172, file: !173, line: 60, baseType: !263, size: 64, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!121, !266, !274, !435}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "genl_ops", file: !173, line: 148, size: 384, elements: !269)
!269 = !{!270, !1385, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "doit", scope: !268, file: !173, line: 149, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!121, !274, !435}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !276, line: 713, size: 1600, elements: !277)
!276 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!277 = !{!278, !308, !313, !320, !324, !336, !337, !338, !339, !340, !341, !345, !346, !347, !348, !349, !350, !351, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !390, !391, !392, !393, !395, !396, !401, !406, !411, !412, !413, !414, !415, !416, !417, !418, !419, !421, !422, !423, !424, !425}
!278 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 714, baseType: !279, size: 192)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 714, size: 192, elements: !280)
!280 = !{!281, !294, !302}
!281 = !DIDerivedType(tag: DW_TAG_member, scope: !279, file: !276, line: 715, baseType: !282, size: 192)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !279, file: !276, line: 715, size: 192, elements: !283)
!283 = !{!284, !285, !286}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !276, line: 717, baseType: !274, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !282, file: !276, line: 718, baseType: !274, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, scope: !282, file: !276, line: 720, baseType: !287, size: 64, offset: 128)
!287 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !282, file: !276, line: 720, size: 64, elements: !288)
!288 = !{!289, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !287, file: !276, line: 721, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !276, line: 242, flags: DIFlagFwdDecl)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !287, file: !276, line: 726, baseType: !293, size: 64)
!293 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !279, file: !276, line: 729, baseType: !295, size: 192, align: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !296, line: 24, size: 192, align: 64, elements: !297)
!296 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !299, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !295, file: !296, line: 25, baseType: !293, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !295, file: !296, line: 26, baseType: !300, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !295, file: !296, line: 27, baseType: !300, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !279, file: !276, line: 730, baseType: !303, size: 128)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !120, line: 178, size: 128, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !120, line: 179, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !303, file: !120, line: 179, baseType: !306, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 733, baseType: !309, size: 64, offset: 192)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 733, size: 64, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !309, file: !276, line: 734, baseType: !159, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !309, file: !276, line: 735, baseType: !121, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 738, baseType: !314, size: 64, offset: 256)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 738, size: 64, elements: !315)
!315 = !{!316, !319}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !314, file: !276, line: 739, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !318, line: 29, baseType: !227)
!318 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !314, file: !276, line: 740, baseType: !218, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !275, file: !276, line: 748, baseType: !321, size: 384, align: 64, offset: 320)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 384, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 48)
!324 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 750, baseType: !325, size: 128, offset: 704)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 750, size: 128, elements: !326)
!326 = !{!327, !335}
!327 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !276, line: 751, baseType: !328, size: 128)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !276, line: 751, size: 128, elements: !329)
!329 = !{!330, !331}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !328, file: !276, line: 752, baseType: !293, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !328, file: !276, line: 753, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !274}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !325, file: !276, line: 755, baseType: !303, size: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !275, file: !276, line: 761, baseType: !7, size: 32, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !275, file: !276, line: 762, baseType: !7, size: 32, offset: 864)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !275, file: !276, line: 763, baseType: !201, size: 16, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !275, file: !276, line: 764, baseType: !201, size: 16, offset: 912)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !275, file: !276, line: 769, baseType: !201, size: 16, offset: 928)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !275, file: !276, line: 780, baseType: !342, offset: 944)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !275, file: !276, line: 782, baseType: !186, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !275, file: !276, line: 783, baseType: !186, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !275, file: !276, line: 784, baseType: !186, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !275, file: !276, line: 785, baseType: !186, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !275, file: !276, line: 786, baseType: !186, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !275, file: !276, line: 787, baseType: !186, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !275, file: !276, line: 795, baseType: !352, offset: 960)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, elements: !343)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !275, file: !276, line: 807, baseType: !342, offset: 960)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !275, file: !276, line: 809, baseType: !186, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !275, file: !276, line: 810, baseType: !186, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !275, file: !276, line: 811, baseType: !186, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !275, file: !276, line: 812, baseType: !186, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !275, file: !276, line: 813, baseType: !186, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !275, file: !276, line: 815, baseType: !186, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !275, file: !276, line: 816, baseType: !186, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !275, file: !276, line: 817, baseType: !186, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !275, file: !276, line: 818, baseType: !186, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !275, file: !276, line: 819, baseType: !186, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !275, file: !276, line: 821, baseType: !186, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !275, file: !276, line: 822, baseType: !186, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !275, file: !276, line: 823, baseType: !186, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !275, file: !276, line: 832, baseType: !342, offset: 976)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !275, file: !276, line: 834, baseType: !186, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !275, file: !276, line: 835, baseType: !186, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !275, file: !276, line: 836, baseType: !186, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !275, file: !276, line: 837, baseType: !186, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !275, file: !276, line: 838, baseType: !186, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !275, file: !276, line: 840, baseType: !186, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !275, file: !276, line: 843, baseType: !186, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !275, file: !276, line: 844, baseType: !186, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !275, file: !276, line: 845, baseType: !186, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !275, file: !276, line: 847, baseType: !186, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !275, file: !276, line: 848, baseType: !186, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 866, baseType: !380, size: 32, offset: 992)
!380 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 866, size: 32, elements: !381)
!381 = !{!382, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !380, file: !276, line: 867, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !384, line: 37, baseType: !137)
!384 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !380, file: !276, line: 868, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !380, file: !276, line: 868, size: 32, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !386, file: !276, line: 869, baseType: !201, size: 16)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !386, file: !276, line: 870, baseType: !201, size: 16, offset: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !275, file: !276, line: 873, baseType: !137, size: 32, offset: 1024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !275, file: !276, line: 874, baseType: !121, size: 32, offset: 1056)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !275, file: !276, line: 875, baseType: !137, size: 32, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !275, file: !276, line: 876, baseType: !394, size: 16, offset: 1120)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !384, line: 30, baseType: !201)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !275, file: !276, line: 877, baseType: !201, size: 16, offset: 1136)
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 879, baseType: !397, size: 32, offset: 1152)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 879, size: 32, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !397, file: !276, line: 880, baseType: !7, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !397, file: !276, line: 881, baseType: !7, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 888, baseType: !402, size: 32, offset: 1184)
!402 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 888, size: 32, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !402, file: !276, line: 889, baseType: !137, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !402, file: !276, line: 890, baseType: !137, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !275, file: !276, line: 893, baseType: !407, size: 16, offset: 1216)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !275, file: !276, line: 893, size: 16, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !407, file: !276, line: 894, baseType: !394, size: 16)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !407, file: !276, line: 895, baseType: !186, size: 8)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !275, file: !276, line: 898, baseType: !201, size: 16, offset: 1232)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !275, file: !276, line: 899, baseType: !201, size: 16, offset: 1248)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !275, file: !276, line: 900, baseType: !201, size: 16, offset: 1264)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !275, file: !276, line: 902, baseType: !394, size: 16, offset: 1280)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !275, file: !276, line: 903, baseType: !201, size: 16, offset: 1296)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !275, file: !276, line: 904, baseType: !201, size: 16, offset: 1312)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !275, file: !276, line: 905, baseType: !201, size: 16, offset: 1328)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !275, file: !276, line: 908, baseType: !352, offset: 1344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !275, file: !276, line: 912, baseType: !420, size: 32, offset: 1344)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !276, line: 606, baseType: !7)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !275, file: !276, line: 913, baseType: !420, size: 32, offset: 1376)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !275, file: !276, line: 914, baseType: !124, size: 64, offset: 1408)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !275, file: !276, line: 915, baseType: !124, size: 64, offset: 1472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !275, file: !276, line: 916, baseType: !7, size: 32, offset: 1536)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !275, file: !276, line: 917, baseType: !426, size: 32, offset: 1568)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !427, line: 113, baseType: !428)
!427 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !427, line: 111, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !428, file: !427, line: 112, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !120, line: 168, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 166, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !432, file: !120, line: 167, baseType: !121, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "genl_info", file: !173, line: 84, size: 576, elements: !437)
!437 = !{!438, !439, !440, !449, !457, !458, !461, !1382, !1384}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "snd_seq", scope: !436, file: !173, line: 85, baseType: !135, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "snd_portid", scope: !436, file: !173, line: 86, baseType: !135, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "nlhdr", scope: !436, file: !173, line: 87, baseType: !441, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !246, line: 44, size: 128, elements: !443)
!443 = !{!444, !445, !446, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !442, file: !246, line: 45, baseType: !137, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !442, file: !246, line: 46, baseType: !201, size: 16, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !442, file: !246, line: 47, baseType: !201, size: 16, offset: 48)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !442, file: !246, line: 48, baseType: !137, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !442, file: !246, line: 49, baseType: !137, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "genlhdr", scope: !436, file: !173, line: 88, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "genlmsghdr", file: !452, line: 13, size: 32, elements: !453)
!452 = !DIFile(filename: "./include/uapi/linux/genetlink.h", directory: "/home/lizy2001/genbc/linux")
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !451, file: !452, line: 14, baseType: !186, size: 8)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !451, file: !452, line: 15, baseType: !186, size: 8, offset: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !451, file: !452, line: 16, baseType: !201, size: 16, offset: 16)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "userhdr", scope: !436, file: !173, line: 89, baseType: !118, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !436, file: !173, line: 90, baseType: !459, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "_net", scope: !436, file: !173, line: 91, baseType: !462, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "possible_net_t", file: !463, line: 318, baseType: !464)
!463 = !DIFile(filename: "./include/net/net_namespace.h", directory: "/home/lizy2001/genbc/linux")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !463, line: 314, size: 64, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "net", scope: !464, file: !463, line: 316, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net", file: !463, line: 56, size: 16896, elements: !469)
!469 = !{!470, !471, !472, !488, !489, !490, !491, !492, !493, !494, !495, !501, !517, !520, !523, !536, !552, !553, !557, !558, !676, !677, !678, !681, !683, !684, !699, !700, !701, !702, !713, !785, !797, !803, !823, !1164, !1329, !1336, !1339, !1354, !1355, !1381}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "passive", scope: !468, file: !463, line: 60, baseType: !426, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !468, file: !463, line: 63, baseType: !426, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rules_mod_lock", scope: !468, file: !463, line: 66, baseType: !473, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !474, line: 83, baseType: !475)
!474 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !474, line: 71, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, scope: !475, file: !474, line: 72, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !475, file: !474, line: 72, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !478, file: !474, line: 73, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !474, line: 20, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !481, file: !474, line: 21, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !485, line: 25, baseType: !486)
!485 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 25, elements: !487)
!487 = !{}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dev_unreg_count", scope: !468, file: !463, line: 68, baseType: !7, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dev_base_seq", scope: !468, file: !463, line: 70, baseType: !7, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !468, file: !463, line: 71, baseType: !121, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nsid_lock", scope: !468, file: !463, line: 73, baseType: !473, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "fnhe_genid", scope: !468, file: !463, line: 74, baseType: !431, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !468, file: !463, line: 76, baseType: !303, size: 128, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "exit_list", scope: !468, file: !463, line: 77, baseType: !303, size: 128, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup_list", scope: !468, file: !463, line: 83, baseType: !496, size: 64, offset: 448)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !497, line: 58, size: 64, elements: !498)
!497 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!498 = !{!499}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !497, line: 59, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "key_domain", scope: !468, file: !463, line: 86, baseType: !502, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "key_tag", file: !504, line: 102, size: 192, elements: !505)
!504 = !DIFile(filename: "./include/linux/key.h", directory: "/home/lizy2001/genbc/linux")
!505 = !{!506, !515, !516}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !503, file: !504, line: 103, baseType: !507, size: 128, align: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !120, line: 216, size: 128, align: 64, elements: !508)
!508 = !{!509, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !120, line: 217, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !507, file: !120, line: 218, baseType: !512, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !510}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !503, file: !504, line: 104, baseType: !426, size: 32, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "removed", scope: !503, file: !504, line: 105, baseType: !162, size: 8, offset: 160)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !468, file: !463, line: 88, baseType: !518, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !141, line: 18, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ucounts", scope: !468, file: !463, line: 89, baseType: !521, size: 64, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "ucounts", file: !463, line: 89, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "netns_ids", scope: !468, file: !463, line: 90, baseType: !524, size: 192, offset: 704)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !525, line: 19, size: 192, elements: !526)
!525 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!526 = !{!527, !534, !535}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !524, file: !525, line: 20, baseType: !528, size: 128)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !529, line: 292, size: 128, elements: !530)
!529 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !528, file: !529, line: 293, baseType: !473)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !528, file: !529, line: 295, baseType: !119, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !528, file: !529, line: 296, baseType: !118, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !524, file: !525, line: 21, baseType: !7, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !524, file: !525, line: 22, baseType: !7, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !468, file: !463, line: 92, baseType: !537, size: 192, offset: 896)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ns_common", file: !538, line: 7, size: 192, elements: !539)
!538 = !DIFile(filename: "./include/linux/ns_common.h", directory: "/home/lizy2001/genbc/linux")
!539 = !{!540, !547, !551}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "stashed", scope: !537, file: !538, line: 8, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !542, line: 13, baseType: !543)
!542 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !120, line: 175, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 173, size: 64, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !544, file: !120, line: 174, baseType: !227, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !537, file: !538, line: 9, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_ns_operations", file: !538, line: 5, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "inum", scope: !537, file: !538, line: 10, baseType: !7, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dev_base_head", scope: !468, file: !463, line: 94, baseType: !303, size: 128, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "proc_net", scope: !468, file: !463, line: 95, baseType: !554, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_dir_entry", file: !556, line: 12, flags: DIFlagFwdDecl)
!556 = !DIFile(filename: "./include/linux/proc_fs.h", directory: "/home/lizy2001/genbc/linux")
!557 = !DIDerivedType(tag: DW_TAG_member, name: "proc_net_stat", scope: !468, file: !463, line: 96, baseType: !554, size: 64, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sysctls", scope: !468, file: !463, line: 99, baseType: !559, size: 768, offset: 1344)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_set", file: !560, line: 156, size: 768, elements: !561)
!560 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!561 = !{!562, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "is_seen", scope: !559, file: !560, line: 157, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!121, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !559, file: !560, line: 158, baseType: !568, size: 704, offset: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_dir", file: !560, line: 150, size: 704, elements: !569)
!569 = !{!570, !672}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !568, file: !560, line: 152, baseType: !571, size: 640)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_header", file: !560, line: 131, size: 640, elements: !572)
!572 = !{!573, !619, !632, !633, !653, !654, !656, !662}
!573 = !DIDerivedType(tag: DW_TAG_member, scope: !571, file: !560, line: 132, baseType: !574, size: 192)
!574 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !571, file: !560, line: 132, size: 192, elements: !575)
!575 = !{!576, !618}
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !574, file: !560, line: 133, baseType: !577, size: 192)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !574, file: !560, line: 133, size: 192, elements: !578)
!578 = !{!579, !615, !616, !617}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table", scope: !577, file: !560, line: 134, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table", file: !560, line: 112, size: 512, elements: !582)
!582 = !{!583, !584, !585, !586, !588, !589, !601, !613, !614}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "procname", scope: !581, file: !560, line: 113, baseType: !210, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !581, file: !560, line: 114, baseType: !118, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !581, file: !560, line: 115, baseType: !121, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !581, file: !560, line: 116, baseType: !587, size: 16, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !120, line: 19, baseType: !202)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !581, file: !560, line: 117, baseType: !580, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "proc_handler", scope: !581, file: !560, line: 118, baseType: !590, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "proc_handler", file: !560, line: 47, baseType: !592)
!592 = !DISubroutineType(types: !593)
!593 = !{!121, !580, !121, !118, !594, !598}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 55, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !147, line: 72, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !147, line: 16, baseType: !293)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !120, line: 46, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !147, line: 88, baseType: !229)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !581, file: !560, line: 119, baseType: !602, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_poll", file: !560, line: 94, size: 192, elements: !604)
!604 = !{!605, !606}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !603, file: !560, line: 95, baseType: !431, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !603, file: !560, line: 96, baseType: !607, size: 128, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !608, line: 40, baseType: !609)
!608 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !608, line: 36, size: 128, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !609, file: !608, line: 37, baseType: !473)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !609, file: !608, line: 38, baseType: !303, size: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "extra1", scope: !581, file: !560, line: 120, baseType: !118, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "extra2", scope: !581, file: !560, line: 121, baseType: !118, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !577, file: !560, line: 135, baseType: !121, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !577, file: !560, line: 136, baseType: !121, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nreg", scope: !577, file: !560, line: 137, baseType: !121, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !574, file: !560, line: 139, baseType: !507, size: 128, align: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "unregistering", scope: !571, file: !560, line: 141, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !622, line: 26, size: 192, elements: !623)
!622 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !621, file: !622, line: 27, baseType: !7, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !621, file: !622, line: 28, baseType: !626, size: 128, offset: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !627, line: 43, size: 128, elements: !628)
!627 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!628 = !{!629, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !626, file: !627, line: 44, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !474, line: 29, baseType: !481)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !626, file: !627, line: 45, baseType: !303, size: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ctl_table_arg", scope: !571, file: !560, line: 142, baseType: !580, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !571, file: !560, line: 143, baseType: !634, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_table_root", file: !560, line: 161, size: 960, elements: !636)
!636 = !{!637, !638, !642, !649}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "default_set", scope: !635, file: !560, line: 162, baseType: !559, size: 768)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !635, file: !560, line: 163, baseType: !639, size: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!566, !634}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "set_ownership", scope: !635, file: !560, line: 164, baseType: !643, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !646, !580, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "permissions", scope: !635, file: !560, line: 167, baseType: !650, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DISubroutineType(types: !652)
!652 = !{!121, !646, !580}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !571, file: !560, line: 144, baseType: !566, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !571, file: !560, line: 145, baseType: !655, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !571, file: !560, line: 146, baseType: !657, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctl_node", file: !560, line: 124, size: 256, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !658, file: !560, line: 125, baseType: !295, size: 192, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !658, file: !560, line: 126, baseType: !646, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !571, file: !560, line: 147, baseType: !663, size: 64, offset: 576)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !120, line: 182, size: 64, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !663, file: !120, line: 183, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !120, line: 186, size: 128, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !120, line: 187, baseType: !666, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !667, file: !120, line: 187, baseType: !671, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !568, file: !560, line: 153, baseType: !673, size: 64, offset: 640)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !296, line: 31, size: 64, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !673, file: !296, line: 32, baseType: !300, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rtnl", scope: !468, file: !463, line: 102, baseType: !159, size: 64, offset: 2112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "genl_sock", scope: !468, file: !463, line: 103, baseType: !159, size: 64, offset: 2176)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_sock", scope: !468, file: !463, line: 105, baseType: !679, size: 64, offset: 2240)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "uevent_sock", file: !463, line: 48, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dev_name_head", scope: !468, file: !463, line: 107, baseType: !682, size: 64, offset: 2304)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dev_index_head", scope: !468, file: !463, line: 108, baseType: !682, size: 64, offset: 2368)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_chain", scope: !468, file: !463, line: 109, baseType: !685, size: 64, offset: 2432)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_notifier_head", file: !686, line: 70, size: 64, elements: !687)
!686 = !DIFile(filename: "./include/linux/notifier.h", directory: "/home/lizy2001/genbc/linux")
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !685, file: !686, line: 71, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "notifier_block", file: !686, line: 54, size: 192, elements: !691)
!691 = !{!692, !697, !698}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_call", scope: !690, file: !686, line: 55, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "notifier_fn_t", file: !686, line: 51, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{!121, !689, !293, !118}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !686, line: 56, baseType: !689, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !690, file: !686, line: 57, baseType: !121, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mix", scope: !468, file: !463, line: 114, baseType: !135, size: 32, offset: 2496)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "loopback_dev", scope: !468, file: !463, line: 116, baseType: !290, size: 64, offset: 2560)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rules_ops", scope: !468, file: !463, line: 119, baseType: !303, size: 128, offset: 2624)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "core", scope: !468, file: !463, line: 121, baseType: !703, size: 256, offset: 2752)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_core", file: !704, line: 8, size: 256, elements: !705)
!704 = !DIFile(filename: "./include/net/netns/core.h", directory: "/home/lizy2001/genbc/linux")
!705 = !{!706, !707, !708, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_hdr", scope: !703, file: !704, line: 10, baseType: !646, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_somaxconn", scope: !703, file: !704, line: 12, baseType: !121, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sock_inuse", scope: !703, file: !704, line: 15, baseType: !709, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prot_inuse", scope: !703, file: !704, line: 16, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "prot_inuse", file: !704, line: 6, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mib", scope: !468, file: !463, line: 122, baseType: !714, size: 832, offset: 3008)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_mib", file: !715, line: 7, size: 832, elements: !716)
!715 = !DIFile(filename: "./include/net/netns/mib.h", directory: "/home/lizy2001/genbc/linux")
!716 = !{!717, !724, !735, !743, !751, !752, !760, !768, !769, !770, !771, !772, !780}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_statistics", scope: !714, file: !715, line: 8, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcp_mib", file: !720, line: 92, size: 1024, elements: !721)
!720 = !DIFile(filename: "./include/net/snmp.h", directory: "/home/lizy2001/genbc/linux")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !719, file: !720, line: 93, baseType: !723, size: 1024)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 1024, elements: !179)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ip_statistics", scope: !714, file: !715, line: 9, baseType: !725, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipstats_mib", file: !720, line: 51, size: 2368, elements: !727)
!727 = !{!728, !732}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !726, file: !720, line: 53, baseType: !729, size: 2368)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2368, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 37)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "syncp", scope: !726, file: !720, line: 54, baseType: !733, offset: 2368)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "u64_stats_sync", file: !734, line: 68, elements: !487)
!734 = !DIFile(filename: "./include/linux/u64_stats_sync.h", directory: "/home/lizy2001/genbc/linux")
!735 = !DIDerivedType(tag: DW_TAG_member, name: "net_statistics", scope: !714, file: !715, line: 10, baseType: !736, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "linux_mib", file: !720, line: 104, size: 7936, elements: !738)
!738 = !{!739}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !737, file: !720, line: 105, baseType: !740, size: 7936)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 7936, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 124)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "udp_statistics", scope: !714, file: !715, line: 11, baseType: !744, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udp_mib", file: !720, line: 98, size: 576, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !745, file: !720, line: 99, baseType: !748, size: 576)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 576, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 9)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "udplite_statistics", scope: !714, file: !715, line: 12, baseType: !744, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_statistics", scope: !714, file: !715, line: 13, baseType: !753, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmp_mib", file: !720, line: 59, size: 1792, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !754, file: !720, line: 60, baseType: !757, size: 1792)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 1792, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 28)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "icmpmsg_statistics", scope: !714, file: !715, line: 14, baseType: !761, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpmsg_mib", file: !720, line: 64, size: 32768, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !762, file: !720, line: 65, baseType: !765, size: 32768)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !541, size: 32768, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "proc_net_devsnmp6", scope: !714, file: !715, line: 17, baseType: !554, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "udp_stats_in6", scope: !714, file: !715, line: 18, baseType: !744, size: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "udplite_stats_in6", scope: !714, file: !715, line: 19, baseType: !744, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_statistics", scope: !714, file: !715, line: 20, baseType: !725, size: 64, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "icmpv6_statistics", scope: !714, file: !715, line: 21, baseType: !773, size: 64, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6_mib", file: !720, line: 71, size: 384, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !774, file: !720, line: 72, baseType: !777, size: 384)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 384, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 6)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "icmpv6msg_statistics", scope: !714, file: !715, line: 22, baseType: !781, size: 64, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmpv6msg_mib", file: !720, line: 81, size: 32768, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mibs", scope: !782, file: !720, line: 82, baseType: !765, size: 32768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !468, file: !463, line: 123, baseType: !786, size: 256, offset: 3840)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_packet", file: !787, line: 11, size: 256, elements: !788)
!787 = !DIFile(filename: "./include/net/netns/packet.h", directory: "/home/lizy2001/genbc/linux")
!788 = !{!789, !796}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sklist_lock", scope: !786, file: !787, line: 12, baseType: !790, size: 192)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !791, line: 53, size: 192, elements: !792)
!791 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !790, file: !791, line: 54, baseType: !541, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !790, file: !791, line: 55, baseType: !473, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !790, file: !791, line: 59, baseType: !303, size: 128, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sklist", scope: !786, file: !787, line: 13, baseType: !663, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "unx", scope: !468, file: !463, line: 124, baseType: !798, size: 128, offset: 4096)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_unix", file: !799, line: 9, size: 128, elements: !800)
!799 = !DIFile(filename: "./include/net/netns/unix.h", directory: "/home/lizy2001/genbc/linux")
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_max_dgram_qlen", scope: !798, file: !799, line: 10, baseType: !121, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ctl", scope: !798, file: !799, line: 11, baseType: !646, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "nexthop", scope: !468, file: !463, line: 125, baseType: !804, size: 512, offset: 4224)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_nexthop", file: !805, line: 11, size: 512, elements: !806)
!805 = !DIFile(filename: "./include/net/netns/nexthop.h", directory: "/home/lizy2001/genbc/linux")
!806 = !{!807, !808, !809, !810, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !804, file: !805, line: 12, baseType: !673, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "devhash", scope: !804, file: !805, line: 13, baseType: !682, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !804, file: !805, line: 15, baseType: !7, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_allocated", scope: !804, file: !805, line: 16, baseType: !135, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "notifier_chain", scope: !804, file: !805, line: 17, baseType: !812, size: 320, offset: 192)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "blocking_notifier_head", file: !686, line: 65, size: 320, elements: !813)
!813 = !{!814, !822}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rwsem", scope: !812, file: !686, line: 66, baseType: !815, size: 256)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !816, line: 35, size: 256, elements: !817)
!816 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!817 = !{!818, !819, !820, !821}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !815, file: !816, line: 36, baseType: !541, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !815, file: !816, line: 42, baseType: !541, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !815, file: !816, line: 46, baseType: !630, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !815, file: !816, line: 47, baseType: !303, size: 128, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !812, file: !686, line: 67, baseType: !689, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4", scope: !468, file: !463, line: 126, baseType: !824, size: 5440, offset: 4736)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netns_ipv4", file: !825, line: 43, size: 5440, elements: !826)
!825 = !DIFile(filename: "./include/net/netns/ipv4.h", directory: "/home/lizy2001/genbc/linux")
!826 = !{!827, !828, !829, !830, !831, !832, !835, !836, !839, !840, !841, !842, !843, !844, !846, !847, !850, !851, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1108, !1109, !1110, !1111, !1112, !1120, !1121, !1122, !1126, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1146, !1147, !1149, !1150, !1153, !1154, !1155, !1156, !1157}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "forw_hdr", scope: !824, file: !825, line: 45, baseType: !646, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "frags_hdr", scope: !824, file: !825, line: 46, baseType: !646, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_hdr", scope: !824, file: !825, line: 47, baseType: !646, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "route_hdr", scope: !824, file: !825, line: 48, baseType: !646, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "xfrm4_hdr", scope: !824, file: !825, line: 49, baseType: !646, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "devconf_all", scope: !824, file: !825, line: 51, baseType: !833, size: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "ipv4_devconf", file: !825, line: 16, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "devconf_dflt", scope: !824, file: !825, line: 52, baseType: !833, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ra_chain", scope: !824, file: !825, line: 53, baseType: !837, size: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_ra_chain", file: !825, line: 53, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ra_mutex", scope: !824, file: !825, line: 54, baseType: !790, size: 192, offset: 512)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fib_has_custom_local_routes", scope: !824, file: !825, line: 62, baseType: !162, size: 8, offset: 704)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fib_table_hash", scope: !824, file: !825, line: 66, baseType: !682, size: 64, offset: 768)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fib_offload_disabled", scope: !824, file: !825, line: 67, baseType: !162, size: 8, offset: 832)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fibnl", scope: !824, file: !825, line: 68, baseType: !159, size: 64, offset: 896)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "icmp_sk", scope: !824, file: !825, line: 70, baseType: !845, size: 64, offset: 960)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mc_autojoin_sk", scope: !824, file: !825, line: 71, baseType: !159, size: 64, offset: 1024)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "peers", scope: !824, file: !825, line: 73, baseType: !848, size: 64, offset: 1088)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "inet_peer_base", file: !825, line: 73, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_sk", scope: !824, file: !825, line: 74, baseType: !845, size: 64, offset: 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fqdir", scope: !824, file: !825, line: 75, baseType: !852, size: 64, offset: 1216)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fqdir", file: !854, line: 9, size: 1728, elements: !855)
!854 = !DIFile(filename: "./include/net/inet_frag.h", directory: "/home/lizy2001/genbc/linux")
!855 = !{!856, !858, !859, !860, !861, !1006, !1007, !1008, !1009, !1010}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "high_thresh", scope: !853, file: !854, line: 11, baseType: !857, size: 64)
!857 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "low_thresh", scope: !853, file: !854, line: 12, baseType: !857, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !853, file: !854, line: 13, baseType: !121, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "max_dist", scope: !853, file: !854, line: 14, baseType: !121, size: 32, offset: 160)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !853, file: !854, line: 15, baseType: !862, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inet_frags", file: !854, line: 98, size: 960, elements: !864)
!864 = !{!865, !866, !942, !946, !947, !951, !952, !1004, !1005}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "qsize", scope: !863, file: !854, line: 99, baseType: !7, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !863, file: !854, line: 101, baseType: !867, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DISubroutineType(types: !869)
!869 = !{null, !870, !940}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inet_frag_queue", file: !854, line: 77, size: 1408, elements: !872)
!872 = !{!873, !879, !916, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !871, file: !854, line: 78, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rhash_head", file: !875, line: 17, size: 64, elements: !876)
!875 = !DIFile(filename: "./include/linux/rhashtable-types.h", directory: "/home/lizy2001/genbc/linux")
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !874, file: !875, line: 18, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !871, file: !854, line: 82, baseType: !880, size: 352, offset: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !871, file: !854, line: 79, size: 352, elements: !881)
!881 = !{!882, !892}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !880, file: !854, line: 80, baseType: !883, size: 160)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frag_v4_compare_key", file: !854, line: 41, size: 160, elements: !884)
!884 = !{!885, !887, !888, !889, !890, !891}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !883, file: !854, line: 42, baseType: !886, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !384, line: 32, baseType: !137)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !883, file: !854, line: 43, baseType: !886, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !883, file: !854, line: 44, baseType: !135, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "vif", scope: !883, file: !854, line: 45, baseType: !135, size: 32, offset: 96)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !883, file: !854, line: 46, baseType: !394, size: 16, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !883, file: !854, line: 47, baseType: !200, size: 16, offset: 144)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !880, file: !854, line: 81, baseType: !893, size: 352)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frag_v6_compare_key", file: !854, line: 50, size: 352, elements: !894)
!894 = !{!895, !912, !913, !914, !915}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !893, file: !854, line: 51, baseType: !896, size: 128)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !897, line: 33, size: 128, elements: !898)
!897 = !DIFile(filename: "./include/uapi/linux/in6.h", directory: "/home/lizy2001/genbc/linux")
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !896, file: !897, line: 40, baseType: !900, size: 128)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !896, file: !897, line: 34, size: 128, elements: !901)
!901 = !{!902, !904, !908}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !900, file: !897, line: 35, baseType: !903, size: 128)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 128, elements: !179)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !900, file: !897, line: 37, baseType: !905, size: 128)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 128, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 8)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !900, file: !897, line: 38, baseType: !909, size: 128)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 128, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 4)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !893, file: !854, line: 52, baseType: !896, size: 128, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !893, file: !854, line: 53, baseType: !135, size: 32, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !893, file: !854, line: 54, baseType: !886, size: 32, offset: 288)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "iif", scope: !893, file: !854, line: 55, baseType: !135, size: 32, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !871, file: !854, line: 83, baseType: !917, size: 320, offset: 448)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_list", file: !918, line: 11, size: 320, elements: !919)
!918 = !DIFile(filename: "./include/linux/timer.h", directory: "/home/lizy2001/genbc/linux")
!919 = !{!920, !921, !922, !927}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !917, file: !918, line: 16, baseType: !667, size: 128)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !917, file: !918, line: 17, baseType: !293, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !917, file: !918, line: 18, baseType: !923, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !917, file: !918, line: 19, baseType: !135, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !871, file: !854, line: 84, baseType: !473, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !871, file: !854, line: 85, baseType: !426, size: 32, offset: 768)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rb_fragments", scope: !871, file: !854, line: 86, baseType: !673, size: 64, offset: 832)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fragments_tail", scope: !871, file: !854, line: 87, baseType: !274, size: 64, offset: 896)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "last_run_head", scope: !871, file: !854, line: 88, baseType: !274, size: 64, offset: 960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stamp", scope: !871, file: !854, line: 89, baseType: !317, size: 64, offset: 1024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !871, file: !854, line: 90, baseType: !121, size: 32, offset: 1088)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "meat", scope: !871, file: !854, line: 91, baseType: !121, size: 32, offset: 1120)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !871, file: !854, line: 92, baseType: !186, size: 8, offset: 1152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !871, file: !854, line: 93, baseType: !200, size: 16, offset: 1168)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fqdir", scope: !871, file: !854, line: 94, baseType: !852, size: 64, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !871, file: !854, line: 95, baseType: !507, size: 128, align: 64, offset: 1280)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !863, file: !854, line: 103, baseType: !943, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{null, !870}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "frag_expire", scope: !863, file: !854, line: 104, baseType: !923, size: 64, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "frags_cachep", scope: !863, file: !854, line: 105, baseType: !948, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !950, line: 117, flags: DIFlagFwdDecl)
!950 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "frags_cache_name", scope: !863, file: !854, line: 106, baseType: !210, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rhash_params", scope: !863, file: !854, line: 107, baseType: !953, size: 320, offset: 384)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rhashtable_params", file: !875, line: 56, size: 320, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !967, !969}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "nelem_hint", scope: !953, file: !875, line: 57, baseType: !200, size: 16)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !953, file: !875, line: 58, baseType: !200, size: 16, offset: 16)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "key_offset", scope: !953, file: !875, line: 59, baseType: !200, size: 16, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "head_offset", scope: !953, file: !875, line: 60, baseType: !200, size: 16, offset: 48)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !953, file: !875, line: 61, baseType: !7, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "min_size", scope: !953, file: !875, line: 62, baseType: !200, size: 16, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "automatic_shrinking", scope: !953, file: !875, line: 63, baseType: !162, size: 8, offset: 112)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "hashfn", scope: !953, file: !875, line: 64, baseType: !963, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "rht_hashfn_t", file: !875, line: 38, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!135, !940, !135, !135}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "obj_hashfn", scope: !953, file: !875, line: 65, baseType: !968, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "rht_obj_hashfn_t", file: !875, line: 39, baseType: !964)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "obj_cmpfn", scope: !953, file: !875, line: 66, baseType: !970, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "rht_obj_cmpfn_t", file: !875, line: 40, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!121, !974, !940}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rhashtable_compare_arg", file: !875, line: 33, size: 128, elements: !976)
!976 = !{!977, !1003}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "ht", scope: !975, file: !875, line: 34, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rhashtable", file: !875, line: 81, size: 1024, elements: !980)
!980 = !{!981, !984, !985, !986, !987, !988, !1000, !1001, !1002}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "tbl", scope: !979, file: !875, line: 82, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "bucket_table", file: !875, line: 26, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "key_len", scope: !979, file: !875, line: 83, baseType: !7, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "max_elems", scope: !979, file: !875, line: 84, baseType: !7, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !979, file: !875, line: 85, baseType: !953, size: 320, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rhlist", scope: !979, file: !875, line: 86, baseType: !162, size: 8, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "run_work", scope: !979, file: !875, line: 87, baseType: !989, size: 256, offset: 512)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !990, line: 102, size: 256, elements: !991)
!990 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !989, file: !990, line: 103, baseType: !541, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !989, file: !990, line: 104, baseType: !303, size: 128, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !989, file: !990, line: 105, baseType: !995, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !990, line: 21, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{null, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !979, file: !875, line: 88, baseType: !790, size: 192, offset: 768)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !979, file: !875, line: 89, baseType: !473, offset: 960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "nelems", scope: !979, file: !875, line: 90, baseType: !431, size: 32, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !975, file: !875, line: 35, baseType: !940, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !863, file: !854, line: 108, baseType: !426, size: 32, offset: 704)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "completion", scope: !863, file: !854, line: 109, baseType: !621, size: 192, offset: 768)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "net", scope: !853, file: !854, line: 16, baseType: !467, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dead", scope: !853, file: !854, line: 17, baseType: !162, size: 8, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rhashtable", scope: !853, file: !854, line: 19, baseType: !979, size: 1024, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !853, file: !854, line: 22, baseType: !541, size: 64, offset: 1408)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_work", scope: !853, file: !854, line: 23, baseType: !989, size: 256, offset: 1472)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_echo_ignore_all", scope: !824, file: !825, line: 87, baseType: !121, size: 32, offset: 1280)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_echo_ignore_broadcasts", scope: !824, file: !825, line: 88, baseType: !121, size: 32, offset: 1312)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_ignore_bogus_error_responses", scope: !824, file: !825, line: 89, baseType: !121, size: 32, offset: 1344)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_ratelimit", scope: !824, file: !825, line: 90, baseType: !121, size: 32, offset: 1376)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_ratemask", scope: !824, file: !825, line: 91, baseType: !121, size: 32, offset: 1408)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sysctl_icmp_errors_use_inbound_ifaddr", scope: !824, file: !825, line: 92, baseType: !121, size: 32, offset: 1440)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ip_local_ports", scope: !824, file: !825, line: 94, baseType: !1018, size: 128, offset: 1472)
