; ModuleID = '../bcout/drivers/acpi/nvs.llvm.bc'
source_filename = "drivers/acpi/nvs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kmem_cache = type opaque
%struct.nvs_region = type { i64, i64, %struct.list_head }
%struct.nvs_page = type { i64, i32, i8*, i8*, i8, %struct.list_head }

@nvs_region_list = internal global %struct.list_head { %struct.list_head* @nvs_region_list, %struct.list_head* @nvs_region_list }, align 8, !dbg !0
@nvs_list = internal global %struct.list_head { %struct.list_head* @nvs_list, %struct.list_head* @nvs_list }, align 8, !dbg !51
@.str = private unnamed_addr constant [34 x i8] c"\016PM: Saving platform NVS memory\0A\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"\016PM: Restoring platform NVS memory\0A\00", align 1
@kmalloc_caches = external dso_local global [3 x [14 x %struct.kmem_cache*]], align 16
@.str.2 = private unnamed_addr constant [21 x i8] c"include/linux/slab.h\00", align 1
@.str.3 = private unnamed_addr constant [69 x i8] c"\016PM: Registering ACPI NVS region [mem %#010lx-%#010lx] (%ld bytes)\0A\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @acpi_nvs_register(i64 %start, i64 %size) #0 !dbg !58 {
entry:
  %s.addr.i.i = alloca %struct.kmem_cache*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "nvs_region_list", scope: !2, file: !3, line: 25, type: !31, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !50, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/nvs.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !12, line: 305, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !15, !16, !17}
!14 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!17 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!18 = !{!19, !21, !22, !36, !40, !48}
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !20, line: 148, baseType: !7)
!20 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nvs_region", file: !3, line: 19, size: 256, elements: !24)
!24 = !{!25, !29, !30}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "phys_start", scope: !23, file: !3, line: 20, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !27, line: 31, baseType: !28)
!27 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!28 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !23, file: !3, line: 21, baseType: !26, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !23, file: !3, line: 22, baseType: !31, size: 128, offset: 128)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !20, line: 178, size: 128, elements: !32)
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !20, line: 179, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !31, file: !20, line: 179, baseType: !34, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nvs_page", file: !3, line: 73, size: 448, elements: !38)
!38 = !{!39, !41, !42, !43, !44, !47}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "phys_start", scope: !37, file: !3, line: 74, baseType: !40, size: 64)
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !3, line: 75, baseType: !7, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "kaddr", scope: !37, file: !3, line: 76, baseType: !21, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !37, file: !3, line: 77, baseType: !21, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "unmap", scope: !37, file: !3, line: 78, baseType: !45, size: 8, offset: 256)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !20, line: 30, baseType: !46)
!46 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !37, file: !3, line: 79, baseType: !31, size: 128, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !34)
!50 = !{!0, !51}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "nvs_list", scope: !2, file: !3, line: 82, type: !31, isLocal: true, isDefinition: true)
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 2}
!56 = !{i32 1, !"Code Model", i32 2}
!57 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!58 = distinct !DISubprogram(name: "acpi_nvs_register", scope: !3, file: !3, line: 36, type: !59, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !26, !26}
!61 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!62 = !{}
!63 = !DILocalVariable(name: "s", arg: 1, scope: !64, file: !12, line: 445, type: !67)
!64 = distinct !DISubprogram(name: "kmem_cache_alloc_trace", scope: !12, file: !12, line: 445, type: !65, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!65 = !DISubroutineType(types: !66)
!66 = !{!21, !67, !19, !70}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !69, line: 117, flags: DIFlagFwdDecl)
!69 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !20, line: 55, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !72, line: 72, baseType: !73)
!72 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !72, line: 16, baseType: !40)
!74 = !DILocation(line: 445, column: 72, scope: !64, inlinedAt: !75)
!75 = distinct !DILocation(line: 552, column: 10, scope: !76, inlinedAt: !81)
!76 = distinct !DILexicalBlock(scope: !77, file: !12, line: 540, column: 34)
!77 = distinct !DILexicalBlock(scope: !78, file: !12, line: 540, column: 6)
!78 = distinct !DISubprogram(name: "kmalloc", scope: !12, file: !12, line: 538, type: !79, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!79 = !DISubroutineType(types: !80)
!80 = !{!21, !70, !19}
!81 = distinct !DILocation(line: 40, column: 11, scope: !58)
!82 = !DILocalVariable(name: "flags", arg: 2, scope: !64, file: !12, line: 446, type: !19)
!83 = !DILocation(line: 446, column: 9, scope: !64, inlinedAt: !75)
!84 = !DILocalVariable(name: "size", arg: 3, scope: !64, file: !12, line: 446, type: !70)
!85 = !DILocation(line: 446, column: 23, scope: !64, inlinedAt: !75)
!86 = !DILocalVariable(name: "ret", scope: !64, file: !12, line: 448, type: !21)
!87 = !DILocation(line: 448, column: 8, scope: !64, inlinedAt: !75)
!88 = !DILocalVariable(name: "flags", arg: 1, scope: !89, file: !12, line: 318, type: !19)
!89 = distinct !DISubprogram(name: "kmalloc_type", scope: !12, file: !12, line: 318, type: !90, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!90 = !DISubroutineType(types: !91)
!91 = !{!11, !19}
!92 = !DILocation(line: 318, column: 67, scope: !89, inlinedAt: !93)
!93 = distinct !DILocation(line: 553, column: 20, scope: !76, inlinedAt: !81)
!94 = !DILocalVariable(name: "size", arg: 1, scope: !95, file: !12, line: 346, type: !70)
