; ModuleID = '../bcout/drivers/acpi/osi.llvm.bc'
source_filename = "drivers/acpi/osi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_osi_config = type { i8, i8, [2 x i8] }
%struct.obs_kernel_param = type { i8*, i32 (i8*)*, i32 }
%struct.acpi_osi_entry = type { [64 x i8], i8 }
%struct.dmi_system_id = type { {}*, i8*, [4 x %struct.dmi_strmatch], i8* }
%struct.dmi_strmatch = type { i8, [79 x i8] }

@acpi_gbl_create_osi_method = external dso_local global i8, align 1
@.str = private unnamed_addr constant [30 x i8] c"\016ACPI: _OSI method disabled\0A\00", align 1
@osi_config = internal global %struct.acpi_osi_config zeroinitializer, align 4, !dbg !0
@__setup_str_osi_setup = internal constant [10 x i8] c"acpi_osi=\00", section ".init.rodata", align 1, !dbg !45
@__setup_osi_setup = internal global %struct.obs_kernel_param { i8* getelementptr inbounds ([10 x i8], [10 x i8]* @__setup_str_osi_setup, i32 0, i32 0), i32 (i8*)* @osi_setup, i32 0 }, section ".init.setup", align 8, !dbg !14
@acpi_gbl_osi_data = external dso_local global i8, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "osi_config", scope: !2, file: !3, line: 40, type: !93, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !13, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/osi.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 10, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !{!14, !0, !30, !45, !50, !79, !91}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "__setup_osi_setup", scope: !2, file: !3, line: 264, type: !16, isLocal: true, isDefinition: true, align: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obs_kernel_param", file: !17, line: 241, size: 192, elements: !18)
!17 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!18 = !{!19, !23, !29}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !16, file: !17, line: 242, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "setup_func", scope: !16, file: !17, line: 243, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28}
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "early", scope: !16, file: !17, line: 244, baseType: !27, size: 32, offset: 128)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "osi_setup_entries", scope: !2, file: !3, line: 42, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8320, elements: !43)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_osi_entry", file: !3, line: 25, size: 520, elements: !34)
!34 = !{!35, !39}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !33, file: !3, line: 26, baseType: !36, size: 512)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !33, file: !3, line: 27, baseType: !40, size: 8, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !41, line: 30, baseType: !42)
!41 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!42 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!43 = !{!44}
!44 = !DISubrange(count: 16)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "__setup_str_osi_setup", scope: !2, file: !3, line: 264, type: !47, isLocal: true, isDefinition: true, align: 8)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 80, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 10)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "acpi_osi_dmi_table", scope: !2, file: !3, line: 326, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 49536, elements: !77)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dmi_system_id", file: !55, line: 566, size: 2752, elements: !56)
!55 = !DIFile(filename: "./include/linux/mod_devicetable.h", directory: "/home/lizy2001/genbc/linux")
!56 = !{!57, !62, !63, !76}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !54, file: !55, line: 567, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!27, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "ident", scope: !54, file: !55, line: 568, baseType: !20, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !54, file: !55, line: 569, baseType: !64, size: 2560, offset: 128)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2560, elements: !74)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dmi_strmatch", file: !55, line: 560, size: 640, elements: !66)
!66 = !{!67, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !65, file: !55, line: 561, baseType: !68, size: 7, flags: DIFlagBitField, extraData: i64 0)
!68 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "exact_match", scope: !65, file: !55, line: 562, baseType: !68, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "substr", scope: !65, file: !55, line: 563, baseType: !71, size: 632, offset: 8)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 632, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 79)
!74 = !{!75}
!75 = !DISubrange(count: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "driver_data", scope: !54, file: !55, line: 570, baseType: !12, size: 64, offset: 2688)
!77 = !{!78}
!78 = !DISubrange(count: 18)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "__print_once", scope: !81, file: !3, line: 76, type: !40, isLocal: true, isDefinition: true)
!81 = distinct !DISubprogram(name: "acpi_osi_handler", scope: !3, file: !3, line: 73, type: !82, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !90)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !88, !84}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !85, line: 21, baseType: !86)
!85 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !87, line: 27, baseType: !7)
!87 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_string", file: !89, line: 423, baseType: !28)
!89 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!90 = !{}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "__print_once", scope: !81, file: !3, line: 83, type: !40, isLocal: true, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_osi_config", file: !3, line: 30, size: 32, elements: !94)
!94 = !{!95, !98, !99, !100, !101, !102, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "default_disabling", scope: !93, file: !3, line: 31, baseType: !96, size: 8)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !85, line: 17, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !87, line: 21, baseType: !68)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "linux_enable", scope: !93, file: !3, line: 32, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "linux_dmi", scope: !93, file: !3, line: 33, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 8)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "linux_cmdline", scope: !93, file: !3, line: 34, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "darwin_enable", scope: !93, file: !3, line: 35, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "darwin_dmi", scope: !93, file: !3, line: 36, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 8)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "darwin_cmdline", scope: !93, file: !3, line: 37, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 8)
!104 = !{i32 7, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{i32 1, !"wchar_size", i32 2}
!107 = !{i32 1, !"Code Model", i32 2}
!108 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!109 = distinct !DISubprogram(name: "acpi_osi_setup", scope: !3, file: !3, line: 93, type: !110, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !90)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !28}
!112 = !DILocalVariable(name: "str", arg: 1, scope: !109, file: !3, line: 93, type: !28)
!113 = !DILocation(line: 93, column: 34, scope: !109)
!114 = !DILocalVariable(name: "osi", scope: !109, file: !3, line: 95, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!116 = !DILocation(line: 95, column: 25, scope: !109)
!117 = !DILocalVariable(name: "enable", scope: !109, file: !3, line: 96, type: !40)
!118 = !DILocation(line: 96, column: 7, scope: !109)
!119 = !DILocalVariable(name: "i", scope: !109, file: !3, line: 97, type: !27)
!120 = !DILocation(line: 97, column: 6, scope: !109)
!121 = !DILocation(line: 99, column: 7, scope: !122)
!122 = distinct !DILexicalBlock(scope: !109, file: !3, line: 99, column: 6)
!123 = !DILocation(line: 99, column: 6, scope: !109)
!124 = !DILocation(line: 100, column: 3, scope: !122)
!125 = !DILocation(line: 102, column: 6, scope: !126)
!126 = distinct !DILexicalBlock(scope: !109, file: !3, line: 102, column: 6)
!127 = !DILocation(line: 102, column: 10, scope: !126)
!128 = !DILocation(line: 102, column: 18, scope: !126)
!129 = !DILocation(line: 102, column: 22, scope: !126)
!130 = !DILocation(line: 102, column: 21, scope: !126)
!131 = !DILocation(line: 102, column: 26, scope: !126)
!132 = !DILocation(line: 102, column: 6, scope: !109)
!133 = !DILocation(line: 103, column: 3, scope: !134)
!134 = distinct !DILexicalBlock(scope: !126, file: !3, line: 102, column: 35)
!135 = !DILocation(line: 104, column: 30, scope: !134)
!136 = !DILocation(line: 105, column: 3, scope: !134)
!137 = !DILocation(line: 108, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !109, file: !3, line: 108, column: 6)
!139 = !DILocation(line: 108, column: 6, scope: !138)
!140 = !DILocation(line: 108, column: 11, scope: !138)
!141 = !DILocation(line: 108, column: 6, scope: !109)
!142 = !DILocation(line: 109, column: 6, scope: !143)
!143 = distinct !DILexicalBlock(scope: !138, file: !3, line: 108, column: 19)
!144 = !DILocation(line: 110, column: 8, scope: !145)
!145 = distinct !DILexicalBlock(scope: !143, file: !3, line: 110, column: 7)
!146 = !DILocation(line: 110, column: 7, scope: !145)
!147 = !DILocation(line: 110, column: 12, scope: !145)
!148 = !DILocation(line: 110, column: 7, scope: !143)
!149 = !DILocation(line: 112, column: 20, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 112, column: 8)
!151 = distinct !DILexicalBlock(scope: !145, file: !3, line: 110, column: 21)
!152 = !DILocation(line: 112, column: 9, scope: !150)
!153 = !DILocation(line: 112, column: 8, scope: !151)
!154 = !DILocation(line: 113, column: 34, scope: !150)
!155 = !DILocation(line: 113, column: 5, scope: !150)
!156 = !DILocation(line: 115, column: 4, scope: !151)
!157 = !DILocation(line: 116, column: 15, scope: !158)
!158 = distinct !DILexicalBlock(scope: !145, file: !3, line: 116, column: 14)
!159 = !DILocation(line: 116, column: 14, scope: !158)
!160 = !DILocation(line: 116, column: 19, scope: !158)
!161 = !DILocation(line: 116, column: 14, scope: !145)
!162 = !DILocation(line: 117, column: 33, scope: !163)
!163 = distinct !DILexicalBlock(scope: !158, file: !3, line: 116, column: 27)
!164 = !DILocation(line: 118, column: 11, scope: !165)
