; ModuleID = '../bcout/drivers/acpi/processor_core.llvm.bc'
source_filename = "drivers/acpi/processor_core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_buffer = type { i64, i8* }
%struct.acpi_table_madt = type { %struct.acpi_table_header, i32, i32 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_subtable_header = type { i8, i8 }
%union.acpi_object = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i32, i64, i32 }
%struct.acpi_object_list = type { i32, %union.acpi_object* }
%struct.anon.1 = type { i32, i32, i8* }
%struct.acpi_madt_local_apic = type { %struct.acpi_subtable_header, i8, i8, i32 }
%struct.acpi_madt_local_x2apic = type { %struct.acpi_subtable_header, i16, i32, i32, i32 }
%struct.acpi_madt_local_sapic = type <{ %struct.acpi_subtable_header, i8, i8, i8, [3 x i8], i32, i32, [1 x i8] }>
%struct.acpi_madt_generic_interrupt = type <{ %struct.acpi_subtable_header, i16, i32, i32, i32, i32, i32, i64, i64, i64, i64, i32, i64, i64, i8, [1 x i8], i16 }>
%struct.acpi_madt_io_apic = type { %struct.acpi_subtable_header, i8, i8, i32, i32 }

@.str = private unnamed_addr constant [5 x i8] c"APIC\00", align 1
@__const.map_mat_entry.buffer = private unnamed_addr constant %struct.acpi_buffer { i64 -1, i8* null }, align 8
@.str.1 = private unnamed_addr constant [5 x i8] c"_MAT\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "madt", scope: !2, file: !3, line: 19, type: !6, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "get_madt_table", scope: !3, file: !3, line: 17, type: !4, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !43, retainedNodes: !148)
!3 = !DIFile(filename: "drivers/acpi/processor_core.c", directory: "/home/lizy2001/genbc/linux")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_madt", file: !8, line: 486, size: 352, elements: !9)
!8 = !DIFile(filename: "./include/acpi/actbl2.h", directory: "/home/lizy2001/genbc/linux")
!9 = !{!10, !41, !42}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !7, file: !8, line: 487, baseType: !11, size: 288)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !12, line: 68, size: 288, elements: !13)
!12 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!13 = !{!14, !19, !25, !29, !30, !34, !38, !39, !40}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !11, file: !12, line: 69, baseType: !15, size: 32)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 32, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18}
!18 = !DISubrange(count: 4)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !11, file: !12, line: 70, baseType: !20, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !21, line: 21, baseType: !22)
!21 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !23, line: 27, baseType: !24)
!23 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !11, file: !12, line: 71, baseType: !26, size: 8, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !21, line: 17, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !23, line: 21, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !11, file: !12, line: 72, baseType: !26, size: 8, offset: 72)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !11, file: !12, line: 73, baseType: !31, size: 48, offset: 80)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 48, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 6)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !11, file: !12, line: 74, baseType: !35, size: 64, offset: 128)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !11, file: !12, line: 75, baseType: !20, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !11, file: !12, line: 76, baseType: !15, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !11, file: !12, line: 77, baseType: !20, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !7, file: !8, line: 488, baseType: !20, size: 32, offset: 288)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !7, file: !8, line: 489, baseType: !20, size: 32, offset: 320)
!43 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !44, retainedTypes: !64, globals: !144, splitDebugInlining: false, nameTableKind: None)
!44 = !{!45}
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acpi_madt_type", file: !8, line: 503, baseType: !24, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!47 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_APIC", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "ACPI_MADT_TYPE_IO_APIC", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "ACPI_MADT_TYPE_INTERRUPT_OVERRIDE", value: 2, isUnsigned: true)
!50 = !DIEnumerator(name: "ACPI_MADT_TYPE_NMI_SOURCE", value: 3, isUnsigned: true)
!51 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_APIC_NMI", value: 4, isUnsigned: true)
!52 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_APIC_OVERRIDE", value: 5, isUnsigned: true)
!53 = !DIEnumerator(name: "ACPI_MADT_TYPE_IO_SAPIC", value: 6, isUnsigned: true)
!54 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_SAPIC", value: 7, isUnsigned: true)
!55 = !DIEnumerator(name: "ACPI_MADT_TYPE_INTERRUPT_SOURCE", value: 8, isUnsigned: true)
!56 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_X2APIC", value: 9, isUnsigned: true)
!57 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_X2APIC_NMI", value: 10, isUnsigned: true)
!58 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_INTERRUPT", value: 11, isUnsigned: true)
!59 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_DISTRIBUTOR", value: 12, isUnsigned: true)
!60 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_MSI_FRAME", value: 13, isUnsigned: true)
!61 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_REDISTRIBUTOR", value: 14, isUnsigned: true)
!62 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_TRANSLATOR", value: 15, isUnsigned: true)
!63 = !DIEnumerator(name: "ACPI_MADT_TYPE_RESERVED", value: 16, isUnsigned: true)
!64 = !{!65, !67, !66, !69, !70, !76, !77, !84, !95, !112, !136}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_cpuid_t", file: !68, line: 266, baseType: !20)
!68 = !DIFile(filename: "./include/linux/acpi.h", directory: "/home/lizy2001/genbc/linux")
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_subtable_header", file: !72, line: 90, size: 16, elements: !73)
!72 = !DIFile(filename: "./include/acpi/actbl1.h", directory: "/home/lizy2001/genbc/linux")
!73 = !{!74, !75}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !72, line: 91, baseType: !26, size: 8)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !71, file: !72, line: 92, baseType: !26, size: 8, offset: 8)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_apic", file: !8, line: 529, size: 64, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !78, file: !8, line: 530, baseType: !71, size: 16)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", scope: !78, file: !8, line: 531, baseType: !26, size: 8, offset: 16)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !78, file: !8, line: 532, baseType: !26, size: 8, offset: 24)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_flags", scope: !78, file: !8, line: 533, baseType: !20, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_x2apic", file: !8, line: 623, size: 128, elements: !86)
!86 = !{!87, !88, !92, !93, !94}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !85, file: !8, line: 624, baseType: !71, size: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !85, file: !8, line: 625, baseType: !89, size: 16, offset: 16)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !21, line: 19, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !23, line: 24, baseType: !91)
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "local_apic_id", scope: !85, file: !8, line: 626, baseType: !20, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_flags", scope: !85, file: !8, line: 627, baseType: !20, size: 32, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !85, file: !8, line: 628, baseType: !20, size: 32, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_sapic", file: !8, line: 593, size: 136, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !106, !107, !108}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !96, file: !8, line: 594, baseType: !71, size: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", scope: !96, file: !8, line: 595, baseType: !26, size: 8, offset: 16)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !96, file: !8, line: 596, baseType: !26, size: 8, offset: 24)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !96, file: !8, line: 597, baseType: !26, size: 8, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !96, file: !8, line: 598, baseType: !103, size: 24, offset: 40)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 3)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_flags", scope: !96, file: !8, line: 599, baseType: !20, size: 32, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !96, file: !8, line: 600, baseType: !20, size: 32, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "uid_string", scope: !96, file: !8, line: 601, baseType: !109, size: 8, offset: 128)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_generic_interrupt", file: !8, line: 643, size: 640, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !126, !127, !128, !129, !130, !131, !132, !133, !135}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !113, file: !8, line: 644, baseType: !71, size: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !113, file: !8, line: 645, baseType: !89, size: 16, offset: 16)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_interface_number", scope: !113, file: !8, line: 646, baseType: !20, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !113, file: !8, line: 647, baseType: !20, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !8, line: 648, baseType: !20, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "parking_version", scope: !113, file: !8, line: 649, baseType: !20, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "performance_interrupt", scope: !113, file: !8, line: 650, baseType: !20, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "parked_address", scope: !113, file: !8, line: 651, baseType: !123, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !21, line: 23, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !23, line: 31, baseType: !125)
!125 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "base_address", scope: !113, file: !8, line: 652, baseType: !123, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "gicv_base_address", scope: !113, file: !8, line: 653, baseType: !123, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "gich_base_address", scope: !113, file: !8, line: 654, baseType: !123, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vgic_interrupt", scope: !113, file: !8, line: 655, baseType: !20, size: 32, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "gicr_base_address", scope: !113, file: !8, line: 656, baseType: !123, size: 64, offset: 480)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mpidr", scope: !113, file: !8, line: 657, baseType: !123, size: 64, offset: 544)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "efficiency_class", scope: !113, file: !8, line: 658, baseType: !26, size: 8, offset: 608)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !113, file: !8, line: 659, baseType: !134, size: 8, offset: 616)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8, elements: !110)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "spe_interrupt", scope: !113, file: !8, line: 660, baseType: !89, size: 16, offset: 624)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_io_apic", file: !8, line: 538, size: 96, elements: !138)
!138 = !{!139, !140, !141, !142, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !137, file: !8, line: 539, baseType: !71, size: 16)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !8, line: 540, baseType: !26, size: 8, offset: 16)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !137, file: !8, line: 541, baseType: !26, size: 8, offset: 24)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !137, file: !8, line: 542, baseType: !20, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq_base", scope: !137, file: !8, line: 543, baseType: !20, size: 32, offset: 64)
!144 = !{!0, !145}
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "read_madt", scope: !2, file: !3, line: 20, type: !147, isLocal: true, isDefinition: true)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !{}
!149 = !{i32 7, !"Dwarf Version", i32 4}
!150 = !{i32 2, !"Debug Info Version", i32 3}
!151 = !{i32 1, !"wchar_size", i32 2}
!152 = !{i32 1, !"Code Model", i32 2}
!153 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!154 = distinct !DISubprogram(name: "acpi_map_madt_entry", scope: !3, file: !3, line: 145, type: !155, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !43, retainedNodes: !148)
!155 = !DISubroutineType(types: !156)
!156 = !{!67, !20}
!157 = !DILocalVariable(name: "acpi_id", arg: 1, scope: !154, file: !3, line: 145, type: !20)
!158 = !DILocation(line: 145, column: 45, scope: !154)
!159 = !DILocalVariable(name: "madt", scope: !154, file: !3, line: 147, type: !6)
!160 = !DILocation(line: 147, column: 26, scope: !154)
!161 = !DILocalVariable(name: "rv", scope: !154, file: !3, line: 148, type: !67)
!162 = !DILocation(line: 148, column: 15, scope: !154)
!163 = !DILocation(line: 151, column: 10, scope: !154)
!164 = !DILocation(line: 150, column: 2, scope: !154)
!165 = !DILocation(line: 152, column: 7, scope: !166)
!166 = distinct !DILexicalBlock(scope: !154, file: !3, line: 152, column: 6)
!167 = !DILocation(line: 152, column: 6, scope: !154)
!168 = !DILocation(line: 153, column: 3, scope: !166)
!169 = !DILocation(line: 155, column: 22, scope: !154)
!170 = !DILocation(line: 155, column: 31, scope: !154)
!171 = !DILocation(line: 155, column: 7, scope: !154)
!172 = !DILocation(line: 155, column: 5, scope: !154)
!173 = !DILocation(line: 157, column: 45, scope: !154)
!174 = !DILocation(line: 157, column: 17, scope: !154)
!175 = !DILocation(line: 157, column: 2, scope: !154)
!176 = !DILocation(line: 159, column: 9, scope: !154)
!177 = !DILocation(line: 159, column: 2, scope: !154)
!178 = !DILocation(line: 160, column: 1, scope: !154)
!179 = distinct !DISubprogram(name: "map_madt_entry", scope: !3, file: !3, line: 109, type: !180, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !43, retainedNodes: !148)
!180 = !DISubroutineType(types: !181)
!181 = !{!67, !6, !147, !20}
!182 = !DILocalVariable(name: "madt", arg: 1, scope: !179, file: !3, line: 109, type: !6)
!183 = !DILocation(line: 109, column: 60, scope: !179)
!184 = !DILocalVariable(name: "type", arg: 2, scope: !179, file: !3, line: 110, type: !147)
!185 = !DILocation(line: 110, column: 12, scope: !179)
!186 = !DILocalVariable(name: "acpi_id", arg: 3, scope: !179, file: !3, line: 110, type: !20)
!187 = !DILocation(line: 110, column: 22, scope: !179)
!188 = !DILocalVariable(name: "madt_end", scope: !179, file: !3, line: 112, type: !69)
!189 = !DILocation(line: 112, column: 16, scope: !179)
!190 = !DILocalVariable(name: "entry", scope: !179, file: !3, line: 112, type: !69)
!191 = !DILocation(line: 112, column: 26, scope: !179)
!192 = !DILocalVariable(name: "phys_id", scope: !179, file: !3, line: 113, type: !67)
!193 = !DILocation(line: 113, column: 15, scope: !179)
!194 = !DILocation(line: 115, column: 7, scope: !195)
!195 = distinct !DILexicalBlock(scope: !179, file: !3, line: 115, column: 6)
!196 = !DILocation(line: 115, column: 6, scope: !179)
!197 = !DILocation(line: 116, column: 10, scope: !195)
!198 = !DILocation(line: 116, column: 3, scope: !195)
!199 = !DILocation(line: 118, column: 25, scope: !179)
!200 = !DILocation(line: 118, column: 10, scope: !179)
!201 = !DILocation(line: 118, column: 8, scope: !179)
!202 = !DILocation(line: 119, column: 13, scope: !179)
!203 = !DILocation(line: 119, column: 21, scope: !179)
!204 = !DILocation(line: 119, column: 27, scope: !179)
!205 = !DILocation(line: 119, column: 34, scope: !179)
!206 = !DILocation(line: 119, column: 19, scope: !179)
!207 = !DILocation(line: 119, column: 11, scope: !179)
!208 = !DILocation(line: 123, column: 8, scope: !179)
!209 = !DILocation(line: 124, column: 2, scope: !179)
!210 = !DILocation(line: 124, column: 9, scope: !179)
!211 = !DILocation(line: 124, column: 15, scope: !179)
!212 = !DILocation(line: 124, column: 55, scope: !179)
!213 = !DILocation(line: 124, column: 53, scope: !179)
!214 = !DILocalVariable(name: "header", scope: !215, file: !3, line: 125, type: !70)
!215 = distinct !DILexicalBlock(scope: !179, file: !3, line: 124, column: 65)
!216 = !DILocation(line: 125, column: 32, scope: !215)
!217 = !DILocation(line: 126, column: 35, scope: !215)
!218 = !DILocation(line: 126, column: 4, scope: !215)
!219 = !DILocation(line: 127, column: 7, scope: !220)
!220 = distinct !DILexicalBlock(scope: !215, file: !3, line: 127, column: 7)
!221 = !DILocation(line: 127, column: 15, scope: !220)
!222 = !DILocation(line: 127, column: 20, scope: !220)
!223 = !DILocation(line: 127, column: 7, scope: !215)
!224 = !DILocation(line: 128, column: 22, scope: !225)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 128, column: 8)
!226 = distinct !DILexicalBlock(scope: !220, file: !3, line: 127, column: 50)
!227 = !DILocation(line: 128, column: 30, scope: !225)
!228 = !DILocation(line: 128, column: 9, scope: !225)
!229 = !DILocation(line: 128, column: 8, scope: !226)
!230 = !DILocation(line: 129, column: 5, scope: !225)
!231 = !DILocation(line: 130, column: 3, scope: !226)
!232 = !DILocation(line: 130, column: 14, scope: !233)
!233 = distinct !DILexicalBlock(scope: !220, file: !3, line: 130, column: 14)
!234 = !DILocation(line: 130, column: 22, scope: !233)
!235 = !DILocation(line: 130, column: 27, scope: !233)
!236 = !DILocation(line: 130, column: 14, scope: !220)
!237 = !DILocation(line: 131, column: 23, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !3, line: 131, column: 8)
!239 = distinct !DILexicalBlock(scope: !233, file: !3, line: 130, column: 59)
!240 = !DILocation(line: 131, column: 31, scope: !238)
!241 = !DILocation(line: 131, column: 37, scope: !238)
!242 = !DILocation(line: 131, column: 9, scope: !238)
!243 = !DILocation(line: 131, column: 8, scope: !239)
!244 = !DILocation(line: 132, column: 5, scope: !238)
!245 = !DILocation(line: 133, column: 3, scope: !239)
!246 = !DILocation(line: 133, column: 14, scope: !247)
!247 = distinct !DILexicalBlock(scope: !233, file: !3, line: 133, column: 14)
!248 = !DILocation(line: 133, column: 22, scope: !247)
!249 = !DILocation(line: 133, column: 27, scope: !247)
!250 = !DILocation(line: 133, column: 14, scope: !233)
!251 = !DILocation(line: 134, column: 23, scope: !252)
!252 = distinct !DILexicalBlock(scope: !253, file: !3, line: 134, column: 8)
!253 = distinct !DILexicalBlock(scope: !247, file: !3, line: 133, column: 58)
!254 = !DILocation(line: 134, column: 31, scope: !252)
!255 = !DILocation(line: 134, column: 37, scope: !252)
!256 = !DILocation(line: 134, column: 9, scope: !252)
!257 = !DILocation(line: 134, column: 8, scope: !253)
!258 = !DILocation(line: 135, column: 5, scope: !252)
!259 = !DILocation(line: 136, column: 3, scope: !253)
!260 = !DILocation(line: 136, column: 14, scope: !261)
!261 = distinct !DILexicalBlock(scope: !247, file: !3, line: 136, column: 14)
!262 = !DILocation(line: 136, column: 22, scope: !261)
!263 = !DILocation(line: 136, column: 27, scope: !261)
!264 = !DILocation(line: 136, column: 14, scope: !247)
!265 = !DILocation(line: 137, column: 24, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !3, line: 137, column: 8)
!267 = distinct !DILexicalBlock(scope: !261, file: !3, line: 136, column: 64)
!268 = !DILocation(line: 137, column: 32, scope: !266)
!269 = !DILocation(line: 137, column: 38, scope: !266)
!270 = !DILocation(line: 137, column: 9, scope: !266)
!271 = !DILocation(line: 137, column: 8, scope: !267)
!272 = !DILocation(line: 138, column: 5, scope: !266)
!273 = !DILocation(line: 139, column: 3, scope: !267)
!274 = !DILocation(line: 140, column: 12, scope: !215)
!275 = !DILocation(line: 140, column: 20, scope: !215)
!276 = !DILocation(line: 140, column: 9, scope: !215)
!277 = distinct !{!277, !209, !278}
!278 = !DILocation(line: 141, column: 2, scope: !179)
!279 = !DILocation(line: 142, column: 9, scope: !179)
!280 = !DILocation(line: 142, column: 2, scope: !179)
!281 = !DILocation(line: 143, column: 1, scope: !179)
!282 = distinct !DISubprogram(name: "acpi_get_phys_id", scope: !3, file: !3, line: 196, type: !283, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !43, retainedNodes: !148)
!283 = !DISubroutineType(types: !284)
!284 = !{!67, !285, !147, !20}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !286, line: 424, baseType: !76)
!286 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!287 = !DILocalVariable(name: "handle", arg: 1, scope: !282, file: !3, line: 196, type: !285)
!288 = !DILocation(line: 196, column: 43, scope: !282)
!289 = !DILocalVariable(name: "type", arg: 2, scope: !282, file: !3, line: 196, type: !147)
!290 = !DILocation(line: 196, column: 55, scope: !282)
!291 = !DILocalVariable(name: "acpi_id", arg: 3, scope: !282, file: !3, line: 196, type: !20)
!292 = !DILocation(line: 196, column: 65, scope: !282)
!293 = !DILocalVariable(name: "phys_id", scope: !282, file: !3, line: 198, type: !67)
!294 = !DILocation(line: 198, column: 15, scope: !282)
!295 = !DILocation(line: 200, column: 26, scope: !282)
!296 = !DILocation(line: 200, column: 34, scope: !282)
!297 = !DILocation(line: 200, column: 40, scope: !282)
!298 = !DILocation(line: 200, column: 12, scope: !282)
!299 = !DILocation(line: 200, column: 10, scope: !282)
!300 = !DILocation(line: 201, column: 25, scope: !301)
!301 = distinct !DILexicalBlock(scope: !282, file: !3, line: 201, column: 6)
!302 = !DILocation(line: 201, column: 6, scope: !301)
!303 = !DILocation(line: 201, column: 6, scope: !282)
!304 = !DILocation(line: 202, column: 28, scope: !301)
!305 = !DILocation(line: 202, column: 46, scope: !301)
!306 = !DILocation(line: 202, column: 52, scope: !301)
!307 = !DILocation(line: 202, column: 13, scope: !301)
!308 = !DILocation(line: 202, column: 11, scope: !301)
!309 = !DILocation(line: 202, column: 3, scope: !301)
!310 = !DILocation(line: 204, column: 9, scope: !282)
!311 = !DILocation(line: 204, column: 2, scope: !282)
!312 = distinct !DISubprogram(name: "map_mat_entry", scope: !3, file: !3, line: 162, type: !283, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !43, retainedNodes: !148)
!313 = !DILocalVariable(name: "handle", arg: 1, scope: !312, file: !3, line: 162, type: !285)
!314 = !DILocation(line: 162, column: 47, scope: !312)
!315 = !DILocalVariable(name: "type", arg: 2, scope: !312, file: !3, line: 162, type: !147)
!316 = !DILocation(line: 162, column: 59, scope: !312)
!317 = !DILocalVariable(name: "acpi_id", arg: 3, scope: !312, file: !3, line: 162, type: !20)
!318 = !DILocation(line: 162, column: 69, scope: !312)
!319 = !DILocalVariable(name: "buffer", scope: !312, file: !3, line: 164, type: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_buffer", file: !286, line: 969, size: 128, elements: !321)
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !320, file: !286, line: 970, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !286, line: 127, baseType: !123)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !320, file: !286, line: 971, baseType: !76, size: 64, offset: 64)
!325 = !DILocation(line: 164, column: 21, scope: !312)
!326 = !DILocalVariable(name: "obj", scope: !312, file: !3, line: 165, type: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !286, line: 899, size: 192, elements: !329)
!329 = !{!330, !332, !337, !344, !351, !357, !363, !371}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !328, file: !286, line: 900, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !286, line: 635, baseType: !20)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !328, file: !286, line: 904, baseType: !333, size: 128)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 901, size: 128, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !286, line: 902, baseType: !331, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !333, file: !286, line: 903, baseType: !123, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !328, file: !286, line: 910, baseType: !338, size: 128)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 906, size: 128, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !338, file: !286, line: 907, baseType: !331, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !338, file: !286, line: 908, baseType: !20, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !338, file: !286, line: 909, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !328, file: !286, line: 916, baseType: !345, size: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 912, size: 128, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !286, line: 913, baseType: !331, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !345, file: !286, line: 914, baseType: !20, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !345, file: !286, line: 915, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !328, file: !286, line: 922, baseType: !352, size: 128)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 918, size: 128, elements: !353)
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !352, file: !286, line: 919, baseType: !331, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !352, file: !286, line: 920, baseType: !20, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !352, file: !286, line: 921, baseType: !327, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !328, file: !286, line: 928, baseType: !358, size: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 924, size: 128, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !286, line: 925, baseType: !331, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !358, file: !286, line: 926, baseType: !331, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !358, file: !286, line: 927, baseType: !285, size: 64, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !328, file: !286, line: 935, baseType: !364, size: 192)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 930, size: 192, elements: !365)
!365 = !{!366, !367, !368, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !286, line: 931, baseType: !331, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !364, file: !286, line: 932, baseType: !20, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !364, file: !286, line: 933, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !286, line: 128, baseType: !123)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !364, file: !286, line: 934, baseType: !20, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !328, file: !286, line: 941, baseType: !372, size: 96)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !286, line: 937, size: 96, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !372, file: !286, line: 938, baseType: !331, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !372, file: !286, line: 939, baseType: !20, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !372, file: !286, line: 940, baseType: !20, size: 32, offset: 64)
!377 = !DILocation(line: 165, column: 21, scope: !312)
!378 = !DILocalVariable(name: "header", scope: !312, file: !3, line: 166, type: !70)
!379 = !DILocation(line: 166, column: 31, scope: !312)
!380 = !DILocalVariable(name: "phys_id", scope: !312, file: !3, line: 167, type: !67)
!381 = !DILocation(line: 167, column: 15, scope: !312)
!382 = !DILocation(line: 169, column: 6, scope: !383)
!383 = distinct !DILexicalBlock(scope: !312, file: !3, line: 169, column: 6)
!384 = !DILocation(line: 169, column: 6, scope: !312)
!385 = !DILocation(line: 170, column: 3, scope: !383)
!386 = !DILocation(line: 172, column: 14, scope: !387)
!387 = distinct !DILexicalBlock(scope: !312, file: !3, line: 172, column: 6)
!388 = !DILocation(line: 172, column: 7, scope: !387)
!389 = !DILocation(line: 172, column: 21, scope: !387)
!390 = !DILocation(line: 172, column: 32, scope: !387)
!391 = !DILocation(line: 172, column: 25, scope: !387)
!392 = !DILocation(line: 172, column: 6, scope: !312)
!393 = !DILocation(line: 173, column: 3, scope: !387)
!394 = !DILocation(line: 175, column: 15, scope: !312)
!395 = !DILocation(line: 175, column: 8, scope: !312)
!396 = !DILocation(line: 175, column: 6, scope: !312)
!397 = !DILocation(line: 176, column: 6, scope: !398)
!398 = distinct !DILexicalBlock(scope: !312, file: !3, line: 176, column: 6)
!399 = !DILocation(line: 176, column: 11, scope: !398)
!400 = !DILocation(line: 176, column: 16, scope: !398)
!401 = !DILocation(line: 176, column: 36, scope: !398)
!402 = !DILocation(line: 177, column: 6, scope: !398)
!403 = !DILocation(line: 177, column: 11, scope: !398)
!404 = !DILocation(line: 177, column: 18, scope: !398)
!405 = !DILocation(line: 177, column: 25, scope: !398)
!406 = !DILocation(line: 176, column: 6, scope: !312)
!407 = !DILocation(line: 178, column: 3, scope: !408)
!408 = distinct !DILexicalBlock(scope: !398, file: !3, line: 177, column: 64)
!409 = !DILocation(line: 181, column: 42, scope: !312)
!410 = !DILocation(line: 181, column: 47, scope: !312)
!411 = !DILocation(line: 181, column: 54, scope: !312)
!412 = !DILocation(line: 181, column: 11, scope: !312)
!413 = !DILocation(line: 181, column: 9, scope: !312)
!414 = !DILocation(line: 182, column: 6, scope: !415)
!415 = distinct !DILexicalBlock(scope: !312, file: !3, line: 182, column: 6)
!416 = !DILocation(line: 182, column: 14, scope: !415)
!417 = !DILocation(line: 182, column: 19, scope: !415)
!418 = !DILocation(line: 182, column: 6, scope: !312)
!419 = !DILocation(line: 183, column: 16, scope: !415)
!420 = !DILocation(line: 183, column: 24, scope: !415)
!421 = !DILocation(line: 183, column: 3, scope: !415)
!422 = !DILocation(line: 184, column: 11, scope: !423)
!423 = distinct !DILexicalBlock(scope: !415, file: !3, line: 184, column: 11)
!424 = !DILocation(line: 184, column: 19, scope: !423)
!425 = !DILocation(line: 184, column: 24, scope: !423)
!426 = !DILocation(line: 184, column: 11, scope: !415)
!427 = !DILocation(line: 185, column: 17, scope: !423)
!428 = !DILocation(line: 185, column: 25, scope: !423)
!429 = !DILocation(line: 185, column: 31, scope: !423)
!430 = !DILocation(line: 185, column: 3, scope: !423)
!431 = !DILocation(line: 186, column: 11, scope: !432)
!432 = distinct !DILexicalBlock(scope: !423, file: !3, line: 186, column: 11)
!433 = !DILocation(line: 186, column: 19, scope: !432)
!434 = !DILocation(line: 186, column: 24, scope: !432)
!435 = !DILocation(line: 186, column: 11, scope: !423)
!436 = !DILocation(line: 187, column: 17, scope: !432)
!437 = !DILocation(line: 187, column: 25, scope: !432)
!438 = !DILocation(line: 187, column: 31, scope: !432)
!439 = !DILocation(line: 187, column: 3, scope: !432)
!440 = !DILocation(line: 188, column: 11, scope: !441)
!441 = distinct !DILexicalBlock(scope: !432, file: !3, line: 188, column: 11)
!442 = !DILocation(line: 188, column: 19, scope: !441)
