; ModuleID = '../bcout/drivers/acpi/processor_throttling.llvm.bc'
source_filename = "drivers/acpi/processor_throttling.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.acpi_processor_errata = type { i8, %struct.anon.41 }
%struct.anon.41 = type { i8, i32 }
%struct.acpi_processor = type { i8*, i32, i32, i32, i32, i32, i32, %struct.acpi_processor_flags, %struct.acpi_processor_power, %struct.acpi_processor_performance*, %struct.acpi_processor_throttling, %struct.acpi_processor_limit, %struct.thermal_cooling_device*, %struct.device*, %struct.freq_qos_request, %struct.freq_qos_request }
%struct.acpi_processor_flags = type { i16 }
%struct.acpi_processor_power = type { i32, %union.anon.0, i32 }
%union.anon.0 = type { [8 x %struct.acpi_lpi_state] }
%struct.acpi_lpi_state = type { i32, i32, i32, i32, i32, i32, i64, i8, i8, [32 x i8] }
%struct.acpi_processor_performance = type { i32, i32, %struct.acpi_pct_register, %struct.acpi_pct_register, i32, %struct.acpi_processor_px*, %struct.acpi_psd_package, [1 x %struct.cpumask], i32 }
%struct.acpi_pct_register = type <{ i8, i16, i8, i8, i8, i8, i64 }>

!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_qos_type", file: !51, line: 41, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/pm_qos.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55}
!53 = !DIEnumerator(name: "PM_QOS_UNITIALIZED", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "PM_QOS_MAX", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "PM_QOS_MIN", value: 2, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dev_pm_qos_req_type", file: !51, line: 99, baseType: !7, size: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIEnumerator(name: "DEV_PM_QOS_RESUME_LATENCY", value: 1, isUnsigned: true)
!59 = !DIEnumerator(name: "DEV_PM_QOS_LATENCY_TOLERANCE", value: 2, isUnsigned: true)
!60 = !DIEnumerator(name: "DEV_PM_QOS_MIN_FREQUENCY", value: 3, isUnsigned: true)
!61 = !DIEnumerator(name: "DEV_PM_QOS_MAX_FREQUENCY", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "DEV_PM_QOS_FLAGS", value: 5, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "freq_qos_req_type", file: !51, line: 80, baseType: !7, size: 32, elements: !64)
!64 = !{!65, !66}
!65 = !DIEnumerator(name: "FREQ_QOS_MIN", value: 1, isUnsigned: true)
!66 = !DIEnumerator(name: "FREQ_QOS_MAX", value: 2, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !68, line: 76, baseType: !7, size: 32, elements: !69)
!68 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80}
!70 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!74 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!75 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!76 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!77 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!78 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!80 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !82, line: 10, baseType: !7, size: 32, elements: !83)
!82 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!83 = !{!84, !85}
!84 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !87, line: 305, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!93 = !{!94, !96, !104, !2439, !2287, !7, !2441, !116, !2442, !238, !2483, !106, !171, !2491, !123, !225, !814, !2492, !2494}
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !95, line: 148, baseType: !7)
!95 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor", file: !99, line: 218, size: 7936, elements: !100)
!99 = !DIFile(filename: "./include/acpi/processor.h", directory: "/home/lizy2001/genbc/linux")
!100 = !{!101, !105, !110, !113, !114, !115, !117, !118, !135, !178, !229, !278, !288, !2436, !2437, !2438}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !98, file: !99, line: 219, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !103, line: 424, baseType: !104)
!103 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_id", scope: !98, file: !99, line: 220, baseType: !106, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !107, line: 21, baseType: !108)
!107 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !109, line: 27, baseType: !7)
!109 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "phys_id", scope: !98, file: !99, line: 221, baseType: !111, size: 32, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_cpuid_t", file: !112, line: 266, baseType: !106)
!112 = !DIFile(filename: "./include/linux/acpi.h", directory: "/home/lizy2001/genbc/linux")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !98, file: !99, line: 222, baseType: !106, size: 32, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pblk", scope: !98, file: !99, line: 223, baseType: !106, size: 32, offset: 160)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "performance_platform_limit", scope: !98, file: !99, line: 224, baseType: !116, size: 32, offset: 192)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "throttling_platform_limit", scope: !98, file: !99, line: 225, baseType: !116, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !99, line: 228, baseType: !119, size: 16, offset: 256)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_flags", file: !99, line: 204, size: 16, elements: !120)
!120 = !{!121, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !119, file: !99, line: 205, baseType: !122, size: 1, flags: DIFlagBitField, extraData: i64 0)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !107, line: 17, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !109, line: 21, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "performance", scope: !119, file: !99, line: 206, baseType: !122, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "throttling", scope: !119, file: !99, line: 207, baseType: !122, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !119, file: !99, line: 208, baseType: !122, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "bm_control", scope: !119, file: !99, line: 209, baseType: !122, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bm_check", scope: !119, file: !99, line: 210, baseType: !122, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "has_cst", scope: !119, file: !99, line: 211, baseType: !122, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "has_lpi", scope: !119, file: !99, line: 212, baseType: !122, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "power_setup_done", scope: !119, file: !99, line: 213, baseType: !122, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "bm_rld_set", scope: !119, file: !99, line: 214, baseType: !122, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "need_hotplug_init", scope: !119, file: !99, line: 215, baseType: !122, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !98, file: !99, line: 229, baseType: !136, size: 4736, offset: 320)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_power", file: !99, line: 87, size: 4736, elements: !137)
!137 = !{!138, !139, !177}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !136, file: !99, line: 88, baseType: !116, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !136, file: !99, line: 89, baseType: !140, size: 4608, offset: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !99, line: 89, size: 4608, elements: !141)
!141 = !{!142, !160}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !140, file: !99, line: 90, baseType: !143, size: 3328)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 3328, elements: !158)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_cx", file: !99, line: 63, size: 416, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !144, file: !99, line: 64, baseType: !122, size: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !99, line: 65, baseType: !122, size: 8, offset: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !144, file: !99, line: 66, baseType: !106, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "entry_method", scope: !144, file: !99, line: 67, baseType: !122, size: 8, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !144, file: !99, line: 68, baseType: !122, size: 8, offset: 72)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !144, file: !99, line: 69, baseType: !106, size: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bm_sts_skip", scope: !144, file: !99, line: 70, baseType: !122, size: 8, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !144, file: !99, line: 71, baseType: !154, size: 256, offset: 136)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 256, elements: !156)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!156 = !{!157}
!157 = !DISubrange(count: 32)
!158 = !{!159}
!159 = !DISubrange(count: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lpi_states", scope: !140, file: !99, line: 91, baseType: !161, size: 4608)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 4608, elements: !158)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_lpi_state", file: !99, line: 74, size: 576, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169, !170, !174, !175, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency", scope: !162, file: !99, line: 75, baseType: !106, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "wake_latency", scope: !162, file: !99, line: 76, baseType: !106, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !162, file: !99, line: 77, baseType: !106, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "arch_flags", scope: !162, file: !99, line: 78, baseType: !106, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "res_cnt_freq", scope: !162, file: !99, line: 79, baseType: !106, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "enable_parent_state", scope: !162, file: !99, line: 80, baseType: !106, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !162, file: !99, line: 81, baseType: !171, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !107, line: 23, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !109, line: 31, baseType: !173)
!173 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !162, file: !99, line: 82, baseType: !122, size: 8, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "entry_method", scope: !162, file: !99, line: 83, baseType: !122, size: 8, offset: 264)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !162, file: !99, line: 84, baseType: !154, size: 256, offset: 272)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "timer_broadcast_on_state", scope: !136, file: !99, line: 93, baseType: !116, size: 32, offset: 4672)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "performance", scope: !98, file: !99, line: 230, baseType: !179, size: 64, offset: 5056)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_performance", file: !99, line: 125, size: 896, elements: !181)
!181 = !{!182, !183, !184, !197, !198, !199, !209, !217, !228}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !180, file: !99, line: 126, baseType: !7, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "platform_limit", scope: !180, file: !99, line: 127, baseType: !7, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "control_register", scope: !180, file: !99, line: 128, baseType: !185, size: 120, offset: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pct_register", file: !99, line: 106, size: 120, elements: !186)
!186 = !{!187, !188, !192, !193, !194, !195, !196}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor", scope: !185, file: !99, line: 107, baseType: !122, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !185, file: !99, line: 108, baseType: !189, size: 16, offset: 8)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !107, line: 19, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !109, line: 24, baseType: !191)
!191 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !185, file: !99, line: 109, baseType: !122, size: 8, offset: 24)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !185, file: !99, line: 110, baseType: !122, size: 8, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !185, file: !99, line: 111, baseType: !122, size: 8, offset: 40)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !185, file: !99, line: 112, baseType: !122, size: 8, offset: 48)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !185, file: !99, line: 113, baseType: !171, size: 64, offset: 56)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "status_register", scope: !180, file: !99, line: 129, baseType: !185, size: 120, offset: 184)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !180, file: !99, line: 130, baseType: !7, size: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !180, file: !99, line: 131, baseType: !200, size: 64, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_px", file: !99, line: 116, size: 384, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "core_frequency", scope: !201, file: !99, line: 117, baseType: !171, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !201, file: !99, line: 118, baseType: !171, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "transition_latency", scope: !201, file: !99, line: 119, baseType: !171, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bus_master_latency", scope: !201, file: !99, line: 120, baseType: !171, size: 64, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !201, file: !99, line: 121, baseType: !171, size: 64, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !201, file: !99, line: 122, baseType: !171, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "domain_info", scope: !180, file: !99, line: 132, baseType: !210, size: 320, offset: 448)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_psd_package", file: !99, line: 98, size: 320, elements: !211)
!211 = !{!212, !213, !214, !215, !216}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !210, file: !99, line: 99, baseType: !171, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !210, file: !99, line: 100, baseType: !171, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !210, file: !99, line: 101, baseType: !171, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "coord_type", scope: !210, file: !99, line: 102, baseType: !171, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_processors", scope: !210, file: !99, line: 103, baseType: !171, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "shared_cpu_map", scope: !180, file: !99, line: 133, baseType: !218, size: 64, offset: 768)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_var_t", file: !219, line: 756, baseType: !220)
!219 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 64, elements: !226)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !219, line: 17, size: 64, elements: !222)
!222 = !{!223}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !221, file: !219, line: 17, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 64, elements: !226)
!225 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!226 = !{!227}
!227 = !DISubrange(count: 1)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "shared_type", scope: !180, file: !99, line: 134, baseType: !7, size: 32, offset: 832)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "throttling", scope: !98, file: !99, line: 231, baseType: !230, size: 1600, offset: 5120)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_throttling", file: !99, line: 170, size: 1600, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !246, !254, !255, !259, !265, !266, !267, !268, !269, !270}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !230, file: !99, line: 171, baseType: !7, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "platform_limit", scope: !230, file: !99, line: 172, baseType: !7, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "control_register", scope: !230, file: !99, line: 173, baseType: !185, size: 120, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "status_register", scope: !230, file: !99, line: 174, baseType: !185, size: 120, offset: 184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !230, file: !99, line: 175, baseType: !7, size: 32, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "states_tss", scope: !230, file: !99, line: 176, baseType: !238, size: 64, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_tx_tss", file: !99, line: 157, size: 320, elements: !240)
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "freqpercentage", scope: !239, file: !99, line: 158, baseType: !171, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !239, file: !99, line: 159, baseType: !171, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "transition_latency", scope: !239, file: !99, line: 160, baseType: !171, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !239, file: !99, line: 161, baseType: !171, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !239, file: !99, line: 162, baseType: !171, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "domain_info", scope: !230, file: !99, line: 177, baseType: !247, size: 320, offset: 448)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_tsd_package", file: !99, line: 139, size: 320, elements: !248)
!248 = !{!249, !250, !251, !252, !253}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !247, file: !99, line: 140, baseType: !171, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !247, file: !99, line: 141, baseType: !171, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !247, file: !99, line: 142, baseType: !171, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "coord_type", scope: !247, file: !99, line: 143, baseType: !171, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "num_processors", scope: !247, file: !99, line: 144, baseType: !171, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "shared_cpu_map", scope: !230, file: !99, line: 178, baseType: !218, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_processor_get_throttling", scope: !230, file: !99, line: 179, baseType: !256, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!116, !97}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_processor_set_throttling", scope: !230, file: !99, line: 180, baseType: !260, size: 64, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!116, !97, !116, !263}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !95, line: 30, baseType: !264)
!264 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !230, file: !99, line: 183, baseType: !106, size: 32, offset: 960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "duty_offset", scope: !230, file: !99, line: 184, baseType: !122, size: 8, offset: 992)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "duty_width", scope: !230, file: !99, line: 185, baseType: !122, size: 8, offset: 1000)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tsd_valid_flag", scope: !230, file: !99, line: 186, baseType: !122, size: 8, offset: 1008)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "shared_type", scope: !230, file: !99, line: 187, baseType: !7, size: 32, offset: 1024)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !230, file: !99, line: 188, baseType: !271, size: 512, offset: 1056)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 512, elements: !276)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_tx", file: !99, line: 164, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !272, file: !99, line: 165, baseType: !189, size: 16)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "performance", scope: !272, file: !99, line: 166, baseType: !189, size: 16, offset: 16)
!276 = !{!277}
!277 = !DISubrange(count: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !98, file: !99, line: 232, baseType: !279, size: 192, offset: 6720)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_limit", file: !99, line: 198, size: 192, elements: !280)
!280 = !{!281, !286, !287}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !279, file: !99, line: 199, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_processor_lx", file: !99, line: 193, size: 64, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "px", scope: !282, file: !99, line: 194, baseType: !116, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !282, file: !99, line: 195, baseType: !116, size: 32, offset: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "thermal", scope: !279, file: !99, line: 200, baseType: !282, size: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !279, file: !99, line: 201, baseType: !282, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cdev", scope: !98, file: !99, line: 233, baseType: !289, size: 64, offset: 6912)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thermal_cooling_device", file: !291, line: 93, size: 6528, elements: !292)
!291 = !DIFile(filename: "./include/linux/thermal.h", directory: "/home/lizy2001/genbc/linux")
!292 = !{!293, !294, !298, !2403, !2404, !2405, !2406, !2432, !2433, !2434, !2435}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !290, file: !291, line: 94, baseType: !116, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !290, file: !291, line: 95, baseType: !295, size: 160, offset: 32)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 160, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 20)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !290, file: !291, line: 96, baseType: !299, size: 5568, offset: 192)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !300)
!300 = !{!301, !1776, !1778, !1781, !1782, !1833, !1929, !1930, !1931, !1932, !1933, !1942, !2119, !2132, !2328, !2329, !2333, !2335, !2336, !2337, !2341, !2347, !2348, !2351, !2352, !2353, !2356, !2357, !2358, !2359, !2391, !2392, !2393, !2396, !2399, !2400, !2401, !2402}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !299, file: !30, line: 462, baseType: !302, size: 512)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !303, line: 64, size: 512, elements: !304)
!303 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!304 = !{!305, !308, !314, !316, !376, !1613, !1766, !1771, !1772, !1773, !1774, !1775}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !303, line: 65, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !302, file: !303, line: 66, baseType: !309, size: 128, offset: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !95, line: 178, size: 128, elements: !310)
!310 = !{!311, !313}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !95, line: 179, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !309, file: !95, line: 179, baseType: !312, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !302, file: !303, line: 67, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !302, file: !303, line: 68, baseType: !317, size: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !303, line: 192, size: 704, elements: !319)
!319 = !{!320, !321, !337, !338}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !318, file: !303, line: 193, baseType: !309, size: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !318, file: !303, line: 194, baseType: !322, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !323, line: 83, baseType: !324)
!323 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !323, line: 71, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, scope: !324, file: !323, line: 72, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !323, line: 72, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !327, file: !323, line: 73, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !323, line: 20, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !330, file: !323, line: 21, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !334, line: 25, baseType: !335)
!334 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 25, elements: !336)
!336 = !{}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !318, file: !303, line: 195, baseType: !302, size: 512, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !318, file: !303, line: 196, baseType: !339, size: 64, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !303, line: 156, size: 192, elements: !342)
!342 = !{!343, !348, !353}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !341, file: !303, line: 157, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !345)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DISubroutineType(types: !347)
!347 = !{!116, !317, !315}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !303, line: 158, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!306, !317, !315}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !341, file: !303, line: 159, baseType: !354, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!116, !317, !315, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !303, line: 148, size: 20736, elements: !360)
!360 = !{!361, !366, !370, !371, !375}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !359, file: !303, line: 149, baseType: !362, size: 192)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 192, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!364 = !{!365}
!365 = !DISubrange(count: 3)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !359, file: !303, line: 150, baseType: !367, size: 4096, offset: 192)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 4096, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !359, file: !303, line: 151, baseType: !116, size: 32, offset: 4288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !359, file: !303, line: 152, baseType: !372, size: 16384, offset: 4320)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 16384, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 2048)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !359, file: !303, line: 153, baseType: !116, size: 32, offset: 20704)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !302, file: !303, line: 69, baseType: !377, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !303, line: 138, size: 448, elements: !379)
!379 = !{!380, !384, !412, !414, !1561, !1592, !1596}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !378, file: !303, line: 139, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !315}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !378, file: !303, line: 140, baseType: !385, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !388, line: 230, size: 128, elements: !389)
!388 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!389 = !{!390, !405}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !387, file: !388, line: 231, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!394, !315, !399, !363}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !95, line: 60, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !396, line: 73, baseType: !397)
!396 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !396, line: 15, baseType: !398)
!398 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !388, line: 30, size: 128, elements: !401)
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !388, line: 31, baseType: !306, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !400, file: !388, line: 32, baseType: !404, size: 16, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !95, line: 19, baseType: !191)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !387, file: !388, line: 232, baseType: !406, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!394, !315, !399, !306, !409}
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 55, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !396, line: 72, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !396, line: 16, baseType: !225)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !378, file: !303, line: 141, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !378, file: !303, line: 142, baseType: !415, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !388, line: 84, size: 320, elements: !419)
!419 = !{!420, !421, !425, !1558, !1559}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !418, file: !388, line: 85, baseType: !306, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !418, file: !388, line: 86, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!404, !315, !399, !116}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !418, file: !388, line: 88, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!404, !315, !429, !116}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !388, line: 168, size: 448, elements: !431)
!431 = !{!432, !433, !434, !435, !445, !446}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !430, file: !388, line: 169, baseType: !400, size: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !430, file: !388, line: 170, baseType: !409, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !430, file: !388, line: 171, baseType: !104, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !430, file: !388, line: 172, baseType: !436, size: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!394, !439, !315, !429, !363, !442, !409}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !441, line: 526, flags: DIFlagFwdDecl)
!441 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !95, line: 46, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !396, line: 88, baseType: !444)
!444 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !430, file: !388, line: 174, baseType: !436, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !430, file: !388, line: 176, baseType: !447, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{!116, !439, !315, !429, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !452, line: 305, size: 1472, elements: !453)
!452 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!453 = !{!454, !455, !456, !457, !458, !466, !467, !1532, !1538, !1539, !1544, !1545, !1548, !1552, !1553, !1554, !1555, !1556}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !451, file: !452, line: 308, baseType: !225, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !451, file: !452, line: 309, baseType: !225, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !451, file: !452, line: 313, baseType: !450, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !451, file: !452, line: 313, baseType: !450, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !451, file: !452, line: 315, baseType: !459, size: 192, align: 64, offset: 256)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !460, line: 24, size: 192, align: 64, elements: !461)
!460 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!461 = !{!462, !463, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !459, file: !460, line: 25, baseType: !225, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !459, file: !460, line: 26, baseType: !464, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !459, file: !460, line: 27, baseType: !464, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !451, file: !452, line: 323, baseType: !225, size: 64, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !451, file: !452, line: 327, baseType: !468, size: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !452, line: 388, size: 7296, elements: !470)
!470 = !{!471, !1528}
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !452, line: 389, baseType: !472, size: 7296)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !452, line: 389, size: 7296, elements: !473)
!473 = !{!474, !475, !479, !480, !484, !485, !486, !487, !488, !496, !501, !502, !503, !504, !513, !514, !515, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !550, !558, !561, !607, !608, !1498, !1499, !1502, !1506, !1507, !1510, !1511, !1512, !1515, !1527}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !472, file: !452, line: 390, baseType: !450, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !472, file: !452, line: 391, baseType: !476, size: 64, offset: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !460, line: 31, size: 64, elements: !477)
!477 = !{!478}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !476, file: !460, line: 32, baseType: !464, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !472, file: !452, line: 392, baseType: !171, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !472, file: !452, line: 394, baseType: !481, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!225, !439, !225, !225, !225, !225}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !472, file: !452, line: 398, baseType: !225, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !472, file: !452, line: 399, baseType: !225, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !472, file: !452, line: 405, baseType: !225, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !472, file: !452, line: 406, baseType: !225, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !472, file: !452, line: 407, baseType: !489, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !441, line: 286, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 286, size: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !491, file: !441, line: 286, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !495, line: 18, baseType: !225)
!495 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!496 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !472, file: !452, line: 416, baseType: !497, size: 32, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !95, line: 168, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 166, size: 32, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !498, file: !95, line: 167, baseType: !116, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !472, file: !452, line: 428, baseType: !497, size: 32, offset: 608)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !472, file: !452, line: 437, baseType: !497, size: 32, offset: 640)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !472, file: !452, line: 447, baseType: !497, size: 32, offset: 672)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !472, file: !452, line: 450, baseType: !505, size: 64, offset: 704)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !506, line: 13, baseType: !507)
!506 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !95, line: 175, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 173, size: 64, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !508, file: !95, line: 174, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !107, line: 22, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !109, line: 30, baseType: !444)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !472, file: !452, line: 452, baseType: !116, size: 32, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !472, file: !452, line: 454, baseType: !322, offset: 800)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !472, file: !452, line: 457, baseType: !516, size: 256, offset: 832)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !517, line: 35, size: 256, elements: !518)
!517 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!518 = !{!519, !520, !521, !523}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !516, file: !517, line: 36, baseType: !505, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !516, file: !517, line: 42, baseType: !505, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !516, file: !517, line: 46, baseType: !522, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !323, line: 29, baseType: !330)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !516, file: !517, line: 47, baseType: !309, size: 128, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !472, file: !452, line: 459, baseType: !309, size: 128, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !472, file: !452, line: 466, baseType: !225, size: 64, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !472, file: !452, line: 467, baseType: !225, size: 64, offset: 1280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !472, file: !452, line: 469, baseType: !225, size: 64, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !472, file: !452, line: 470, baseType: !225, size: 64, offset: 1408)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !472, file: !452, line: 471, baseType: !507, size: 64, offset: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !472, file: !452, line: 472, baseType: !225, size: 64, offset: 1536)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !472, file: !452, line: 473, baseType: !225, size: 64, offset: 1600)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !472, file: !452, line: 474, baseType: !225, size: 64, offset: 1664)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !472, file: !452, line: 475, baseType: !225, size: 64, offset: 1728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !472, file: !452, line: 477, baseType: !322, offset: 1792)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !472, file: !452, line: 478, baseType: !225, size: 64, offset: 1792)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !472, file: !452, line: 478, baseType: !225, size: 64, offset: 1856)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !472, file: !452, line: 478, baseType: !225, size: 64, offset: 1920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !472, file: !452, line: 478, baseType: !225, size: 64, offset: 1984)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !472, file: !452, line: 479, baseType: !225, size: 64, offset: 2048)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !472, file: !452, line: 479, baseType: !225, size: 64, offset: 2112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !472, file: !452, line: 479, baseType: !225, size: 64, offset: 2176)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !472, file: !452, line: 480, baseType: !225, size: 64, offset: 2240)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !472, file: !452, line: 480, baseType: !225, size: 64, offset: 2304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !472, file: !452, line: 480, baseType: !225, size: 64, offset: 2368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !472, file: !452, line: 480, baseType: !225, size: 64, offset: 2432)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !472, file: !452, line: 482, baseType: !547, size: 2816, offset: 2496)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 2816, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 44)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !472, file: !452, line: 488, baseType: !551, size: 256, offset: 5312)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !552, line: 60, size: 256, elements: !553)
!552 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !551, file: !552, line: 61, baseType: !555, size: 256)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 256, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 4)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !472, file: !452, line: 490, baseType: !559, size: 64, offset: 5568)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !452, line: 490, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !472, file: !452, line: 493, baseType: !562, size: 896, offset: 5632)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !563, line: 53, baseType: !564)
!563 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 13, size: 896, elements: !565)
!565 = !{!566, !567, !568, !569, !572, !573, !580, !581, !601, !602, !603}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !564, file: !563, line: 18, baseType: !171, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !564, file: !563, line: 28, baseType: !507, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !564, file: !563, line: 31, baseType: !516, size: 256, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !564, file: !563, line: 32, baseType: !570, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !563, line: 32, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !564, file: !563, line: 37, baseType: !191, size: 16, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !564, file: !563, line: 40, baseType: !574, size: 192, offset: 512)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !575, line: 53, size: 192, elements: !576)
!575 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !574, file: !575, line: 54, baseType: !505, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !574, file: !575, line: 55, baseType: !322, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !574, file: !575, line: 59, baseType: !309, size: 128, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !564, file: !563, line: 41, baseType: !104, size: 64, offset: 704)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !564, file: !563, line: 42, baseType: !582, size: 64, offset: 768)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !585, line: 13, size: 896, elements: !586)
!585 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !584, file: !585, line: 14, baseType: !104, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !584, file: !585, line: 15, baseType: !225, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !584, file: !585, line: 17, baseType: !225, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !584, file: !585, line: 17, baseType: !225, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !584, file: !585, line: 19, baseType: !398, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !584, file: !585, line: 21, baseType: !398, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !584, file: !585, line: 22, baseType: !398, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !584, file: !585, line: 23, baseType: !398, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !584, file: !585, line: 24, baseType: !398, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !584, file: !585, line: 25, baseType: !398, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !584, file: !585, line: 26, baseType: !398, size: 64, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !584, file: !585, line: 27, baseType: !398, size: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !584, file: !585, line: 28, baseType: !398, size: 64, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !584, file: !585, line: 29, baseType: !398, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !564, file: !563, line: 44, baseType: !497, size: 32, offset: 832)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !564, file: !563, line: 50, baseType: !189, size: 16, offset: 864)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !564, file: !563, line: 51, baseType: !604, size: 16, offset: 880)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !107, line: 18, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !109, line: 23, baseType: !606)
!606 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !452, line: 495, baseType: !225, size: 64, offset: 6528)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !472, file: !452, line: 497, baseType: !609, size: 64, offset: 6592)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !452, line: 381, size: 384, elements: !611)
!611 = !{!612, !613, !1497}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !610, file: !452, line: 382, baseType: !497, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !610, file: !452, line: 383, baseType: !614, size: 128, offset: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !452, line: 376, size: 128, elements: !615)
!615 = !{!616, !1495}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !614, file: !452, line: 377, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !619, line: 640, size: 48640, elements: !620)
!619 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!620 = !{!621, !627, !629, !630, !636, !637, !638, !639, !640, !641, !642, !643, !647, !665, !676, !766, !767, !768, !772, !773, !775, !776, !777, !778, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !857, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !913, !915, !916, !917, !929, !931, !932, !933, !934, !935, !941, !942, !943, !944, !945, !946, !947, !959, !964, !969, !970, !971, !974, !976, !979, !982, !985, !988, !992, !995, !998, !1004, !1005, !1006, !1012, !1013, !1014, !1015, !1016, !1025, !1026, !1027, !1028, !1029, !1034, !1035, !1036, !1039, !1040, !1043, !1046, !1049, !1052, !1055, !1058, !1059, !1139, !1142, !1145, !1146, !1149, !1150, !1151, !1157, !1158, !1159, !1172, !1173, !1174, !1184, !1189, !1192, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !618, file: !619, line: 646, baseType: !622, size: 128)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !623, line: 56, size: 128, elements: !624)
!623 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !622, file: !623, line: 57, baseType: !225, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !622, file: !623, line: 58, baseType: !106, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !618, file: !619, line: 649, baseType: !628, size: 64, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !398)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !618, file: !619, line: 657, baseType: !104, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !618, file: !619, line: 658, baseType: !631, size: 32, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !632, line: 113, baseType: !633)
!632 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !632, line: 111, size: 32, elements: !634)
!634 = !{!635}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !633, file: !632, line: 112, baseType: !497, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !619, line: 660, baseType: !7, size: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !618, file: !619, line: 661, baseType: !7, size: 32, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !618, file: !619, line: 684, baseType: !116, size: 32, offset: 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !618, file: !619, line: 686, baseType: !116, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !618, file: !619, line: 687, baseType: !116, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !618, file: !619, line: 688, baseType: !116, size: 32, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !618, file: !619, line: 689, baseType: !7, size: 32, offset: 480)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !618, file: !619, line: 691, baseType: !644, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !619, line: 691, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !618, file: !619, line: 692, baseType: !648, size: 832, offset: 576)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !619, line: 451, size: 832, elements: !649)
!649 = !{!650, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !648, file: !619, line: 453, baseType: !651, size: 128)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !619, line: 325, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !651, file: !619, line: 326, baseType: !225, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !651, file: !619, line: 327, baseType: !106, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !648, file: !619, line: 454, baseType: !459, size: 192, align: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !648, file: !619, line: 455, baseType: !309, size: 128, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !648, file: !619, line: 456, baseType: !7, size: 32, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !648, file: !619, line: 458, baseType: !171, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !648, file: !619, line: 459, baseType: !171, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !648, file: !619, line: 460, baseType: !171, size: 64, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !648, file: !619, line: 461, baseType: !171, size: 64, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !648, file: !619, line: 463, baseType: !171, size: 64, offset: 768)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !648, file: !619, line: 465, baseType: !664, offset: 832)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !619, line: 415, elements: !336)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !618, file: !619, line: 693, baseType: !666, size: 384, offset: 1408)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !619, line: 489, size: 384, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !666, file: !619, line: 490, baseType: !309, size: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !666, file: !619, line: 491, baseType: !225, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !666, file: !619, line: 492, baseType: !225, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !666, file: !619, line: 493, baseType: !7, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !666, file: !619, line: 494, baseType: !191, size: 16, offset: 288)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !666, file: !619, line: 495, baseType: !191, size: 16, offset: 304)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !666, file: !619, line: 497, baseType: !675, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !618, file: !619, line: 697, baseType: !677, size: 1792, offset: 1792)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !619, line: 507, size: 1792, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !763, !764}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !677, file: !619, line: 508, baseType: !459, size: 192, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !677, file: !619, line: 515, baseType: !171, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !677, file: !619, line: 516, baseType: !171, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !677, file: !619, line: 517, baseType: !171, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !677, file: !619, line: 518, baseType: !171, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !677, file: !619, line: 519, baseType: !171, size: 64, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !677, file: !619, line: 526, baseType: !511, size: 64, offset: 512)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !677, file: !619, line: 527, baseType: !171, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !619, line: 528, baseType: !7, size: 32, offset: 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !677, file: !619, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !677, file: !619, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !677, file: !619, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !677, file: !619, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !677, file: !619, line: 563, baseType: !693, size: 512, offset: 704)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !694)
!694 = !{!695, !703, !704, !709, !759, !760, !761, !762}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !693, file: !6, line: 119, baseType: !696, size: 256)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !697, line: 9, size: 256, elements: !698)
!697 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !697, line: 10, baseType: !459, size: 192, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !696, file: !697, line: 11, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !702, line: 29, baseType: !511)
!702 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !693, file: !6, line: 120, baseType: !701, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !693, file: !6, line: 121, baseType: !705, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!5, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !693, file: !6, line: 122, baseType: !710, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !712)
!712 = !{!713, !731, !732, !735, !745, !746, !754, !758}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !711, file: !6, line: 160, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !715, file: !6, line: 215, baseType: !522)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !715, file: !6, line: 216, baseType: !7, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !715, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !715, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !715, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !715, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !715, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !715, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !715, file: !6, line: 233, baseType: !701, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !715, file: !6, line: 234, baseType: !708, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !715, file: !6, line: 235, baseType: !701, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !715, file: !6, line: 236, baseType: !708, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !715, file: !6, line: 237, baseType: !730, size: 4096, offset: 512)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 4096, elements: !158)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !711, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !711, file: !6, line: 162, baseType: !733, size: 32, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !95, line: 27, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !396, line: 96, baseType: !116)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !711, file: !6, line: 163, baseType: !736, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !737, line: 276, baseType: !738)
!737 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !737, line: 276, size: 32, elements: !739)
!739 = !{!740}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !738, file: !737, line: 276, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !737, line: 70, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !737, line: 65, size: 32, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !742, file: !737, line: 66, baseType: !7, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !711, file: !6, line: 164, baseType: !708, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !711, file: !6, line: 165, baseType: !747, size: 128, offset: 256)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !697, line: 14, size: 128, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !747, file: !697, line: 15, baseType: !750, size: 128)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !460, line: 125, size: 128, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !750, file: !460, line: 126, baseType: !476, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !750, file: !460, line: 127, baseType: !464, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !711, file: !6, line: 166, baseType: !755, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!701}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !711, file: !6, line: 167, baseType: !701, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !693, file: !6, line: 123, baseType: !122, size: 8, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !693, file: !6, line: 124, baseType: !122, size: 8, offset: 456)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !693, file: !6, line: 125, baseType: !122, size: 8, offset: 464)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !693, file: !6, line: 126, baseType: !122, size: 8, offset: 472)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !677, file: !619, line: 572, baseType: !693, size: 512, offset: 1216)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !677, file: !619, line: 580, baseType: !765, size: 64, offset: 1728)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !618, file: !619, line: 721, baseType: !7, size: 32, offset: 3584)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !618, file: !619, line: 722, baseType: !116, size: 32, offset: 3616)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !618, file: !619, line: 723, baseType: !769, size: 64, offset: 3648)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !219, line: 17, baseType: !221)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !618, file: !619, line: 724, baseType: !771, size: 64, offset: 3712)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !618, file: !619, line: 749, baseType: !774, offset: 3776)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !619, line: 290, elements: !336)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !618, file: !619, line: 751, baseType: !309, size: 128, offset: 3776)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !618, file: !619, line: 757, baseType: !468, size: 64, offset: 3904)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !618, file: !619, line: 758, baseType: !468, size: 64, offset: 3968)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !618, file: !619, line: 761, baseType: !779, size: 320, offset: 4032)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !552, line: 34, size: 320, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !779, file: !552, line: 35, baseType: !171, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !779, file: !552, line: 36, baseType: !783, size: 256, offset: 64)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 256, elements: !556)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !618, file: !619, line: 766, baseType: !116, size: 32, offset: 4352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !618, file: !619, line: 767, baseType: !116, size: 32, offset: 4384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !618, file: !619, line: 768, baseType: !116, size: 32, offset: 4416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !618, file: !619, line: 770, baseType: !116, size: 32, offset: 4448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !618, file: !619, line: 772, baseType: !225, size: 64, offset: 4480)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !618, file: !619, line: 775, baseType: !7, size: 32, offset: 4544)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !618, file: !619, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !618, file: !619, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !618, file: !619, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !618, file: !619, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !618, file: !619, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !618, file: !619, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !618, file: !619, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !618, file: !619, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !618, file: !619, line: 831, baseType: !225, size: 64, offset: 4672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !618, file: !619, line: 833, baseType: !800, size: 384, offset: 4736)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !801)
!801 = !{!802, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !800, file: !12, line: 26, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{!398, !806}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, scope: !800, file: !12, line: 27, baseType: !808, size: 320, offset: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !800, file: !12, line: 27, size: 320, elements: !809)
!809 = !{!810, !820, !847}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !808, file: !12, line: 36, baseType: !811, size: 320)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !12, line: 29, size: 320, elements: !812)
!812 = !{!813, !815, !816, !817, !818, !819}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !811, file: !12, line: 30, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !811, file: !12, line: 31, baseType: !106, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !811, file: !12, line: 32, baseType: !106, size: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !811, file: !12, line: 33, baseType: !106, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !811, file: !12, line: 34, baseType: !171, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !811, file: !12, line: 35, baseType: !814, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !808, file: !12, line: 46, baseType: !821, size: 192)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !12, line: 38, size: 192, elements: !822)
!822 = !{!823, !824, !825, !846}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !821, file: !12, line: 39, baseType: !733, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !821, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, scope: !821, file: !12, line: 41, baseType: !826, size: 64, offset: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !821, file: !12, line: 41, size: 64, elements: !827)
!827 = !{!828, !836}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !826, file: !12, line: 42, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !831, line: 7, size: 128, elements: !832)
!831 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!832 = !{!833, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !830, file: !831, line: 8, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !396, line: 93, baseType: !444)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !830, file: !831, line: 9, baseType: !444, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !826, file: !12, line: 43, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !839, line: 7, size: 64, elements: !840)
!839 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!840 = !{!841, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !838, file: !839, line: 8, baseType: !842, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !839, line: 5, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !107, line: 20, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !109, line: 26, baseType: !116)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !838, file: !839, line: 9, baseType: !843, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !821, file: !12, line: 45, baseType: !171, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !808, file: !12, line: 54, baseType: !848, size: 256)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !808, file: !12, line: 48, size: 256, elements: !849)
!849 = !{!850, !853, !854, !855, !856}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !848, file: !12, line: 49, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !848, file: !12, line: 50, baseType: !116, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !848, file: !12, line: 51, baseType: !116, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !848, file: !12, line: 52, baseType: !225, size: 64, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !848, file: !12, line: 53, baseType: !225, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !618, file: !619, line: 835, baseType: !858, size: 32, offset: 5120)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !95, line: 22, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !396, line: 28, baseType: !116)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !618, file: !619, line: 836, baseType: !858, size: 32, offset: 5152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !618, file: !619, line: 840, baseType: !225, size: 64, offset: 5184)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !618, file: !619, line: 849, baseType: !617, size: 64, offset: 5248)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !618, file: !619, line: 852, baseType: !617, size: 64, offset: 5312)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !618, file: !619, line: 857, baseType: !309, size: 128, offset: 5376)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !618, file: !619, line: 858, baseType: !309, size: 128, offset: 5504)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !618, file: !619, line: 859, baseType: !617, size: 64, offset: 5632)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !618, file: !619, line: 867, baseType: !309, size: 128, offset: 5696)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !618, file: !619, line: 868, baseType: !309, size: 128, offset: 5824)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !618, file: !619, line: 871, baseType: !870, size: 64, offset: 5952)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !872, line: 59, size: 768, elements: !873)
!872 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!873 = !{!874, !875, !876, !877, !888, !889, !896, !905}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !871, file: !872, line: 61, baseType: !631, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !871, file: !872, line: 62, baseType: !7, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !871, file: !872, line: 63, baseType: !322, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !871, file: !872, line: 65, baseType: !878, size: 256, offset: 64)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 256, elements: !556)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !95, line: 182, size: 64, elements: !880)
!880 = !{!881}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !879, file: !95, line: 183, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !95, line: 186, size: 128, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !883, file: !95, line: 187, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !883, file: !95, line: 187, baseType: !887, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !871, file: !872, line: 66, baseType: !879, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !871, file: !872, line: 68, baseType: !890, size: 128, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !891, line: 40, baseType: !892)
!891 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !891, line: 36, size: 128, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !892, file: !891, line: 37, baseType: !322)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !892, file: !891, line: 38, baseType: !309, size: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !871, file: !872, line: 69, baseType: !897, size: 128, align: 64, offset: 512)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !95, line: 216, size: 128, align: 64, elements: !898)
!898 = !{!899, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !897, file: !95, line: 217, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !897, file: !95, line: 218, baseType: !902, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !900}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !871, file: !872, line: 70, baseType: !906, size: 128, offset: 640)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 128, elements: !226)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !872, line: 54, size: 128, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !907, file: !872, line: 55, baseType: !116, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !907, file: !872, line: 56, baseType: !911, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !872, line: 56, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !618, file: !619, line: 872, baseType: !914, size: 512, offset: 6016)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 512, elements: !556)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !618, file: !619, line: 873, baseType: !309, size: 128, offset: 6528)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !618, file: !619, line: 874, baseType: !309, size: 128, offset: 6656)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !618, file: !619, line: 876, baseType: !918, size: 64, offset: 6784)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !920, line: 26, size: 192, elements: !921)
!920 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !919, file: !920, line: 27, baseType: !7, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !919, file: !920, line: 28, baseType: !924, size: 128, offset: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !925, line: 43, size: 128, elements: !926)
!925 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !924, file: !925, line: 44, baseType: !522)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !924, file: !925, line: 45, baseType: !309, size: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !618, file: !619, line: 879, baseType: !930, size: 64, offset: 6848)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !618, file: !619, line: 882, baseType: !930, size: 64, offset: 6912)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !618, file: !619, line: 884, baseType: !171, size: 64, offset: 6976)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !618, file: !619, line: 885, baseType: !171, size: 64, offset: 7040)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !618, file: !619, line: 890, baseType: !171, size: 64, offset: 7104)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !618, file: !619, line: 891, baseType: !936, size: 128, offset: 7168)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !619, line: 242, size: 128, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !936, file: !619, line: 244, baseType: !171, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !936, file: !619, line: 245, baseType: !171, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !936, file: !619, line: 246, baseType: !522, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !618, file: !619, line: 900, baseType: !225, size: 64, offset: 7296)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !618, file: !619, line: 901, baseType: !225, size: 64, offset: 7360)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !618, file: !619, line: 904, baseType: !171, size: 64, offset: 7424)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !618, file: !619, line: 907, baseType: !171, size: 64, offset: 7488)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !618, file: !619, line: 910, baseType: !225, size: 64, offset: 7552)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !618, file: !619, line: 911, baseType: !225, size: 64, offset: 7616)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !618, file: !619, line: 914, baseType: !948, size: 640, offset: 7680)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !949, line: 123, size: 640, elements: !950)
!949 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!950 = !{!951, !957, !958}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !948, file: !949, line: 124, baseType: !952, size: 576)
