; ModuleID = '../bcout/drivers/acpi/resource.llvm.bc'
source_filename = "drivers/acpi/resource.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_resource = type { i32, i32, %union.acpi_resource_data }
%union.acpi_resource_data = type { %struct.acpi_resource_vendor_typed, [40 x i8] }
%struct.acpi_resource_vendor_typed = type { i16, i8, [16 x i8], [1 x i8] }
%struct.resource = type { i64, i64, i8*, i64, i64, %struct.resource*, %struct.resource*, %struct.resource* }
%struct.acpi_resource_memory24 = type <{ i8, i16, i16, i16, i16 }>
%struct.acpi_resource_memory32 = type <{ i8, i32, i32, i32, i32 }>
%struct.acpi_resource_fixed_memory32 = type <{ i8, i32, i32 }>
%struct.acpi_resource_io = type <{ i8, i8, i8, i16, i16 }>
%struct.acpi_resource_fixed_io = type <{ i16, i8 }>
%struct.resource_win = type { %struct.resource, i64 }
%struct.acpi_resource_address64 = type <{ i8, i8, i8, i8, i8, %union.acpi_resource_attribute, %struct.acpi_address64_attribute, %struct.acpi_resource_source }>
%union.acpi_resource_attribute = type { %struct.acpi_memory_attribute }
%struct.acpi_memory_attribute = type { i8, i8, i8, i8 }
%struct.acpi_address64_attribute = type { i64, i64, i64, i64, i64 }
%struct.acpi_resource_source = type <{ i8, i16, i8* }>
%struct.acpi_resource_address = type { i8, i8, i8, i8, i8, %union.acpi_resource_attribute }
%struct.acpi_io_attribute = type { i8, i8, i8, i8 }

!36 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!37 = !{!38, !39}
!38 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !41, line: 16, baseType: !5, size: 32, elements: !42)
!41 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !47, line: 26, baseType: !5, size: 32, elements: !48)
!47 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!48 = !{!49, !50, !51}
!49 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!52 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !53, line: 44, baseType: !5, size: 32, elements: !54)
!53 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!54 = !{!55, !56, !57}
!55 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !59, line: 343, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!60 = !{!61, !62, !63, !64}
!61 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !66, line: 524, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !69, !70, !71, !72}
!68 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !66, line: 502, baseType: !5, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78}
!75 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!76 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!77 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!78 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !80, line: 76, baseType: !5, size: 32, elements: !81)
!80 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92}
!82 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!85 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!86 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!87 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!88 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!89 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!90 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!91 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!92 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_gc_flags", file: !10, line: 1084, baseType: !5, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99}
!95 = !DIEnumerator(name: "IRQ_GC_INIT_MASK_CACHE", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "IRQ_GC_INIT_NESTED_LOCK", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "IRQ_GC_MASK_CACHE_PER_TYPE", value: 4, isUnsigned: true)
!98 = !DIEnumerator(name: "IRQ_GC_NO_MASK", value: 8, isUnsigned: true)
!99 = !DIEnumerator(name: "IRQ_GC_BE_IO", value: 16, isUnsigned: true)
!100 = !{!101, !106, !133, !134, !135, !144, !148, !149, !2686}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !102, line: 17, baseType: !103)
!102 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !104, line: 21, baseType: !105)
!104 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!105 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address", file: !108, line: 303, size: 72, elements: !109)
!108 = !DIFile(filename: "./include/acpi/acrestyp.h", directory: "/home/lizy2001/genbc/linux")
!109 = !{!110, !111, !112, !113, !114, !115}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !107, file: !108, line: 304, baseType: !101, size: 8)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !107, file: !108, line: 304, baseType: !101, size: 8, offset: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !107, file: !108, line: 304, baseType: !101, size: 8, offset: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !107, file: !108, line: 304, baseType: !101, size: 8, offset: 24)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !107, file: !108, line: 304, baseType: !101, size: 8, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !107, file: !108, line: 304, baseType: !116, size: 32, offset: 40)
!116 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_attribute", file: !108, line: 249, size: 32, elements: !117)
!117 = !{!118, !125, !132}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !116, file: !108, line: 250, baseType: !119, size: 32)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_memory_attribute", file: !108, line: 235, size: 32, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !119, file: !108, line: 236, baseType: !101, size: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !119, file: !108, line: 237, baseType: !101, size: 8, offset: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !119, file: !108, line: 238, baseType: !101, size: 8, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !119, file: !108, line: 239, baseType: !101, size: 8, offset: 24)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !116, file: !108, line: 251, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_io_attribute", file: !108, line: 242, size: 32, elements: !127)
!127 = !{!128, !129, !130, !131}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !126, file: !108, line: 243, baseType: !101, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !126, file: !108, line: 244, baseType: !101, size: 8, offset: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "translation_type", scope: !126, file: !108, line: 245, baseType: !101, size: 8, offset: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !126, file: !108, line: 246, baseType: !101, size: 8, offset: 24)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !116, file: !108, line: 255, baseType: !101, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !140, line: 178, size: 128, elements: !141)
!140 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !140, line: 179, baseType: !138, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !139, file: !140, line: 179, baseType: !138, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !145, line: 421, baseType: !146)
!145 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !102, line: 21, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !104, line: 27, baseType: !5)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !152, line: 351, size: 10880, elements: !153)
!152 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!153 = !{!154, !156, !158, !2415, !2416, !2417, !2418, !2419, !2420, !2429, !2446, !2520, !2549, !2573, !2594, !2598, !2607, !2639, !2653, !2675, !2679, !2680, !2681, !2682, !2683, !2684, !2685}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !151, file: !152, line: 352, baseType: !155, size: 32)
!155 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !151, file: !152, line: 353, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !145, line: 424, baseType: !133)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !151, file: !152, line: 354, baseType: !159, size: 192, offset: 128)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !160, line: 17, size: 192, elements: !161)
!160 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!161 = !{!162, !164, !2414}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !159, file: !160, line: 18, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !159, file: !160, line: 19, baseType: !165, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !160, line: 110, size: 1152, elements: !168)
!168 = !{!169, !173, !177, !185, !2356, !2360, !2364, !2369, !2373, !2374, !2378, !2382, !2386, !2397, !2398, !2399, !2400, !2410}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !167, file: !160, line: 111, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!163, !163}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !167, file: !160, line: 112, baseType: !174, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !163}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !167, file: !160, line: 113, baseType: !178, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !140, line: 30, baseType: !182)
!182 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !167, file: !160, line: 114, baseType: !186, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!189, !183, !191}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !59, line: 461, size: 5568, elements: !194)
!194 = !{!195, !1685, !1687, !1690, !1691, !1742, !1839, !1840, !1841, !1842, !1843, !1852, !1957, !1970, !2281, !2282, !2286, !2288, !2289, !2290, !2294, !2300, !2301, !2304, !2305, !2306, !2309, !2310, !2311, !2312, !2344, !2345, !2346, !2349, !2352, !2353, !2354, !2355}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !193, file: !59, line: 462, baseType: !196, size: 512)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !197, line: 64, size: 512, elements: !198)
!197 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!198 = !{!199, !203, !204, !206, !266, !1521, !1675, !1680, !1681, !1682, !1683, !1684}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !197, line: 65, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !196, file: !197, line: 66, baseType: !139, size: 128, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !197, line: 67, baseType: !205, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !196, file: !197, line: 68, baseType: !207, size: 64, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !197, line: 192, size: 704, elements: !209)
!209 = !{!210, !211, !227, !228}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !208, file: !197, line: 193, baseType: !139, size: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !208, file: !197, line: 194, baseType: !212, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !213, line: 83, baseType: !214)
!213 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !213, line: 71, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !213, line: 72, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !213, line: 72, elements: !218)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !217, file: !213, line: 73, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !213, line: 20, elements: !221)
!221 = !{!222}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !220, file: !213, line: 21, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !224, line: 25, baseType: !225)
!224 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !224, line: 25, elements: !226)
!226 = !{}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !208, file: !197, line: 195, baseType: !196, size: 512, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !208, file: !197, line: 196, baseType: !229, size: 64, offset: 640)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !197, line: 156, size: 192, elements: !232)
!232 = !{!233, !238, !243}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !231, file: !197, line: 157, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!155, !207, !205}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !231, file: !197, line: 158, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!200, !207, !205}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !231, file: !197, line: 159, baseType: !244, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!155, !207, !205, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !197, line: 148, size: 20736, elements: !250)
!250 = !{!251, !256, !260, !261, !265}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !249, file: !197, line: 149, baseType: !252, size: 192)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 192, elements: !254)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!254 = !{!255}
!255 = !DISubrange(count: 3)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !249, file: !197, line: 150, baseType: !257, size: 4096, offset: 192)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 4096, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !249, file: !197, line: 151, baseType: !155, size: 32, offset: 4288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !197, line: 152, baseType: !262, size: 16384, offset: 4320)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 16384, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 2048)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !249, file: !197, line: 153, baseType: !155, size: 32, offset: 20704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !196, file: !197, line: 69, baseType: !267, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !197, line: 138, size: 448, elements: !269)
!269 = !{!270, !274, !304, !306, !1468, !1499, !1503}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !268, file: !197, line: 139, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !205}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !268, file: !197, line: 140, baseType: !275, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !278, line: 230, size: 128, elements: !279)
!278 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!279 = !{!280, !296}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !277, file: !278, line: 231, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !205, !289, !253}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !140, line: 60, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !286, line: 73, baseType: !287)
!286 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !286, line: 15, baseType: !288)
!288 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !278, line: 30, size: 128, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !278, line: 31, baseType: !200, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !290, file: !278, line: 32, baseType: !294, size: 16, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !140, line: 19, baseType: !295)
!295 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !277, file: !278, line: 232, baseType: !297, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!284, !205, !289, !200, !300}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !140, line: 55, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !286, line: 72, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !286, line: 16, baseType: !303)
!303 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !268, file: !197, line: 141, baseType: !305, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !268, file: !197, line: 142, baseType: !307, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !278, line: 84, size: 320, elements: !311)
!311 = !{!312, !313, !317, !1465, !1466}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !278, line: 85, baseType: !200, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !310, file: !278, line: 86, baseType: !314, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DISubroutineType(types: !316)
!316 = !{!294, !205, !289, !155}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !310, file: !278, line: 88, baseType: !318, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!294, !205, !321, !155}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !278, line: 168, size: 448, elements: !323)
!323 = !{!324, !325, !326, !327, !337, !338}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !322, file: !278, line: 169, baseType: !290, size: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !322, file: !278, line: 170, baseType: !300, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !322, file: !278, line: 171, baseType: !133, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !322, file: !278, line: 172, baseType: !328, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!284, !331, !205, !321, !253, !334, !300}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !333, line: 526, flags: DIFlagFwdDecl)
!333 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !140, line: 46, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !286, line: 88, baseType: !336)
!336 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !322, file: !278, line: 174, baseType: !328, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !322, file: !278, line: 176, baseType: !339, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!155, !331, !205, !321, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !344, line: 305, size: 1472, elements: !345)
!344 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!345 = !{!346, !347, !348, !349, !350, !358, !359, !1439, !1445, !1446, !1451, !1452, !1455, !1459, !1460, !1461, !1462, !1463}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !343, file: !344, line: 308, baseType: !303, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !343, file: !344, line: 309, baseType: !303, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !343, file: !344, line: 313, baseType: !342, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !343, file: !344, line: 313, baseType: !342, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !343, file: !344, line: 315, baseType: !351, size: 192, align: 64, offset: 256)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !352, line: 24, size: 192, align: 64, elements: !353)
!352 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!353 = !{!354, !355, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !351, file: !352, line: 25, baseType: !303, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !351, file: !352, line: 26, baseType: !356, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !351, file: !352, line: 27, baseType: !356, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !343, file: !344, line: 323, baseType: !303, size: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !343, file: !344, line: 327, baseType: !360, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !344, line: 388, size: 7296, elements: !362)
!362 = !{!363, !1435}
!363 = !DIDerivedType(tag: DW_TAG_member, scope: !361, file: !344, line: 389, baseType: !364, size: 7296)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !361, file: !344, line: 389, size: 7296, elements: !365)
!365 = !{!366, !367, !371, !375, !379, !380, !381, !382, !383, !391, !396, !397, !398, !399, !408, !409, !410, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !445, !453, !456, !504, !505, !1406, !1407, !1410, !1413, !1414, !1417, !1418, !1419, !1422, !1434}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !364, file: !344, line: 390, baseType: !342, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !364, file: !344, line: 391, baseType: !368, size: 64, offset: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !352, line: 31, size: 64, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !368, file: !352, line: 32, baseType: !356, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !364, file: !344, line: 392, baseType: !372, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !102, line: 23, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !104, line: 31, baseType: !374)
!374 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !364, file: !344, line: 394, baseType: !376, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!303, !331, !303, !303, !303, !303}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !364, file: !344, line: 398, baseType: !303, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !364, file: !344, line: 399, baseType: !303, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !364, file: !344, line: 405, baseType: !303, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !364, file: !344, line: 406, baseType: !303, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !364, file: !344, line: 407, baseType: !384, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !333, line: 286, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 286, size: 64, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !386, file: !333, line: 286, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !390, line: 18, baseType: !303)
!390 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!391 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !364, file: !344, line: 416, baseType: !392, size: 32, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !140, line: 168, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 166, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !393, file: !140, line: 167, baseType: !155, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !364, file: !344, line: 428, baseType: !392, size: 32, offset: 608)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !364, file: !344, line: 437, baseType: !392, size: 32, offset: 640)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !364, file: !344, line: 447, baseType: !392, size: 32, offset: 672)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !364, file: !344, line: 450, baseType: !400, size: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !401, line: 13, baseType: !402)
!401 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !140, line: 175, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !140, line: 173, size: 64, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !403, file: !140, line: 174, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !102, line: 22, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !104, line: 30, baseType: !336)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !364, file: !344, line: 452, baseType: !155, size: 32, offset: 768)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !364, file: !344, line: 454, baseType: !212, offset: 800)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !364, file: !344, line: 457, baseType: !411, size: 256, offset: 832)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !412, line: 35, size: 256, elements: !413)
!412 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!413 = !{!414, !415, !416, !418}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !411, file: !412, line: 36, baseType: !400, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !411, file: !412, line: 42, baseType: !400, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !411, file: !412, line: 46, baseType: !417, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !213, line: 29, baseType: !220)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !411, file: !412, line: 47, baseType: !139, size: 128, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !364, file: !344, line: 459, baseType: !139, size: 128, offset: 1088)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !364, file: !344, line: 466, baseType: !303, size: 64, offset: 1216)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !364, file: !344, line: 467, baseType: !303, size: 64, offset: 1280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !364, file: !344, line: 469, baseType: !303, size: 64, offset: 1344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !364, file: !344, line: 470, baseType: !303, size: 64, offset: 1408)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !364, file: !344, line: 471, baseType: !402, size: 64, offset: 1472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !364, file: !344, line: 472, baseType: !303, size: 64, offset: 1536)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !364, file: !344, line: 473, baseType: !303, size: 64, offset: 1600)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !364, file: !344, line: 474, baseType: !303, size: 64, offset: 1664)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !364, file: !344, line: 475, baseType: !303, size: 64, offset: 1728)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !364, file: !344, line: 477, baseType: !212, offset: 1792)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !364, file: !344, line: 478, baseType: !303, size: 64, offset: 1792)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !364, file: !344, line: 478, baseType: !303, size: 64, offset: 1856)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !364, file: !344, line: 478, baseType: !303, size: 64, offset: 1920)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !364, file: !344, line: 478, baseType: !303, size: 64, offset: 1984)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !364, file: !344, line: 479, baseType: !303, size: 64, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !364, file: !344, line: 479, baseType: !303, size: 64, offset: 2112)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !364, file: !344, line: 479, baseType: !303, size: 64, offset: 2176)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !364, file: !344, line: 480, baseType: !303, size: 64, offset: 2240)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !364, file: !344, line: 480, baseType: !303, size: 64, offset: 2304)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !364, file: !344, line: 480, baseType: !303, size: 64, offset: 2368)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !364, file: !344, line: 480, baseType: !303, size: 64, offset: 2432)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !364, file: !344, line: 482, baseType: !442, size: 2816, offset: 2496)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 2816, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 44)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !364, file: !344, line: 488, baseType: !446, size: 256, offset: 5312)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !447, line: 60, size: 256, elements: !448)
!447 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !446, file: !447, line: 61, baseType: !450, size: 256)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 256, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 4)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !364, file: !344, line: 490, baseType: !454, size: 64, offset: 5568)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !344, line: 490, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !364, file: !344, line: 493, baseType: !457, size: 896, offset: 5632)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !458, line: 53, baseType: !459)
!458 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 13, size: 896, elements: !460)
!460 = !{!461, !462, !463, !464, !467, !468, !475, !476, !496, !497, !500}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !459, file: !458, line: 18, baseType: !372, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !459, file: !458, line: 28, baseType: !402, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !459, file: !458, line: 31, baseType: !411, size: 256, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !459, file: !458, line: 32, baseType: !465, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !458, line: 32, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !459, file: !458, line: 37, baseType: !295, size: 16, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !459, file: !458, line: 40, baseType: !469, size: 192, offset: 512)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !470, line: 53, size: 192, elements: !471)
!470 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!471 = !{!472, !473, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !469, file: !470, line: 54, baseType: !400, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !469, file: !470, line: 55, baseType: !212, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !469, file: !470, line: 59, baseType: !139, size: 128, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !459, file: !458, line: 41, baseType: !133, size: 64, offset: 704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !459, file: !458, line: 42, baseType: !477, size: 64, offset: 768)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !480, line: 13, size: 896, elements: !481)
!480 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !479, file: !480, line: 14, baseType: !133, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !479, file: !480, line: 15, baseType: !303, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !479, file: !480, line: 17, baseType: !303, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !479, file: !480, line: 17, baseType: !303, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !479, file: !480, line: 19, baseType: !288, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !479, file: !480, line: 21, baseType: !288, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !479, file: !480, line: 22, baseType: !288, size: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !479, file: !480, line: 23, baseType: !288, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !479, file: !480, line: 24, baseType: !288, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !479, file: !480, line: 25, baseType: !288, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !479, file: !480, line: 26, baseType: !288, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !479, file: !480, line: 27, baseType: !288, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !479, file: !480, line: 28, baseType: !288, size: 64, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !479, file: !480, line: 29, baseType: !288, size: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !459, file: !458, line: 44, baseType: !392, size: 32, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !459, file: !458, line: 50, baseType: !498, size: 16, offset: 864)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !102, line: 19, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !104, line: 24, baseType: !295)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !459, file: !458, line: 51, baseType: !501, size: 16, offset: 880)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !102, line: 18, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !104, line: 23, baseType: !503)
!503 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !364, file: !344, line: 495, baseType: !303, size: 64, offset: 6528)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !364, file: !344, line: 497, baseType: !506, size: 64, offset: 6592)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !344, line: 381, size: 384, elements: !508)
!508 = !{!509, !510, !1405}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !507, file: !344, line: 382, baseType: !392, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !507, file: !344, line: 383, baseType: !511, size: 128, offset: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !344, line: 376, size: 128, elements: !512)
!512 = !{!513, !1403}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !511, file: !344, line: 377, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !516, line: 640, size: 48640, elements: !517)
!516 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!517 = !{!518, !524, !526, !527, !533, !534, !535, !536, !537, !538, !539, !540, !544, !562, !573, !665, !666, !667, !678, !679, !681, !682, !683, !684, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !763, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !819, !821, !822, !823, !835, !837, !838, !839, !840, !841, !847, !848, !849, !850, !851, !852, !853, !865, !870, !874, !875, !876, !879, !883, !886, !889, !892, !895, !898, !901, !904, !910, !911, !912, !918, !919, !920, !921, !922, !931, !932, !933, !934, !935, !940, !941, !942, !945, !946, !949, !952, !955, !958, !961, !964, !965, !1045, !1048, !1051, !1052, !1055, !1056, !1057, !1063, !1064, !1065, !1078, !1079, !1080, !1090, !1095, !1098, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !515, file: !516, line: 646, baseType: !519, size: 128)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !520, line: 56, size: 128, elements: !521)
!520 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !519, file: !520, line: 57, baseType: !303, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !519, file: !520, line: 58, baseType: !146, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !515, file: !516, line: 649, baseType: !525, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !515, file: !516, line: 657, baseType: !133, size: 64, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !515, file: !516, line: 658, baseType: !528, size: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !529, line: 113, baseType: !530)
!529 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !529, line: 111, size: 32, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !530, file: !529, line: 112, baseType: !392, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !515, file: !516, line: 660, baseType: !5, size: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !515, file: !516, line: 661, baseType: !5, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !515, file: !516, line: 684, baseType: !155, size: 32, offset: 352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !515, file: !516, line: 686, baseType: !155, size: 32, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !515, file: !516, line: 687, baseType: !155, size: 32, offset: 416)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !515, file: !516, line: 688, baseType: !155, size: 32, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !515, file: !516, line: 689, baseType: !5, size: 32, offset: 480)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !515, file: !516, line: 691, baseType: !541, size: 64, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !516, line: 691, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !515, file: !516, line: 692, baseType: !545, size: 832, offset: 576)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !516, line: 451, size: 832, elements: !546)
!546 = !{!547, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !545, file: !516, line: 453, baseType: !548, size: 128)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !516, line: 325, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !548, file: !516, line: 326, baseType: !303, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !548, file: !516, line: 327, baseType: !146, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !545, file: !516, line: 454, baseType: !351, size: 192, align: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !545, file: !516, line: 455, baseType: !139, size: 128, offset: 320)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !545, file: !516, line: 456, baseType: !5, size: 32, offset: 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !545, file: !516, line: 458, baseType: !372, size: 64, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !545, file: !516, line: 459, baseType: !372, size: 64, offset: 576)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !545, file: !516, line: 460, baseType: !372, size: 64, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !545, file: !516, line: 461, baseType: !372, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !545, file: !516, line: 463, baseType: !372, size: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !545, file: !516, line: 465, baseType: !561, offset: 832)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !516, line: 415, elements: !226)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !515, file: !516, line: 693, baseType: !563, size: 384, offset: 1408)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !516, line: 489, size: 384, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !563, file: !516, line: 490, baseType: !139, size: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !563, file: !516, line: 491, baseType: !303, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !563, file: !516, line: 492, baseType: !303, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !563, file: !516, line: 493, baseType: !5, size: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !563, file: !516, line: 494, baseType: !295, size: 16, offset: 288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !563, file: !516, line: 495, baseType: !295, size: 16, offset: 304)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !563, file: !516, line: 497, baseType: !572, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !515, file: !516, line: 697, baseType: !574, size: 1792, offset: 1792)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !516, line: 507, size: 1792, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !662, !663}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !574, file: !516, line: 508, baseType: !351, size: 192, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !574, file: !516, line: 515, baseType: !372, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !574, file: !516, line: 516, baseType: !372, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !574, file: !516, line: 517, baseType: !372, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !574, file: !516, line: 518, baseType: !372, size: 64, offset: 384)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !574, file: !516, line: 519, baseType: !372, size: 64, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !574, file: !516, line: 526, baseType: !406, size: 64, offset: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !574, file: !516, line: 527, baseType: !372, size: 64, offset: 576)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !516, line: 528, baseType: !5, size: 32, offset: 640)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !574, file: !516, line: 554, baseType: !5, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !574, file: !516, line: 555, baseType: !5, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !574, file: !516, line: 556, baseType: !5, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !574, file: !516, line: 557, baseType: !5, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !574, file: !516, line: 563, baseType: !590, size: 512, offset: 704)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !36, line: 118, size: 512, elements: !591)
!591 = !{!592, !600, !601, !606, !658, !659, !660, !661}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !590, file: !36, line: 119, baseType: !593, size: 256)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !594, line: 9, size: 256, elements: !595)
!594 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !593, file: !594, line: 10, baseType: !351, size: 192, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !593, file: !594, line: 11, baseType: !598, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !599, line: 29, baseType: !406)
!599 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !590, file: !36, line: 120, baseType: !598, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !590, file: !36, line: 121, baseType: !602, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{!35, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !590, file: !36, line: 122, baseType: !607, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !36, line: 159, size: 512, align: 512, elements: !609)
!609 = !{!610, !630, !631, !634, !644, !645, !653, !657}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !608, file: !36, line: 160, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !36, line: 214, size: 4608, align: 512, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !612, file: !36, line: 215, baseType: !417)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !612, file: !36, line: 216, baseType: !5, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !612, file: !36, line: 217, baseType: !5, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !612, file: !36, line: 218, baseType: !5, size: 32, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !612, file: !36, line: 219, baseType: !5, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !612, file: !36, line: 220, baseType: !5, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !612, file: !36, line: 221, baseType: !5, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !612, file: !36, line: 222, baseType: !5, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !612, file: !36, line: 233, baseType: !598, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !612, file: !36, line: 234, baseType: !605, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !612, file: !36, line: 235, baseType: !598, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !612, file: !36, line: 236, baseType: !605, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !612, file: !36, line: 237, baseType: !627, size: 4096, offset: 512)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 4096, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !608, file: !36, line: 161, baseType: !5, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !608, file: !36, line: 162, baseType: !632, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !140, line: 27, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !286, line: 96, baseType: !155)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !608, file: !36, line: 163, baseType: !635, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !636, line: 276, baseType: !637)
!636 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !636, line: 276, size: 32, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !637, file: !636, line: 276, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !636, line: 70, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !636, line: 65, size: 32, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !641, file: !636, line: 66, baseType: !5, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !608, file: !36, line: 164, baseType: !605, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !608, file: !36, line: 165, baseType: !646, size: 128, offset: 256)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !594, line: 14, size: 128, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !646, file: !594, line: 15, baseType: !649, size: 128)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !352, line: 125, size: 128, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !649, file: !352, line: 126, baseType: !368, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !649, file: !352, line: 127, baseType: !356, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !608, file: !36, line: 166, baseType: !654, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!598}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !608, file: !36, line: 167, baseType: !598, size: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !590, file: !36, line: 123, baseType: !101, size: 8, offset: 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !590, file: !36, line: 124, baseType: !101, size: 8, offset: 456)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !590, file: !36, line: 125, baseType: !101, size: 8, offset: 464)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !590, file: !36, line: 126, baseType: !101, size: 8, offset: 472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !574, file: !516, line: 572, baseType: !590, size: 512, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !574, file: !516, line: 580, baseType: !664, size: 64, offset: 1728)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !515, file: !516, line: 721, baseType: !5, size: 32, offset: 3584)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !515, file: !516, line: 722, baseType: !155, size: 32, offset: 3616)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !515, file: !516, line: 723, baseType: !668, size: 64, offset: 3648)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !671, line: 17, baseType: !672)
!671 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !671, line: 17, size: 64, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !672, file: !671, line: 17, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 64, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 1)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !515, file: !516, line: 724, baseType: !670, size: 64, offset: 3712)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !515, file: !516, line: 749, baseType: !680, offset: 3776)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !516, line: 290, elements: !226)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !515, file: !516, line: 751, baseType: !139, size: 128, offset: 3776)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !515, file: !516, line: 757, baseType: !360, size: 64, offset: 3904)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !515, file: !516, line: 758, baseType: !360, size: 64, offset: 3968)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !515, file: !516, line: 761, baseType: !685, size: 320, offset: 4032)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !447, line: 34, size: 320, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !685, file: !447, line: 35, baseType: !372, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !685, file: !447, line: 36, baseType: !689, size: 256, offset: 64)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 256, elements: !451)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !515, file: !516, line: 766, baseType: !155, size: 32, offset: 4352)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !515, file: !516, line: 767, baseType: !155, size: 32, offset: 4384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !515, file: !516, line: 768, baseType: !155, size: 32, offset: 4416)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !515, file: !516, line: 770, baseType: !155, size: 32, offset: 4448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !515, file: !516, line: 772, baseType: !303, size: 64, offset: 4480)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !515, file: !516, line: 775, baseType: !5, size: 32, offset: 4544)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !515, file: !516, line: 778, baseType: !5, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !515, file: !516, line: 779, baseType: !5, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !515, file: !516, line: 780, baseType: !5, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !515, file: !516, line: 803, baseType: !5, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !515, file: !516, line: 806, baseType: !5, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !515, file: !516, line: 807, baseType: !5, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !515, file: !516, line: 809, baseType: !5, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !515, file: !516, line: 815, baseType: !5, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !515, file: !516, line: 831, baseType: !303, size: 64, offset: 4672)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !515, file: !516, line: 833, baseType: !706, size: 384, offset: 4736)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !41, line: 25, size: 384, elements: !707)
!707 = !{!708, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !706, file: !41, line: 26, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!288, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !706, file: !41, line: 27, baseType: !714, size: 320, offset: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !706, file: !41, line: 27, size: 320, elements: !715)
!715 = !{!716, !726, !753}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !714, file: !41, line: 36, baseType: !717, size: 320)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !41, line: 29, size: 320, elements: !718)
!718 = !{!719, !721, !722, !723, !724, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !717, file: !41, line: 30, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !717, file: !41, line: 31, baseType: !146, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !717, file: !41, line: 32, baseType: !146, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !717, file: !41, line: 33, baseType: !146, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !717, file: !41, line: 34, baseType: !372, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !717, file: !41, line: 35, baseType: !720, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !714, file: !41, line: 46, baseType: !727, size: 192)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !41, line: 38, size: 192, elements: !728)
!728 = !{!729, !730, !731, !752}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !727, file: !41, line: 39, baseType: !632, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !41, line: 40, baseType: !40, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, scope: !727, file: !41, line: 41, baseType: !732, size: 64, offset: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !727, file: !41, line: 41, size: 64, elements: !733)
!733 = !{!734, !742}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !732, file: !41, line: 42, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !737, line: 7, size: 128, elements: !738)
!737 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!738 = !{!739, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !736, file: !737, line: 8, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !286, line: 93, baseType: !336)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !736, file: !737, line: 9, baseType: !336, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !732, file: !41, line: 43, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !745, line: 7, size: 64, elements: !746)
!745 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!746 = !{!747, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !744, file: !745, line: 8, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !745, line: 5, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !102, line: 20, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !104, line: 26, baseType: !155)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !744, file: !745, line: 9, baseType: !749, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !727, file: !41, line: 45, baseType: !372, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !714, file: !41, line: 54, baseType: !754, size: 256)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !41, line: 48, size: 256, elements: !755)
!755 = !{!756, !759, !760, !761, !762}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !754, file: !41, line: 49, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !41, line: 14, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !754, file: !41, line: 50, baseType: !155, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !754, file: !41, line: 51, baseType: !155, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !754, file: !41, line: 52, baseType: !303, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !754, file: !41, line: 53, baseType: !303, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !515, file: !516, line: 835, baseType: !764, size: 32, offset: 5120)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !140, line: 22, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !286, line: 28, baseType: !155)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !515, file: !516, line: 836, baseType: !764, size: 32, offset: 5152)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !515, file: !516, line: 840, baseType: !303, size: 64, offset: 5184)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !515, file: !516, line: 849, baseType: !514, size: 64, offset: 5248)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !515, file: !516, line: 852, baseType: !514, size: 64, offset: 5312)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !515, file: !516, line: 857, baseType: !139, size: 128, offset: 5376)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !515, file: !516, line: 858, baseType: !139, size: 128, offset: 5504)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !515, file: !516, line: 859, baseType: !514, size: 64, offset: 5632)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !515, file: !516, line: 867, baseType: !139, size: 128, offset: 5696)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !515, file: !516, line: 868, baseType: !139, size: 128, offset: 5824)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !515, file: !516, line: 871, baseType: !776, size: 64, offset: 5952)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !778, line: 59, size: 768, elements: !779)
!778 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!779 = !{!780, !781, !782, !783, !794, !795, !802, !811}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !777, file: !778, line: 61, baseType: !528, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !777, file: !778, line: 62, baseType: !5, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !777, file: !778, line: 63, baseType: !212, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !777, file: !778, line: 65, baseType: !784, size: 256, offset: 64)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 256, elements: !451)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !140, line: 182, size: 64, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !785, file: !140, line: 183, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !140, line: 186, size: 128, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !140, line: 187, baseType: !788, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !789, file: !140, line: 187, baseType: !793, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !777, file: !778, line: 66, baseType: !785, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !777, file: !778, line: 68, baseType: !796, size: 128, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !797, line: 40, baseType: !798)
!797 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !797, line: 36, size: 128, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !798, file: !797, line: 37, baseType: !212)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !798, file: !797, line: 38, baseType: !139, size: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !777, file: !778, line: 69, baseType: !803, size: 128, align: 64, offset: 512)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !140, line: 216, size: 128, align: 64, elements: !804)
!804 = !{!805, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !140, line: 217, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !803, file: !140, line: 218, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !806}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !777, file: !778, line: 70, baseType: !812, size: 128, offset: 640)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 128, elements: !676)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !778, line: 54, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !813, file: !778, line: 55, baseType: !155, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !813, file: !778, line: 56, baseType: !817, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !778, line: 56, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !515, file: !516, line: 872, baseType: !820, size: 512, offset: 6016)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 512, elements: !451)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !515, file: !516, line: 873, baseType: !139, size: 128, offset: 6528)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !515, file: !516, line: 874, baseType: !139, size: 128, offset: 6656)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !515, file: !516, line: 876, baseType: !824, size: 64, offset: 6784)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !826, line: 26, size: 192, elements: !827)
!826 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !825, file: !826, line: 27, baseType: !5, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !825, file: !826, line: 28, baseType: !830, size: 128, offset: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !831, line: 43, size: 128, elements: !832)
!831 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !830, file: !831, line: 44, baseType: !417)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !830, file: !831, line: 45, baseType: !139, size: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !515, file: !516, line: 879, baseType: !836, size: 64, offset: 6848)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !515, file: !516, line: 882, baseType: !836, size: 64, offset: 6912)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !515, file: !516, line: 884, baseType: !372, size: 64, offset: 6976)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !515, file: !516, line: 885, baseType: !372, size: 64, offset: 7040)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !515, file: !516, line: 890, baseType: !372, size: 64, offset: 7104)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !515, file: !516, line: 891, baseType: !842, size: 128, offset: 7168)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !516, line: 242, size: 128, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !842, file: !516, line: 244, baseType: !372, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !842, file: !516, line: 245, baseType: !372, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !842, file: !516, line: 246, baseType: !417, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !515, file: !516, line: 900, baseType: !303, size: 64, offset: 7296)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !515, file: !516, line: 901, baseType: !303, size: 64, offset: 7360)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !515, file: !516, line: 904, baseType: !372, size: 64, offset: 7424)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !515, file: !516, line: 907, baseType: !372, size: 64, offset: 7488)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !515, file: !516, line: 910, baseType: !303, size: 64, offset: 7552)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !515, file: !516, line: 911, baseType: !303, size: 64, offset: 7616)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !515, file: !516, line: 914, baseType: !854, size: 640, offset: 7680)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !855, line: 123, size: 640, elements: !856)
!855 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!856 = !{!857, !863, !864}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !854, file: !855, line: 124, baseType: !858, size: 576)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 576, elements: !254)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !855, line: 108, size: 192, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !859, file: !855, line: 109, baseType: !372, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !859, file: !855, line: 110, baseType: !646, size: 128, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !854, file: !855, line: 125, baseType: !5, size: 32, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !854, file: !855, line: 126, baseType: !5, size: 32, offset: 608)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !515, file: !516, line: 917, baseType: !866, size: 192, offset: 8320)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !855, line: 134, size: 192, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !866, file: !855, line: 135, baseType: !803, size: 128, align: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !866, file: !855, line: 136, baseType: !5, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !515, file: !516, line: 923, baseType: !871, size: 64, offset: 8512)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !516, line: 923, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !515, file: !516, line: 926, baseType: !871, size: 64, offset: 8576)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !515, file: !516, line: 929, baseType: !871, size: 64, offset: 8640)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !515, file: !516, line: 933, baseType: !877, size: 64, offset: 8704)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !516, line: 933, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !515, file: !516, line: 943, baseType: !880, size: 128, offset: 8768)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 128, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 16)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !515, file: !516, line: 945, baseType: !884, size: 64, offset: 8896)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !516, line: 49, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !515, file: !516, line: 956, baseType: !887, size: 64, offset: 8960)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !516, line: 45, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !515, file: !516, line: 959, baseType: !890, size: 64, offset: 9024)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !516, line: 959, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !515, file: !516, line: 962, baseType: !893, size: 64, offset: 9088)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !516, line: 66, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !515, file: !516, line: 966, baseType: !896, size: 64, offset: 9152)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !516, line: 50, flags: DIFlagFwdDecl)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !515, file: !516, line: 969, baseType: !899, size: 64, offset: 9216)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !855, line: 223, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !515, file: !516, line: 970, baseType: !902, size: 64, offset: 9280)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !516, line: 62, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !515, file: !516, line: 971, baseType: !905, size: 64, offset: 9344)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !906, line: 25, baseType: !907)
!906 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !906, line: 23, size: 64, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !907, file: !906, line: 24, baseType: !675, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !515, file: !516, line: 972, baseType: !905, size: 64, offset: 9408)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !515, file: !516, line: 974, baseType: !905, size: 64, offset: 9472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !515, file: !516, line: 975, baseType: !913, size: 192, offset: 9536)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !914, line: 30, size: 192, elements: !915)
!914 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !913, file: !914, line: 31, baseType: !139, size: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !913, file: !914, line: 32, baseType: !905, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !515, file: !516, line: 976, baseType: !303, size: 64, offset: 9728)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !515, file: !516, line: 977, baseType: !300, size: 64, offset: 9792)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !515, file: !516, line: 978, baseType: !5, size: 32, offset: 9856)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !515, file: !516, line: 980, baseType: !806, size: 64, offset: 9920)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !515, file: !516, line: 989, baseType: !923, size: 128, offset: 9984)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !924, line: 35, size: 128, elements: !925)
!924 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !923, file: !924, line: 36, baseType: !155, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !923, file: !924, line: 37, baseType: !392, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !923, file: !924, line: 38, baseType: !929, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !924, line: 23, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !515, file: !516, line: 992, baseType: !372, size: 64, offset: 10112)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !515, file: !516, line: 993, baseType: !372, size: 64, offset: 10176)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !515, file: !516, line: 996, baseType: !212, offset: 10240)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !515, file: !516, line: 999, baseType: !417, offset: 10240)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !515, file: !516, line: 1001, baseType: !936, size: 64, offset: 10240)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !516, line: 636, size: 64, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !516, line: 637, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !515, file: !516, line: 1005, baseType: !649, size: 128, offset: 10304)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !515, file: !516, line: 1007, baseType: !514, size: 64, offset: 10432)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !515, file: !516, line: 1009, baseType: !943, size: 64, offset: 10496)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !516, line: 1009, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !515, file: !516, line: 1043, baseType: !133, size: 64, offset: 10560)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !515, file: !516, line: 1046, baseType: !947, size: 64, offset: 10624)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !516, line: 41, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !515, file: !516, line: 1050, baseType: !950, size: 64, offset: 10688)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !516, line: 42, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !515, file: !516, line: 1054, baseType: !953, size: 64, offset: 10752)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !516, line: 55, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !515, file: !516, line: 1056, baseType: !956, size: 64, offset: 10816)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !516, line: 40, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !515, file: !516, line: 1058, baseType: !959, size: 64, offset: 10880)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !516, line: 47, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !515, file: !516, line: 1061, baseType: !962, size: 64, offset: 10944)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !516, line: 43, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !515, file: !516, line: 1064, baseType: !303, size: 64, offset: 11008)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !515, file: !516, line: 1065, baseType: !966, size: 64, offset: 11072)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !914, line: 14, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !914, line: 12, size: 384, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, scope: !968, file: !914, line: 13, baseType: !971, size: 384)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !968, file: !914, line: 13, size: 384, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !971, file: !914, line: 13, baseType: !155, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !971, file: !914, line: 13, baseType: !155, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !971, file: !914, line: 13, baseType: !155, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !971, file: !914, line: 13, baseType: !977, size: 256, offset: 128)
