; ModuleID = '../bcout/drivers/acpi/spcr.llvm.bc'
source_filename = "drivers/acpi/spcr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_spcr = type <{ %struct.acpi_table_header, i8, [3 x i8], %struct.acpi_generic_address, i8, i8, i32, i8, i8, i8, i8, i8, i8, i16, i16, i8, i8, i8, i32, i8, i32 }>
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>

@acpi_parse_spcr.opts = internal global [64 x i8] zeroinitializer, align 16, !dbg !0
@acpi_disabled = external dso_local global i32, align 4
@.str = private unnamed_addr constant [5 x i8] c"SPCR\00", align 1
@.str.1 = private unnamed_addr constant [37 x i8] c"\016ACPI: SPCR: SPCR table version %d\0A\00", align 1
@.str.2 = private unnamed_addr constant [70 x i8] c"\013ACPI: SPCR: Unexpected SPCR Access Width.  Defaulting to byte size\0A\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"mmio\00", align 1
@.str.4 = private unnamed_addr constant [7 x i8] c"mmio16\00", align 1
@.str.5 = private unnamed_addr constant [7 x i8] c"mmio32\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"io\00", align 1
@.str.7 = private unnamed_addr constant [6 x i8] c"pl011\00", align 1
@.str.8 = private unnamed_addr constant [5 x i8] c"uart\00", align 1
@qdf2400_e44_present = dso_local global i8 0, align 1, !dbg !53

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "opts", scope: !2, file: !3, line: 89, type: !56, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "acpi_parse_spcr", scope: !3, file: !3, line: 87, type: !4, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !55)
!3 = !DIFile(filename: "drivers/acpi/spcr.c", directory: "/home/lizy2001/genbc/linux")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !8, line: 30, baseType: !9)
!8 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!9 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!10 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !18, globals: !52, splitDebugInlining: false, nameTableKind: None)
!11 = !{!12}
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 10, baseType: !14, size: 32, elements: !15)
!13 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!18 = !{!19, !50, !20}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !22, line: 68, size: 288, elements: !23)
!22 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!23 = !{!24, !29, !34, !38, !39, !43, !47, !48, !49}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !21, file: !22, line: 69, baseType: !25, size: 32)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !27)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !{!28}
!28 = !DISubrange(count: 4)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !21, file: !22, line: 70, baseType: !30, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !31, line: 21, baseType: !32)
!31 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !33, line: 27, baseType: !14)
!33 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !21, file: !22, line: 71, baseType: !35, size: 8, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !31, line: 17, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !33, line: 21, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !21, file: !22, line: 72, baseType: !35, size: 8, offset: 72)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !21, file: !22, line: 73, baseType: !40, size: 48, offset: 80)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 48, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !21, file: !22, line: 74, baseType: !44, size: 64, offset: 128)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 8)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !21, file: !22, line: 75, baseType: !30, size: 32, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !21, file: !22, line: 76, baseType: !25, size: 32, offset: 224)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !21, file: !22, line: 77, baseType: !30, size: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !51, line: 805, baseType: !35)
!51 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!0, !53}
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "qdf2400_e44_present", scope: !10, file: !3, line: 22, type: !7, isLocal: false, isDefinition: true)
!55 = !{}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 64)
!59 = !{i32 7, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 2}
!62 = !{i32 1, !"Code Model", i32 2}
!63 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!64 = !DILocalVariable(name: "enable_earlycon", arg: 1, scope: !2, file: !3, line: 87, type: !7)
!65 = !DILocation(line: 87, column: 33, scope: !2)
!66 = !DILocalVariable(name: "enable_console", arg: 2, scope: !2, file: !3, line: 87, type: !7)
!67 = !DILocation(line: 87, column: 55, scope: !2)
!68 = !DILocalVariable(name: "table", scope: !2, file: !3, line: 90, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_spcr", file: !71, line: 102, size: 640, elements: !72)
!71 = !DIFile(filename: "./include/acpi/actbl3.h", directory: "/home/lizy2001/genbc/linux")
!72 = !{!73, !74, !75, !79, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !103, !104, !105, !106, !107, !108, !109}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !70, file: !71, line: 103, baseType: !21, size: 288)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !70, file: !71, line: 104, baseType: !35, size: 8, offset: 288)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !70, file: !71, line: 105, baseType: !76, size: 24, offset: 296)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 24, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "serial_port", scope: !70, file: !71, line: 106, baseType: !80, size: 96, offset: 320)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_generic_address", file: !22, line: 90, size: 96, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !80, file: !22, line: 91, baseType: !35, size: 8)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !80, file: !22, line: 92, baseType: !35, size: 8, offset: 8)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !80, file: !22, line: 93, baseType: !35, size: 8, offset: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "access_width", scope: !80, file: !22, line: 94, baseType: !35, size: 8, offset: 24)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !80, file: !22, line: 95, baseType: !87, size: 64, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !31, line: 23, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !33, line: 31, baseType: !89)
!89 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_type", scope: !70, file: !71, line: 107, baseType: !35, size: 8, offset: 416)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pc_interrupt", scope: !70, file: !71, line: 108, baseType: !35, size: 8, offset: 424)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt", scope: !70, file: !71, line: 109, baseType: !30, size: 32, offset: 432)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !70, file: !71, line: 110, baseType: !35, size: 8, offset: 464)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !70, file: !71, line: 111, baseType: !35, size: 8, offset: 472)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !70, file: !71, line: 112, baseType: !35, size: 8, offset: 480)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !70, file: !71, line: 113, baseType: !35, size: 8, offset: 488)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "terminal_type", scope: !70, file: !71, line: 114, baseType: !35, size: 8, offset: 496)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !70, file: !71, line: 115, baseType: !35, size: 8, offset: 504)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pci_device_id", scope: !70, file: !71, line: 116, baseType: !100, size: 16, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !31, line: 19, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !33, line: 24, baseType: !102)
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pci_vendor_id", scope: !70, file: !71, line: 117, baseType: !100, size: 16, offset: 528)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pci_bus", scope: !70, file: !71, line: 118, baseType: !35, size: 8, offset: 544)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pci_device", scope: !70, file: !71, line: 119, baseType: !35, size: 8, offset: 552)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pci_function", scope: !70, file: !71, line: 120, baseType: !35, size: 8, offset: 560)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pci_flags", scope: !70, file: !71, line: 121, baseType: !30, size: 32, offset: 568)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pci_segment", scope: !70, file: !71, line: 122, baseType: !35, size: 8, offset: 600)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !70, file: !71, line: 123, baseType: !30, size: 32, offset: 608)
!110 = !DILocation(line: 90, column: 26, scope: !2)
!111 = !DILocalVariable(name: "status", scope: !2, file: !3, line: 91, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !51, line: 421, baseType: !30)
!113 = !DILocation(line: 91, column: 14, scope: !2)
!114 = !DILocalVariable(name: "uart", scope: !2, file: !3, line: 92, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!116 = !DILocation(line: 92, column: 8, scope: !2)
!117 = !DILocalVariable(name: "iotype", scope: !2, file: !3, line: 93, type: !115)
!118 = !DILocation(line: 93, column: 8, scope: !2)
!119 = !DILocalVariable(name: "baud_rate", scope: !2, file: !3, line: 94, type: !6)
!120 = !DILocation(line: 94, column: 6, scope: !2)
!121 = !DILocalVariable(name: "err", scope: !2, file: !3, line: 95, type: !6)
!122 = !DILocation(line: 95, column: 6, scope: !2)
!123 = !DILocation(line: 97, column: 6, scope: !124)
!124 = distinct !DILexicalBlock(scope: !2, file: !3, line: 97, column: 6)
!125 = !DILocation(line: 97, column: 6, scope: !2)
!126 = !DILocation(line: 98, column: 3, scope: !124)
!127 = !DILocation(line: 101, column: 5, scope: !2)
!128 = !DILocation(line: 100, column: 11, scope: !2)
!129 = !DILocation(line: 100, column: 9, scope: !2)
!130 = !DILocation(line: 103, column: 6, scope: !131)
!131 = distinct !DILexicalBlock(scope: !2, file: !3, line: 103, column: 6)
!132 = !DILocation(line: 103, column: 6, scope: !2)
!133 = !DILocation(line: 104, column: 3, scope: !131)
!134 = !DILocation(line: 106, column: 6, scope: !135)
!135 = distinct !DILexicalBlock(scope: !2, file: !3, line: 106, column: 6)
!136 = !DILocation(line: 106, column: 13, scope: !135)
!137 = !DILocation(line: 106, column: 20, scope: !135)
!138 = !DILocation(line: 106, column: 29, scope: !135)
!139 = !DILocation(line: 106, column: 6, scope: !2)
!140 = !DILocation(line: 107, column: 3, scope: !135)
!141 = !DILocation(line: 109, column: 6, scope: !142)
!142 = distinct !DILexicalBlock(scope: !2, file: !3, line: 109, column: 6)
!143 = !DILocation(line: 109, column: 13, scope: !142)
!144 = !DILocation(line: 109, column: 25, scope: !142)
!145 = !DILocation(line: 109, column: 34, scope: !142)
!146 = !DILocation(line: 109, column: 6, scope: !2)
!147 = !DILocation(line: 110, column: 11, scope: !148)
!148 = distinct !DILexicalBlock(scope: !142, file: !3, line: 109, column: 67)
!149 = !DILocation(line: 110, column: 3, scope: !148)
!150 = !DILocation(line: 113, column: 4, scope: !151)
!151 = distinct !DILexicalBlock(scope: !148, file: !3, line: 111, column: 39)
!152 = !DILocation(line: 116, column: 11, scope: !151)
!153 = !DILocation(line: 117, column: 4, scope: !151)
!154 = !DILocation(line: 119, column: 11, scope: !151)
!155 = !DILocation(line: 120, column: 4, scope: !151)
!156 = !DILocation(line: 122, column: 11, scope: !151)
!157 = !DILocation(line: 123, column: 4, scope: !151)
!158 = !DILocation(line: 125, column: 2, scope: !148)
!159 = !DILocation(line: 126, column: 10, scope: !142)
!160 = !DILocation(line: 128, column: 10, scope: !2)
!161 = !DILocation(line: 128, column: 17, scope: !2)
!162 = !DILocation(line: 128, column: 2, scope: !2)
!163 = !DILocation(line: 130, column: 10, scope: !164)
!164 = distinct !DILexicalBlock(scope: !2, file: !3, line: 128, column: 33)
!165 = !DILocation(line: 130, column: 3, scope: !164)
!166 = !DILocation(line: 135, column: 8, scope: !164)
!167 = !DILocation(line: 136, column: 3, scope: !164)
!168 = !DILocation(line: 139, column: 8, scope: !164)
!169 = !DILocation(line: 140, column: 3, scope: !164)
!170 = !DILocation(line: 142, column: 7, scope: !164)
!171 = !DILocation(line: 143, column: 3, scope: !164)
!172 = !DILocation(line: 146, column: 10, scope: !2)
!173 = !DILocation(line: 146, column: 17, scope: !2)
!174 = !DILocation(line: 146, column: 2, scope: !2)
