; ModuleID = '../bcout/drivers/acpi/sysfs.llvm.bc'
source_filename = "drivers/acpi/sysfs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }
%struct.spinlock = type { %union.anon.1 }
%union.anon.1 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.kset_uevent_ops = type { i32 (%struct.kset*, %struct.kobject*)*, i8* (%struct.kset*, %struct.kobject*)*, i32 (%struct.kset*, %struct.kobject*, %struct.kobj_uevent_env*)* }
%struct.kobj_uevent_env = type { [3 x i8*], [64 x i8*], i32, [2048 x i8], i32 }

!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobject_action", file: !65, line: 53, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DIEnumerator(name: "KOBJ_ADD", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "KOBJ_REMOVE", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "KOBJ_CHANGE", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "KOBJ_MOVE", value: 3, isUnsigned: true)
!71 = !DIEnumerator(name: "KOBJ_ONLINE", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "KOBJ_OFFLINE", value: 5, isUnsigned: true)
!73 = !DIEnumerator(name: "KOBJ_BIND", value: 6, isUnsigned: true)
!74 = !DIEnumerator(name: "KOBJ_UNBIND", value: 7, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !76, line: 305, baseType: !7, size: 32, elements: !77)
!76 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!77 = !{!78, !79, !80, !81}
!78 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 10, baseType: !7, size: 32, elements: !84)
!83 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!84 = !{!85, !86}
!85 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!87 = !{!88, !90, !96, !97, !98, !1606, !1608, !1610, !1611, !1612, !1613, !176, !2454}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !89, line: 148, baseType: !7)
!89 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !91, line: 421, baseType: !92)
!91 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !93, line: 21, baseType: !94)
!93 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !95, line: 27, baseType: !7)
!95 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_attr", file: !3, line: 328, size: 704, elements: !100)
!100 = !{!101, !1601, !1603, !1604, !1605}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !99, file: !3, line: 329, baseType: !102, size: 448)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !103, line: 168, size: 448, elements: !104)
!103 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!104 = !{!105, !115, !121, !122, !1596, !1597}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !102, file: !103, line: 169, baseType: !106, size: 128)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !103, line: 30, size: 128, elements: !107)
!107 = !{!108, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !103, line: 31, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !106, file: !103, line: 32, baseType: !113, size: 16, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !89, line: 19, baseType: !114)
!114 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !103, line: 170, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !89, line: 55, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !118, line: 72, baseType: !119)
!118 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !118, line: 16, baseType: !120)
!120 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !102, file: !103, line: 171, baseType: !96, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !102, file: !103, line: 172, baseType: !123, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !130, !133, !244, !192, !459, !116}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !89, line: 60, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !118, line: 73, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !118, line: 15, baseType: !129)
!129 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !132, line: 526, flags: DIFlagFwdDecl)
!132 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !65, line: 64, size: 512, elements: !135)
!135 = !{!136, !137, !143, !144, !205, !306, !1586, !1591, !1592, !1593, !1594, !1595}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !134, file: !65, line: 65, baseType: !109, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !134, file: !65, line: 66, baseType: !138, size: 128, offset: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !89, line: 178, size: 128, elements: !139)
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !89, line: 179, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !89, line: 179, baseType: !141, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !134, file: !65, line: 67, baseType: !133, size: 64, offset: 192)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !134, file: !65, line: 68, baseType: !145, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !65, line: 192, size: 704, elements: !147)
!147 = !{!148, !149, !165, !166}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !146, file: !65, line: 193, baseType: !138, size: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !146, file: !65, line: 194, baseType: !150, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !151, line: 83, baseType: !152)
!151 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !151, line: 71, elements: !153)
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 72, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 72, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !155, file: !151, line: 73, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !151, line: 20, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !158, file: !151, line: 21, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !162, line: 25, baseType: !163)
!162 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 25, elements: !164)
!164 = !{}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !146, file: !65, line: 195, baseType: !134, size: 512, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !146, file: !65, line: 196, baseType: !167, size: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !65, line: 156, size: 192, elements: !170)
!170 = !{!171, !177, !182}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !169, file: !65, line: 157, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !145, !133}
!176 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !65, line: 158, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!109, !145, !133}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !169, file: !65, line: 159, baseType: !183, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!176, !145, !133, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !65, line: 148, size: 20736, elements: !189)
!189 = !{!190, !195, !199, !200, !204}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !188, file: !65, line: 149, baseType: !191, size: 192)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 192, elements: !193)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!193 = !{!194}
!194 = !DISubrange(count: 3)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !188, file: !65, line: 150, baseType: !196, size: 4096, offset: 192)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 4096, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !188, file: !65, line: 151, baseType: !176, size: 32, offset: 4288)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !188, file: !65, line: 152, baseType: !201, size: 16384, offset: 4320)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 16384, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 2048)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !188, file: !65, line: 153, baseType: !176, size: 32, offset: 20704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !134, file: !65, line: 69, baseType: !206, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !65, line: 138, size: 448, elements: !208)
!208 = !{!209, !213, !227, !229, !248, !283, !287}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !207, file: !65, line: 139, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !133}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !207, file: !65, line: 140, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !103, line: 230, size: 128, elements: !217)
!217 = !{!218, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !216, file: !103, line: 231, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!126, !133, !222, !192}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !216, file: !103, line: 232, baseType: !224, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!126, !133, !222, !109, !116}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !207, file: !65, line: 141, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !207, file: !65, line: 142, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !103, line: 84, size: 320, elements: !234)
!234 = !{!235, !236, !240, !245, !246}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !103, line: 85, baseType: !109, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !233, file: !103, line: 86, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!113, !133, !222, !176}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !233, file: !103, line: 88, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!113, !133, !244, !176}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "attrs", scope: !233, file: !103, line: 90, baseType: !228, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bin_attrs", scope: !233, file: !103, line: 91, baseType: !247, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !207, file: !65, line: 143, baseType: !249, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{!252, !133}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !6, line: 39, size: 384, elements: !255)
!255 = !{!256, !257, !263, !267, !275, !279}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !6, line: 40, baseType: !5, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !254, file: !6, line: 41, baseType: !258, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !89, line: 30, baseType: !262)
!262 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !254, file: !6, line: 42, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!96}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !254, file: !6, line: 43, baseType: !268, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !273}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !6, line: 19, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !254, file: !6, line: 44, baseType: !276, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{!271}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !254, file: !6, line: 45, baseType: !280, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !96}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !207, file: !65, line: 144, baseType: !284, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!271, !133}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !207, file: !65, line: 145, baseType: !288, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !133, !291, !299}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !293, line: 23, baseType: !294)
!293 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/lizy2001/genbc/linux")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 21, size: 32, elements: !295)
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !294, file: !293, line: 22, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !89, line: 32, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !118, line: 49, baseType: !7)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !293, line: 28, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 26, size: 32, elements: !302)
!302 = !{!303}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !301, file: !293, line: 27, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !89, line: 33, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !118, line: 50, baseType: !7)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !134, file: !65, line: 70, baseType: !307, size: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !309, line: 123, size: 1024, elements: !310)
!309 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/lizy2001/genbc/linux")
!310 = !{!311, !316, !317, !318, !319, !327, !328, !329, !1579, !1580, !1581, !1582, !1583}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !308, file: !309, line: 124, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !89, line: 168, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 166, size: 32, elements: !314)
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !313, file: !89, line: 167, baseType: !176, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !308, file: !309, line: 125, baseType: !312, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !308, file: !309, line: 135, baseType: !307, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !308, file: !309, line: 136, baseType: !109, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !308, file: !309, line: 138, baseType: !320, size: 192, align: 64, offset: 192)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !321, line: 24, size: 192, align: 64, elements: !322)
!321 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!322 = !{!323, !324, !326}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !320, file: !321, line: 25, baseType: !120, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !320, file: !321, line: 26, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !320, file: !321, line: 27, baseType: !325, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !308, file: !309, line: 140, baseType: !271, size: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !308, file: !309, line: 141, baseType: !7, size: 32, offset: 448)
!329 = !DIDerivedType(tag: DW_TAG_member, scope: !308, file: !309, line: 142, baseType: !330, size: 256, offset: 512)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !308, file: !309, line: 142, size: 256, elements: !331)
!331 = !{!332, !395, !399}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !330, file: !309, line: 143, baseType: !333, size: 192)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !309, line: 91, size: 192, elements: !334)
!334 = !{!335, !336, !340}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !333, file: !309, line: 92, baseType: !120, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !333, file: !309, line: 94, baseType: !337, size: 64, offset: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !321, line: 31, size: 64, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !337, file: !321, line: 32, baseType: !325, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !333, file: !309, line: 100, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !309, line: 180, size: 704, elements: !343)
!343 = !{!344, !345, !346, !359, !360, !361, !387, !388}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !342, file: !309, line: 182, baseType: !307, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !342, file: !309, line: 183, baseType: !7, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !342, file: !309, line: 186, baseType: !347, size: 192, offset: 128)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !348, line: 19, size: 192, elements: !349)
!348 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/lizy2001/genbc/linux")
!349 = !{!350, !357, !358}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !347, file: !348, line: 20, baseType: !351, size: 128)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !352, line: 292, size: 128, elements: !353)
!352 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/lizy2001/genbc/linux")
!353 = !{!354, !355, !356}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !351, file: !352, line: 293, baseType: !150)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !351, file: !352, line: 295, baseType: !88, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !351, file: !352, line: 296, baseType: !96, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !347, file: !348, line: 21, baseType: !7, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !347, file: !348, line: 22, baseType: !7, size: 32, offset: 160)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "last_id_lowbits", scope: !342, file: !309, line: 187, baseType: !92, size: 32, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id_highbits", scope: !342, file: !309, line: 188, baseType: !92, size: 32, offset: 352)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !342, file: !309, line: 189, baseType: !362, size: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !309, line: 168, size: 320, elements: !364)
!364 = !{!365, !371, !375, !379, !383}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !363, file: !309, line: 169, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!176, !369, !341}
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !132, line: 539, flags: DIFlagFwdDecl)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !363, file: !309, line: 171, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!176, !307, !109, !113}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !363, file: !309, line: 173, baseType: !376, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!176, !307}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !363, file: !309, line: 174, baseType: !380, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!176, !307, !307, !109}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !363, file: !309, line: 176, baseType: !384, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!176, !369, !307, !341}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "supers", scope: !342, file: !309, line: 192, baseType: !138, size: 128, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "deactivate_waitq", scope: !342, file: !309, line: 194, baseType: !389, size: 128, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !390, line: 40, baseType: !391)
!390 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !390, line: 36, size: 128, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !391, file: !390, line: 37, baseType: !150)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !391, file: !390, line: 38, baseType: !138, size: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !330, file: !309, line: 144, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_symlink", file: !309, line: 103, size: 64, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "target_kn", scope: !396, file: !309, line: 104, baseType: !307, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !330, file: !309, line: 145, baseType: !400, size: 256)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_attr", file: !309, line: 107, size: 256, elements: !401)
!401 = !{!402, !1574, !1577, !1578}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !400, file: !309, line: 108, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_ops", file: !309, line: 217, size: 768, elements: !406)
!406 = !{!407, !446, !450, !454, !461, !465, !469, !473, !474, !475, !476, !484}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !405, file: !309, line: 222, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!176, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_open_file", file: !309, line: 197, size: 1088, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !434, !435, !436, !437, !438, !439, !440, !441}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !412, file: !309, line: 199, baseType: !307, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !412, file: !309, line: 200, baseType: !130, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "seq_file", scope: !412, file: !309, line: 201, baseType: !369, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !412, file: !309, line: 202, baseType: !96, size: 64, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !412, file: !309, line: 205, baseType: !419, size: 192, offset: 256)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !420, line: 53, size: 192, elements: !421)
!420 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!421 = !{!422, !432, !433}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !419, file: !420, line: 54, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !424, line: 13, baseType: !425)
!424 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !89, line: 175, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 173, size: 64, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !426, file: !89, line: 174, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !93, line: 22, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !95, line: 30, baseType: !431)
!431 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !419, file: !420, line: 55, baseType: !150, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !419, file: !420, line: 59, baseType: !138, size: 128, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_mutex", scope: !412, file: !309, line: 206, baseType: !419, size: 192, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !412, file: !309, line: 207, baseType: !176, size: 32, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !412, file: !309, line: 208, baseType: !138, size: 128, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc_buf", scope: !412, file: !309, line: 209, baseType: !192, size: 64, offset: 832)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !412, file: !309, line: 211, baseType: !116, size: 64, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mmapped", scope: !412, file: !309, line: 212, baseType: !261, size: 1, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "released", scope: !412, file: !309, line: 213, baseType: !261, size: 1, offset: 961, flags: DIFlagBitField, extraData: i64 960)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !412, file: !309, line: 214, baseType: !442, size: 64, offset: 1024)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !445, line: 356, flags: DIFlagFwdDecl)
!445 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!446 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !405, file: !309, line: 223, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !411}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "seq_show", scope: !405, file: !309, line: 236, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!176, !369, !96}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "seq_start", scope: !405, file: !309, line: 238, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!96, !369, !458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !89, line: 46, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !118, line: 88, baseType: !431)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "seq_next", scope: !405, file: !309, line: 239, baseType: !462, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DISubroutineType(types: !464)
!464 = !{!96, !369, !96, !458}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "seq_stop", scope: !405, file: !309, line: 240, baseType: !466, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !369, !96}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !405, file: !309, line: 242, baseType: !470, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DISubroutineType(types: !472)
!472 = !{!126, !411, !192, !116, !459}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_write_len", scope: !405, file: !309, line: 252, baseType: !116, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prealloc", scope: !405, file: !309, line: 259, baseType: !261, size: 8, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !405, file: !309, line: 260, baseType: !470, size: 64, offset: 576)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !405, file: !309, line: 263, baseType: !477, size: 64, offset: 640)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DISubroutineType(types: !479)
!479 = !{!480, !411, !482}
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__poll_t", file: !481, line: 52, baseType: !7)
!481 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "poll_table_struct", file: !309, line: 27, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !405, file: !309, line: 266, baseType: !485, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!176, !411, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !445, line: 305, size: 1472, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !1551, !1557, !1558, !1563, !1564, !1567, !1568, !1569, !1570, !1571, !1572}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !489, file: !445, line: 308, baseType: !120, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !489, file: !445, line: 309, baseType: !120, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !489, file: !445, line: 313, baseType: !488, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !489, file: !445, line: 313, baseType: !488, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !489, file: !445, line: 315, baseType: !320, size: 192, align: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !489, file: !445, line: 323, baseType: !120, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !489, file: !445, line: 327, baseType: !498, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !445, line: 388, size: 7296, elements: !500)
!500 = !{!501, !1547}
!501 = !DIDerivedType(tag: DW_TAG_member, scope: !499, file: !445, line: 389, baseType: !502, size: 7296)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !445, line: 389, size: 7296, elements: !503)
!503 = !{!504, !505, !506, !510, !514, !515, !516, !517, !518, !526, !527, !528, !529, !530, !531, !532, !533, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !568, !576, !579, !621, !622, !1518, !1519, !1522, !1525, !1526, !1529, !1530, !1531, !1534, !1546}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !502, file: !445, line: 390, baseType: !488, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !502, file: !445, line: 391, baseType: !337, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !502, file: !445, line: 392, baseType: !507, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !93, line: 23, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !95, line: 31, baseType: !509)
!509 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !502, file: !445, line: 394, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{!120, !130, !120, !120, !120, !120}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !502, file: !445, line: 398, baseType: !120, size: 64, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !502, file: !445, line: 399, baseType: !120, size: 64, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !502, file: !445, line: 405, baseType: !120, size: 64, offset: 384)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !502, file: !445, line: 406, baseType: !120, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !502, file: !445, line: 407, baseType: !519, size: 64, offset: 512)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !132, line: 286, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 286, size: 64, elements: !522)
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !521, file: !132, line: 286, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !525, line: 18, baseType: !120)
!525 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!526 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !502, file: !445, line: 416, baseType: !312, size: 32, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !502, file: !445, line: 428, baseType: !312, size: 32, offset: 608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !502, file: !445, line: 437, baseType: !312, size: 32, offset: 640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !502, file: !445, line: 447, baseType: !312, size: 32, offset: 672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !502, file: !445, line: 450, baseType: !423, size: 64, offset: 704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !502, file: !445, line: 452, baseType: !176, size: 32, offset: 768)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !502, file: !445, line: 454, baseType: !150, offset: 800)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !502, file: !445, line: 457, baseType: !534, size: 256, offset: 832)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !535, line: 35, size: 256, elements: !536)
!535 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!536 = !{!537, !538, !539, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !534, file: !535, line: 36, baseType: !423, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !534, file: !535, line: 42, baseType: !423, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !534, file: !535, line: 46, baseType: !540, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !151, line: 29, baseType: !158)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !534, file: !535, line: 47, baseType: !138, size: 128, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !502, file: !445, line: 459, baseType: !138, size: 128, offset: 1088)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !502, file: !445, line: 466, baseType: !120, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !502, file: !445, line: 467, baseType: !120, size: 64, offset: 1280)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !502, file: !445, line: 469, baseType: !120, size: 64, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !502, file: !445, line: 470, baseType: !120, size: 64, offset: 1408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !502, file: !445, line: 471, baseType: !425, size: 64, offset: 1472)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !502, file: !445, line: 472, baseType: !120, size: 64, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !502, file: !445, line: 473, baseType: !120, size: 64, offset: 1600)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !502, file: !445, line: 474, baseType: !120, size: 64, offset: 1664)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !502, file: !445, line: 475, baseType: !120, size: 64, offset: 1728)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !502, file: !445, line: 477, baseType: !150, offset: 1792)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !502, file: !445, line: 478, baseType: !120, size: 64, offset: 1792)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !502, file: !445, line: 478, baseType: !120, size: 64, offset: 1856)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !502, file: !445, line: 478, baseType: !120, size: 64, offset: 1920)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !502, file: !445, line: 478, baseType: !120, size: 64, offset: 1984)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !502, file: !445, line: 479, baseType: !120, size: 64, offset: 2048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !502, file: !445, line: 479, baseType: !120, size: 64, offset: 2112)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !502, file: !445, line: 479, baseType: !120, size: 64, offset: 2176)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !502, file: !445, line: 480, baseType: !120, size: 64, offset: 2240)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !502, file: !445, line: 480, baseType: !120, size: 64, offset: 2304)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !502, file: !445, line: 480, baseType: !120, size: 64, offset: 2368)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !502, file: !445, line: 480, baseType: !120, size: 64, offset: 2432)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !502, file: !445, line: 482, baseType: !565, size: 2816, offset: 2496)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 2816, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 44)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !502, file: !445, line: 488, baseType: !569, size: 256, offset: 5312)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !570, line: 60, size: 256, elements: !571)
!570 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !569, file: !570, line: 61, baseType: !573, size: 256)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 256, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 4)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !502, file: !445, line: 490, baseType: !577, size: 64, offset: 5568)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !445, line: 490, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !502, file: !445, line: 493, baseType: !580, size: 896, offset: 5632)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !581, line: 53, baseType: !582)
!581 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 13, size: 896, elements: !583)
!583 = !{!584, !585, !586, !587, !590, !591, !592, !593, !613, !614, !617}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !582, file: !581, line: 18, baseType: !507, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !582, file: !581, line: 28, baseType: !425, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !582, file: !581, line: 31, baseType: !534, size: 256, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !582, file: !581, line: 32, baseType: !588, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !581, line: 32, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !582, file: !581, line: 37, baseType: !114, size: 16, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !582, file: !581, line: 40, baseType: !419, size: 192, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !582, file: !581, line: 41, baseType: !96, size: 64, offset: 704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !582, file: !581, line: 42, baseType: !594, size: 64, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !597, line: 13, size: 896, elements: !598)
!597 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !596, file: !597, line: 14, baseType: !96, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !596, file: !597, line: 15, baseType: !120, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !596, file: !597, line: 17, baseType: !120, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !596, file: !597, line: 17, baseType: !120, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !596, file: !597, line: 19, baseType: !129, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !596, file: !597, line: 21, baseType: !129, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !596, file: !597, line: 22, baseType: !129, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !596, file: !597, line: 23, baseType: !129, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !596, file: !597, line: 24, baseType: !129, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !596, file: !597, line: 25, baseType: !129, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !596, file: !597, line: 26, baseType: !129, size: 64, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !596, file: !597, line: 27, baseType: !129, size: 64, offset: 704)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !596, file: !597, line: 28, baseType: !129, size: 64, offset: 768)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !596, file: !597, line: 29, baseType: !129, size: 64, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !582, file: !581, line: 44, baseType: !312, size: 32, offset: 832)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !582, file: !581, line: 50, baseType: !615, size: 16, offset: 864)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !93, line: 19, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !95, line: 24, baseType: !114)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !582, file: !581, line: 51, baseType: !618, size: 16, offset: 880)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !93, line: 18, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !95, line: 23, baseType: !620)
!620 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !445, line: 495, baseType: !120, size: 64, offset: 6528)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !502, file: !445, line: 497, baseType: !623, size: 64, offset: 6592)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !445, line: 381, size: 384, elements: !625)
!625 = !{!626, !627, !1517}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !624, file: !445, line: 382, baseType: !312, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !624, file: !445, line: 383, baseType: !628, size: 128, offset: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !445, line: 376, size: 128, elements: !629)
!629 = !{!630, !1515}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !628, file: !445, line: 377, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !633, line: 640, size: 48640, elements: !634)
!633 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!634 = !{!635, !641, !643, !644, !650, !651, !652, !653, !654, !655, !656, !657, !661, !679, !690, !785, !786, !787, !798, !799, !801, !802, !803, !804, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !882, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !932, !934, !935, !936, !948, !950, !951, !952, !953, !954, !960, !961, !962, !963, !964, !965, !966, !978, !983, !987, !988, !989, !992, !996, !999, !1002, !1005, !1008, !1011, !1014, !1017, !1023, !1024, !1025, !1031, !1032, !1033, !1034, !1035, !1044, !1045, !1046, !1047, !1048, !1053, !1054, !1055, !1058, !1059, !1062, !1065, !1068, !1071, !1074, !1077, !1078, !1157, !1160, !1163, !1164, !1167, !1168, !1169, !1175, !1176, !1177, !1190, !1191, !1192, !1202, !1207, !1210, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !632, file: !633, line: 646, baseType: !636, size: 128)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !637, line: 56, size: 128, elements: !638)
!637 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !636, file: !637, line: 57, baseType: !120, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !636, file: !637, line: 58, baseType: !92, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !632, file: !633, line: 649, baseType: !642, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !129)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !632, file: !633, line: 657, baseType: !96, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !632, file: !633, line: 658, baseType: !645, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !646, line: 113, baseType: !647)
!646 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !646, line: 111, size: 32, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !647, file: !646, line: 112, baseType: !312, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !633, line: 660, baseType: !7, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !632, file: !633, line: 661, baseType: !7, size: 32, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !632, file: !633, line: 684, baseType: !176, size: 32, offset: 352)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !632, file: !633, line: 686, baseType: !176, size: 32, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !632, file: !633, line: 687, baseType: !176, size: 32, offset: 416)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !632, file: !633, line: 688, baseType: !176, size: 32, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !632, file: !633, line: 689, baseType: !7, size: 32, offset: 480)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !632, file: !633, line: 691, baseType: !658, size: 64, offset: 512)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !633, line: 691, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !632, file: !633, line: 692, baseType: !662, size: 832, offset: 576)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !633, line: 451, size: 832, elements: !663)
!663 = !{!664, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !662, file: !633, line: 453, baseType: !665, size: 128)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !633, line: 325, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !665, file: !633, line: 326, baseType: !120, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !665, file: !633, line: 327, baseType: !92, size: 32, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !662, file: !633, line: 454, baseType: !320, size: 192, align: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !662, file: !633, line: 455, baseType: !138, size: 128, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !662, file: !633, line: 456, baseType: !7, size: 32, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !662, file: !633, line: 458, baseType: !507, size: 64, offset: 512)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !662, file: !633, line: 459, baseType: !507, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !662, file: !633, line: 460, baseType: !507, size: 64, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !662, file: !633, line: 461, baseType: !507, size: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !662, file: !633, line: 463, baseType: !507, size: 64, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !662, file: !633, line: 465, baseType: !678, offset: 832)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !633, line: 415, elements: !164)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !632, file: !633, line: 693, baseType: !680, size: 384, offset: 1408)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !633, line: 489, size: 384, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !680, file: !633, line: 490, baseType: !138, size: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !680, file: !633, line: 491, baseType: !120, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !680, file: !633, line: 492, baseType: !120, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !680, file: !633, line: 493, baseType: !7, size: 32, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !680, file: !633, line: 494, baseType: !114, size: 16, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !680, file: !633, line: 495, baseType: !114, size: 16, offset: 304)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !680, file: !633, line: 497, baseType: !689, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !632, file: !633, line: 697, baseType: !691, size: 1792, offset: 1792)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !633, line: 507, size: 1792, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !782, !783}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !691, file: !633, line: 508, baseType: !320, size: 192, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !691, file: !633, line: 515, baseType: !507, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !691, file: !633, line: 516, baseType: !507, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !691, file: !633, line: 517, baseType: !507, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !691, file: !633, line: 518, baseType: !507, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !691, file: !633, line: 519, baseType: !507, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !691, file: !633, line: 526, baseType: !429, size: 64, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !691, file: !633, line: 527, baseType: !507, size: 64, offset: 576)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !633, line: 528, baseType: !7, size: 32, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !691, file: !633, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !691, file: !633, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !691, file: !633, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !691, file: !633, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !691, file: !633, line: 563, baseType: !707, size: 512, offset: 704)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !13, line: 118, size: 512, elements: !708)
!708 = !{!709, !717, !718, !723, !775, !779, !780, !781}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !13, line: 119, baseType: !710, size: 256)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !711, line: 9, size: 256, elements: !712)
!711 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !710, file: !711, line: 10, baseType: !320, size: 192, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !710, file: !711, line: 11, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !716, line: 29, baseType: !429)
!716 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !707, file: !13, line: 120, baseType: !715, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !707, file: !13, line: 121, baseType: !719, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!12, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !707, file: !13, line: 122, baseType: !724, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !13, line: 159, size: 512, align: 512, elements: !726)
!726 = !{!727, !747, !748, !751, !761, !762, !770, !774}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !725, file: !13, line: 160, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !13, line: 214, size: 4608, align: 512, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !729, file: !13, line: 215, baseType: !540)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !729, file: !13, line: 216, baseType: !7, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !729, file: !13, line: 217, baseType: !7, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !729, file: !13, line: 218, baseType: !7, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !729, file: !13, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !729, file: !13, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !729, file: !13, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !729, file: !13, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !729, file: !13, line: 233, baseType: !715, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !729, file: !13, line: 234, baseType: !722, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !729, file: !13, line: 235, baseType: !715, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !729, file: !13, line: 236, baseType: !722, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !729, file: !13, line: 237, baseType: !744, size: 4096, offset: 512)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 4096, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !725, file: !13, line: 161, baseType: !7, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !725, file: !13, line: 162, baseType: !749, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !89, line: 27, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !118, line: 96, baseType: !176)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !725, file: !13, line: 163, baseType: !752, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !753, line: 276, baseType: !754)
!753 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !753, line: 276, size: 32, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !754, file: !753, line: 276, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !753, line: 70, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !753, line: 65, size: 32, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !758, file: !753, line: 66, baseType: !7, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !725, file: !13, line: 164, baseType: !722, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !725, file: !13, line: 165, baseType: !763, size: 128, offset: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !711, line: 14, size: 128, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !763, file: !711, line: 15, baseType: !766, size: 128)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !321, line: 125, size: 128, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !766, file: !321, line: 126, baseType: !337, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !766, file: !321, line: 127, baseType: !325, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !725, file: !13, line: 166, baseType: !771, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!715}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !725, file: !13, line: 167, baseType: !715, size: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !707, file: !13, line: 123, baseType: !776, size: 8, offset: 448)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !93, line: 17, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !95, line: 21, baseType: !778)
!778 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !707, file: !13, line: 124, baseType: !776, size: 8, offset: 456)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !707, file: !13, line: 125, baseType: !776, size: 8, offset: 464)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !707, file: !13, line: 126, baseType: !776, size: 8, offset: 472)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !691, file: !633, line: 572, baseType: !707, size: 512, offset: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !691, file: !633, line: 580, baseType: !784, size: 64, offset: 1728)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !632, file: !633, line: 721, baseType: !7, size: 32, offset: 3584)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !632, file: !633, line: 722, baseType: !176, size: 32, offset: 3616)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !632, file: !633, line: 723, baseType: !788, size: 64, offset: 3648)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !791, line: 17, baseType: !792)
!791 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !791, line: 17, size: 64, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !792, file: !791, line: 17, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 1)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !632, file: !633, line: 724, baseType: !790, size: 64, offset: 3712)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !632, file: !633, line: 749, baseType: !800, offset: 3776)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !633, line: 290, elements: !164)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !632, file: !633, line: 751, baseType: !138, size: 128, offset: 3776)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !632, file: !633, line: 757, baseType: !498, size: 64, offset: 3904)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !632, file: !633, line: 758, baseType: !498, size: 64, offset: 3968)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !632, file: !633, line: 761, baseType: !805, size: 320, offset: 4032)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !570, line: 34, size: 320, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !805, file: !570, line: 35, baseType: !507, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !805, file: !570, line: 36, baseType: !809, size: 256, offset: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 256, elements: !574)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !632, file: !633, line: 766, baseType: !176, size: 32, offset: 4352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !632, file: !633, line: 767, baseType: !176, size: 32, offset: 4384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !632, file: !633, line: 768, baseType: !176, size: 32, offset: 4416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !632, file: !633, line: 770, baseType: !176, size: 32, offset: 4448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !632, file: !633, line: 772, baseType: !120, size: 64, offset: 4480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !632, file: !633, line: 775, baseType: !7, size: 32, offset: 4544)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !632, file: !633, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !632, file: !633, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !632, file: !633, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !632, file: !633, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !632, file: !633, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !632, file: !633, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !632, file: !633, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !632, file: !633, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !632, file: !633, line: 831, baseType: !120, size: 64, offset: 4672)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !632, file: !633, line: 833, baseType: !826, size: 384, offset: 4736)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !18, line: 25, size: 384, elements: !827)
!827 = !{!828, !833}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !826, file: !18, line: 26, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!129, !832}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, scope: !826, file: !18, line: 27, baseType: !834, size: 320, offset: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !826, file: !18, line: 27, size: 320, elements: !835)
!835 = !{!836, !845, !872}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !834, file: !18, line: 36, baseType: !837, size: 320)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !834, file: !18, line: 29, size: 320, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !837, file: !18, line: 30, baseType: !97, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !837, file: !18, line: 31, baseType: !92, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !837, file: !18, line: 32, baseType: !92, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !837, file: !18, line: 33, baseType: !92, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !837, file: !18, line: 34, baseType: !507, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !837, file: !18, line: 35, baseType: !97, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !834, file: !18, line: 46, baseType: !846, size: 192)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !834, file: !18, line: 38, size: 192, elements: !847)
!847 = !{!848, !849, !850, !871}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !846, file: !18, line: 39, baseType: !749, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !846, file: !18, line: 40, baseType: !17, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, scope: !846, file: !18, line: 41, baseType: !851, size: 64, offset: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !846, file: !18, line: 41, size: 64, elements: !852)
!852 = !{!853, !861}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !851, file: !18, line: 42, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !856, line: 7, size: 128, elements: !857)
!856 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!857 = !{!858, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !855, file: !856, line: 8, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !118, line: 93, baseType: !431)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !855, file: !856, line: 9, baseType: !431, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !851, file: !18, line: 43, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !864, line: 7, size: 64, elements: !865)
!864 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!865 = !{!866, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !863, file: !864, line: 8, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !864, line: 5, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !93, line: 20, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !95, line: 26, baseType: !176)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !863, file: !864, line: 9, baseType: !868, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !846, file: !18, line: 45, baseType: !507, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !834, file: !18, line: 54, baseType: !873, size: 256)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !834, file: !18, line: 48, size: 256, elements: !874)
!874 = !{!875, !878, !879, !880, !881}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !873, file: !18, line: 49, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !18, line: 14, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !873, file: !18, line: 50, baseType: !176, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !873, file: !18, line: 51, baseType: !176, size: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !873, file: !18, line: 52, baseType: !120, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !873, file: !18, line: 53, baseType: !120, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !632, file: !633, line: 835, baseType: !883, size: 32, offset: 5120)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !89, line: 22, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !118, line: 28, baseType: !176)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !632, file: !633, line: 836, baseType: !883, size: 32, offset: 5152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !632, file: !633, line: 840, baseType: !120, size: 64, offset: 5184)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !632, file: !633, line: 849, baseType: !631, size: 64, offset: 5248)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !632, file: !633, line: 852, baseType: !631, size: 64, offset: 5312)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !632, file: !633, line: 857, baseType: !138, size: 128, offset: 5376)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !632, file: !633, line: 858, baseType: !138, size: 128, offset: 5504)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !632, file: !633, line: 859, baseType: !631, size: 64, offset: 5632)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !632, file: !633, line: 867, baseType: !138, size: 128, offset: 5696)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !632, file: !633, line: 868, baseType: !138, size: 128, offset: 5824)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !632, file: !633, line: 871, baseType: !895, size: 64, offset: 5952)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !897, line: 59, size: 768, elements: !898)
!897 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!898 = !{!899, !900, !901, !902, !913, !914, !915, !924}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !896, file: !897, line: 61, baseType: !645, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !896, file: !897, line: 62, baseType: !7, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !896, file: !897, line: 63, baseType: !150, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !896, file: !897, line: 65, baseType: !903, size: 256, offset: 64)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 256, elements: !574)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !89, line: 182, size: 64, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !904, file: !89, line: 183, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !89, line: 186, size: 128, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !908, file: !89, line: 187, baseType: !907, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !908, file: !89, line: 187, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !896, file: !897, line: 66, baseType: !904, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !896, file: !897, line: 68, baseType: !389, size: 128, offset: 384)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !896, file: !897, line: 69, baseType: !916, size: 128, align: 64, offset: 512)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !89, line: 216, size: 128, align: 64, elements: !917)
!917 = !{!918, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !916, file: !89, line: 217, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !916, file: !89, line: 218, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !919}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !896, file: !897, line: 70, baseType: !925, size: 128, offset: 640)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, elements: !796)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !897, line: 54, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !926, file: !897, line: 55, baseType: !176, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !926, file: !897, line: 56, baseType: !930, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !897, line: 56, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !632, file: !633, line: 872, baseType: !933, size: 512, offset: 6016)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 512, elements: !574)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !632, file: !633, line: 873, baseType: !138, size: 128, offset: 6528)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !632, file: !633, line: 874, baseType: !138, size: 128, offset: 6656)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !632, file: !633, line: 876, baseType: !937, size: 64, offset: 6784)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !939, line: 26, size: 192, elements: !940)
!939 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !938, file: !939, line: 27, baseType: !7, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !938, file: !939, line: 28, baseType: !943, size: 128, offset: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !944, line: 43, size: 128, elements: !945)
!944 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !943, file: !944, line: 44, baseType: !540)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !943, file: !944, line: 45, baseType: !138, size: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !632, file: !633, line: 879, baseType: !949, size: 64, offset: 6848)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !632, file: !633, line: 882, baseType: !949, size: 64, offset: 6912)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !632, file: !633, line: 884, baseType: !507, size: 64, offset: 6976)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !632, file: !633, line: 885, baseType: !507, size: 64, offset: 7040)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !632, file: !633, line: 890, baseType: !507, size: 64, offset: 7104)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !632, file: !633, line: 891, baseType: !955, size: 128, offset: 7168)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !633, line: 242, size: 128, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !955, file: !633, line: 244, baseType: !507, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !955, file: !633, line: 245, baseType: !507, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !955, file: !633, line: 246, baseType: !540, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !632, file: !633, line: 900, baseType: !120, size: 64, offset: 7296)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !632, file: !633, line: 901, baseType: !120, size: 64, offset: 7360)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !632, file: !633, line: 904, baseType: !507, size: 64, offset: 7424)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !632, file: !633, line: 907, baseType: !507, size: 64, offset: 7488)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !632, file: !633, line: 910, baseType: !120, size: 64, offset: 7552)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !632, file: !633, line: 911, baseType: !120, size: 64, offset: 7616)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !632, file: !633, line: 914, baseType: !967, size: 640, offset: 7680)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !968, line: 123, size: 640, elements: !969)
!968 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!969 = !{!970, !976, !977}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !967, file: !968, line: 124, baseType: !971, size: 576)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 576, elements: !193)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !968, line: 108, size: 192, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !972, file: !968, line: 109, baseType: !507, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !972, file: !968, line: 110, baseType: !763, size: 128, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !967, file: !968, line: 125, baseType: !7, size: 32, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !967, file: !968, line: 126, baseType: !7, size: 32, offset: 608)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !632, file: !633, line: 917, baseType: !979, size: 192, offset: 8320)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !968, line: 134, size: 192, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !979, file: !968, line: 135, baseType: !916, size: 128, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !979, file: !968, line: 136, baseType: !7, size: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !632, file: !633, line: 923, baseType: !984, size: 64, offset: 8512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !633, line: 923, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !632, file: !633, line: 926, baseType: !984, size: 64, offset: 8576)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !632, file: !633, line: 929, baseType: !984, size: 64, offset: 8640)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !632, file: !633, line: 933, baseType: !990, size: 64, offset: 8704)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !633, line: 933, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !632, file: !633, line: 943, baseType: !993, size: 128, offset: 8768)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !111, size: 128, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 16)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !632, file: !633, line: 945, baseType: !997, size: 64, offset: 8896)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !633, line: 49, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !632, file: !633, line: 956, baseType: !1000, size: 64, offset: 8960)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !633, line: 45, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !632, file: !633, line: 959, baseType: !1003, size: 64, offset: 9024)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !633, line: 959, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !632, file: !633, line: 962, baseType: !1006, size: 64, offset: 9088)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !633, line: 66, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !632, file: !633, line: 966, baseType: !1009, size: 64, offset: 9152)
