; ModuleID = '../bcout/drivers/acpi/tables.llvm.bc'
source_filename = "drivers/acpi/tables.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%union.acpi_name_union = type { i32 }
%struct.obs_kernel_param = type { i8*, i32 (i8*)*, i32 }
%struct.acpi_subtable_header = type { i8, i8 }
%struct.acpi_madt_local_apic = type { %struct.acpi_subtable_header, i8, i8, i32 }
%struct.acpi_madt_local_x2apic = type { %struct.acpi_subtable_header, i16, i32, i32, i32 }
%struct.acpi_madt_io_apic = type { %struct.acpi_subtable_header, i8, i8, i32, i32 }
%struct.acpi_madt_interrupt_override = type <{ %struct.acpi_subtable_header, i8, i8, i32, i16 }>
%struct.acpi_madt_nmi_source = type { %struct.acpi_subtable_header, i16, i32 }
%struct.acpi_madt_local_apic_nmi = type <{ %struct.acpi_subtable_header, i8, i16, i8 }>
%struct.acpi_madt_local_x2apic_nmi = type { %struct.acpi_subtable_header, i16, i32, i8, [3 x i8] }
%struct.acpi_madt_local_apic_override = type <{ %struct.acpi_subtable_header, i16, i64 }>
%struct.acpi_madt_io_sapic = type { %struct.acpi_subtable_header, i8, i8, i32, i64 }
%struct.acpi_madt_local_sapic = type <{ %struct.acpi_subtable_header, i8, i8, i8, [3 x i8], i32, i32, [1 x i8] }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mps_inti_flags_polarity", scope: !2, file: !3, line: 32, type: !266, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !40, globals: !200, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/tables.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !26, !30, !35}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acpi_madt_type", file: !6, line: 503, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/acpi/actbl2.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!9 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_APIC", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_MADT_TYPE_IO_APIC", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_MADT_TYPE_INTERRUPT_OVERRIDE", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "ACPI_MADT_TYPE_NMI_SOURCE", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_APIC_NMI", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_APIC_OVERRIDE", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "ACPI_MADT_TYPE_IO_SAPIC", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_SAPIC", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "ACPI_MADT_TYPE_INTERRUPT_SOURCE", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_X2APIC", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "ACPI_MADT_TYPE_LOCAL_X2APIC_NMI", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_INTERRUPT", value: 11, isUnsigned: true)
!21 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_DISTRIBUTOR", value: 12, isUnsigned: true)
!22 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_MSI_FRAME", value: 13, isUnsigned: true)
!23 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_REDISTRIBUTOR", value: 14, isUnsigned: true)
!24 = !DIEnumerator(name: "ACPI_MADT_TYPE_GENERIC_TRANSLATOR", value: 15, isUnsigned: true)
!25 = !DIEnumerator(name: "ACPI_MADT_TYPE_RESERVED", value: 16, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acpi_subtable_type", file: !3, line: 39, baseType: !7, size: 32, elements: !27)
!27 = !{!28, !29}
!28 = !DIEnumerator(name: "ACPI_SUBTABLE_COMMON", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "ACPI_SUBTABLE_HMAT", value: 1, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lockdep_ok", file: !31, line: 561, baseType: !7, size: 32, elements: !32)
!31 = !DIFile(filename: "./include/linux/kernel.h", directory: "/home/lizy2001/genbc/linux")
!32 = !{!33, !34}
!33 = !DIEnumerator(name: "LOCKDEP_STILL_OK", value: 0, isUnsigned: true)
!34 = !DIEnumerator(name: "LOCKDEP_NOW_UNRELIABLE", value: 1, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 10, baseType: !7, size: 32, elements: !37)
!36 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!37 = !{!38, !39}
!38 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!39 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!40 = !{!41, !60, !71, !79, !87, !93, !100, !111, !120, !121, !122, !130, !145, !156, !177, !187, !189}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_apic", file: !6, line: 529, size: 64, elements: !43)
!43 = !{!44, !55, !56, !57}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !42, file: !6, line: 530, baseType: !45, size: 16)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_subtable_header", file: !46, line: 90, size: 16, elements: !47)
!46 = !DIFile(filename: "./include/acpi/actbl1.h", directory: "/home/lizy2001/genbc/linux")
!47 = !{!48, !54}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !45, file: !46, line: 91, baseType: !49, size: 8)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !50, line: 17, baseType: !51)
!50 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !52, line: 21, baseType: !53)
!52 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!53 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !45, file: !46, line: 92, baseType: !49, size: 8, offset: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", scope: !42, file: !6, line: 531, baseType: !49, size: 8, offset: 16)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !6, line: 532, baseType: !49, size: 8, offset: 24)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_flags", scope: !42, file: !6, line: 533, baseType: !58, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !50, line: 21, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !52, line: 27, baseType: !7)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_x2apic", file: !6, line: 623, size: 128, elements: !62)
!62 = !{!63, !64, !68, !69, !70}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !61, file: !6, line: 624, baseType: !45, size: 16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !61, file: !6, line: 625, baseType: !65, size: 16, offset: 16)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !50, line: 19, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !52, line: 24, baseType: !67)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "local_apic_id", scope: !61, file: !6, line: 626, baseType: !58, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_flags", scope: !61, file: !6, line: 627, baseType: !58, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !61, file: !6, line: 628, baseType: !58, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_io_apic", file: !6, line: 538, size: 96, elements: !73)
!73 = !{!74, !75, !76, !77, !78}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !72, file: !6, line: 539, baseType: !45, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !72, file: !6, line: 540, baseType: !49, size: 8, offset: 16)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !72, file: !6, line: 541, baseType: !49, size: 8, offset: 24)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !72, file: !6, line: 542, baseType: !58, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq_base", scope: !72, file: !6, line: 543, baseType: !58, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_interrupt_override", file: !6, line: 548, size: 80, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !80, file: !6, line: 549, baseType: !45, size: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !80, file: !6, line: 550, baseType: !49, size: 8, offset: 16)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "source_irq", scope: !80, file: !6, line: 551, baseType: !49, size: 8, offset: 24)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq", scope: !80, file: !6, line: 552, baseType: !58, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "inti_flags", scope: !80, file: !6, line: 553, baseType: !65, size: 16, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_nmi_source", file: !6, line: 558, size: 64, elements: !89)
!89 = !{!90, !91, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !88, file: !6, line: 559, baseType: !45, size: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "inti_flags", scope: !88, file: !6, line: 560, baseType: !65, size: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq", scope: !88, file: !6, line: 561, baseType: !58, size: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_apic_nmi", file: !6, line: 566, size: 48, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !94, file: !6, line: 567, baseType: !45, size: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", scope: !94, file: !6, line: 568, baseType: !49, size: 8, offset: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "inti_flags", scope: !94, file: !6, line: 569, baseType: !65, size: 16, offset: 24)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "lint", scope: !94, file: !6, line: 570, baseType: !49, size: 8, offset: 40)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_x2apic_nmi", file: !6, line: 633, size: 96, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !101, file: !6, line: 634, baseType: !45, size: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "inti_flags", scope: !101, file: !6, line: 635, baseType: !65, size: 16, offset: 16)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !101, file: !6, line: 636, baseType: !58, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "lint", scope: !101, file: !6, line: 637, baseType: !49, size: 8, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !101, file: !6, line: 638, baseType: !108, size: 24, offset: 72)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 24, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 3)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_apic_override", file: !6, line: 575, size: 96, elements: !113)
!113 = !{!114, !115, !116}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !112, file: !6, line: 576, baseType: !45, size: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !112, file: !6, line: 577, baseType: !65, size: 16, offset: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !112, file: !6, line: 578, baseType: !117, size: 64, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !50, line: 23, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !52, line: 31, baseType: !119)
!119 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_io_sapic", file: !6, line: 583, size: 128, elements: !124)
!124 = !{!125, !126, !127, !128, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !123, file: !6, line: 584, baseType: !45, size: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !6, line: 585, baseType: !49, size: 8, offset: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !123, file: !6, line: 586, baseType: !49, size: 8, offset: 24)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq_base", scope: !123, file: !6, line: 587, baseType: !58, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !123, file: !6, line: 588, baseType: !117, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_local_sapic", file: !6, line: 593, size: 136, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !131, file: !6, line: 594, baseType: !45, size: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", scope: !131, file: !6, line: 595, baseType: !49, size: 8, offset: 16)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !131, file: !6, line: 596, baseType: !49, size: 8, offset: 24)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !131, file: !6, line: 597, baseType: !49, size: 8, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !131, file: !6, line: 598, baseType: !108, size: 24, offset: 40)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_flags", scope: !131, file: !6, line: 599, baseType: !58, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !131, file: !6, line: 600, baseType: !58, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "uid_string", scope: !131, file: !6, line: 601, baseType: !141, size: 8, offset: 128)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 8, elements: !143)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!143 = !{!144}
!144 = !DISubrange(count: 1)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_interrupt_source", file: !6, line: 606, size: 128, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !146, file: !6, line: 607, baseType: !45, size: 16)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "inti_flags", scope: !146, file: !6, line: 608, baseType: !65, size: 16, offset: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !6, line: 609, baseType: !49, size: 8, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !146, file: !6, line: 610, baseType: !49, size: 8, offset: 40)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "eid", scope: !146, file: !6, line: 611, baseType: !49, size: 8, offset: 48)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "io_sapic_vector", scope: !146, file: !6, line: 612, baseType: !49, size: 8, offset: 56)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq", scope: !146, file: !6, line: 613, baseType: !58, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !6, line: 614, baseType: !58, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_generic_interrupt", file: !6, line: 643, size: 640, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !176}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !157, file: !6, line: 644, baseType: !45, size: 16)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !157, file: !6, line: 645, baseType: !65, size: 16, offset: 16)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_interface_number", scope: !157, file: !6, line: 646, baseType: !58, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !157, file: !6, line: 647, baseType: !58, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !6, line: 648, baseType: !58, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parking_version", scope: !157, file: !6, line: 649, baseType: !58, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "performance_interrupt", scope: !157, file: !6, line: 650, baseType: !58, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "parked_address", scope: !157, file: !6, line: 651, baseType: !117, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "base_address", scope: !157, file: !6, line: 652, baseType: !117, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "gicv_base_address", scope: !157, file: !6, line: 653, baseType: !117, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "gich_base_address", scope: !157, file: !6, line: 654, baseType: !117, size: 64, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "vgic_interrupt", scope: !157, file: !6, line: 655, baseType: !58, size: 32, offset: 448)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "gicr_base_address", scope: !157, file: !6, line: 656, baseType: !117, size: 64, offset: 480)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mpidr", scope: !157, file: !6, line: 657, baseType: !117, size: 64, offset: 544)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "efficiency_class", scope: !157, file: !6, line: 658, baseType: !49, size: 8, offset: 608)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !157, file: !6, line: 659, baseType: !175, size: 8, offset: 616)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 8, elements: !143)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "spe_interrupt", scope: !157, file: !6, line: 660, baseType: !65, size: 16, offset: 624)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_madt_generic_distributor", file: !6, line: 671, size: 192, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !186}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !178, file: !6, line: 672, baseType: !45, size: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !178, file: !6, line: 673, baseType: !65, size: 16, offset: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "gic_id", scope: !178, file: !6, line: 674, baseType: !58, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "base_address", scope: !178, file: !6, line: 675, baseType: !117, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "global_irq_base", scope: !178, file: !6, line: 676, baseType: !58, size: 32, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !178, file: !6, line: 677, baseType: !49, size: 8, offset: 160)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !178, file: !6, line: 678, baseType: !108, size: 24, offset: 168)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !188, line: 421, baseType: !58)
!188 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_subtable_headers", file: !191, line: 132, size: 64, elements: !192)
!191 = !DIFile(filename: "./include/linux/acpi.h", directory: "/home/lizy2001/genbc/linux")
!192 = !{!193, !194}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !190, file: !191, line: 133, baseType: !45, size: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "hmat", scope: !190, file: !191, line: 134, baseType: !195, size: 64)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_hmat_structure", file: !46, line: 1404, size: 64, elements: !196)
!196 = !{!197, !198, !199}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !46, line: 1405, baseType: !65, size: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !195, file: !46, line: 1406, baseType: !65, size: 16, offset: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !195, file: !46, line: 1407, baseType: !58, size: 32, offset: 32)
!200 = !{!201, !216, !218, !220, !262, !0, !264, !267, !272, !277, !282}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "__setup_acpi_parse_apic_instance", scope: !2, file: !3, line: 824, type: !203, isLocal: true, isDefinition: true, align: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obs_kernel_param", file: !204, line: 241, size: 192, elements: !205)
!204 = !DIFile(filename: "./include/linux/init.h", directory: "/home/lizy2001/genbc/linux")
!205 = !{!206, !209, !215}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !204, line: 242, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "setup_func", scope: !203, file: !204, line: 243, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !214}
!213 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "early", scope: !203, file: !204, line: 244, baseType: !213, size: 32, offset: 128)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__setup_acpi_force_table_verification_setup", scope: !2, file: !3, line: 832, type: !203, isLocal: true, isDefinition: true, align: 64)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "__setup_acpi_force_32bit_fadt_addr", scope: !2, file: !3, line: 841, type: !203, isLocal: true, isDefinition: true, align: 64)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "initial_tables", scope: !2, file: !3, line: 35, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 32768, elements: !260)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !224, line: 334, size: 256, elements: !225)
!224 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!225 = !{!226, !228, !250, !251, !256, !258, !259}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !223, file: !224, line: 335, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !188, line: 129, baseType: !117)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !223, file: !224, line: 336, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !224, line: 68, size: 288, elements: !231)
!231 = !{!232, !236, !237, !238, !239, !243, !247, !248, !249}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !230, file: !224, line: 69, baseType: !233, size: 32)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 32, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 4)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !230, file: !224, line: 70, baseType: !58, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !230, file: !224, line: 71, baseType: !49, size: 8, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !230, file: !224, line: 72, baseType: !49, size: 8, offset: 72)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !230, file: !224, line: 73, baseType: !240, size: 48, offset: 80)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 48, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 6)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !230, file: !224, line: 74, baseType: !244, size: 64, offset: 128)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !230, file: !224, line: 75, baseType: !58, size: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !230, file: !224, line: 76, baseType: !233, size: 32, offset: 224)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !230, file: !224, line: 77, baseType: !58, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !223, file: !224, line: 337, baseType: !58, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !223, file: !224, line: 338, baseType: !252, size: 32, offset: 160)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !224, line: 327, size: 32, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !252, file: !224, line: 328, baseType: !58, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !252, file: !224, line: 329, baseType: !233, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !223, file: !224, line: 339, baseType: !257, size: 16, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !188, line: 445, baseType: !65)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 340, baseType: !49, size: 8, offset: 208)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "validation_count", scope: !223, file: !224, line: 341, baseType: !65, size: 16, offset: 224)
!260 = !{!261}
!261 = !DISubrange(count: 128)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "acpi_apic_instance", scope: !2, file: !3, line: 37, type: !213, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "mps_inti_flags_trigger", scope: !2, file: !3, line: 33, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 256, elements: !234)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "acpi_verify_table_checksum", scope: !2, file: !3, line: 53, type: !269, isLocal: true, isDefinition: true)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !270, line: 30, baseType: !271)
!270 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!271 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "__setup_str_acpi_parse_apic_instance", scope: !2, file: !3, line: 824, type: !274, isLocal: true, isDefinition: true, align: 8)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 152, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 19)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "__setup_str_acpi_force_table_verification_setup", scope: !2, file: !3, line: 832, type: !279, isLocal: true, isDefinition: true, align: 8)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 240, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 30)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "__setup_str_acpi_force_32bit_fadt_addr", scope: !2, file: !3, line: 841, type: !284, isLocal: true, isDefinition: true, align: 8)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 216, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 27)
!287 = !{i32 7, !"Dwarf Version", i32 4}
!288 = !{i32 2, !"Debug Info Version", i32 3}
!289 = !{i32 1, !"wchar_size", i32 2}
!290 = !{i32 1, !"Code Model", i32 2}
!291 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!292 = distinct !DISubprogram(name: "acpi_table_print_madt_entry", scope: !3, file: !3, line: 55, type: !293, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !296)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!296 = !{}
!297 = !DILocalVariable(name: "header", arg: 1, scope: !292, file: !3, line: 55, type: !295)
!298 = !DILocation(line: 55, column: 63, scope: !292)
!299 = !DILocation(line: 57, column: 7, scope: !300)
!300 = distinct !DILexicalBlock(scope: !292, file: !3, line: 57, column: 6)
!301 = !DILocation(line: 57, column: 6, scope: !292)
!302 = !DILocation(line: 58, column: 3, scope: !300)
!303 = !DILocation(line: 60, column: 10, scope: !292)
!304 = !DILocation(line: 60, column: 18, scope: !292)
!305 = !DILocation(line: 60, column: 2, scope: !292)
!306 = !DILocalVariable(name: "p", scope: !307, file: !3, line: 64, type: !41)
!307 = distinct !DILexicalBlock(scope: !308, file: !3, line: 63, column: 3)
!308 = distinct !DILexicalBlock(scope: !292, file: !3, line: 60, column: 24)
!309 = !DILocation(line: 64, column: 33, scope: !307)
!310 = !DILocation(line: 65, column: 39, scope: !307)
!311 = !DILocation(line: 65, column: 8, scope: !307)
!312 = !DILocation(line: 66, column: 4, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 66, column: 4)
!314 = distinct !DILexicalBlock(scope: !307, file: !3, line: 66, column: 4)
!315 = !DILocation(line: 66, column: 4, scope: !314)
!316 = !DILocation(line: 70, column: 3, scope: !308)
!317 = !DILocalVariable(name: "p", scope: !318, file: !3, line: 74, type: !60)
!318 = distinct !DILexicalBlock(scope: !308, file: !3, line: 73, column: 3)
!319 = !DILocation(line: 74, column: 35, scope: !318)
!320 = !DILocation(line: 75, column: 41, scope: !318)
!321 = !DILocation(line: 75, column: 8, scope: !318)
!322 = !DILocation(line: 76, column: 4, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !3, line: 76, column: 4)
!324 = distinct !DILexicalBlock(scope: !318, file: !3, line: 76, column: 4)
!325 = !DILocation(line: 76, column: 4, scope: !324)
!326 = !DILocation(line: 80, column: 3, scope: !308)
!327 = !DILocalVariable(name: "p", scope: !328, file: !3, line: 84, type: !71)
!328 = distinct !DILexicalBlock(scope: !308, file: !3, line: 83, column: 3)
!329 = !DILocation(line: 84, column: 30, scope: !328)
!330 = !DILocation(line: 85, column: 36, scope: !328)
!331 = !DILocation(line: 85, column: 8, scope: !328)
!332 = !DILocation(line: 86, column: 4, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !3, line: 86, column: 4)
!334 = distinct !DILexicalBlock(scope: !328, file: !3, line: 86, column: 4)
!335 = !DILocation(line: 86, column: 4, scope: !334)
!336 = !DILocation(line: 89, column: 3, scope: !308)
!337 = !DILocalVariable(name: "p", scope: !338, file: !3, line: 93, type: !79)
!338 = distinct !DILexicalBlock(scope: !308, file: !3, line: 92, column: 3)
!339 = !DILocation(line: 93, column: 41, scope: !338)
!340 = !DILocation(line: 94, column: 47, scope: !338)
!341 = !DILocation(line: 94, column: 8, scope: !338)
!342 = !DILocation(line: 95, column: 4, scope: !338)
!343 = !DILocation(line: 99, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !338, file: !3, line: 99, column: 8)
!345 = !DILocation(line: 99, column: 11, scope: !344)
!346 = !DILocation(line: 99, column: 23, scope: !344)
!347 = !DILocation(line: 99, column: 8, scope: !338)
!348 = !DILocation(line: 101, column: 5, scope: !344)
!349 = !DILocation(line: 105, column: 3, scope: !308)
!350 = !DILocalVariable(name: "p", scope: !351, file: !3, line: 109, type: !87)
!351 = distinct !DILexicalBlock(scope: !308, file: !3, line: 108, column: 3)
!352 = !DILocation(line: 109, column: 33, scope: !351)
!353 = !DILocation(line: 110, column: 39, scope: !351)
!354 = !DILocation(line: 110, column: 8, scope: !351)
!355 = !DILocation(line: 111, column: 4, scope: !351)
!356 = !DILocation(line: 116, column: 3, scope: !308)
!357 = !DILocalVariable(name: "p", scope: !358, file: !3, line: 120, type: !93)
!358 = distinct !DILexicalBlock(scope: !308, file: !3, line: 119, column: 3)
!359 = !DILocation(line: 120, column: 37, scope: !358)
!360 = !DILocation(line: 121, column: 43, scope: !358)
!361 = !DILocation(line: 121, column: 8, scope: !358)
!362 = !DILocation(line: 122, column: 4, scope: !358)
!363 = !DILocation(line: 128, column: 3, scope: !308)
!364 = !DILocalVariable(name: "polarity", scope: !365, file: !3, line: 132, type: !65)
!365 = distinct !DILexicalBlock(scope: !308, file: !3, line: 131, column: 3)
!366 = !DILocation(line: 132, column: 8, scope: !365)
!367 = !DILocalVariable(name: "trigger", scope: !365, file: !3, line: 132, type: !65)
!368 = !DILocation(line: 132, column: 18, scope: !365)
!369 = !DILocalVariable(name: "p", scope: !365, file: !3, line: 133, type: !100)
!370 = !DILocation(line: 133, column: 39, scope: !365)
!371 = !DILocation(line: 134, column: 45, scope: !365)
!372 = !DILocation(line: 134, column: 8, scope: !365)
!373 = !DILocation(line: 136, column: 15, scope: !365)
!374 = !DILocation(line: 136, column: 18, scope: !365)
!375 = !DILocation(line: 136, column: 29, scope: !365)
!376 = !DILocation(line: 136, column: 13, scope: !365)
!377 = !DILocation(line: 137, column: 15, scope: !365)
!378 = !DILocation(line: 137, column: 18, scope: !365)
!379 = !DILocation(line: 137, column: 29, scope: !365)
!380 = !DILocation(line: 137, column: 55, scope: !365)
!381 = !DILocation(line: 137, column: 14, scope: !365)
!382 = !DILocation(line: 137, column: 12, scope: !365)
!383 = !DILocation(line: 139, column: 4, scope: !365)
!384 = !DILocation(line: 145, column: 3, scope: !308)
!385 = !DILocalVariable(name: "p", scope: !386, file: !3, line: 149, type: !111)
!386 = distinct !DILexicalBlock(scope: !308, file: !3, line: 148, column: 3)
!387 = !DILocation(line: 149, column: 42, scope: !386)
!388 = !DILocation(line: 150, column: 48, scope: !386)
!389 = !DILocation(line: 150, column: 8, scope: !386)
!390 = !DILocation(line: 151, column: 4, scope: !386)
!391 = !DILocation(line: 154, column: 3, scope: !308)
!392 = !DILocalVariable(name: "p", scope: !393, file: !3, line: 158, type: !122)
!393 = distinct !DILexicalBlock(scope: !308, file: !3, line: 157, column: 3)
!394 = !DILocation(line: 158, column: 31, scope: !393)
!395 = !DILocation(line: 159, column: 37, scope: !393)
!396 = !DILocation(line: 159, column: 8, scope: !393)
!397 = !DILocation(line: 160, column: 4, scope: !398)
!398 = distinct !DILexicalBlock(scope: !399, file: !3, line: 160, column: 4)
!399 = distinct !DILexicalBlock(scope: !393, file: !3, line: 160, column: 4)
!400 = !DILocation(line: 160, column: 4, scope: !399)
!401 = !DILocation(line: 164, column: 3, scope: !308)
!402 = !DILocalVariable(name: "p", scope: !403, file: !3, line: 168, type: !130)
!403 = distinct !DILexicalBlock(scope: !308, file: !3, line: 167, column: 3)
!404 = !DILocation(line: 168, column: 34, scope: !403)
!405 = !DILocation(line: 169, column: 40, scope: !403)
!406 = !DILocation(line: 169, column: 8, scope: !403)
!407 = !DILocation(line: 170, column: 4, scope: !408)
!408 = distinct !DILexicalBlock(scope: !409, file: !3, line: 170, column: 4)
!409 = distinct !DILexicalBlock(scope: !403, file: !3, line: 170, column: 4)
!410 = !DILocation(line: 170, column: 4, scope: !409)
!411 = !DILocation(line: 174, column: 3, scope: !308)
!412 = !DILocalVariable(name: "p", scope: !413, file: !3, line: 178, type: !145)
!413 = distinct !DILexicalBlock(scope: !308, file: !3, line: 177, column: 3)
!414 = !DILocation(line: 178, column: 39, scope: !413)
!415 = !DILocation(line: 179, column: 45, scope: !413)
!416 = !DILocation(line: 179, column: 8, scope: !413)
!417 = !DILocation(line: 180, column: 4, scope: !413)
!418 = !DILocation(line: 186, column: 3, scope: !308)
!419 = !DILocalVariable(name: "p", scope: !420, file: !3, line: 190, type: !156)
!420 = distinct !DILexicalBlock(scope: !308, file: !3, line: 189, column: 3)
!421 = !DILocation(line: 190, column: 40, scope: !420)
!422 = !DILocation(line: 191, column: 43, scope: !420)
!423 = !DILocation(line: 191, column: 5, scope: !420)
!424 = !DILocation(line: 192, column: 4, scope: !425)
!425 = distinct !DILexicalBlock(scope: !426, file: !3, line: 192, column: 4)
!426 = distinct !DILexicalBlock(scope: !420, file: !3, line: 192, column: 4)
!427 = !DILocation(line: 192, column: 4, scope: !426)
!428 = !DILocation(line: 198, column: 3, scope: !308)
!429 = !DILocalVariable(name: "p", scope: !430, file: !3, line: 202, type: !177)
!430 = distinct !DILexicalBlock(scope: !308, file: !3, line: 201, column: 3)
!431 = !DILocation(line: 202, column: 42, scope: !430)
!432 = !DILocation(line: 203, column: 45, scope: !430)
!433 = !DILocation(line: 203, column: 5, scope: !430)
!434 = !DILocation(line: 204, column: 4, scope: !435)
!435 = distinct !DILexicalBlock(scope: !436, file: !3, line: 204, column: 4)
!436 = distinct !DILexicalBlock(scope: !430, file: !3, line: 204, column: 4)
!437 = !DILocation(line: 204, column: 4, scope: !436)
!438 = !DILocation(line: 208, column: 3, scope: !308)
!439 = !DILocation(line: 211, column: 3, scope: !308)
!440 = !DILocation(line: 213, column: 3, scope: !308)
!441 = !DILocation(line: 215, column: 1, scope: !292)
!442 = distinct !DISubprogram(name: "acpi_table_parse_entries_array", scope: !3, file: !3, line: 345, type: !443, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !296)
!443 = !DISubroutineType(types: !444)
!444 = !{!213, !214, !121, !445, !213, !7}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_subtable_proc", file: !191, line: 215, size: 192, elements: !447)
!447 = !{!448, !449, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !446, file: !191, line: 216, baseType: !213, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !446, file: !191, line: 217, baseType: !450, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_tbl_entry_handler", file: !191, line: 139, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!213, !189, !454}
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !446, file: !191, line: 218, baseType: !213, size: 32, offset: 128)
!456 = !DILocalVariable(name: "id", arg: 1, scope: !442, file: !3, line: 345, type: !214)
!457 = !DILocation(line: 345, column: 49, scope: !442)
!458 = !DILocalVariable(name: "table_size", arg: 2, scope: !442, file: !3, line: 346, type: !121)
!459 = !DILocation(line: 346, column: 19, scope: !442)
!460 = !DILocalVariable(name: "proc", arg: 3, scope: !442, file: !3, line: 347, type: !445)
!461 = !DILocation(line: 347, column: 32, scope: !442)
!462 = !DILocalVariable(name: "proc_num", arg: 4, scope: !442, file: !3, line: 347, type: !213)
!463 = !DILocation(line: 347, column: 42, scope: !442)
!464 = !DILocalVariable(name: "max_entries", arg: 5, scope: !442, file: !3, line: 348, type: !7)
!465 = !DILocation(line: 348, column: 18, scope: !442)
!466 = !DILocalVariable(name: "table_header", scope: !442, file: !3, line: 350, type: !229)
!467 = !DILocation(line: 350, column: 28, scope: !442)
!468 = !DILocalVariable(name: "count", scope: !442, file: !3, line: 351, type: !213)
!469 = !DILocation(line: 351, column: 6, scope: !442)
!470 = !DILocalVariable(name: "instance", scope: !442, file: !3, line: 352, type: !58)
!471 = !DILocation(line: 352, column: 6, scope: !442)
!472 = !DILocation(line: 354, column: 6, scope: !473)
!473 = distinct !DILexicalBlock(scope: !442, file: !3, line: 354, column: 6)
!474 = !DILocation(line: 354, column: 6, scope: !442)
!475 = !DILocation(line: 355, column: 3, scope: !473)
!476 = !DILocation(line: 357, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !442, file: !3, line: 357, column: 6)
!478 = !DILocation(line: 357, column: 6, scope: !442)
!479 = !DILocation(line: 358, column: 3, scope: !477)
!480 = !DILocation(line: 360, column: 7, scope: !481)
!481 = distinct !DILexicalBlock(scope: !442, file: !3, line: 360, column: 6)
!482 = !DILocation(line: 360, column: 6, scope: !442)
!483 = !DILocation(line: 361, column: 3, scope: !481)
!484 = !DILocation(line: 363, column: 15, scope: !485)
!485 = distinct !DILexicalBlock(scope: !442, file: !3, line: 363, column: 6)
!486 = !DILocation(line: 363, column: 7, scope: !485)
!487 = !DILocation(line: 363, column: 6, scope: !442)
!488 = !DILocation(line: 364, column: 14, scope: !485)
!489 = !DILocation(line: 364, column: 12, scope: !485)
!490 = !DILocation(line: 364, column: 3, scope: !485)
!491 = !DILocation(line: 366, column: 17, scope: !442)
!492 = !DILocation(line: 366, column: 21, scope: !442)
!493 = !DILocation(line: 366, column: 2, scope: !442)
!494 = !DILocation(line: 367, column: 7, scope: !495)
!495 = distinct !DILexicalBlock(scope: !442, file: !3, line: 367, column: 6)
!496 = !DILocation(line: 367, column: 6, scope: !442)
!497 = !DILocation(line: 368, column: 3, scope: !498)
!498 = distinct !DILexicalBlock(scope: !495, file: !3, line: 367, column: 21)
!499 = !DILocation(line: 369, column: 3, scope: !498)
!500 = !DILocation(line: 372, column: 35, scope: !442)
!501 = !DILocation(line: 372, column: 39, scope: !442)
!502 = !DILocation(line: 372, column: 51, scope: !442)
!503 = !DILocation(line: 373, column: 4, scope: !442)
!504 = !DILocation(line: 373, column: 10, scope: !442)
!505 = !DILocation(line: 373, column: 20, scope: !442)
!506 = !DILocation(line: 372, column: 10, scope: !442)
!507 = !DILocation(line: 372, column: 8, scope: !442)
!508 = !DILocation(line: 375, column: 17, scope: !442)
!509 = !DILocation(line: 375, column: 2, scope: !442)
!510 = !DILocation(line: 376, column: 9, scope: !442)
!511 = !DILocation(line: 376, column: 2, scope: !442)
!512 = !DILocation(line: 377, column: 1, scope: !442)
!513 = distinct !DISubprogram(name: "acpi_parse_entries_array", scope: !3, file: !3, line: 284, type: !514, scopeLine: 288, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !296)
!514 = !DISubroutineType(types: !515)
!515 = !{!213, !214, !121, !229, !445, !213, !7}
!516 = !DILocalVariable(name: "id", arg: 1, scope: !513, file: !3, line: 284, type: !214)
!517 = !DILocation(line: 284, column: 50, scope: !513)
!518 = !DILocalVariable(name: "table_size", arg: 2, scope: !513, file: !3, line: 284, type: !121)
!519 = !DILocation(line: 284, column: 68, scope: !513)
!520 = !DILocalVariable(name: "table_header", arg: 3, scope: !513, file: !3, line: 285, type: !229)
!521 = !DILocation(line: 285, column: 29, scope: !513)
!522 = !DILocalVariable(name: "proc", arg: 4, scope: !513, file: !3, line: 286, type: !445)
!523 = !DILocation(line: 286, column: 30, scope: !513)
!524 = !DILocalVariable(name: "proc_num", arg: 5, scope: !513, file: !3, line: 286, type: !213)
!525 = !DILocation(line: 286, column: 40, scope: !513)
!526 = !DILocalVariable(name: "max_entries", arg: 6, scope: !513, file: !3, line: 287, type: !7)
!527 = !DILocation(line: 287, column: 16, scope: !513)
!528 = !DILocalVariable(name: "entry", scope: !513, file: !3, line: 289, type: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_subtable_entry", file: !3, line: 44, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !529, file: !3, line: 45, baseType: !189, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !529, file: !3, line: 46, baseType: !26, size: 32, offset: 64)
!533 = !DILocation(line: 289, column: 29, scope: !513)
!534 = !DILocalVariable(name: "table_end", scope: !513, file: !3, line: 290, type: !121)
!535 = !DILocation(line: 290, column: 16, scope: !513)
!536 = !DILocalVariable(name: "subtable_len", scope: !513, file: !3, line: 290, type: !121)
!537 = !DILocation(line: 290, column: 27, scope: !513)
!538 = !DILocalVariable(name: "entry_len", scope: !513, file: !3, line: 290, type: !121)
!539 = !DILocation(line: 290, column: 41, scope: !513)
!540 = !DILocalVariable(name: "count", scope: !513, file: !3, line: 291, type: !213)
!541 = !DILocation(line: 291, column: 6, scope: !513)
!542 = !DILocalVariable(name: "errs", scope: !513, file: !3, line: 292, type: !213)
!543 = !DILocation(line: 292, column: 6, scope: !513)
!544 = !DILocalVariable(name: "i", scope: !513, file: !3, line: 293, type: !213)
!545 = !DILocation(line: 293, column: 6, scope: !513)
!546 = !DILocation(line: 295, column: 29, scope: !513)
!547 = !DILocation(line: 295, column: 14, scope: !513)
!548 = !DILocation(line: 295, column: 44, scope: !513)
!549 = !DILocation(line: 295, column: 58, scope: !513)
!550 = !DILocation(line: 295, column: 42, scope: !513)
!551 = !DILocation(line: 295, column: 12, scope: !513)
!552 = !DILocation(line: 299, column: 38, scope: !513)
!553 = !DILocation(line: 299, column: 15, scope: !513)
!554 = !DILocation(line: 299, column: 8, scope: !513)
!555 = !DILocation(line: 299, column: 13, scope: !513)
!556 = !DILocation(line: 301, column: 22, scope: !513)
!557 = !DILocation(line: 301, column: 7, scope: !513)
!558 = !DILocation(line: 301, column: 37, scope: !513)
!559 = !DILocation(line: 301, column: 35, scope: !513)
!560 = !DILocation(line: 300, column: 14, scope: !513)
!561 = !DILocation(line: 300, column: 8, scope: !513)
!562 = !DILocation(line: 300, column: 12, scope: !513)
!563 = !DILocation(line: 302, column: 17, scope: !513)
!564 = !DILocation(line: 302, column: 15, scope: !513)
!565 = !DILocation(line: 304, column: 2, scope: !513)
!566 = !DILocation(line: 304, column: 31, scope: !513)
!567 = !DILocation(line: 304, column: 10, scope: !513)
!568 = !DILocation(line: 304, column: 38, scope: !513)
!569 = !DILocation(line: 304, column: 36, scope: !513)
!570 = !DILocation(line: 304, column: 54, scope: !513)
!571 = !DILocation(line: 304, column: 52, scope: !513)
!572 = !DILocation(line: 305, column: 7, scope: !573)
!573 = distinct !DILexicalBlock(scope: !574, file: !3, line: 305, column: 7)
!574 = distinct !DILexicalBlock(scope: !513, file: !3, line: 304, column: 65)
!575 = !DILocation(line: 305, column: 19, scope: !573)
!576 = !DILocation(line: 305, column: 22, scope: !573)
!577 = !DILocation(line: 305, column: 31, scope: !573)
!578 = !DILocation(line: 305, column: 28, scope: !573)
!579 = !DILocation(line: 305, column: 7, scope: !574)
!580 = !DILocation(line: 306, column: 4, scope: !573)
!581 = !DILocation(line: 308, column: 10, scope: !582)
!582 = distinct !DILexicalBlock(scope: !574, file: !3, line: 308, column: 3)
!583 = !DILocation(line: 308, column: 8, scope: !582)
!584 = !DILocation(line: 308, column: 15, scope: !585)
!585 = distinct !DILexicalBlock(scope: !582, file: !3, line: 308, column: 3)
!586 = !DILocation(line: 308, column: 19, scope: !585)
!587 = !DILocation(line: 308, column: 17, scope: !585)
!588 = !DILocation(line: 308, column: 3, scope: !582)
!589 = !DILocation(line: 309, column: 8, scope: !590)
!590 = distinct !DILexicalBlock(scope: !591, file: !3, line: 309, column: 8)
!591 = distinct !DILexicalBlock(scope: !585, file: !3, line: 308, column: 34)
!592 = !DILocation(line: 309, column: 39, scope: !590)
!593 = !DILocation(line: 309, column: 44, scope: !590)
!594 = !DILocation(line: 309, column: 47, scope: !590)
!595 = !DILocation(line: 309, column: 36, scope: !590)
!596 = !DILocation(line: 309, column: 8, scope: !591)
!597 = !DILocation(line: 310, column: 5, scope: !590)
