; ModuleID = '../bcout/drivers/acpi/thermal.llvm.bc'
source_filename = "drivers/acpi/thermal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_acpi_thermal_init6:\09\09\09"
module asm ".long\09acpi_thermal_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.acpi_driver = type { [80 x i8], [80 x i8], %struct.acpi_device_id*, i32, %struct.acpi_device_ops, %struct.device_driver, %struct.module* }
%struct.acpi_device_id = type { [9 x i8], i64, i32, i32 }
%struct.acpi_device_ops = type { i32 (%struct.acpi_device*)*, i32 (%struct.acpi_device*)*, void (%struct.acpi_device*, i32)* }

!92 = !DIEnumerator(name: "THERMAL_TABLE_CHANGED", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "THERMAL_EVENT_KEEP_ALIVE", value: 8, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 30, baseType: !96, size: 64, elements: !97)
!95 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!96 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!98 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!99 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!100 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!101 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!102 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!103 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!104 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!105 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!106 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!107 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!108 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!109 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!110 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!111 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!112 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!113 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!114 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!115 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!116 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!117 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!118 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!119 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!120 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!121 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!122 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!123 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!124 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!125 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!126 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !128, line: 305, baseType: !7, size: 32, elements: !129)
!128 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!129 = !{!130, !131, !132, !133}
!130 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!131 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!132 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!133 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 10, baseType: !7, size: 32, elements: !136)
!135 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!136 = !{!137, !138}
!137 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!138 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 308, baseType: !7, size: 32, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!141 = !DIEnumerator(name: "WQ_UNBOUND", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "WQ_FREEZABLE", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "WQ_MEM_RECLAIM", value: 8, isUnsigned: true)
!144 = !DIEnumerator(name: "WQ_HIGHPRI", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "WQ_CPU_INTENSIVE", value: 32, isUnsigned: true)
!146 = !DIEnumerator(name: "WQ_SYSFS", value: 64, isUnsigned: true)
!147 = !DIEnumerator(name: "WQ_POWER_EFFICIENT", value: 128, isUnsigned: true)
!148 = !DIEnumerator(name: "__WQ_DRAINING", value: 65536, isUnsigned: true)
!149 = !DIEnumerator(name: "__WQ_ORDERED", value: 131072, isUnsigned: true)
!150 = !DIEnumerator(name: "__WQ_LEGACY", value: 262144, isUnsigned: true)
!151 = !DIEnumerator(name: "__WQ_ORDERED_EXPLICIT", value: 524288, isUnsigned: true)
!152 = !DIEnumerator(name: "WQ_MAX_ACTIVE", value: 512, isUnsigned: true)
!153 = !DIEnumerator(name: "WQ_MAX_UNBOUND_PER_CPU", value: 4, isUnsigned: true)
!154 = !DIEnumerator(name: "WQ_DFL_ACTIVE", value: 256, isUnsigned: true)
!155 = !{!156, !158, !159, !160, !162, !166, !173, !177, !684}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !157, line: 148, baseType: !7)
!157 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!158 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !161, line: 421, baseType: !162)
!161 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !163, line: 21, baseType: !164)
!163 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !165, line: 27, baseType: !7)
!165 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !157, line: 178, size: 128, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !157, line: 179, baseType: !168, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !169, file: !157, line: 179, baseType: !168, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thermal", file: !3, line: 163, size: 11136, elements: !175)
!175 = !{!176, !2512, !2513, !2514, !2515, !2516, !2518, !2524, !2533, !2574, !2575, !2745, !2746}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !174, file: !3, line: 164, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !179, line: 351, size: 10880, elements: !180)
!179 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!180 = !{!181, !183, !185, !2239, !2240, !2241, !2242, !2243, !2244, !2253, !2270, !2344, !2373, !2397, !2418, !2424, !2433, !2465, !2479, !2501, !2505, !2506, !2507, !2508, !2509, !2510, !2511}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !178, file: !179, line: 352, baseType: !182, size: 32)
!182 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !178, file: !179, line: 353, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !161, line: 424, baseType: !159)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !178, file: !179, line: 354, baseType: !186, size: 192, offset: 128)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !187, line: 17, size: 192, elements: !188)
!187 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!188 = !{!189, !191, !2238}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !186, file: !187, line: 18, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !186, file: !187, line: 19, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !187, line: 110, size: 1152, elements: !195)
!195 = !{!196, !200, !204, !212, !2180, !2184, !2188, !2193, !2197, !2198, !2202, !2206, !2210, !2221, !2222, !2223, !2224, !2234}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !194, file: !187, line: 111, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!190, !190}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !194, file: !187, line: 112, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !190}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !194, file: !187, line: 113, baseType: !205, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !210}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !157, line: 30, baseType: !209)
!209 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !194, file: !187, line: 114, baseType: !213, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !210, !218}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !221)
!221 = !{!222, !1713, !1715, !1718, !1719, !1770, !1867, !1868, !1869, !1870, !1871, !1880, !1985, !1998, !2105, !2106, !2110, !2112, !2113, !2114, !2118, !2124, !2125, !2128, !2129, !2130, !2133, !2134, !2135, !2136, !2168, !2169, !2170, !2173, !2176, !2177, !2178, !2179}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !220, file: !30, line: 462, baseType: !223, size: 512)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !224, line: 64, size: 512, elements: !225)
!224 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!225 = !{!226, !230, !231, !233, !293, !1550, !1703, !1708, !1709, !1710, !1711, !1712}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !223, file: !224, line: 65, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !223, file: !224, line: 66, baseType: !169, size: 128, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !223, file: !224, line: 67, baseType: !232, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !223, file: !224, line: 68, baseType: !234, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !224, line: 192, size: 704, elements: !236)
!236 = !{!237, !238, !254, !255}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !235, file: !224, line: 193, baseType: !169, size: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !235, file: !224, line: 194, baseType: !239, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !240, line: 83, baseType: !241)
!240 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !240, line: 71, elements: !242)
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 72, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 72, elements: !245)
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !244, file: !240, line: 73, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !240, line: 20, elements: !248)
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !247, file: !240, line: 21, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !251, line: 25, baseType: !252)
!251 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 25, elements: !253)
!253 = !{}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !235, file: !224, line: 195, baseType: !223, size: 512, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !235, file: !224, line: 196, baseType: !256, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !224, line: 156, size: 192, elements: !259)
!259 = !{!260, !265, !270}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !258, file: !224, line: 157, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!182, !234, !232}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !258, file: !224, line: 158, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!227, !234, !232}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !258, file: !224, line: 159, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!182, !234, !232, !275}
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !224, line: 148, size: 20736, elements: !277)
!277 = !{!278, !283, !287, !288, !292}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !276, file: !224, line: 149, baseType: !279, size: 192)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 192, elements: !281)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!281 = !{!282}
!282 = !DISubrange(count: 3)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !276, file: !224, line: 150, baseType: !284, size: 4096, offset: 192)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 4096, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !276, file: !224, line: 151, baseType: !182, size: 32, offset: 4288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !224, line: 152, baseType: !289, size: 16384, offset: 4320)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 16384, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2048)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !276, file: !224, line: 153, baseType: !182, size: 32, offset: 20704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !223, file: !224, line: 69, baseType: !294, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !224, line: 138, size: 448, elements: !296)
!296 = !{!297, !301, !329, !331, !1498, !1529, !1533}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !295, file: !224, line: 139, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !232}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !295, file: !224, line: 140, baseType: !302, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !305, line: 230, size: 128, elements: !306)
!305 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!306 = !{!307, !322}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !304, file: !305, line: 231, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!311, !232, !315, !280}
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !157, line: 60, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !313, line: 73, baseType: !314)
!313 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !313, line: 15, baseType: !96)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !305, line: 30, size: 128, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !316, file: !305, line: 31, baseType: !227, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !316, file: !305, line: 32, baseType: !320, size: 16, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !157, line: 19, baseType: !321)
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !304, file: !305, line: 232, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{!311, !232, !315, !227, !326}
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 55, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !313, line: 72, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !313, line: 16, baseType: !158)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !295, file: !224, line: 141, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !295, file: !224, line: 142, baseType: !332, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !305, line: 84, size: 320, elements: !336)
!336 = !{!337, !338, !342, !1495, !1496}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !305, line: 85, baseType: !227, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !335, file: !305, line: 86, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!320, !232, !315, !182}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !335, file: !305, line: 88, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!320, !232, !346, !182}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !305, line: 168, size: 448, elements: !348)
!348 = !{!349, !350, !351, !352, !362, !363}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !347, file: !305, line: 169, baseType: !316, size: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !347, file: !305, line: 170, baseType: !326, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !347, file: !305, line: 171, baseType: !159, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !347, file: !305, line: 172, baseType: !353, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DISubroutineType(types: !355)
!355 = !{!311, !356, !232, !346, !280, !359, !326}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !358, line: 526, flags: DIFlagFwdDecl)
!358 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !157, line: 46, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !313, line: 88, baseType: !361)
!361 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !347, file: !305, line: 174, baseType: !353, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !347, file: !305, line: 176, baseType: !364, size: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!182, !356, !232, !346, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !369, line: 305, size: 1472, elements: !370)
!369 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!370 = !{!371, !372, !373, !374, !375, !383, !384, !1469, !1475, !1476, !1481, !1482, !1485, !1489, !1490, !1491, !1492, !1493}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !368, file: !369, line: 308, baseType: !158, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !368, file: !369, line: 309, baseType: !158, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !368, file: !369, line: 313, baseType: !367, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !368, file: !369, line: 313, baseType: !367, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !368, file: !369, line: 315, baseType: !376, size: 192, align: 64, offset: 256)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !377, line: 24, size: 192, align: 64, elements: !378)
!377 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!378 = !{!379, !380, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !376, file: !377, line: 25, baseType: !158, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !376, file: !377, line: 26, baseType: !381, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !376, file: !377, line: 27, baseType: !381, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !368, file: !369, line: 323, baseType: !158, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !368, file: !369, line: 327, baseType: !385, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !369, line: 388, size: 7296, elements: !387)
!387 = !{!388, !1465}
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !369, line: 389, baseType: !389, size: 7296)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !386, file: !369, line: 389, size: 7296, elements: !390)
!390 = !{!391, !392, !396, !400, !404, !405, !406, !407, !408, !416, !421, !422, !423, !424, !433, !434, !435, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !470, !478, !481, !529, !530, !1436, !1437, !1440, !1444, !1445, !1448, !1449, !1450, !1453, !1464}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !389, file: !369, line: 390, baseType: !367, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !389, file: !369, line: 391, baseType: !393, size: 64, offset: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !377, line: 31, size: 64, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !393, file: !377, line: 32, baseType: !381, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !389, file: !369, line: 392, baseType: !397, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !163, line: 23, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !165, line: 31, baseType: !399)
!399 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !389, file: !369, line: 394, baseType: !401, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DISubroutineType(types: !403)
!403 = !{!158, !356, !158, !158, !158, !158}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !389, file: !369, line: 398, baseType: !158, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !389, file: !369, line: 399, baseType: !158, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !389, file: !369, line: 405, baseType: !158, size: 64, offset: 384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !389, file: !369, line: 406, baseType: !158, size: 64, offset: 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !389, file: !369, line: 407, baseType: !409, size: 64, offset: 512)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !358, line: 286, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !358, line: 286, size: 64, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !411, file: !358, line: 286, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !415, line: 18, baseType: !158)
!415 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !389, file: !369, line: 416, baseType: !417, size: 32, offset: 576)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !157, line: 168, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 166, size: 32, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !418, file: !157, line: 167, baseType: !182, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !389, file: !369, line: 428, baseType: !417, size: 32, offset: 608)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !389, file: !369, line: 437, baseType: !417, size: 32, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !389, file: !369, line: 447, baseType: !417, size: 32, offset: 672)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !389, file: !369, line: 450, baseType: !425, size: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !426, line: 13, baseType: !427)
!426 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !157, line: 175, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 173, size: 64, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !428, file: !157, line: 174, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !163, line: 22, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !165, line: 30, baseType: !361)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !389, file: !369, line: 452, baseType: !182, size: 32, offset: 768)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !389, file: !369, line: 454, baseType: !239, offset: 800)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !389, file: !369, line: 457, baseType: !436, size: 256, offset: 832)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !437, line: 35, size: 256, elements: !438)
!437 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!438 = !{!439, !440, !441, !443}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !436, file: !437, line: 36, baseType: !425, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !436, file: !437, line: 42, baseType: !425, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !436, file: !437, line: 46, baseType: !442, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !240, line: 29, baseType: !247)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !436, file: !437, line: 47, baseType: !169, size: 128, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !389, file: !369, line: 459, baseType: !169, size: 128, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !389, file: !369, line: 466, baseType: !158, size: 64, offset: 1216)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !389, file: !369, line: 467, baseType: !158, size: 64, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !389, file: !369, line: 469, baseType: !158, size: 64, offset: 1344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !389, file: !369, line: 470, baseType: !158, size: 64, offset: 1408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !389, file: !369, line: 471, baseType: !427, size: 64, offset: 1472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !389, file: !369, line: 472, baseType: !158, size: 64, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !389, file: !369, line: 473, baseType: !158, size: 64, offset: 1600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !389, file: !369, line: 474, baseType: !158, size: 64, offset: 1664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !389, file: !369, line: 475, baseType: !158, size: 64, offset: 1728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !389, file: !369, line: 477, baseType: !239, offset: 1792)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !389, file: !369, line: 478, baseType: !158, size: 64, offset: 1792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !389, file: !369, line: 478, baseType: !158, size: 64, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !389, file: !369, line: 478, baseType: !158, size: 64, offset: 1920)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !389, file: !369, line: 478, baseType: !158, size: 64, offset: 1984)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !389, file: !369, line: 479, baseType: !158, size: 64, offset: 2048)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !389, file: !369, line: 479, baseType: !158, size: 64, offset: 2112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !389, file: !369, line: 479, baseType: !158, size: 64, offset: 2176)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !389, file: !369, line: 480, baseType: !158, size: 64, offset: 2240)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !389, file: !369, line: 480, baseType: !158, size: 64, offset: 2304)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !389, file: !369, line: 480, baseType: !158, size: 64, offset: 2368)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !389, file: !369, line: 480, baseType: !158, size: 64, offset: 2432)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !389, file: !369, line: 482, baseType: !467, size: 2816, offset: 2496)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 2816, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 44)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !389, file: !369, line: 488, baseType: !471, size: 256, offset: 5312)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !472, line: 60, size: 256, elements: !473)
!472 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!473 = !{!474}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !471, file: !472, line: 61, baseType: !475, size: 256)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 256, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 4)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !389, file: !369, line: 490, baseType: !479, size: 64, offset: 5568)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !369, line: 490, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !389, file: !369, line: 493, baseType: !482, size: 896, offset: 5632)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !483, line: 53, baseType: !484)
!483 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 13, size: 896, elements: !485)
!485 = !{!486, !487, !488, !489, !492, !493, !500, !501, !521, !522, !525}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !484, file: !483, line: 18, baseType: !397, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !484, file: !483, line: 28, baseType: !427, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !484, file: !483, line: 31, baseType: !436, size: 256, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !484, file: !483, line: 32, baseType: !490, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !483, line: 32, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !484, file: !483, line: 37, baseType: !321, size: 16, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !484, file: !483, line: 40, baseType: !494, size: 192, offset: 512)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !495, line: 53, size: 192, elements: !496)
!495 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !494, file: !495, line: 54, baseType: !425, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !494, file: !495, line: 55, baseType: !239, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !494, file: !495, line: 59, baseType: !169, size: 128, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !484, file: !483, line: 41, baseType: !159, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !484, file: !483, line: 42, baseType: !502, size: 64, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !505, line: 13, size: 896, elements: !506)
!505 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !504, file: !505, line: 14, baseType: !159, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !504, file: !505, line: 15, baseType: !158, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !504, file: !505, line: 17, baseType: !158, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !504, file: !505, line: 17, baseType: !158, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !504, file: !505, line: 19, baseType: !96, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !504, file: !505, line: 21, baseType: !96, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !504, file: !505, line: 22, baseType: !96, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !504, file: !505, line: 23, baseType: !96, size: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !504, file: !505, line: 24, baseType: !96, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !504, file: !505, line: 25, baseType: !96, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !504, file: !505, line: 26, baseType: !96, size: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !504, file: !505, line: 27, baseType: !96, size: 64, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !504, file: !505, line: 28, baseType: !96, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !504, file: !505, line: 29, baseType: !96, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !484, file: !483, line: 44, baseType: !417, size: 32, offset: 832)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !484, file: !483, line: 50, baseType: !523, size: 16, offset: 864)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !163, line: 19, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !165, line: 24, baseType: !321)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !484, file: !483, line: 51, baseType: !526, size: 16, offset: 880)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !163, line: 18, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !165, line: 23, baseType: !528)
!528 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !389, file: !369, line: 495, baseType: !158, size: 64, offset: 6528)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !389, file: !369, line: 497, baseType: !531, size: 64, offset: 6592)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !369, line: 381, size: 384, elements: !533)
!533 = !{!534, !535, !1435}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !532, file: !369, line: 382, baseType: !417, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !532, file: !369, line: 383, baseType: !536, size: 128, offset: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !369, line: 376, size: 128, elements: !537)
!537 = !{!538, !1433}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !536, file: !369, line: 377, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !541, line: 640, size: 48640, elements: !542)
!541 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!542 = !{!543, !549, !551, !552, !558, !559, !560, !561, !562, !563, !564, !565, !569, !587, !598, !693, !694, !695, !706, !707, !709, !710, !711, !712, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !791, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !847, !849, !850, !851, !863, !865, !866, !867, !868, !869, !875, !876, !877, !878, !879, !880, !881, !893, !898, !903, !904, !905, !908, !912, !915, !918, !921, !924, !928, !931, !934, !940, !941, !942, !948, !949, !950, !951, !952, !961, !962, !963, !964, !965, !970, !971, !972, !975, !976, !979, !982, !985, !988, !991, !994, !995, !1075, !1078, !1081, !1082, !1085, !1086, !1087, !1093, !1094, !1095, !1108, !1109, !1110, !1120, !1125, !1128, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !540, file: !541, line: 646, baseType: !544, size: 128)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !545, line: 56, size: 128, elements: !546)
!545 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !545, line: 57, baseType: !158, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !544, file: !545, line: 58, baseType: !162, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !540, file: !541, line: 649, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !540, file: !541, line: 657, baseType: !159, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !540, file: !541, line: 658, baseType: !553, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !554, line: 113, baseType: !555)
!554 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !554, line: 111, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !555, file: !554, line: 112, baseType: !417, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !541, line: 660, baseType: !7, size: 32, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !540, file: !541, line: 661, baseType: !7, size: 32, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !540, file: !541, line: 684, baseType: !182, size: 32, offset: 352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !540, file: !541, line: 686, baseType: !182, size: 32, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !540, file: !541, line: 687, baseType: !182, size: 32, offset: 416)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !540, file: !541, line: 688, baseType: !182, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !540, file: !541, line: 689, baseType: !7, size: 32, offset: 480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !540, file: !541, line: 691, baseType: !566, size: 64, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !541, line: 691, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !540, file: !541, line: 692, baseType: !570, size: 832, offset: 576)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !541, line: 451, size: 832, elements: !571)
!571 = !{!572, !577, !578, !579, !580, !581, !582, !583, !584, !585}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !570, file: !541, line: 453, baseType: !573, size: 128)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !541, line: 325, size: 128, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !573, file: !541, line: 326, baseType: !158, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !573, file: !541, line: 327, baseType: !162, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !570, file: !541, line: 454, baseType: !376, size: 192, align: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !570, file: !541, line: 455, baseType: !169, size: 128, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !570, file: !541, line: 456, baseType: !7, size: 32, offset: 448)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !570, file: !541, line: 458, baseType: !397, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !570, file: !541, line: 459, baseType: !397, size: 64, offset: 576)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !570, file: !541, line: 460, baseType: !397, size: 64, offset: 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !570, file: !541, line: 461, baseType: !397, size: 64, offset: 704)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !570, file: !541, line: 463, baseType: !397, size: 64, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !570, file: !541, line: 465, baseType: !586, offset: 832)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !541, line: 415, elements: !253)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !540, file: !541, line: 693, baseType: !588, size: 384, offset: 1408)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !541, line: 489, size: 384, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !588, file: !541, line: 490, baseType: !169, size: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !588, file: !541, line: 491, baseType: !158, size: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !588, file: !541, line: 492, baseType: !158, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !588, file: !541, line: 493, baseType: !7, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !588, file: !541, line: 494, baseType: !321, size: 16, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !588, file: !541, line: 495, baseType: !321, size: 16, offset: 304)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !588, file: !541, line: 497, baseType: !597, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !540, file: !541, line: 697, baseType: !599, size: 1792, offset: 1792)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !541, line: 507, size: 1792, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !690, !691}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !599, file: !541, line: 508, baseType: !376, size: 192, align: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !599, file: !541, line: 515, baseType: !397, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !599, file: !541, line: 516, baseType: !397, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !599, file: !541, line: 517, baseType: !397, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !599, file: !541, line: 518, baseType: !397, size: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !599, file: !541, line: 519, baseType: !397, size: 64, offset: 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !599, file: !541, line: 526, baseType: !431, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !599, file: !541, line: 527, baseType: !397, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !541, line: 528, baseType: !7, size: 32, offset: 640)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !599, file: !541, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !599, file: !541, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !599, file: !541, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !599, file: !541, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !599, file: !541, line: 563, baseType: !615, size: 512, offset: 704)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !616)
!616 = !{!617, !625, !626, !631, !683, !687, !688, !689}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !615, file: !6, line: 119, baseType: !618, size: 256)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !619, line: 9, size: 256, elements: !620)
!619 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !618, file: !619, line: 10, baseType: !376, size: 192, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !618, file: !619, line: 11, baseType: !623, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !624, line: 29, baseType: !431)
!624 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !615, file: !6, line: 120, baseType: !623, size: 64, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !615, file: !6, line: 121, baseType: !627, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!5, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !615, file: !6, line: 122, baseType: !632, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !634)
!634 = !{!635, !655, !656, !659, !669, !670, !678, !682}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !633, file: !6, line: 160, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !637, file: !6, line: 215, baseType: !442)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !637, file: !6, line: 216, baseType: !7, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !637, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !637, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !637, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !637, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !637, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !637, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !637, file: !6, line: 233, baseType: !623, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !637, file: !6, line: 234, baseType: !630, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !637, file: !6, line: 235, baseType: !623, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !637, file: !6, line: 236, baseType: !630, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !637, file: !6, line: 237, baseType: !652, size: 4096, offset: 512)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 4096, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !633, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !633, file: !6, line: 162, baseType: !657, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !157, line: 27, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !313, line: 96, baseType: !182)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !633, file: !6, line: 163, baseType: !660, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !661, line: 276, baseType: !662)
!661 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !661, line: 276, size: 32, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !662, file: !661, line: 276, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !661, line: 70, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !661, line: 65, size: 32, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !666, file: !661, line: 66, baseType: !7, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !633, file: !6, line: 164, baseType: !630, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !633, file: !6, line: 165, baseType: !671, size: 128, offset: 256)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !619, line: 14, size: 128, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !671, file: !619, line: 15, baseType: !674, size: 128)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !377, line: 125, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !674, file: !377, line: 126, baseType: !393, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !674, file: !377, line: 127, baseType: !381, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !633, file: !6, line: 166, baseType: !679, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!623}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !633, file: !6, line: 167, baseType: !623, size: 64, offset: 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !615, file: !6, line: 123, baseType: !684, size: 8, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !163, line: 17, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !165, line: 21, baseType: !686)
!686 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !615, file: !6, line: 124, baseType: !684, size: 8, offset: 456)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !615, file: !6, line: 125, baseType: !684, size: 8, offset: 464)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !615, file: !6, line: 126, baseType: !684, size: 8, offset: 472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !599, file: !541, line: 572, baseType: !615, size: 512, offset: 1216)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !599, file: !541, line: 580, baseType: !692, size: 64, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !540, file: !541, line: 721, baseType: !7, size: 32, offset: 3584)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !540, file: !541, line: 722, baseType: !182, size: 32, offset: 3616)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !540, file: !541, line: 723, baseType: !696, size: 64, offset: 3648)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !699, line: 17, baseType: !700)
!699 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !699, line: 17, size: 64, elements: !701)
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !700, file: !699, line: 17, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 64, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 1)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !540, file: !541, line: 724, baseType: !698, size: 64, offset: 3712)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !540, file: !541, line: 749, baseType: !708, offset: 3776)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !541, line: 290, elements: !253)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !540, file: !541, line: 751, baseType: !169, size: 128, offset: 3776)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !540, file: !541, line: 757, baseType: !385, size: 64, offset: 3904)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !540, file: !541, line: 758, baseType: !385, size: 64, offset: 3968)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !540, file: !541, line: 761, baseType: !713, size: 320, offset: 4032)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !472, line: 34, size: 320, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !713, file: !472, line: 35, baseType: !397, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !713, file: !472, line: 36, baseType: !717, size: 256, offset: 64)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, elements: !476)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !540, file: !541, line: 766, baseType: !182, size: 32, offset: 4352)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !540, file: !541, line: 767, baseType: !182, size: 32, offset: 4384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !540, file: !541, line: 768, baseType: !182, size: 32, offset: 4416)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !540, file: !541, line: 770, baseType: !182, size: 32, offset: 4448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !540, file: !541, line: 772, baseType: !158, size: 64, offset: 4480)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !540, file: !541, line: 775, baseType: !7, size: 32, offset: 4544)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !540, file: !541, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !540, file: !541, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !540, file: !541, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !540, file: !541, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !540, file: !541, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !540, file: !541, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !540, file: !541, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !540, file: !541, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !540, file: !541, line: 831, baseType: !158, size: 64, offset: 4672)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !540, file: !541, line: 833, baseType: !734, size: 384, offset: 4736)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !735)
!735 = !{!736, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !734, file: !12, line: 26, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!96, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, scope: !734, file: !12, line: 27, baseType: !742, size: 320, offset: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !734, file: !12, line: 27, size: 320, elements: !743)
!743 = !{!744, !754, !781}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !742, file: !12, line: 36, baseType: !745, size: 320)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !12, line: 29, size: 320, elements: !746)
!746 = !{!747, !749, !750, !751, !752, !753}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !745, file: !12, line: 30, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !745, file: !12, line: 31, baseType: !162, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !12, line: 32, baseType: !162, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !745, file: !12, line: 33, baseType: !162, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !745, file: !12, line: 34, baseType: !397, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !745, file: !12, line: 35, baseType: !748, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !742, file: !12, line: 46, baseType: !755, size: 192)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !12, line: 38, size: 192, elements: !756)
!756 = !{!757, !758, !759, !780}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !755, file: !12, line: 39, baseType: !657, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, scope: !755, file: !12, line: 41, baseType: !760, size: 64, offset: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !755, file: !12, line: 41, size: 64, elements: !761)
!761 = !{!762, !770}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !760, file: !12, line: 42, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !765, line: 7, size: 128, elements: !766)
!765 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!766 = !{!767, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !764, file: !765, line: 8, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !313, line: 93, baseType: !361)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !764, file: !765, line: 9, baseType: !361, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !760, file: !12, line: 43, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !773, line: 7, size: 64, elements: !774)
!773 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!774 = !{!775, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !772, file: !773, line: 8, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !773, line: 5, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !163, line: 20, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !165, line: 26, baseType: !182)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !772, file: !773, line: 9, baseType: !777, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !755, file: !12, line: 45, baseType: !397, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !742, file: !12, line: 54, baseType: !782, size: 256)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !12, line: 48, size: 256, elements: !783)
!783 = !{!784, !787, !788, !789, !790}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !782, file: !12, line: 49, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !782, file: !12, line: 50, baseType: !182, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !782, file: !12, line: 51, baseType: !182, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !782, file: !12, line: 52, baseType: !158, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !782, file: !12, line: 53, baseType: !158, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !540, file: !541, line: 835, baseType: !792, size: 32, offset: 5120)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !157, line: 22, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !313, line: 28, baseType: !182)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !540, file: !541, line: 836, baseType: !792, size: 32, offset: 5152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !540, file: !541, line: 840, baseType: !158, size: 64, offset: 5184)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !540, file: !541, line: 849, baseType: !539, size: 64, offset: 5248)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !540, file: !541, line: 852, baseType: !539, size: 64, offset: 5312)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !540, file: !541, line: 857, baseType: !169, size: 128, offset: 5376)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !540, file: !541, line: 858, baseType: !169, size: 128, offset: 5504)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !540, file: !541, line: 859, baseType: !539, size: 64, offset: 5632)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !540, file: !541, line: 867, baseType: !169, size: 128, offset: 5696)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !540, file: !541, line: 868, baseType: !169, size: 128, offset: 5824)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !540, file: !541, line: 871, baseType: !804, size: 64, offset: 5952)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !806, line: 59, size: 768, elements: !807)
!806 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !809, !810, !811, !822, !823, !830, !839}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !805, file: !806, line: 61, baseType: !553, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !805, file: !806, line: 62, baseType: !7, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !805, file: !806, line: 63, baseType: !239, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !805, file: !806, line: 65, baseType: !812, size: 256, offset: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 256, elements: !476)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !157, line: 182, size: 64, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !813, file: !157, line: 183, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !157, line: 186, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !817, file: !157, line: 187, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !817, file: !157, line: 187, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !805, file: !806, line: 66, baseType: !813, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !805, file: !806, line: 68, baseType: !824, size: 128, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !825, line: 40, baseType: !826)
!825 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !825, line: 36, size: 128, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !826, file: !825, line: 37, baseType: !239)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !826, file: !825, line: 38, baseType: !169, size: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !805, file: !806, line: 69, baseType: !831, size: 128, align: 64, offset: 512)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !157, line: 216, size: 128, align: 64, elements: !832)
!832 = !{!833, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !157, line: 217, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !831, file: !157, line: 218, baseType: !836, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !834}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !805, file: !806, line: 70, baseType: !840, size: 128, offset: 640)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 128, elements: !704)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !806, line: 54, size: 128, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !841, file: !806, line: 55, baseType: !182, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !841, file: !806, line: 56, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !806, line: 56, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !540, file: !541, line: 872, baseType: !848, size: 512, offset: 6016)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 512, elements: !476)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !540, file: !541, line: 873, baseType: !169, size: 128, offset: 6528)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !540, file: !541, line: 874, baseType: !169, size: 128, offset: 6656)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !540, file: !541, line: 876, baseType: !852, size: 64, offset: 6784)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !854, line: 26, size: 192, elements: !855)
!854 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !853, file: !854, line: 27, baseType: !7, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !853, file: !854, line: 28, baseType: !858, size: 128, offset: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !859, line: 43, size: 128, elements: !860)
!859 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !858, file: !859, line: 44, baseType: !442)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !858, file: !859, line: 45, baseType: !169, size: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !540, file: !541, line: 879, baseType: !864, size: 64, offset: 6848)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !540, file: !541, line: 882, baseType: !864, size: 64, offset: 6912)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !540, file: !541, line: 884, baseType: !397, size: 64, offset: 6976)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !540, file: !541, line: 885, baseType: !397, size: 64, offset: 7040)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !540, file: !541, line: 890, baseType: !397, size: 64, offset: 7104)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !540, file: !541, line: 891, baseType: !870, size: 128, offset: 7168)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !541, line: 242, size: 128, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !870, file: !541, line: 244, baseType: !397, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !870, file: !541, line: 245, baseType: !397, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !870, file: !541, line: 246, baseType: !442, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !540, file: !541, line: 900, baseType: !158, size: 64, offset: 7296)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !540, file: !541, line: 901, baseType: !158, size: 64, offset: 7360)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !540, file: !541, line: 904, baseType: !397, size: 64, offset: 7424)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !540, file: !541, line: 907, baseType: !397, size: 64, offset: 7488)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !540, file: !541, line: 910, baseType: !158, size: 64, offset: 7552)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !540, file: !541, line: 911, baseType: !158, size: 64, offset: 7616)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !540, file: !541, line: 914, baseType: !882, size: 640, offset: 7680)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !883, line: 123, size: 640, elements: !884)
!883 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!884 = !{!885, !891, !892}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !882, file: !883, line: 124, baseType: !886, size: 576)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 576, elements: !281)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !883, line: 108, size: 192, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !887, file: !883, line: 109, baseType: !397, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !887, file: !883, line: 110, baseType: !671, size: 128, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !882, file: !883, line: 125, baseType: !7, size: 32, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !882, file: !883, line: 126, baseType: !7, size: 32, offset: 608)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !540, file: !541, line: 917, baseType: !894, size: 192, offset: 8320)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !883, line: 134, size: 192, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !894, file: !883, line: 135, baseType: !831, size: 128, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !894, file: !883, line: 136, baseType: !7, size: 32, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !540, file: !541, line: 923, baseType: !899, size: 64, offset: 8512)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !902, line: 11, flags: DIFlagFwdDecl)
!902 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!903 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !540, file: !541, line: 926, baseType: !899, size: 64, offset: 8576)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !540, file: !541, line: 929, baseType: !899, size: 64, offset: 8640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !540, file: !541, line: 933, baseType: !906, size: 64, offset: 8704)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !541, line: 933, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !540, file: !541, line: 943, baseType: !909, size: 128, offset: 8768)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 128, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 16)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !540, file: !541, line: 945, baseType: !913, size: 64, offset: 8896)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !541, line: 49, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !540, file: !541, line: 956, baseType: !916, size: 64, offset: 8960)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !541, line: 45, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !540, file: !541, line: 959, baseType: !919, size: 64, offset: 9024)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !541, line: 959, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !540, file: !541, line: 962, baseType: !922, size: 64, offset: 9088)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !541, line: 66, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !540, file: !541, line: 966, baseType: !925, size: 64, offset: 9152)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !927, line: 35, flags: DIFlagFwdDecl)
!927 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!928 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !540, file: !541, line: 969, baseType: !929, size: 64, offset: 9216)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !883, line: 223, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !540, file: !541, line: 970, baseType: !932, size: 64, offset: 9280)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !541, line: 62, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !540, file: !541, line: 971, baseType: !935, size: 64, offset: 9344)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !936, line: 25, baseType: !937)
!936 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !936, line: 23, size: 64, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !937, file: !936, line: 24, baseType: !703, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !540, file: !541, line: 972, baseType: !935, size: 64, offset: 9408)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !540, file: !541, line: 974, baseType: !935, size: 64, offset: 9472)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !540, file: !541, line: 975, baseType: !943, size: 192, offset: 9536)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !944, line: 30, size: 192, elements: !945)
!944 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !943, file: !944, line: 31, baseType: !169, size: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !943, file: !944, line: 32, baseType: !935, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !540, file: !541, line: 976, baseType: !158, size: 64, offset: 9728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !540, file: !541, line: 977, baseType: !326, size: 64, offset: 9792)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !540, file: !541, line: 978, baseType: !7, size: 32, offset: 9856)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !540, file: !541, line: 980, baseType: !834, size: 64, offset: 9920)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !540, file: !541, line: 989, baseType: !953, size: 128, offset: 9984)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !954, line: 35, size: 128, elements: !955)
!954 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !953, file: !954, line: 36, baseType: !182, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !953, file: !954, line: 37, baseType: !417, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !953, file: !954, line: 38, baseType: !959, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !954, line: 23, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !540, file: !541, line: 992, baseType: !397, size: 64, offset: 10112)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !540, file: !541, line: 993, baseType: !397, size: 64, offset: 10176)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !540, file: !541, line: 996, baseType: !239, offset: 10240)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !540, file: !541, line: 999, baseType: !442, offset: 10240)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !540, file: !541, line: 1001, baseType: !966, size: 64, offset: 10240)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !541, line: 636, size: 64, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !966, file: !541, line: 637, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !540, file: !541, line: 1005, baseType: !674, size: 128, offset: 10304)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !540, file: !541, line: 1007, baseType: !539, size: 64, offset: 10432)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !540, file: !541, line: 1009, baseType: !973, size: 64, offset: 10496)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !541, line: 1009, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !540, file: !541, line: 1043, baseType: !159, size: 64, offset: 10560)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !540, file: !541, line: 1046, baseType: !977, size: 64, offset: 10624)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !541, line: 41, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !540, file: !541, line: 1050, baseType: !980, size: 64, offset: 10688)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !541, line: 42, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !540, file: !541, line: 1054, baseType: !983, size: 64, offset: 10752)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !541, line: 55, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !540, file: !541, line: 1056, baseType: !986, size: 64, offset: 10816)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !541, line: 40, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !540, file: !541, line: 1058, baseType: !989, size: 64, offset: 10880)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !541, line: 47, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !540, file: !541, line: 1061, baseType: !992, size: 64, offset: 10944)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !541, line: 43, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !540, file: !541, line: 1064, baseType: !158, size: 64, offset: 11008)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !540, file: !541, line: 1065, baseType: !996, size: 64, offset: 11072)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !944, line: 14, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !944, line: 12, size: 384, elements: !999)
!999 = !{!1000}
!1000 = !DIDerivedType(tag: DW_TAG_member, scope: !998, file: !944, line: 13, baseType: !1001, size: 384)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !998, file: !944, line: 13, size: 384, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1001, file: !944, line: 13, baseType: !182, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1001, file: !944, line: 13, baseType: !182, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1001, file: !944, line: 13, baseType: !182, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1001, file: !944, line: 13, baseType: !1007, size: 256, offset: 128)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !1008, line: 32, size: 256, elements: !1009)
!1008 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!1009 = !{!1010, !1016, !1029, !1035, !1044, !1064, !1069}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1007, file: !1008, line: 37, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1007, file: !1008, line: 34, size: 64, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1011, file: !1008, line: 35, baseType: !793, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1011, file: !1008, line: 36, baseType: !1015, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !313, line: 49, baseType: !7)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1007, file: !1008, line: 45, baseType: !1017, size: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1007, file: !1008, line: 40, size: 192, elements: !1018)
!1018 = !{!1019, !1021, !1022, !1028}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !1017, file: !1008, line: 41, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !313, line: 95, baseType: !182)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !1017, file: !1008, line: 42, baseType: !182, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !1017, file: !1008, line: 43, baseType: !1023, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !1008, line: 11, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1008, line: 8, size: 64, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1024, file: !1008, line: 9, baseType: !182, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1024, file: !1008, line: 10, baseType: !159, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !1017, file: !1008, line: 44, baseType: !182, size: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1007, file: !1008, line: 52, baseType: !1030, size: 128)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1007, file: !1008, line: 48, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1030, file: !1008, line: 49, baseType: !793, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1030, file: !1008, line: 50, baseType: !1015, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !1030, file: !1008, line: 51, baseType: !1023, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1007, file: !1008, line: 61, baseType: !1036, size: 256)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1007, file: !1008, line: 55, size: 256, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1043}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1036, file: !1008, line: 56, baseType: !793, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1036, file: !1008, line: 57, baseType: !1015, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !1036, file: !1008, line: 58, baseType: !182, size: 32, offset: 64)
