; ModuleID = '../bcout/drivers/acpi/utils.llvm.bc'
source_filename = "drivers/acpi/utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_buffer = type { i64, i8* }
%struct.mutex = type { %struct.atomic64_t, %struct.spinlock, %struct.list_head }
%struct.atomic64_t = type { i64 }
%struct.spinlock = type { %union.anon }
%union.anon = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.bus_type = type { i8*, i8*, %struct.device*, %struct.attribute_group**, %struct.attribute_group**, %struct.attribute_group**, i32 (%struct.device*, %struct.device_driver*)*, i32 (%struct.device*, %struct.kobj_uevent_env*)*, i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, void (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*, i32)*, i32 (%struct.device*)*, i32 (%struct.device*)*, i32 (%struct.device*)*, %struct.dev_pm_ops*, %struct.iommu_ops*, %struct.subsys_private*, %struct.lock_class_key, i8 }

!40 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !42, line: 524, baseType: !7, size: 32, elements: !43)
!42 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!43 = !{!44, !45, !46, !47, !48}
!44 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !42, line: 502, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!52 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!53 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!54 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !56, line: 76, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!58 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!64 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!65 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!66 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!68 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acpi_predicate", file: !70, line: 622, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "./include/linux/acpi.h", directory: "/home/lizy2001/genbc/linux")
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "all_versions", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "less_than_or_equal", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "equal", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "greater_than_or_equal", value: 3, isUnsigned: true)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !77, line: 305, baseType: !7, size: 32, elements: !78)
!77 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!83 = !{!84, !90, !94, !95, !100, !101, !102, !96, !103, !91, !153, !169, !1572, !319, !174}
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !85, line: 421, baseType: !86)
!85 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !87, line: 21, baseType: !88)
!87 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !89, line: 27, baseType: !7)
!89 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !85, line: 127, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !87, line: 23, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !89, line: 31, baseType: !93)
!93 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !87, line: 17, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !89, line: 21, baseType: !99)
!99 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!100 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !85, line: 899, size: 192, elements: !105)
!105 = !{!106, !108, !113, !120, !126, !132, !139, !147}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !85, line: 900, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !85, line: 635, baseType: !86)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !104, file: !85, line: 904, baseType: !109, size: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 901, size: 128, elements: !110)
!110 = !{!111, !112}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !85, line: 902, baseType: !107, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !109, file: !85, line: 903, baseType: !91, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !104, file: !85, line: 910, baseType: !114, size: 128)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 906, size: 128, elements: !115)
!115 = !{!116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !85, line: 907, baseType: !107, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !114, file: !85, line: 908, baseType: !86, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !114, file: !85, line: 909, baseType: !119, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !104, file: !85, line: 916, baseType: !121, size: 128)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 912, size: 128, elements: !122)
!122 = !{!123, !124, !125}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !85, line: 913, baseType: !107, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !121, file: !85, line: 914, baseType: !86, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !121, file: !85, line: 915, baseType: !96, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !104, file: !85, line: 922, baseType: !127, size: 128)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 918, size: 128, elements: !128)
!128 = !{!129, !130, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !85, line: 919, baseType: !107, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !127, file: !85, line: 920, baseType: !86, size: 32, offset: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !127, file: !85, line: 921, baseType: !103, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !104, file: !85, line: 928, baseType: !133, size: 128)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 924, size: 128, elements: !134)
!134 = !{!135, !136, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !85, line: 925, baseType: !107, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !133, file: !85, line: 926, baseType: !107, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !133, file: !85, line: 927, baseType: !138, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !85, line: 424, baseType: !101)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !104, file: !85, line: 935, baseType: !140, size: 192)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 930, size: 192, elements: !141)
!141 = !{!142, !143, !144, !146}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !85, line: 931, baseType: !107, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !140, file: !85, line: 932, baseType: !86, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !140, file: !85, line: 933, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !85, line: 128, baseType: !91)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !140, file: !85, line: 934, baseType: !86, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !104, file: !85, line: 941, baseType: !148, size: 96)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !104, file: !85, line: 937, size: 96, elements: !149)
!149 = !{!150, !151, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !85, line: 938, baseType: !107, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !148, file: !85, line: 939, baseType: !86, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !148, file: !85, line: 940, baseType: !86, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device_bus_id", file: !155, line: 99, size: 320, elements: !156)
!155 = !DIFile(filename: "drivers/acpi/internal.h", directory: "/home/lizy2001/genbc/linux")
!156 = !{!157, !161, !162}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bus_id", scope: !154, file: !155, line: 100, baseType: !158, size: 120)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 120, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 15)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "instance_no", scope: !154, file: !155, line: 101, baseType: !7, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !154, file: !155, line: 102, baseType: !163, size: 128, offset: 192)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !164, line: 178, size: 128, elements: !165)
!164 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !164, line: 179, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !163, file: !164, line: 179, baseType: !167, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !171, line: 351, size: 10880, elements: !172)
!171 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!172 = !{!173, !175, !176, !2225, !2226, !2227, !2228, !2229, !2230, !2239, !2256, !2281, !2310, !2334, !2355, !2361, !2370, !2402, !2416, !2438, !2442, !2443, !2444, !2445, !2446, !2447, !2448}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !170, file: !171, line: 352, baseType: !174, size: 32)
!174 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !170, file: !171, line: 353, baseType: !138, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !170, file: !171, line: 354, baseType: !177, size: 192, offset: 128)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !178, line: 17, size: 192, elements: !179)
!178 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!179 = !{!180, !182, !2224}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !177, file: !178, line: 18, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !177, file: !178, line: 19, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !178, line: 110, size: 1152, elements: !186)
!186 = !{!187, !191, !195, !203, !2166, !2170, !2174, !2179, !2183, !2184, !2188, !2192, !2196, !2207, !2208, !2209, !2210, !2220}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !185, file: !178, line: 111, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!181, !181}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !185, file: !178, line: 112, baseType: !192, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{null, !181}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !185, file: !178, line: 113, baseType: !196, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!199, !201}
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !164, line: 30, baseType: !200)
!200 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !185, file: !178, line: 114, baseType: !204, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!207, !201, !209}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !35, line: 461, size: 5568, elements: !212)
!212 = !{!213, !1700, !1702, !1705, !1706, !1757, !1854, !1855, !1856, !1857, !1858, !1867, !1972, !1985, !2092, !2093, !2097, !2098, !2099, !2100, !2104, !2110, !2111, !2114, !2115, !2116, !2119, !2120, !2121, !2122, !2154, !2155, !2156, !2159, !2162, !2163, !2164, !2165}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !211, file: !35, line: 462, baseType: !214, size: 512)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !215, line: 64, size: 512, elements: !216)
!215 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!216 = !{!217, !220, !221, !223, !282, !1536, !1690, !1695, !1696, !1697, !1698, !1699}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 65, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !214, file: !215, line: 66, baseType: !163, size: 128, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !215, line: 67, baseType: !222, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !214, file: !215, line: 68, baseType: !224, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !215, line: 192, size: 704, elements: !226)
!226 = !{!227, !228, !244, !245}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !225, file: !215, line: 193, baseType: !163, size: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !225, file: !215, line: 194, baseType: !229, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !230, line: 83, baseType: !231)
!230 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !230, line: 71, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, scope: !231, file: !230, line: 72, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !231, file: !230, line: 72, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !234, file: !230, line: 73, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !230, line: 20, elements: !238)
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !237, file: !230, line: 21, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !241, line: 25, baseType: !242)
!241 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 25, elements: !243)
!243 = !{}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !225, file: !215, line: 195, baseType: !214, size: 512, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !225, file: !215, line: 196, baseType: !246, size: 64, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !215, line: 156, size: 192, elements: !249)
!249 = !{!250, !255, !260}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !248, file: !215, line: 157, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!174, !224, !222}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !215, line: 158, baseType: !256, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{!218, !224, !222}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !248, file: !215, line: 159, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{!174, !224, !222, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !215, line: 148, size: 20736, elements: !267)
!267 = !{!268, !272, !276, !277, !281}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !266, file: !215, line: 149, baseType: !269, size: 192)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 192, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 3)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !266, file: !215, line: 150, baseType: !273, size: 4096, offset: 192)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 4096, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !266, file: !215, line: 151, baseType: !174, size: 32, offset: 4288)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !266, file: !215, line: 152, baseType: !278, size: 16384, offset: 4320)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 16384, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 2048)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !266, file: !215, line: 153, baseType: !174, size: 32, offset: 20704)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !214, file: !215, line: 69, baseType: !283, size: 64, offset: 320)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !215, line: 138, size: 448, elements: !285)
!285 = !{!286, !290, !320, !322, !1484, !1515, !1519}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !284, file: !215, line: 139, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !222}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !284, file: !215, line: 140, baseType: !291, size: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !294, line: 230, size: 128, elements: !295)
!294 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!295 = !{!296, !312}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !293, file: !294, line: 231, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !222, !305, !119}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !164, line: 60, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !302, line: 73, baseType: !303)
!302 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !302, line: 15, baseType: !304)
!304 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !294, line: 30, size: 128, elements: !307)
!307 = !{!308, !309}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !294, line: 31, baseType: !218, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !306, file: !294, line: 32, baseType: !310, size: 16, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !164, line: 19, baseType: !311)
!311 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !293, file: !294, line: 232, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!300, !222, !305, !218, !316}
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !164, line: 55, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !302, line: 72, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !302, line: 16, baseType: !319)
!319 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !284, file: !215, line: 141, baseType: !321, size: 64, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !284, file: !215, line: 142, baseType: !323, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !294, line: 84, size: 320, elements: !327)
!327 = !{!328, !329, !333, !1481, !1482}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !294, line: 85, baseType: !218, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !326, file: !294, line: 86, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!310, !222, !305, !174}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !326, file: !294, line: 88, baseType: !334, size: 64, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!310, !222, !337, !174}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !294, line: 168, size: 448, elements: !339)
!339 = !{!340, !341, !342, !343, !353, !354}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !338, file: !294, line: 169, baseType: !306, size: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !338, file: !294, line: 170, baseType: !316, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !338, file: !294, line: 171, baseType: !101, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !338, file: !294, line: 172, baseType: !344, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!300, !347, !222, !337, !119, !350, !316}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !349, line: 526, flags: DIFlagFwdDecl)
!349 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !164, line: 46, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !302, line: 88, baseType: !352)
!352 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !338, file: !294, line: 174, baseType: !344, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !338, file: !294, line: 176, baseType: !355, size: 64, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!174, !347, !222, !337, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !360, line: 305, size: 1472, elements: !361)
!360 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!361 = !{!362, !363, !364, !365, !366, !374, !375, !1455, !1461, !1462, !1467, !1468, !1471, !1475, !1476, !1477, !1478, !1479}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !359, file: !360, line: 308, baseType: !319, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !359, file: !360, line: 309, baseType: !319, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !359, file: !360, line: 313, baseType: !358, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !359, file: !360, line: 313, baseType: !358, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !359, file: !360, line: 315, baseType: !367, size: 192, align: 64, offset: 256)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !368, line: 24, size: 192, align: 64, elements: !369)
!368 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!369 = !{!370, !371, !373}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !367, file: !368, line: 25, baseType: !319, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !367, file: !368, line: 26, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !367, file: !368, line: 27, baseType: !372, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !359, file: !360, line: 323, baseType: !319, size: 64, offset: 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !359, file: !360, line: 327, baseType: !376, size: 64, offset: 512)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !360, line: 388, size: 7296, elements: !378)
!378 = !{!379, !1451}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !360, line: 389, baseType: !380, size: 7296)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !360, line: 389, size: 7296, elements: !381)
!381 = !{!382, !383, !387, !388, !392, !393, !394, !395, !396, !404, !409, !410, !411, !412, !421, !422, !423, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !458, !466, !469, !517, !518, !1421, !1422, !1425, !1429, !1430, !1433, !1434, !1435, !1438, !1450}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !380, file: !360, line: 390, baseType: !358, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !380, file: !360, line: 391, baseType: !384, size: 64, offset: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !368, line: 31, size: 64, elements: !385)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !384, file: !368, line: 32, baseType: !372, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !380, file: !360, line: 392, baseType: !91, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !380, file: !360, line: 394, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!319, !347, !319, !319, !319, !319}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !380, file: !360, line: 398, baseType: !319, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !380, file: !360, line: 399, baseType: !319, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !380, file: !360, line: 405, baseType: !319, size: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !380, file: !360, line: 406, baseType: !319, size: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !380, file: !360, line: 407, baseType: !397, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !349, line: 286, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !349, line: 286, size: 64, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !399, file: !349, line: 286, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !403, line: 18, baseType: !319)
!403 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!404 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !380, file: !360, line: 416, baseType: !405, size: 32, offset: 576)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !164, line: 168, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 166, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !406, file: !164, line: 167, baseType: !174, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !380, file: !360, line: 428, baseType: !405, size: 32, offset: 608)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !380, file: !360, line: 437, baseType: !405, size: 32, offset: 640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !380, file: !360, line: 447, baseType: !405, size: 32, offset: 672)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !380, file: !360, line: 450, baseType: !413, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !414, line: 13, baseType: !415)
!414 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !164, line: 175, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 173, size: 64, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !416, file: !164, line: 174, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !87, line: 22, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !89, line: 30, baseType: !352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !380, file: !360, line: 452, baseType: !174, size: 32, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !380, file: !360, line: 454, baseType: !229, offset: 800)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !380, file: !360, line: 457, baseType: !424, size: 256, offset: 832)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !425, line: 35, size: 256, elements: !426)
!425 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!426 = !{!427, !428, !429, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !424, file: !425, line: 36, baseType: !413, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !424, file: !425, line: 42, baseType: !413, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !424, file: !425, line: 46, baseType: !430, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !230, line: 29, baseType: !237)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !424, file: !425, line: 47, baseType: !163, size: 128, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !380, file: !360, line: 459, baseType: !163, size: 128, offset: 1088)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !380, file: !360, line: 466, baseType: !319, size: 64, offset: 1216)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !380, file: !360, line: 467, baseType: !319, size: 64, offset: 1280)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !380, file: !360, line: 469, baseType: !319, size: 64, offset: 1344)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !380, file: !360, line: 470, baseType: !319, size: 64, offset: 1408)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !380, file: !360, line: 471, baseType: !415, size: 64, offset: 1472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !380, file: !360, line: 472, baseType: !319, size: 64, offset: 1536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !380, file: !360, line: 473, baseType: !319, size: 64, offset: 1600)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !380, file: !360, line: 474, baseType: !319, size: 64, offset: 1664)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !380, file: !360, line: 475, baseType: !319, size: 64, offset: 1728)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !380, file: !360, line: 477, baseType: !229, offset: 1792)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !380, file: !360, line: 478, baseType: !319, size: 64, offset: 1792)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !380, file: !360, line: 478, baseType: !319, size: 64, offset: 1856)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !380, file: !360, line: 478, baseType: !319, size: 64, offset: 1920)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !380, file: !360, line: 478, baseType: !319, size: 64, offset: 1984)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !380, file: !360, line: 479, baseType: !319, size: 64, offset: 2048)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !380, file: !360, line: 479, baseType: !319, size: 64, offset: 2112)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !380, file: !360, line: 479, baseType: !319, size: 64, offset: 2176)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !380, file: !360, line: 480, baseType: !319, size: 64, offset: 2240)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !380, file: !360, line: 480, baseType: !319, size: 64, offset: 2304)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !380, file: !360, line: 480, baseType: !319, size: 64, offset: 2368)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !380, file: !360, line: 480, baseType: !319, size: 64, offset: 2432)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !380, file: !360, line: 482, baseType: !455, size: 2816, offset: 2496)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 2816, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 44)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !380, file: !360, line: 488, baseType: !459, size: 256, offset: 5312)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !460, line: 60, size: 256, elements: !461)
!460 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !459, file: !460, line: 61, baseType: !463, size: 256)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 256, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 4)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !380, file: !360, line: 490, baseType: !467, size: 64, offset: 5568)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !360, line: 490, flags: DIFlagFwdDecl)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !380, file: !360, line: 493, baseType: !470, size: 896, offset: 5632)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !471, line: 53, baseType: !472)
!471 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 13, size: 896, elements: !473)
!473 = !{!474, !475, !476, !477, !480, !481, !488, !489, !509, !510, !513}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !472, file: !471, line: 18, baseType: !91, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !472, file: !471, line: 28, baseType: !415, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !472, file: !471, line: 31, baseType: !424, size: 256, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !472, file: !471, line: 32, baseType: !478, size: 64, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !471, line: 32, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !472, file: !471, line: 37, baseType: !311, size: 16, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !472, file: !471, line: 40, baseType: !482, size: 192, offset: 512)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !483, line: 53, size: 192, elements: !484)
!483 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !482, file: !483, line: 54, baseType: !413, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !482, file: !483, line: 55, baseType: !229, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !482, file: !483, line: 59, baseType: !163, size: 128, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !472, file: !471, line: 41, baseType: !101, size: 64, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !472, file: !471, line: 42, baseType: !490, size: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !493, line: 13, size: 896, elements: !494)
!493 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !492, file: !493, line: 14, baseType: !101, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !493, line: 15, baseType: !319, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !492, file: !493, line: 17, baseType: !319, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !492, file: !493, line: 17, baseType: !319, size: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !492, file: !493, line: 19, baseType: !304, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !492, file: !493, line: 21, baseType: !304, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !492, file: !493, line: 22, baseType: !304, size: 64, offset: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !492, file: !493, line: 23, baseType: !304, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !492, file: !493, line: 24, baseType: !304, size: 64, offset: 512)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !492, file: !493, line: 25, baseType: !304, size: 64, offset: 576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !492, file: !493, line: 26, baseType: !304, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !492, file: !493, line: 27, baseType: !304, size: 64, offset: 704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !492, file: !493, line: 28, baseType: !304, size: 64, offset: 768)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !492, file: !493, line: 29, baseType: !304, size: 64, offset: 832)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !472, file: !471, line: 44, baseType: !405, size: 32, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !472, file: !471, line: 50, baseType: !511, size: 16, offset: 864)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !87, line: 19, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !89, line: 24, baseType: !311)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !472, file: !471, line: 51, baseType: !514, size: 16, offset: 880)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !87, line: 18, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !89, line: 23, baseType: !516)
!516 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !380, file: !360, line: 495, baseType: !319, size: 64, offset: 6528)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !380, file: !360, line: 497, baseType: !519, size: 64, offset: 6592)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !360, line: 381, size: 384, elements: !521)
!521 = !{!522, !523, !1420}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !520, file: !360, line: 382, baseType: !405, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !520, file: !360, line: 383, baseType: !524, size: 128, offset: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !360, line: 376, size: 128, elements: !525)
!525 = !{!526, !1418}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !524, file: !360, line: 377, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !529, line: 640, size: 48640, elements: !530)
!529 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!530 = !{!531, !537, !539, !540, !546, !547, !548, !549, !550, !551, !552, !553, !557, !575, !586, !678, !679, !680, !691, !692, !694, !695, !696, !697, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !776, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !832, !834, !835, !836, !848, !850, !851, !852, !853, !854, !860, !861, !862, !863, !864, !865, !866, !878, !883, !888, !889, !890, !893, !897, !900, !903, !906, !909, !913, !916, !919, !925, !926, !927, !933, !934, !935, !936, !937, !946, !947, !948, !949, !950, !955, !956, !957, !960, !961, !964, !967, !970, !973, !976, !979, !980, !1060, !1063, !1066, !1067, !1070, !1071, !1072, !1078, !1079, !1080, !1093, !1094, !1095, !1105, !1110, !1113, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !528, file: !529, line: 646, baseType: !532, size: 128)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !533, line: 56, size: 128, elements: !534)
!533 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !532, file: !533, line: 57, baseType: !319, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !532, file: !533, line: 58, baseType: !86, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !528, file: !529, line: 649, baseType: !538, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !304)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !528, file: !529, line: 657, baseType: !101, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !528, file: !529, line: 658, baseType: !541, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !542, line: 113, baseType: !543)
!542 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !542, line: 111, size: 32, elements: !544)
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !543, file: !542, line: 112, baseType: !405, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !528, file: !529, line: 660, baseType: !7, size: 32, offset: 288)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !528, file: !529, line: 661, baseType: !7, size: 32, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !528, file: !529, line: 684, baseType: !174, size: 32, offset: 352)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !528, file: !529, line: 686, baseType: !174, size: 32, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !528, file: !529, line: 687, baseType: !174, size: 32, offset: 416)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !528, file: !529, line: 688, baseType: !174, size: 32, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !528, file: !529, line: 689, baseType: !7, size: 32, offset: 480)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !528, file: !529, line: 691, baseType: !554, size: 64, offset: 512)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !529, line: 691, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !528, file: !529, line: 692, baseType: !558, size: 832, offset: 576)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !529, line: 451, size: 832, elements: !559)
!559 = !{!560, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !558, file: !529, line: 453, baseType: !561, size: 128)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !529, line: 325, size: 128, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !561, file: !529, line: 326, baseType: !319, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !561, file: !529, line: 327, baseType: !86, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !558, file: !529, line: 454, baseType: !367, size: 192, align: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !558, file: !529, line: 455, baseType: !163, size: 128, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !558, file: !529, line: 456, baseType: !7, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !558, file: !529, line: 458, baseType: !91, size: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !558, file: !529, line: 459, baseType: !91, size: 64, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !558, file: !529, line: 460, baseType: !91, size: 64, offset: 640)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !558, file: !529, line: 461, baseType: !91, size: 64, offset: 704)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !558, file: !529, line: 463, baseType: !91, size: 64, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !558, file: !529, line: 465, baseType: !574, offset: 832)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !529, line: 415, elements: !243)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !528, file: !529, line: 693, baseType: !576, size: 384, offset: 1408)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !529, line: 489, size: 384, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !576, file: !529, line: 490, baseType: !163, size: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !576, file: !529, line: 491, baseType: !319, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !576, file: !529, line: 492, baseType: !319, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !576, file: !529, line: 493, baseType: !7, size: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !576, file: !529, line: 494, baseType: !311, size: 16, offset: 288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !576, file: !529, line: 495, baseType: !311, size: 16, offset: 304)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !576, file: !529, line: 497, baseType: !585, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !528, file: !529, line: 697, baseType: !587, size: 1792, offset: 1792)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !529, line: 507, size: 1792, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !675, !676}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !587, file: !529, line: 508, baseType: !367, size: 192, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !587, file: !529, line: 515, baseType: !91, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !587, file: !529, line: 516, baseType: !91, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !587, file: !529, line: 517, baseType: !91, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !587, file: !529, line: 518, baseType: !91, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !587, file: !529, line: 519, baseType: !91, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !587, file: !529, line: 526, baseType: !419, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !587, file: !529, line: 527, baseType: !91, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !529, line: 528, baseType: !7, size: 32, offset: 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !587, file: !529, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !587, file: !529, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !587, file: !529, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !587, file: !529, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !587, file: !529, line: 563, baseType: !603, size: 512, offset: 704)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !12, line: 118, size: 512, elements: !604)
!604 = !{!605, !613, !614, !619, !671, !672, !673, !674}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !603, file: !12, line: 119, baseType: !606, size: 256)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !607, line: 9, size: 256, elements: !608)
!607 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !606, file: !607, line: 10, baseType: !367, size: 192, align: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !606, file: !607, line: 11, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !612, line: 29, baseType: !419)
!612 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !603, file: !12, line: 120, baseType: !611, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !603, file: !12, line: 121, baseType: !615, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!11, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !603, file: !12, line: 122, baseType: !620, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !12, line: 159, size: 512, align: 512, elements: !622)
!622 = !{!623, !643, !644, !647, !657, !658, !666, !670}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !621, file: !12, line: 160, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !12, line: 214, size: 4608, align: 512, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !625, file: !12, line: 215, baseType: !430)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !625, file: !12, line: 216, baseType: !7, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !625, file: !12, line: 217, baseType: !7, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !625, file: !12, line: 218, baseType: !7, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !625, file: !12, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !625, file: !12, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !625, file: !12, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !625, file: !12, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !625, file: !12, line: 233, baseType: !611, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !625, file: !12, line: 234, baseType: !618, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !625, file: !12, line: 235, baseType: !611, size: 64, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !625, file: !12, line: 236, baseType: !618, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !625, file: !12, line: 237, baseType: !640, size: 4096, offset: 512)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 4096, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !621, file: !12, line: 161, baseType: !7, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !621, file: !12, line: 162, baseType: !645, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !164, line: 27, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !302, line: 96, baseType: !174)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !621, file: !12, line: 163, baseType: !648, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !649, line: 276, baseType: !650)
!649 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !649, line: 276, size: 32, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !650, file: !649, line: 276, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !649, line: 70, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !649, line: 65, size: 32, elements: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !654, file: !649, line: 66, baseType: !7, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !621, file: !12, line: 164, baseType: !618, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !621, file: !12, line: 165, baseType: !659, size: 128, offset: 256)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !607, line: 14, size: 128, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !659, file: !607, line: 15, baseType: !662, size: 128)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !368, line: 125, size: 128, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !662, file: !368, line: 126, baseType: !384, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !662, file: !368, line: 127, baseType: !372, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !621, file: !12, line: 166, baseType: !667, size: 64, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!611}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !621, file: !12, line: 167, baseType: !611, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !603, file: !12, line: 123, baseType: !97, size: 8, offset: 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !603, file: !12, line: 124, baseType: !97, size: 8, offset: 456)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !603, file: !12, line: 125, baseType: !97, size: 8, offset: 464)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !603, file: !12, line: 126, baseType: !97, size: 8, offset: 472)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !587, file: !529, line: 572, baseType: !603, size: 512, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !587, file: !529, line: 580, baseType: !677, size: 64, offset: 1728)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !528, file: !529, line: 721, baseType: !7, size: 32, offset: 3584)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !528, file: !529, line: 722, baseType: !174, size: 32, offset: 3616)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !528, file: !529, line: 723, baseType: !681, size: 64, offset: 3648)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !684, line: 17, baseType: !685)
!684 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !684, line: 17, size: 64, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !685, file: !684, line: 17, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 1)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !528, file: !529, line: 724, baseType: !683, size: 64, offset: 3712)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !528, file: !529, line: 749, baseType: !693, offset: 3776)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !529, line: 290, elements: !243)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !528, file: !529, line: 751, baseType: !163, size: 128, offset: 3776)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !528, file: !529, line: 757, baseType: !376, size: 64, offset: 3904)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !528, file: !529, line: 758, baseType: !376, size: 64, offset: 3968)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !528, file: !529, line: 761, baseType: !698, size: 320, offset: 4032)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !460, line: 34, size: 320, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !698, file: !460, line: 35, baseType: !91, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !698, file: !460, line: 36, baseType: !702, size: 256, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 256, elements: !464)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !528, file: !529, line: 766, baseType: !174, size: 32, offset: 4352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !528, file: !529, line: 767, baseType: !174, size: 32, offset: 4384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !528, file: !529, line: 768, baseType: !174, size: 32, offset: 4416)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !528, file: !529, line: 770, baseType: !174, size: 32, offset: 4448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !528, file: !529, line: 772, baseType: !319, size: 64, offset: 4480)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !528, file: !529, line: 775, baseType: !7, size: 32, offset: 4544)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !528, file: !529, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !528, file: !529, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !528, file: !529, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !528, file: !529, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !528, file: !529, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !528, file: !529, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !528, file: !529, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !528, file: !529, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !528, file: !529, line: 831, baseType: !319, size: 64, offset: 4672)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !528, file: !529, line: 833, baseType: !719, size: 384, offset: 4736)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !17, line: 25, size: 384, elements: !720)
!720 = !{!721, !726}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !719, file: !17, line: 26, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!304, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, scope: !719, file: !17, line: 27, baseType: !727, size: 320, offset: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !17, line: 27, size: 320, elements: !728)
!728 = !{!729, !739, !766}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !727, file: !17, line: 36, baseType: !730, size: 320)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !17, line: 29, size: 320, elements: !731)
!731 = !{!732, !734, !735, !736, !737, !738}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !730, file: !17, line: 30, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !730, file: !17, line: 31, baseType: !86, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !730, file: !17, line: 32, baseType: !86, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !730, file: !17, line: 33, baseType: !86, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !730, file: !17, line: 34, baseType: !91, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !730, file: !17, line: 35, baseType: !733, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !727, file: !17, line: 46, baseType: !740, size: 192)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !17, line: 38, size: 192, elements: !741)
!741 = !{!742, !743, !744, !765}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !740, file: !17, line: 39, baseType: !645, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !740, file: !17, line: 40, baseType: !16, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, scope: !740, file: !17, line: 41, baseType: !745, size: 64, offset: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !740, file: !17, line: 41, size: 64, elements: !746)
!746 = !{!747, !755}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !745, file: !17, line: 42, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !750, line: 7, size: 128, elements: !751)
!750 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!751 = !{!752, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !749, file: !750, line: 8, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !302, line: 93, baseType: !352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !749, file: !750, line: 9, baseType: !352, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !745, file: !17, line: 43, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !758, line: 7, size: 64, elements: !759)
!758 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!759 = !{!760, !764}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !757, file: !758, line: 8, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !758, line: 5, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !87, line: 20, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !89, line: 26, baseType: !174)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !757, file: !758, line: 9, baseType: !762, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !740, file: !17, line: 45, baseType: !91, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !727, file: !17, line: 54, baseType: !767, size: 256)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !727, file: !17, line: 48, size: 256, elements: !768)
!768 = !{!769, !772, !773, !774, !775}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !767, file: !17, line: 49, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !17, line: 14, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !767, file: !17, line: 50, baseType: !174, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !767, file: !17, line: 51, baseType: !174, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !767, file: !17, line: 52, baseType: !319, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !767, file: !17, line: 53, baseType: !319, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !528, file: !529, line: 835, baseType: !777, size: 32, offset: 5120)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !164, line: 22, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !302, line: 28, baseType: !174)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !528, file: !529, line: 836, baseType: !777, size: 32, offset: 5152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !528, file: !529, line: 840, baseType: !319, size: 64, offset: 5184)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !528, file: !529, line: 849, baseType: !527, size: 64, offset: 5248)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !528, file: !529, line: 852, baseType: !527, size: 64, offset: 5312)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !528, file: !529, line: 857, baseType: !163, size: 128, offset: 5376)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !528, file: !529, line: 858, baseType: !163, size: 128, offset: 5504)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !528, file: !529, line: 859, baseType: !527, size: 64, offset: 5632)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !528, file: !529, line: 867, baseType: !163, size: 128, offset: 5696)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !528, file: !529, line: 868, baseType: !163, size: 128, offset: 5824)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !528, file: !529, line: 871, baseType: !789, size: 64, offset: 5952)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !791, line: 59, size: 768, elements: !792)
!791 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!792 = !{!793, !794, !795, !796, !807, !808, !815, !824}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !790, file: !791, line: 61, baseType: !541, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !790, file: !791, line: 62, baseType: !7, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !790, file: !791, line: 63, baseType: !229, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !790, file: !791, line: 65, baseType: !797, size: 256, offset: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 256, elements: !464)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !164, line: 182, size: 64, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !798, file: !164, line: 183, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !164, line: 186, size: 128, elements: !803)
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !802, file: !164, line: 187, baseType: !801, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !802, file: !164, line: 187, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !790, file: !791, line: 66, baseType: !798, size: 64, offset: 320)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !790, file: !791, line: 68, baseType: !809, size: 128, offset: 384)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !810, line: 40, baseType: !811)
!810 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !810, line: 36, size: 128, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !811, file: !810, line: 37, baseType: !229)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !811, file: !810, line: 38, baseType: !163, size: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !790, file: !791, line: 69, baseType: !816, size: 128, align: 64, offset: 512)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !164, line: 216, size: 128, align: 64, elements: !817)
!817 = !{!818, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !816, file: !164, line: 217, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !816, file: !164, line: 218, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !819}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !790, file: !791, line: 70, baseType: !825, size: 128, offset: 640)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 128, elements: !689)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !791, line: 54, size: 128, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !826, file: !791, line: 55, baseType: !174, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !826, file: !791, line: 56, baseType: !830, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !791, line: 56, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !528, file: !529, line: 872, baseType: !833, size: 512, offset: 6016)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 512, elements: !464)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !528, file: !529, line: 873, baseType: !163, size: 128, offset: 6528)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !528, file: !529, line: 874, baseType: !163, size: 128, offset: 6656)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !528, file: !529, line: 876, baseType: !837, size: 64, offset: 6784)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !839, line: 26, size: 192, elements: !840)
!839 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !838, file: !839, line: 27, baseType: !7, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !838, file: !839, line: 28, baseType: !843, size: 128, offset: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !844, line: 43, size: 128, elements: !845)
!844 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !843, file: !844, line: 44, baseType: !430)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !843, file: !844, line: 45, baseType: !163, size: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !528, file: !529, line: 879, baseType: !849, size: 64, offset: 6848)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !528, file: !529, line: 882, baseType: !849, size: 64, offset: 6912)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !528, file: !529, line: 884, baseType: !91, size: 64, offset: 6976)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !528, file: !529, line: 885, baseType: !91, size: 64, offset: 7040)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !528, file: !529, line: 890, baseType: !91, size: 64, offset: 7104)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !528, file: !529, line: 891, baseType: !855, size: 128, offset: 7168)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !529, line: 242, size: 128, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !855, file: !529, line: 244, baseType: !91, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !855, file: !529, line: 245, baseType: !91, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !855, file: !529, line: 246, baseType: !430, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !528, file: !529, line: 900, baseType: !319, size: 64, offset: 7296)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !528, file: !529, line: 901, baseType: !319, size: 64, offset: 7360)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !528, file: !529, line: 904, baseType: !91, size: 64, offset: 7424)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !528, file: !529, line: 907, baseType: !91, size: 64, offset: 7488)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !528, file: !529, line: 910, baseType: !319, size: 64, offset: 7552)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !528, file: !529, line: 911, baseType: !319, size: 64, offset: 7616)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !528, file: !529, line: 914, baseType: !867, size: 640, offset: 7680)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !868, line: 123, size: 640, elements: !869)
!868 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!869 = !{!870, !876, !877}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !867, file: !868, line: 124, baseType: !871, size: 576)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 576, elements: !270)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !868, line: 108, size: 192, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !872, file: !868, line: 109, baseType: !91, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !872, file: !868, line: 110, baseType: !659, size: 128, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !867, file: !868, line: 125, baseType: !7, size: 32, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !867, file: !868, line: 126, baseType: !7, size: 32, offset: 608)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !528, file: !529, line: 917, baseType: !879, size: 192, offset: 8320)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !868, line: 134, size: 192, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !879, file: !868, line: 135, baseType: !816, size: 128, align: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !879, file: !868, line: 136, baseType: !7, size: 32, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !528, file: !529, line: 923, baseType: !884, size: 64, offset: 8512)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !887, line: 11, flags: DIFlagFwdDecl)
!887 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!888 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !528, file: !529, line: 926, baseType: !884, size: 64, offset: 8576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !528, file: !529, line: 929, baseType: !884, size: 64, offset: 8640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !528, file: !529, line: 933, baseType: !891, size: 64, offset: 8704)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !529, line: 933, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !528, file: !529, line: 943, baseType: !894, size: 128, offset: 8768)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 16)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !528, file: !529, line: 945, baseType: !898, size: 64, offset: 8896)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !529, line: 49, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !528, file: !529, line: 956, baseType: !901, size: 64, offset: 8960)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !529, line: 45, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !528, file: !529, line: 959, baseType: !904, size: 64, offset: 9024)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !529, line: 959, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !528, file: !529, line: 962, baseType: !907, size: 64, offset: 9088)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !529, line: 66, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !528, file: !529, line: 966, baseType: !910, size: 64, offset: 9152)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !912, line: 35, flags: DIFlagFwdDecl)
!912 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!913 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !528, file: !529, line: 969, baseType: !914, size: 64, offset: 9216)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !868, line: 223, flags: DIFlagFwdDecl)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !528, file: !529, line: 970, baseType: !917, size: 64, offset: 9280)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !529, line: 62, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !528, file: !529, line: 971, baseType: !920, size: 64, offset: 9344)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !921, line: 25, baseType: !922)
!921 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !921, line: 23, size: 64, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !922, file: !921, line: 24, baseType: !688, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !528, file: !529, line: 972, baseType: !920, size: 64, offset: 9408)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !528, file: !529, line: 974, baseType: !920, size: 64, offset: 9472)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !528, file: !529, line: 975, baseType: !928, size: 192, offset: 9536)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !929, line: 30, size: 192, elements: !930)
!929 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !928, file: !929, line: 31, baseType: !163, size: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !928, file: !929, line: 32, baseType: !920, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !528, file: !529, line: 976, baseType: !319, size: 64, offset: 9728)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !528, file: !529, line: 977, baseType: !316, size: 64, offset: 9792)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !528, file: !529, line: 978, baseType: !7, size: 32, offset: 9856)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !528, file: !529, line: 980, baseType: !819, size: 64, offset: 9920)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !528, file: !529, line: 989, baseType: !938, size: 128, offset: 9984)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !939, line: 35, size: 128, elements: !940)
!939 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!940 = !{!941, !942, !943}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !938, file: !939, line: 36, baseType: !174, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !938, file: !939, line: 37, baseType: !405, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !938, file: !939, line: 38, baseType: !944, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !939, line: 23, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !528, file: !529, line: 992, baseType: !91, size: 64, offset: 10112)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !528, file: !529, line: 993, baseType: !91, size: 64, offset: 10176)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !528, file: !529, line: 996, baseType: !229, offset: 10240)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !528, file: !529, line: 999, baseType: !430, offset: 10240)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !528, file: !529, line: 1001, baseType: !951, size: 64, offset: 10240)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !529, line: 636, size: 64, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !951, file: !529, line: 637, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !528, file: !529, line: 1005, baseType: !662, size: 128, offset: 10304)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !528, file: !529, line: 1007, baseType: !527, size: 64, offset: 10432)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !528, file: !529, line: 1009, baseType: !958, size: 64, offset: 10496)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !529, line: 1009, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !528, file: !529, line: 1043, baseType: !101, size: 64, offset: 10560)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !528, file: !529, line: 1046, baseType: !962, size: 64, offset: 10624)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !529, line: 41, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !528, file: !529, line: 1050, baseType: !965, size: 64, offset: 10688)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !529, line: 42, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !528, file: !529, line: 1054, baseType: !968, size: 64, offset: 10752)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !529, line: 55, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !528, file: !529, line: 1056, baseType: !971, size: 64, offset: 10816)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !529, line: 40, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !528, file: !529, line: 1058, baseType: !974, size: 64, offset: 10880)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !529, line: 47, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !528, file: !529, line: 1061, baseType: !977, size: 64, offset: 10944)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !529, line: 43, flags: DIFlagFwdDecl)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !528, file: !529, line: 1064, baseType: !319, size: 64, offset: 11008)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !528, file: !529, line: 1065, baseType: !981, size: 64, offset: 11072)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
