; ModuleID = '../bcout/drivers/net/wireless/ath/ath6kl/core.llvm.bc'
source_filename = "drivers/net/wireless/ath/ath6kl/core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.lock_class_key = type {}
%struct.kmem_cache = type opaque

!351 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_MBSS", value: 3, isUnsigned: true)
!352 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_ANY", value: 4, isUnsigned: true)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_chan_width", file: !272, line: 4521, baseType: !7, size: 32, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!355 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20_NOHT", value: 0, isUnsigned: true)
!356 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20", value: 1, isUnsigned: true)
!357 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_40", value: 2, isUnsigned: true)
!358 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80", value: 3, isUnsigned: true)
!359 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80P80", value: 4, isUnsigned: true)
!360 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_160", value: 5, isUnsigned: true)
!361 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_5", value: 6, isUnsigned: true)
!362 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_10", value: 7, isUnsigned: true)
!363 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_1", value: 8, isUnsigned: true)
!364 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_2", value: 9, isUnsigned: true)
!365 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_4", value: 10, isUnsigned: true)
!366 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_8", value: 11, isUnsigned: true)
!367 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_16", value: 12, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_key_mode", file: !272, line: 4491, baseType: !7, size: 32, elements: !369)
!369 = !{!370, !371, !372}
!370 = !DIEnumerator(name: "NL80211_KEY_RX_TX", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "NL80211_KEY_NO_TX", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "NL80211_KEY_SET_TX", value: 2, isUnsigned: true)
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_auth_type", file: !272, line: 4672, baseType: !7, size: 32, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385}
!375 = !DIEnumerator(name: "NL80211_AUTHTYPE_OPEN_SYSTEM", value: 0, isUnsigned: true)
!376 = !DIEnumerator(name: "NL80211_AUTHTYPE_SHARED_KEY", value: 1, isUnsigned: true)
!377 = !DIEnumerator(name: "NL80211_AUTHTYPE_FT", value: 2, isUnsigned: true)
!378 = !DIEnumerator(name: "NL80211_AUTHTYPE_NETWORK_EAP", value: 3, isUnsigned: true)
!379 = !DIEnumerator(name: "NL80211_AUTHTYPE_SAE", value: 4, isUnsigned: true)
!380 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK", value: 5, isUnsigned: true)
!381 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK_PFS", value: 6, isUnsigned: true)
!382 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_PK", value: 7, isUnsigned: true)
!383 = !DIEnumerator(name: "__NL80211_AUTHTYPE_NUM", value: 8, isUnsigned: true)
!384 = !DIEnumerator(name: "NL80211_AUTHTYPE_MAX", value: 7, isUnsigned: true)
!385 = !DIEnumerator(name: "NL80211_AUTHTYPE_AUTOMATIC", value: 8, isUnsigned: true)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_mfp", file: !272, line: 4709, baseType: !7, size: 32, elements: !387)
!387 = !{!388, !389, !390}
!388 = !DIEnumerator(name: "NL80211_MFP_NO", value: 0, isUnsigned: true)
!389 = !DIEnumerator(name: "NL80211_MFP_REQUIRED", value: 1, isUnsigned: true)
!390 = !DIEnumerator(name: "NL80211_MFP_OPTIONAL", value: 2, isUnsigned: true)
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_bss_select_attr", file: !272, line: 6321, baseType: !7, size: 32, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398}
!393 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_INVALID", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_BAND_PREF", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI_ADJUST", value: 3, isUnsigned: true)
!397 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_AFTER_LAST", value: 4, isUnsigned: true)
!398 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_MAX", value: 3, isUnsigned: true)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !31, line: 423, baseType: !7, size: 32, elements: !400)
!400 = !{!401, !402, !403, !404}
!401 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!402 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!403 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!404 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!405 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !406, file: !31, line: 2085, baseType: !7, size: 32, elements: !8002)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !31, line: 1858, size: 15808, elements: !407)
!407 = !{!408, !413, !436, !453, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !470, !478, !479, !480, !481, !482, !483, !484, !485, !486, !512, !522, !523, !524, !529, !530, !534, !537, !5659, !6175, !6179, !6219, !6220, !6221, !6222, !6223, !6224, !6225, !6226, !6227, !6228, !6229, !6230, !6231, !6232, !6233, !6234, !6235, !6236, !6237, !6238, !6239, !6240, !6241, !6242, !6243, !6244, !6245, !6250, !6251, !6252, !6534, !6535, !6536, !6537, !6540, !6543, !6546, !7828, !7831, !7832, !7845, !7846, !7847, !7848, !7849, !7850, !7857, !7858, !7892, !7893, !7894, !7895, !7896, !7897, !7898, !7899, !7900, !7903, !7904, !7905, !7906, !7907, !7908, !7909, !7910, !7911, !7916, !7917, !7918, !7919, !7956, !7957, !7959, !7960, !7964, !7965, !7966, !7967, !7973, !7975, !7978, !7981, !7983, !7984, !7985, !7986, !7987, !7991, !7994}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !406, file: !31, line: 1859, baseType: !409, size: 128)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 128, elements: !411)
!410 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!411 = !{!412}
!412 = !DISubrange(count: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !406, file: !31, line: 1860, baseType: !414, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !31, line: 938, size: 384, elements: !416)
!416 = !{!417, !425, !431, !433}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !415, file: !31, line: 939, baseType: !418, size: 128)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !419, line: 186, size: 128, elements: !420)
!419 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!420 = !{!421, !423}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !419, line: 187, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !418, file: !419, line: 187, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !415, file: !31, line: 940, baseType: !426, size: 128, offset: 128)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !419, line: 178, size: 128, elements: !427)
!427 = !{!428, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !419, line: 179, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !426, file: !419, line: 179, baseType: !429, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !415, file: !31, line: 941, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !31, line: 942, baseType: !434, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !406, file: !31, line: 1861, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !31, line: 930, size: 128, elements: !439)
!439 = !{!440, !449}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !438, file: !31, line: 931, baseType: !441, size: 128, align: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !419, line: 216, size: 128, align: 64, elements: !442)
!442 = !{!443, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !419, line: 217, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !441, file: !419, line: 218, baseType: !446, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !444}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !438, file: !31, line: 932, baseType: !450, offset: 128)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: -1)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !406, file: !31, line: 1866, baseType: !454, size: 64, offset: 256)
!454 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !406, file: !31, line: 1867, baseType: !454, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !406, file: !31, line: 1868, baseType: !454, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !406, file: !31, line: 1869, baseType: !32, size: 32, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !406, file: !31, line: 1877, baseType: !454, size: 64, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !406, file: !31, line: 1879, baseType: !426, size: 128, offset: 576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !406, file: !31, line: 1880, baseType: !426, size: 128, offset: 704)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !406, file: !31, line: 1881, baseType: !426, size: 128, offset: 832)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !406, file: !31, line: 1882, baseType: !426, size: 128, offset: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !406, file: !31, line: 1883, baseType: !426, size: 128, offset: 1088)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !406, file: !31, line: 1884, baseType: !426, size: 128, offset: 1216)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !406, file: !31, line: 1889, baseType: !466, size: 256, offset: 1344)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !406, file: !31, line: 1886, size: 256, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !466, file: !31, line: 1887, baseType: !426, size: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !466, file: !31, line: 1888, baseType: !426, size: 128, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !406, file: !31, line: 1891, baseType: !471, size: 64, offset: 1600)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !472, line: 12, baseType: !473)
!472 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !474, line: 23, baseType: !475)
!474 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !476, line: 31, baseType: !477)
!476 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!477 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !406, file: !31, line: 1892, baseType: !471, size: 64, offset: 1664)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !406, file: !31, line: 1893, baseType: !471, size: 64, offset: 1728)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !406, file: !31, line: 1894, baseType: !471, size: 64, offset: 1792)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !406, file: !31, line: 1895, baseType: !471, size: 64, offset: 1856)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !406, file: !31, line: 1896, baseType: !471, size: 64, offset: 1920)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !406, file: !31, line: 1897, baseType: !471, size: 64, offset: 1984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !406, file: !31, line: 1899, baseType: !32, size: 32, offset: 2048)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !406, file: !31, line: 1900, baseType: !32, size: 32, offset: 2080)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !406, file: !31, line: 1902, baseType: !487, size: 1472, offset: 2112)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !31, line: 169, size: 1472, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !487, file: !31, line: 170, baseType: !454, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !487, file: !31, line: 171, baseType: !454, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !487, file: !31, line: 172, baseType: !454, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !487, file: !31, line: 173, baseType: !454, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !487, file: !31, line: 174, baseType: !454, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !487, file: !31, line: 175, baseType: !454, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !487, file: !31, line: 176, baseType: !454, size: 64, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !487, file: !31, line: 177, baseType: !454, size: 64, offset: 448)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !487, file: !31, line: 178, baseType: !454, size: 64, offset: 512)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !487, file: !31, line: 179, baseType: !454, size: 64, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !487, file: !31, line: 180, baseType: !454, size: 64, offset: 640)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !487, file: !31, line: 181, baseType: !454, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !487, file: !31, line: 182, baseType: !454, size: 64, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !487, file: !31, line: 183, baseType: !454, size: 64, offset: 832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !487, file: !31, line: 184, baseType: !454, size: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !487, file: !31, line: 185, baseType: !454, size: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !487, file: !31, line: 186, baseType: !454, size: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !487, file: !31, line: 187, baseType: !454, size: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !487, file: !31, line: 188, baseType: !454, size: 64, offset: 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !487, file: !31, line: 189, baseType: !454, size: 64, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !487, file: !31, line: 190, baseType: !454, size: 64, offset: 1280)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !487, file: !31, line: 191, baseType: !454, size: 64, offset: 1344)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !487, file: !31, line: 192, baseType: !454, size: 64, offset: 1408)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !406, file: !31, line: 1904, baseType: !513, size: 64, offset: 3584)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !514, line: 13, baseType: !515)
!514 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !419, line: 175, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 173, size: 64, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !516, file: !419, line: 174, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !474, line: 22, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !476, line: 30, baseType: !521)
!521 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !406, file: !31, line: 1905, baseType: !513, size: 64, offset: 3648)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !406, file: !31, line: 1906, baseType: !513, size: 64, offset: 3712)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !406, file: !31, line: 1909, baseType: !525, size: 32, offset: 3776)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !419, line: 168, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 166, size: 32, elements: !527)
!527 = !{!528}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !526, file: !419, line: 167, baseType: !32, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !406, file: !31, line: 1910, baseType: !525, size: 32, offset: 3808)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !406, file: !31, line: 1913, baseType: !531, size: 64, offset: 3840)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !31, line: 1913, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !406, file: !31, line: 1914, baseType: !535, size: 64, offset: 3904)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !31, line: 1914, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !406, file: !31, line: 1916, baseType: !538, size: 64, offset: 3968)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !31, line: 1283, size: 4416, elements: !541)
!541 = !{!542, !546, !550, !551, !552, !715, !719, !724, !728, !729, !734, !735, !858, !863, !867, !873, !877, !909, !917, !921, !926, !930, !931, !937, !941, !945, !949, !950, !972, !976, !991, !1002, !1006, !1015, !1019, !1020, !1024, !1045, !1049, !1053, !1057, !1061, !1068, !1072, !1090, !1094, !1144, !1148, !1153, !1157, !1161, !1165, !1175, !1176, !1185, !1191, !1192, !1196, !1200, !1204, !1208, !1209, !1213, !1214, !5619, !5639, !5643, !5649, !5655}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !540, file: !31, line: 1284, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!32, !432}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !540, file: !31, line: 1285, baseType: !547, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !432}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !540, file: !31, line: 1286, baseType: !543, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !540, file: !31, line: 1287, baseType: !543, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !540, file: !31, line: 1288, baseType: !553, size: 64, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!556, !557, !432}
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !31, line: 120, baseType: !30)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !559, line: 713, size: 1600, elements: !560)
!559 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!560 = !{!561, !583, !591, !598, !602, !614, !615, !616, !619, !620, !621, !627, !628, !629, !630, !631, !632, !633, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !673, !674, !675, !676, !678, !679, !684, !689, !694, !695, !696, !697, !698, !699, !700, !701, !702, !704, !705, !707, !708, !709}
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 714, baseType: !562, size: 192)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 714, size: 192, elements: !563)
!563 = !{!564, !574, !582}
!564 = !DIDerivedType(tag: DW_TAG_member, scope: !562, file: !559, line: 715, baseType: !565, size: 192)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !562, file: !559, line: 715, size: 192, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !559, line: 717, baseType: !557, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !559, line: 718, baseType: !557, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !559, line: 720, baseType: !570, size: 64, offset: 128)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !559, line: 720, size: 64, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !570, file: !559, line: 721, baseType: !432, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !570, file: !559, line: 726, baseType: !454, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !562, file: !559, line: 729, baseType: !575, size: 192, align: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !576, line: 24, size: 192, align: 64, elements: !577)
!576 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!577 = !{!578, !579, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !575, file: !576, line: 25, baseType: !454, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !575, file: !576, line: 26, baseType: !580, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !575, file: !576, line: 27, baseType: !580, size: 64, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !562, file: !559, line: 730, baseType: !426, size: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 733, baseType: !584, size: 64, offset: 192)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 733, size: 64, elements: !585)
!585 = !{!586, !590}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !584, file: !559, line: 734, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !589, line: 124, flags: DIFlagFwdDecl)
!589 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !584, file: !559, line: 735, baseType: !32, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 738, baseType: !592, size: 64, offset: 256)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 738, size: 64, elements: !593)
!593 = !{!594, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !592, file: !559, line: 739, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !596, line: 29, baseType: !519)
!596 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !592, file: !559, line: 740, baseType: !473, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !558, file: !559, line: 748, baseType: !599, size: 384, align: 64, offset: 320)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 384, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 48)
!602 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 750, baseType: !603, size: 128, offset: 704)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 750, size: 128, elements: !604)
!604 = !{!605, !613}
!605 = !DIDerivedType(tag: DW_TAG_member, scope: !603, file: !559, line: 751, baseType: !606, size: 128)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !559, line: 751, size: 128, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !606, file: !559, line: 752, baseType: !454, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !606, file: !559, line: 753, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !557}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !603, file: !559, line: 755, baseType: !426, size: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !558, file: !559, line: 761, baseType: !7, size: 32, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !558, file: !559, line: 762, baseType: !7, size: 32, offset: 864)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !558, file: !559, line: 763, baseType: !617, size: 16, offset: 896)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !476, line: 24, baseType: !618)
!618 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !558, file: !559, line: 764, baseType: !617, size: 16, offset: 912)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !558, file: !559, line: 769, baseType: !617, size: 16, offset: 928)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !558, file: !559, line: 780, baseType: !622, offset: 944)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, elements: !625)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !476, line: 21, baseType: !624)
!624 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!625 = !{!626}
!626 = !DISubrange(count: 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !558, file: !559, line: 782, baseType: !623, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !558, file: !559, line: 783, baseType: !623, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !558, file: !559, line: 784, baseType: !623, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !558, file: !559, line: 785, baseType: !623, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !558, file: !559, line: 786, baseType: !623, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !558, file: !559, line: 787, baseType: !623, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !558, file: !559, line: 795, baseType: !634, offset: 960)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, elements: !625)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !476, line: 27, baseType: !7)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !558, file: !559, line: 807, baseType: !622, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !558, file: !559, line: 809, baseType: !623, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !558, file: !559, line: 810, baseType: !623, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !558, file: !559, line: 811, baseType: !623, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !558, file: !559, line: 812, baseType: !623, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !558, file: !559, line: 813, baseType: !623, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !558, file: !559, line: 815, baseType: !623, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !558, file: !559, line: 816, baseType: !623, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !558, file: !559, line: 817, baseType: !623, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !558, file: !559, line: 818, baseType: !623, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !558, file: !559, line: 819, baseType: !623, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !558, file: !559, line: 821, baseType: !623, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !558, file: !559, line: 822, baseType: !623, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !558, file: !559, line: 823, baseType: !623, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !558, file: !559, line: 832, baseType: !622, offset: 976)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !558, file: !559, line: 834, baseType: !623, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !558, file: !559, line: 835, baseType: !623, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !558, file: !559, line: 836, baseType: !623, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !558, file: !559, line: 837, baseType: !623, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !558, file: !559, line: 838, baseType: !623, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !558, file: !559, line: 840, baseType: !623, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !558, file: !559, line: 843, baseType: !623, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !558, file: !559, line: 844, baseType: !623, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !558, file: !559, line: 845, baseType: !623, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !558, file: !559, line: 847, baseType: !623, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !558, file: !559, line: 848, baseType: !623, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!662 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 866, baseType: !663, size: 32, offset: 992)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 866, size: 32, elements: !664)
!664 = !{!665, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !663, file: !559, line: 867, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !667, line: 37, baseType: !635)
!667 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!668 = !DIDerivedType(tag: DW_TAG_member, scope: !663, file: !559, line: 868, baseType: !669, size: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !663, file: !559, line: 868, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !669, file: !559, line: 869, baseType: !617, size: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !669, file: !559, line: 870, baseType: !617, size: 16, offset: 16)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !558, file: !559, line: 873, baseType: !635, size: 32, offset: 1024)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !558, file: !559, line: 874, baseType: !32, size: 32, offset: 1056)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !558, file: !559, line: 875, baseType: !635, size: 32, offset: 1088)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !558, file: !559, line: 876, baseType: !677, size: 16, offset: 1120)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !667, line: 30, baseType: !617)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !558, file: !559, line: 877, baseType: !617, size: 16, offset: 1136)
!679 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 879, baseType: !680, size: 32, offset: 1152)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 879, size: 32, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !680, file: !559, line: 880, baseType: !7, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !680, file: !559, line: 881, baseType: !7, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 888, baseType: !685, size: 32, offset: 1184)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 888, size: 32, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !685, file: !559, line: 889, baseType: !635, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !685, file: !559, line: 890, baseType: !635, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !559, line: 893, baseType: !690, size: 16, offset: 1216)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !559, line: 893, size: 16, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !690, file: !559, line: 894, baseType: !677, size: 16)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !690, file: !559, line: 895, baseType: !623, size: 8)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !558, file: !559, line: 898, baseType: !617, size: 16, offset: 1232)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !558, file: !559, line: 899, baseType: !617, size: 16, offset: 1248)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !558, file: !559, line: 900, baseType: !617, size: 16, offset: 1264)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !558, file: !559, line: 902, baseType: !677, size: 16, offset: 1280)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !558, file: !559, line: 903, baseType: !617, size: 16, offset: 1296)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !558, file: !559, line: 904, baseType: !617, size: 16, offset: 1312)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !558, file: !559, line: 905, baseType: !617, size: 16, offset: 1328)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !558, file: !559, line: 908, baseType: !634, offset: 1344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !558, file: !559, line: 912, baseType: !703, size: 32, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !559, line: 606, baseType: !7)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !558, file: !559, line: 913, baseType: !703, size: 32, offset: 1376)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !558, file: !559, line: 914, baseType: !706, size: 64, offset: 1408)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !558, file: !559, line: 915, baseType: !706, size: 64, offset: 1472)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !558, file: !559, line: 916, baseType: !7, size: 32, offset: 1536)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !558, file: !559, line: 917, baseType: !710, size: 32, offset: 1568)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !711, line: 113, baseType: !712)
!711 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !711, line: 111, size: 32, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !712, file: !711, line: 112, baseType: !525, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !540, file: !31, line: 1290, baseType: !716, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!471, !557, !432, !471}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !540, file: !31, line: 1293, baseType: !720, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !432, !557, !432}
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !474, line: 19, baseType: !617)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !540, file: !31, line: 1296, baseType: !725, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !432, !32}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !540, file: !31, line: 1298, baseType: !547, size: 64, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !540, file: !31, line: 1299, baseType: !730, size: 64, offset: 576)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!32, !432, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !540, file: !31, line: 1301, baseType: !543, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !540, file: !31, line: 1302, baseType: !736, size: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!32, !432, !739, !32}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !741, line: 234, size: 320, elements: !742)
!741 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!742 = !{!743, !747}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !740, file: !741, line: 239, baseType: !744, size: 128)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !740, file: !741, line: 236, size: 128, elements: !745)
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !744, file: !741, line: 238, baseType: !409, size: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !740, file: !741, line: 255, baseType: !748, size: 192, offset: 128)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !740, file: !741, line: 241, size: 192, elements: !749)
!749 = !{!750, !762, !763, !764, !765, !766, !768, !769, !770, !779, !780, !781, !782}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !748, file: !741, line: 242, baseType: !751, size: 128)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !752, line: 32, size: 128, elements: !753)
!752 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!753 = !{!754, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !751, file: !752, line: 33, baseType: !755, size: 16)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !752, line: 26, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !757, line: 10, baseType: !618)
!757 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!758 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !751, file: !752, line: 34, baseType: !759, size: 112, offset: 16)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 112, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 14)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !748, file: !741, line: 243, baseType: !751, size: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !748, file: !741, line: 244, baseType: !751, size: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !748, file: !741, line: 245, baseType: !751, size: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !748, file: !741, line: 246, baseType: !751, size: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !748, file: !741, line: 247, baseType: !767, size: 16)
!767 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !748, file: !741, line: 248, baseType: !32, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !748, file: !741, line: 249, baseType: !32, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !748, file: !741, line: 250, baseType: !771, size: 192)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !741, line: 196, size: 192, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !771, file: !741, line: 197, baseType: !454, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !771, file: !741, line: 198, baseType: !454, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !771, file: !741, line: 199, baseType: !618, size: 16, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !771, file: !741, line: 200, baseType: !624, size: 8, offset: 144)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !771, file: !741, line: 201, baseType: !624, size: 8, offset: 152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !771, file: !741, line: 202, baseType: !624, size: 8, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !748, file: !741, line: 251, baseType: !409, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !748, file: !741, line: 252, baseType: !409, size: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !748, file: !741, line: 253, baseType: !733, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !748, file: !741, line: 254, baseType: !783, size: 128)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !741, line: 207, size: 128, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !741, line: 208, baseType: !7, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !783, file: !741, line: 209, baseType: !7, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !783, file: !741, line: 222, baseType: !788, size: 64, offset: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !783, file: !741, line: 210, size: 64, elements: !789)
!789 = !{!790, !798, !805, !817, !823, !830, !841, !849}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !788, file: !741, line: 212, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !793, line: 56, baseType: !794)
!793 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 53, size: 32, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !794, file: !793, line: 54, baseType: !618, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !794, file: !793, line: 55, baseType: !618, size: 16, offset: 16)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !788, file: !741, line: 213, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !793, line: 80, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 77, size: 64, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !801, file: !793, line: 78, baseType: !7, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !801, file: !793, line: 79, baseType: !7, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !788, file: !741, line: 214, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !793, line: 66, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 58, size: 192, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !808, file: !793, line: 59, baseType: !7, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !808, file: !793, line: 60, baseType: !7, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !808, file: !793, line: 61, baseType: !7, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !808, file: !793, line: 62, baseType: !7, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !808, file: !793, line: 63, baseType: !7, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !808, file: !793, line: 64, baseType: !618, size: 16, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !808, file: !793, line: 65, baseType: !618, size: 16, offset: 176)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !788, file: !741, line: 215, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !793, line: 70, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 68, size: 32, elements: !821)
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !820, file: !793, line: 69, baseType: !7, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !788, file: !741, line: 216, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !793, line: 75, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 72, size: 160, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !826, file: !793, line: 73, baseType: !7, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !826, file: !793, line: 74, baseType: !409, size: 128, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !788, file: !741, line: 217, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !793, line: 89, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 82, size: 192, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !833, file: !793, line: 83, baseType: !618, size: 16)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !833, file: !793, line: 84, baseType: !7, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !833, file: !793, line: 85, baseType: !7, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !833, file: !793, line: 86, baseType: !7, size: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !833, file: !793, line: 87, baseType: !7, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !833, file: !793, line: 88, baseType: !7, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !788, file: !741, line: 220, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !793, line: 44, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 40, size: 96, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !844, file: !793, line: 41, baseType: !7, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !844, file: !793, line: 42, baseType: !7, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !844, file: !793, line: 43, baseType: !618, size: 16, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !788, file: !741, line: 221, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !793, line: 51, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 46, size: 128, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !852, file: !793, line: 47, baseType: !7, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !852, file: !793, line: 48, baseType: !7, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !852, file: !793, line: 49, baseType: !618, size: 16, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !852, file: !793, line: 50, baseType: !7, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !540, file: !31, line: 1304, baseType: !859, size: 64, offset: 768)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!32, !432, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !540, file: !31, line: 1306, baseType: !864, size: 64, offset: 832)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!32, !432, !32}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !540, file: !31, line: 1308, baseType: !868, size: 64, offset: 896)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!32, !432, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !31, line: 206, flags: DIFlagFwdDecl)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !540, file: !31, line: 1310, baseType: !874, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DISubroutineType(types: !876)
!876 = !{null, !432, !7}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !540, file: !31, line: 1313, baseType: !878, size: 64, offset: 1024)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !432, !881}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !883, line: 214, size: 1536, elements: !884)
!883 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !882, file: !883, line: 215, baseType: !475, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !882, file: !883, line: 216, baseType: !475, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !882, file: !883, line: 217, baseType: !475, size: 64, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !882, file: !883, line: 218, baseType: !475, size: 64, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !882, file: !883, line: 219, baseType: !475, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !882, file: !883, line: 220, baseType: !475, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !882, file: !883, line: 221, baseType: !475, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !882, file: !883, line: 222, baseType: !475, size: 64, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !882, file: !883, line: 223, baseType: !475, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !882, file: !883, line: 224, baseType: !475, size: 64, offset: 576)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !882, file: !883, line: 227, baseType: !475, size: 64, offset: 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !882, file: !883, line: 228, baseType: !475, size: 64, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !882, file: !883, line: 229, baseType: !475, size: 64, offset: 768)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !882, file: !883, line: 230, baseType: !475, size: 64, offset: 832)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !882, file: !883, line: 231, baseType: !475, size: 64, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !882, file: !883, line: 232, baseType: !475, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !882, file: !883, line: 235, baseType: !475, size: 64, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !882, file: !883, line: 236, baseType: !475, size: 64, offset: 1088)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !882, file: !883, line: 237, baseType: !475, size: 64, offset: 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !882, file: !883, line: 238, baseType: !475, size: 64, offset: 1216)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !882, file: !883, line: 239, baseType: !475, size: 64, offset: 1280)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !882, file: !883, line: 242, baseType: !475, size: 64, offset: 1344)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !882, file: !883, line: 243, baseType: !475, size: 64, offset: 1408)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !882, file: !883, line: 244, baseType: !475, size: 64, offset: 1472)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !540, file: !31, line: 1315, baseType: !910, size: 64, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !915, !32}
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !419, line: 30, baseType: !914)
!914 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !540, file: !31, line: 1316, baseType: !918, size: 64, offset: 1152)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!32, !32, !915, !733}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !540, file: !31, line: 1319, baseType: !922, size: 64, offset: 1216)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!925, !432}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !540, file: !31, line: 1321, baseType: !927, size: 64, offset: 1280)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!32, !432, !677, !723}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !540, file: !31, line: 1323, baseType: !927, size: 64, offset: 1344)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !540, file: !31, line: 1331, baseType: !932, size: 64, offset: 1408)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!32, !432, !32, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !474, line: 17, baseType: !623)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !540, file: !31, line: 1333, baseType: !938, size: 64, offset: 1472)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!32, !432, !32, !723, !936, !677}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !540, file: !31, line: 1336, baseType: !942, size: 64, offset: 1536)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!32, !432, !32, !32, !32}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !540, file: !31, line: 1339, baseType: !946, size: 64, offset: 1600)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!32, !432, !32, !913}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !540, file: !31, line: 1341, baseType: !946, size: 64, offset: 1664)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !540, file: !31, line: 1343, baseType: !951, size: 64, offset: 1728)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!32, !432, !32, !954}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !956, line: 20, size: 576, elements: !957)
!956 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!957 = !{!958, !959, !963, !964, !965, !966, !967, !968, !969, !970, !971}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !955, file: !956, line: 21, baseType: !635, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !955, file: !956, line: 22, baseType: !960, size: 256, offset: 32)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 256, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !955, file: !956, line: 23, baseType: !635, size: 32, offset: 288)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !955, file: !956, line: 24, baseType: !635, size: 32, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !955, file: !956, line: 25, baseType: !635, size: 32, offset: 352)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !955, file: !956, line: 26, baseType: !635, size: 32, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !955, file: !956, line: 27, baseType: !635, size: 32, offset: 416)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !955, file: !956, line: 28, baseType: !635, size: 32, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !955, file: !956, line: 29, baseType: !635, size: 32, offset: 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !955, file: !956, line: 30, baseType: !635, size: 32, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !955, file: !956, line: 31, baseType: !677, size: 16, offset: 544)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !540, file: !31, line: 1346, baseType: !973, size: 64, offset: 1792)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!32, !432, !32, !32}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !540, file: !31, line: 1348, baseType: !977, size: 64, offset: 1856)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!32, !432, !32, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !956, line: 9, size: 512, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !981, file: !956, line: 10, baseType: !475, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !981, file: !956, line: 11, baseType: !475, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !981, file: !956, line: 12, baseType: !475, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !981, file: !956, line: 13, baseType: !475, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !981, file: !956, line: 14, baseType: !475, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !981, file: !956, line: 15, baseType: !475, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !981, file: !956, line: 16, baseType: !475, size: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !981, file: !956, line: 17, baseType: !475, size: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !540, file: !31, line: 1352, baseType: !992, size: 64, offset: 1920)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!32, !432, !32, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !998, line: 213, size: 32, elements: !999)
!998 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !997, file: !998, line: 214, baseType: !617, size: 16)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !997, file: !998, line: 215, baseType: !617, size: 16, offset: 16)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !540, file: !31, line: 1355, baseType: !1003, size: 64, offset: 1984)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!32, !432, !32, !557}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !540, file: !31, line: 1357, baseType: !1007, size: 64, offset: 2048)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!32, !432, !32, !1010, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !883, line: 956, size: 128, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1011, file: !883, line: 957, baseType: !635, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1011, file: !883, line: 958, baseType: !475, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !540, file: !31, line: 1361, baseType: !1016, size: 64, offset: 2112)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!32, !432, !32, !473, !32}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !540, file: !31, line: 1364, baseType: !946, size: 64, offset: 2176)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !540, file: !31, line: 1367, baseType: !1021, size: 64, offset: 2240)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!32, !432, !37, !733}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !540, file: !31, line: 1400, baseType: !1025, size: 64, offset: 2304)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!32, !432, !432, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1030, line: 75, size: 384, elements: !1031)
!1030 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1031 = !{!1032, !1033, !1036, !1040, !1044}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1029, file: !1030, line: 76, baseType: !434, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1029, file: !1030, line: 77, baseType: !1034, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1029, file: !1030, line: 78, baseType: !1037, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1030, line: 78, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1029, file: !1030, line: 79, baseType: !1041, size: 160, offset: 192)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 160, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 20)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1029, file: !1030, line: 80, baseType: !936, size: 8, offset: 352)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !540, file: !31, line: 1403, baseType: !1046, size: 64, offset: 2368)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!32, !432, !432}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !540, file: !31, line: 1405, baseType: !1050, size: 64, offset: 2432)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!432, !432, !557, !913}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !540, file: !31, line: 1408, baseType: !1054, size: 64, offset: 2496)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!471, !432, !471}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !540, file: !31, line: 1410, baseType: !1058, size: 64, offset: 2560)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!32, !432, !471}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !540, file: !31, line: 1412, baseType: !1062, size: 64, offset: 2624)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!32, !432, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1067, line: 35, flags: DIFlagFwdDecl)
!1067 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !540, file: !31, line: 1414, baseType: !1069, size: 64, offset: 2688)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !432, !1065}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !540, file: !31, line: 1417, baseType: !1073, size: 64, offset: 2752)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!32, !1076, !995, !432, !1088, !723, !723, !1028}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1078, line: 8, size: 96, elements: !1079)
!1078 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1079 = !{!1080, !1081, !1082, !1083, !1085, !1086, !1087}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1077, file: !1078, line: 9, baseType: !623, size: 8)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1077, file: !1078, line: 10, baseType: !623, size: 8, offset: 8)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1077, file: !1078, line: 11, baseType: !617, size: 16, offset: 16)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1077, file: !1078, line: 12, baseType: !1084, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !476, line: 26, baseType: !32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1077, file: !1078, line: 13, baseType: !617, size: 16, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1077, file: !1078, line: 14, baseType: !623, size: 8, offset: 80)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1077, file: !1078, line: 15, baseType: !623, size: 8, offset: 88)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !540, file: !31, line: 1424, baseType: !1091, size: 64, offset: 2816)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!32, !1076, !995, !432, !1088, !723}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !540, file: !31, line: 1429, baseType: !1095, size: 64, offset: 2880)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!32, !557, !1098, !432, !432, !1143}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1030, line: 203, size: 1024, elements: !1100)
!1100 = !{!1101, !1102, !1112, !1116, !1120, !1121, !1125, !1126, !1127, !1128, !1130, !1131, !1132, !1133}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1099, file: !1030, line: 204, baseType: !557, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1099, file: !1030, line: 205, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !998, line: 44, size: 128, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1105, file: !998, line: 45, baseType: !635, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1105, file: !998, line: 46, baseType: !617, size: 16, offset: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1105, file: !998, line: 47, baseType: !617, size: 16, offset: 48)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1105, file: !998, line: 48, baseType: !635, size: 32, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1105, file: !998, line: 49, baseType: !635, size: 32, offset: 96)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1099, file: !1030, line: 206, baseType: !1113, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!32, !557, !1098}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1099, file: !1030, line: 208, baseType: !1117, size: 64, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!32, !1098}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !1030, line: 209, baseType: !733, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1099, file: !1030, line: 211, baseType: !1122, size: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1124, line: 76, flags: DIFlagFwdDecl)
!1124 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1099, file: !1030, line: 212, baseType: !1028, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1099, file: !1030, line: 213, baseType: !723, size: 16, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1099, file: !1030, line: 214, baseType: !723, size: 16, offset: 464)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1099, file: !1030, line: 215, baseType: !1129, size: 32, offset: 480)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !474, line: 21, baseType: !635)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1099, file: !1030, line: 216, baseType: !7, size: 32, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1099, file: !1030, line: 216, baseType: !7, size: 32, offset: 544)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1099, file: !1030, line: 217, baseType: !913, size: 8, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, scope: !1099, file: !1030, line: 218, baseType: !1134, size: 384, offset: 640)
!1134 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1099, file: !1030, line: 218, size: 384, elements: !1135)
!1135 = !{!1136, !1138}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1134, file: !1030, line: 219, baseType: !1137, size: 384)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 384, elements: !600)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1134, file: !1030, line: 224, baseType: !1139, size: 384)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 384, elements: !1141)
!1140 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1141 = !{!1142}
!1142 = !DISubrange(count: 6)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !540, file: !31, line: 1434, baseType: !1145, size: 64, offset: 2944)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!32, !557, !995, !432, !1088, !723, !1129, !1129, !1028}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !540, file: !31, line: 1440, baseType: !1149, size: 64, offset: 3008)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!32, !432, !1152, !723, !1028}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !540, file: !31, line: 1444, baseType: !1154, size: 64, offset: 3072)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!32, !557, !1129, !1129, !432, !1129, !32}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !540, file: !31, line: 1449, baseType: !1158, size: 64, offset: 3136)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!32, !432, !1152, !723}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !540, file: !31, line: 1452, baseType: !1162, size: 64, offset: 3200)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!32, !432, !913}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !540, file: !31, line: 1454, baseType: !1166, size: 64, offset: 3264)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!32, !432, !1169}
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !31, line: 820, size: 264, elements: !1171)
!1171 = !{!1172, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1170, file: !31, line: 821, baseType: !1173, size: 256)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 256, elements: !961)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1170, file: !31, line: 822, baseType: !624, size: 8, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !540, file: !31, line: 1456, baseType: !1166, size: 64, offset: 3328)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !540, file: !31, line: 1458, baseType: !1177, size: 64, offset: 3392)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!32, !432, !1180, !1181}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !419, line: 55, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1183, line: 72, baseType: !1184)
!1183 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1183, line: 16, baseType: !454)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !540, file: !31, line: 1460, baseType: !1186, size: 64, offset: 3456)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !432, !1189}
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !31, line: 67, flags: DIFlagFwdDecl)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !540, file: !31, line: 1462, baseType: !1186, size: 64, offset: 3520)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !540, file: !31, line: 1464, baseType: !1193, size: 64, offset: 3584)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!733, !432, !432}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !540, file: !31, line: 1466, baseType: !1197, size: 64, offset: 3648)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{null, !432, !733}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !540, file: !31, line: 1469, baseType: !1201, size: 64, offset: 3712)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!32, !432, !32, !1129}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !540, file: !31, line: 1472, baseType: !1205, size: 64, offset: 3776)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!32, !915}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !540, file: !31, line: 1473, baseType: !1162, size: 64, offset: 3840)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !540, file: !31, line: 1475, baseType: !1210, size: 64, offset: 3904)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!32, !432, !557}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !540, file: !31, line: 1477, baseType: !725, size: 64, offset: 3968)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !540, file: !31, line: 1479, baseType: !1215, size: 64, offset: 4032)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!32, !432, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !31, line: 894, size: 256, elements: !1220)
!1220 = !{!1221, !1222}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1219, file: !31, line: 895, baseType: !57, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, scope: !1219, file: !31, line: 896, baseType: !1223, size: 192, offset: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1219, file: !31, line: 896, size: 192, elements: !1224)
!1224 = !{!1225, !1234, !5612}
!1225 = !DIDerivedType(tag: DW_TAG_member, scope: !1223, file: !31, line: 898, baseType: !1226, size: 192)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1223, file: !31, line: 898, size: 192, elements: !1227)
!1227 = !{!1228, !1229, !1233}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1226, file: !31, line: 899, baseType: !1129, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1226, file: !31, line: 900, baseType: !1230, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1232, line: 11, flags: DIFlagFwdDecl)
!1232 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1226, file: !31, line: 901, baseType: !1028, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, scope: !1223, file: !31, line: 904, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1223, file: !31, line: 904, size: 64, elements: !1236)
!1236 = !{!1237}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1235, file: !31, line: 905, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !65, line: 222, size: 2560, elements: !1240)
!1240 = !{!1241, !5591, !5592, !5610, !5611}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1239, file: !65, line: 223, baseType: !1242, size: 2048)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !65, line: 141, size: 2048, elements: !1243)
!1243 = !{!1244, !5565, !5566, !5567, !5568, !5569, !5570, !5571, !5572, !5573, !5574, !5575, !5576, !5577, !5582, !5583, !5584, !5585, !5586, !5587, !5588, !5589, !5590}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1242, file: !65, line: 145, baseType: !1245, size: 64, align: 512)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !65, line: 54, size: 2368, elements: !1248)
!1248 = !{!1249, !1448, !1453, !5237, !5241, !5245, !5246, !5250, !5256, !5257, !5258, !5259, !5260, !5264, !5268, !5272, !5273, !5274, !5278, !5279, !5291, !5295, !5299, !5311, !5500, !5504, !5508, !5513, !5517, !5521, !5525, !5531, !5535, !5542, !5546, !5548, !5549}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1247, file: !65, line: 56, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!32, !1253}
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !96, line: 483, size: 960, align: 64, elements: !1255)
!1255 = !{!1256, !1272, !1283, !1294, !1318, !1324, !1332, !1349, !1362, !1368, !1377, !1382, !1390, !1402, !1422, !1429, !1433, !1437, !1442}
!1256 = !DIDerivedType(tag: DW_TAG_member, scope: !1254, file: !96, line: 484, baseType: !1257, size: 512)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1254, file: !96, line: 484, size: 512, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1257, file: !96, line: 485, baseType: !635, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1257, file: !96, line: 486, baseType: !635, size: 32, offset: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1257, file: !96, line: 487, baseType: !635, size: 32, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1257, file: !96, line: 488, baseType: !635, size: 32, offset: 96)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1257, file: !96, line: 489, baseType: !635, size: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1257, file: !96, line: 492, baseType: !635, size: 32, offset: 160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1257, file: !96, line: 493, baseType: !635, size: 32, offset: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1257, file: !96, line: 496, baseType: !409, size: 128, offset: 224)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1257, file: !96, line: 497, baseType: !635, size: 32, offset: 352)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1257, file: !96, line: 498, baseType: !635, size: 32, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1257, file: !96, line: 499, baseType: !635, size: 32, offset: 416)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1257, file: !96, line: 500, baseType: !635, size: 32, offset: 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1257, file: !96, line: 501, baseType: !635, size: 32, offset: 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, scope: !1254, file: !96, line: 507, baseType: !1273, size: 256)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1254, file: !96, line: 507, size: 256, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1282}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1273, file: !96, line: 508, baseType: !635, size: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1273, file: !96, line: 509, baseType: !475, size: 64, align: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, scope: !1273, file: !96, line: 510, baseType: !1278, size: 64, offset: 128)
!1278 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1273, file: !96, line: 510, size: 64, elements: !1279)
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1278, file: !96, line: 511, baseType: !475, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1278, file: !96, line: 512, baseType: !475, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1273, file: !96, line: 514, baseType: !475, size: 64, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1254, file: !96, line: 532, baseType: !1284, size: 448)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1254, file: !96, line: 517, size: 448, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1284, file: !96, line: 518, baseType: !475, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1284, file: !96, line: 521, baseType: !475, size: 64, align: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1284, file: !96, line: 522, baseType: !475, size: 64, align: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1284, file: !96, line: 523, baseType: !475, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1284, file: !96, line: 524, baseType: !635, size: 32, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1284, file: !96, line: 529, baseType: !635, size: 32, offset: 288)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1284, file: !96, line: 530, baseType: !475, size: 64, offset: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1284, file: !96, line: 531, baseType: !475, size: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, scope: !1254, file: !96, line: 534, baseType: !1295, size: 960)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1254, file: !96, line: 534, size: 960, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1295, file: !96, line: 535, baseType: !635, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1295, file: !96, line: 536, baseType: !635, size: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1295, file: !96, line: 537, baseType: !475, size: 64, align: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1295, file: !96, line: 538, baseType: !475, size: 64, align: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1295, file: !96, line: 539, baseType: !635, size: 32, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1295, file: !96, line: 540, baseType: !635, size: 32, offset: 224)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1295, file: !96, line: 541, baseType: !475, size: 64, align: 64, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1295, file: !96, line: 542, baseType: !635, size: 32, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1295, file: !96, line: 543, baseType: !635, size: 32, offset: 352)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1295, file: !96, line: 544, baseType: !409, size: 128, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1295, file: !96, line: 545, baseType: !635, size: 32, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1295, file: !96, line: 550, baseType: !635, size: 32, offset: 544)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1295, file: !96, line: 551, baseType: !635, size: 32, offset: 576)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1295, file: !96, line: 552, baseType: !635, size: 32, offset: 608)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1295, file: !96, line: 553, baseType: !475, size: 64, align: 64, offset: 640)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1295, file: !96, line: 554, baseType: !635, size: 32, offset: 704)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !1295, file: !96, line: 555, baseType: !635, size: 32, offset: 736)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !1295, file: !96, line: 556, baseType: !475, size: 64, align: 64, offset: 768)
