; ModuleID = '../bcout/drivers/net/wireless/ath/ath6kl/debug.llvm.bc'
source_filename = "drivers/net/wireless/ath/ath6kl/debug.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.va_format = type { i8*, [1 x %struct.__va_list_tag]* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.ath6kl = type <{ %struct.device*, %struct.wiphy*, i32, i32, %struct.ath6kl_bmi, %struct.ath6kl_hif_ops*, %struct.ath6kl_htc_ops*, %struct.wmi*, [9 x i32], i32, %struct.htc_target*, i32, [4 x i8], i8*, %struct.list_head, %struct.spinlock, i8, [3 x i8], i32, i8, i8, %struct.spinlock, [6 x i8], %struct.semaphore, i8, [3 x i8], %struct.ath6kl_version, i32, i8, [15 x %struct.ath6kl_node_mapping], i8, i8, i8, i8, [7 x i8], %struct.ath6kl_cookie*, i32, [4 x i32], [4 x i8], [4 x i8], i8, [9 x i8], [2 x i8], i32, [4 x i8], %struct.ath6kl_htc_credit_info, i32, i32, i8, [7 x i8], [10 x %struct.ath6kl_sta], i8, [3 x i8], %struct.ath6kl_req_key, %struct.sk_buff_head, i32, i16, %struct.spinlock, i8, %struct.wmi_ap_mode_stat, [3 x i8], [6 x i8], %struct.list_head, i8, [3 x i8], i32, [6 x i8], [2 x i8], %struct.anon.138, %struct.ath6kl_hw, i16, i16, i16, [2 x i8], %struct.wait_queue_head, %struct.ath6kl_mbox_info, [198 x %struct.ath6kl_cookie], i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i32, [4 x i8], [1 x i64], %struct.workqueue_struct*, %struct.dentry*, i8, i8, [6 x i8], %struct.ath6kl_fw_recovery }>

!349 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_MBSS", value: 3, isUnsigned: true)
!350 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_ANY", value: 4, isUnsigned: true)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_chan_width", file: !270, line: 4521, baseType: !5, size: 32, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365}
!353 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20_NOHT", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_40", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80", value: 3, isUnsigned: true)
!357 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80P80", value: 4, isUnsigned: true)
!358 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_160", value: 5, isUnsigned: true)
!359 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_5", value: 6, isUnsigned: true)
!360 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_10", value: 7, isUnsigned: true)
!361 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_1", value: 8, isUnsigned: true)
!362 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_2", value: 9, isUnsigned: true)
!363 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_4", value: 10, isUnsigned: true)
!364 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_8", value: 11, isUnsigned: true)
!365 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_16", value: 12, isUnsigned: true)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_key_mode", file: !270, line: 4491, baseType: !5, size: 32, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIEnumerator(name: "NL80211_KEY_RX_TX", value: 0, isUnsigned: true)
!369 = !DIEnumerator(name: "NL80211_KEY_NO_TX", value: 1, isUnsigned: true)
!370 = !DIEnumerator(name: "NL80211_KEY_SET_TX", value: 2, isUnsigned: true)
!371 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_auth_type", file: !270, line: 4672, baseType: !5, size: 32, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!373 = !DIEnumerator(name: "NL80211_AUTHTYPE_OPEN_SYSTEM", value: 0, isUnsigned: true)
!374 = !DIEnumerator(name: "NL80211_AUTHTYPE_SHARED_KEY", value: 1, isUnsigned: true)
!375 = !DIEnumerator(name: "NL80211_AUTHTYPE_FT", value: 2, isUnsigned: true)
!376 = !DIEnumerator(name: "NL80211_AUTHTYPE_NETWORK_EAP", value: 3, isUnsigned: true)
!377 = !DIEnumerator(name: "NL80211_AUTHTYPE_SAE", value: 4, isUnsigned: true)
!378 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK", value: 5, isUnsigned: true)
!379 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK_PFS", value: 6, isUnsigned: true)
!380 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_PK", value: 7, isUnsigned: true)
!381 = !DIEnumerator(name: "__NL80211_AUTHTYPE_NUM", value: 8, isUnsigned: true)
!382 = !DIEnumerator(name: "NL80211_AUTHTYPE_MAX", value: 7, isUnsigned: true)
!383 = !DIEnumerator(name: "NL80211_AUTHTYPE_AUTOMATIC", value: 8, isUnsigned: true)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_mfp", file: !270, line: 4709, baseType: !5, size: 32, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIEnumerator(name: "NL80211_MFP_NO", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "NL80211_MFP_REQUIRED", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "NL80211_MFP_OPTIONAL", value: 2, isUnsigned: true)
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_bss_select_attr", file: !270, line: 6321, baseType: !5, size: 32, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_INVALID", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_BAND_PREF", value: 2, isUnsigned: true)
!394 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI_ADJUST", value: 3, isUnsigned: true)
!395 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_AFTER_LAST", value: 4, isUnsigned: true)
!396 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_MAX", value: 3, isUnsigned: true)
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !29, line: 423, baseType: !5, size: 32, elements: !398)
!398 = !{!399, !400, !401, !402}
!399 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!400 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!401 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!402 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !404, file: !29, line: 2085, baseType: !5, size: 32, elements: !8000)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !29, line: 1858, size: 15808, elements: !405)
!405 = !{!406, !411, !434, !451, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !468, !476, !477, !478, !479, !480, !481, !482, !483, !484, !510, !520, !521, !522, !527, !528, !532, !535, !5657, !6173, !6177, !6217, !6218, !6219, !6220, !6221, !6222, !6223, !6224, !6225, !6226, !6227, !6228, !6229, !6230, !6231, !6232, !6233, !6234, !6235, !6236, !6237, !6238, !6239, !6240, !6241, !6242, !6243, !6248, !6249, !6250, !6532, !6533, !6534, !6535, !6538, !6541, !6544, !7826, !7829, !7830, !7843, !7844, !7845, !7846, !7847, !7848, !7855, !7856, !7890, !7891, !7892, !7893, !7894, !7895, !7896, !7897, !7898, !7901, !7902, !7903, !7904, !7905, !7906, !7907, !7908, !7909, !7914, !7915, !7916, !7917, !7954, !7955, !7957, !7958, !7962, !7963, !7964, !7965, !7971, !7973, !7976, !7979, !7981, !7982, !7983, !7984, !7985, !7989, !7992}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !404, file: !29, line: 1859, baseType: !407, size: 128)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 128, elements: !409)
!408 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!409 = !{!410}
!410 = !DISubrange(count: 16)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !404, file: !29, line: 1860, baseType: !412, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !29, line: 938, size: 384, elements: !414)
!414 = !{!415, !423, !429, !431}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !413, file: !29, line: 939, baseType: !416, size: 128)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !417, line: 186, size: 128, elements: !418)
!417 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!418 = !{!419, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !416, file: !417, line: 187, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !416, file: !417, line: 187, baseType: !422, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !413, file: !29, line: 940, baseType: !424, size: 128, offset: 128)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !417, line: 178, size: 128, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !417, line: 179, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !424, file: !417, line: 179, baseType: !427, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !413, file: !29, line: 941, baseType: !430, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !413, file: !29, line: 942, baseType: !432, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !404, file: !29, line: 1861, baseType: !435, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !29, line: 930, size: 128, elements: !437)
!437 = !{!438, !447}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !436, file: !29, line: 931, baseType: !439, size: 128, align: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !417, line: 216, size: 128, align: 64, elements: !440)
!440 = !{!441, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !417, line: 217, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !439, file: !417, line: 218, baseType: !444, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !442}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !436, file: !29, line: 932, baseType: !448, offset: 128)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: -1)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !404, file: !29, line: 1866, baseType: !452, size: 64, offset: 256)
!452 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !404, file: !29, line: 1867, baseType: !452, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !404, file: !29, line: 1868, baseType: !452, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !404, file: !29, line: 1869, baseType: !30, size: 32, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !29, line: 1877, baseType: !452, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !404, file: !29, line: 1879, baseType: !424, size: 128, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !404, file: !29, line: 1880, baseType: !424, size: 128, offset: 704)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !404, file: !29, line: 1881, baseType: !424, size: 128, offset: 832)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !404, file: !29, line: 1882, baseType: !424, size: 128, offset: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !404, file: !29, line: 1883, baseType: !424, size: 128, offset: 1088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !404, file: !29, line: 1884, baseType: !424, size: 128, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !404, file: !29, line: 1889, baseType: !464, size: 256, offset: 1344)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !29, line: 1886, size: 256, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !464, file: !29, line: 1887, baseType: !424, size: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !464, file: !29, line: 1888, baseType: !424, size: 128, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !404, file: !29, line: 1891, baseType: !469, size: 64, offset: 1600)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !470, line: 12, baseType: !471)
!470 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !472, line: 23, baseType: !473)
!472 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !474, line: 31, baseType: !475)
!474 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!475 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !404, file: !29, line: 1892, baseType: !469, size: 64, offset: 1664)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !404, file: !29, line: 1893, baseType: !469, size: 64, offset: 1728)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !404, file: !29, line: 1894, baseType: !469, size: 64, offset: 1792)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !404, file: !29, line: 1895, baseType: !469, size: 64, offset: 1856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !404, file: !29, line: 1896, baseType: !469, size: 64, offset: 1920)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !404, file: !29, line: 1897, baseType: !469, size: 64, offset: 1984)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !404, file: !29, line: 1899, baseType: !30, size: 32, offset: 2048)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !404, file: !29, line: 1900, baseType: !30, size: 32, offset: 2080)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !404, file: !29, line: 1902, baseType: !485, size: 1472, offset: 2112)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !29, line: 169, size: 1472, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !485, file: !29, line: 170, baseType: !452, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !485, file: !29, line: 171, baseType: !452, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !485, file: !29, line: 172, baseType: !452, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !485, file: !29, line: 173, baseType: !452, size: 64, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !485, file: !29, line: 174, baseType: !452, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !485, file: !29, line: 175, baseType: !452, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !485, file: !29, line: 176, baseType: !452, size: 64, offset: 384)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !485, file: !29, line: 177, baseType: !452, size: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !485, file: !29, line: 178, baseType: !452, size: 64, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !485, file: !29, line: 179, baseType: !452, size: 64, offset: 576)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !485, file: !29, line: 180, baseType: !452, size: 64, offset: 640)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !485, file: !29, line: 181, baseType: !452, size: 64, offset: 704)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !485, file: !29, line: 182, baseType: !452, size: 64, offset: 768)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !485, file: !29, line: 183, baseType: !452, size: 64, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !485, file: !29, line: 184, baseType: !452, size: 64, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !485, file: !29, line: 185, baseType: !452, size: 64, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !485, file: !29, line: 186, baseType: !452, size: 64, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !485, file: !29, line: 187, baseType: !452, size: 64, offset: 1088)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !485, file: !29, line: 188, baseType: !452, size: 64, offset: 1152)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !485, file: !29, line: 189, baseType: !452, size: 64, offset: 1216)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !485, file: !29, line: 190, baseType: !452, size: 64, offset: 1280)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !485, file: !29, line: 191, baseType: !452, size: 64, offset: 1344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !485, file: !29, line: 192, baseType: !452, size: 64, offset: 1408)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !404, file: !29, line: 1904, baseType: !511, size: 64, offset: 3584)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !512, line: 13, baseType: !513)
!512 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !417, line: 175, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 173, size: 64, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !514, file: !417, line: 174, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !472, line: 22, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !474, line: 30, baseType: !519)
!519 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !404, file: !29, line: 1905, baseType: !511, size: 64, offset: 3648)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !404, file: !29, line: 1906, baseType: !511, size: 64, offset: 3712)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !404, file: !29, line: 1909, baseType: !523, size: 32, offset: 3776)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !417, line: 168, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 166, size: 32, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !524, file: !417, line: 167, baseType: !30, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !404, file: !29, line: 1910, baseType: !523, size: 32, offset: 3808)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !404, file: !29, line: 1913, baseType: !529, size: 64, offset: 3840)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !29, line: 1913, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !404, file: !29, line: 1914, baseType: !533, size: 64, offset: 3904)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !29, line: 1914, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !404, file: !29, line: 1916, baseType: !536, size: 64, offset: 3968)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !29, line: 1283, size: 4416, elements: !539)
!539 = !{!540, !544, !548, !549, !550, !713, !717, !722, !726, !727, !732, !733, !856, !861, !865, !871, !875, !907, !915, !919, !924, !928, !929, !935, !939, !943, !947, !948, !970, !974, !989, !1000, !1004, !1013, !1017, !1018, !1022, !1043, !1047, !1051, !1055, !1059, !1066, !1070, !1088, !1092, !1142, !1146, !1151, !1155, !1159, !1163, !1173, !1174, !1183, !1189, !1190, !1194, !1198, !1202, !1206, !1207, !1211, !1212, !5617, !5637, !5641, !5647, !5653}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !538, file: !29, line: 1284, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!30, !430}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !538, file: !29, line: 1285, baseType: !545, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !430}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !538, file: !29, line: 1286, baseType: !541, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !538, file: !29, line: 1287, baseType: !541, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !538, file: !29, line: 1288, baseType: !551, size: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !555, !430}
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !29, line: 120, baseType: !28)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !557, line: 713, size: 1600, elements: !558)
!557 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!558 = !{!559, !581, !589, !596, !600, !612, !613, !614, !617, !618, !619, !625, !626, !627, !628, !629, !630, !631, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !671, !672, !673, !674, !676, !677, !682, !687, !692, !693, !694, !695, !696, !697, !698, !699, !700, !702, !703, !705, !706, !707}
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 714, baseType: !560, size: 192)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 714, size: 192, elements: !561)
!561 = !{!562, !572, !580}
!562 = !DIDerivedType(tag: DW_TAG_member, scope: !560, file: !557, line: 715, baseType: !563, size: 192)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !557, line: 715, size: 192, elements: !564)
!564 = !{!565, !566, !567}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !563, file: !557, line: 717, baseType: !555, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !563, file: !557, line: 718, baseType: !555, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !563, file: !557, line: 720, baseType: !568, size: 64, offset: 128)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !563, file: !557, line: 720, size: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !568, file: !557, line: 721, baseType: !430, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !568, file: !557, line: 726, baseType: !452, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !560, file: !557, line: 729, baseType: !573, size: 192, align: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !574, line: 24, size: 192, align: 64, elements: !575)
!574 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!575 = !{!576, !577, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !573, file: !574, line: 25, baseType: !452, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !573, file: !574, line: 26, baseType: !578, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !573, file: !574, line: 27, baseType: !578, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !560, file: !557, line: 730, baseType: !424, size: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 733, baseType: !582, size: 64, offset: 192)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 733, size: 64, elements: !583)
!583 = !{!584, !588}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !582, file: !557, line: 734, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !587, line: 124, flags: DIFlagFwdDecl)
!587 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !582, file: !557, line: 735, baseType: !30, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 738, baseType: !590, size: 64, offset: 256)
!590 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 738, size: 64, elements: !591)
!591 = !{!592, !595}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !590, file: !557, line: 739, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !594, line: 29, baseType: !517)
!594 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !590, file: !557, line: 740, baseType: !471, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !556, file: !557, line: 748, baseType: !597, size: 384, align: 64, offset: 320)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 384, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 48)
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 750, baseType: !601, size: 128, offset: 704)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 750, size: 128, elements: !602)
!602 = !{!603, !611}
!603 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !557, line: 751, baseType: !604, size: 128)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !601, file: !557, line: 751, size: 128, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !604, file: !557, line: 752, baseType: !452, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !604, file: !557, line: 753, baseType: !608, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !555}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !601, file: !557, line: 755, baseType: !424, size: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !556, file: !557, line: 761, baseType: !5, size: 32, offset: 832)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !556, file: !557, line: 762, baseType: !5, size: 32, offset: 864)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !556, file: !557, line: 763, baseType: !615, size: 16, offset: 896)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !474, line: 24, baseType: !616)
!616 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !556, file: !557, line: 764, baseType: !615, size: 16, offset: 912)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !556, file: !557, line: 769, baseType: !615, size: 16, offset: 928)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !556, file: !557, line: 780, baseType: !620, offset: 944)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, elements: !623)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !474, line: 21, baseType: !622)
!622 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!623 = !{!624}
!624 = !DISubrange(count: 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !556, file: !557, line: 782, baseType: !621, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !556, file: !557, line: 783, baseType: !621, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !556, file: !557, line: 784, baseType: !621, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !556, file: !557, line: 785, baseType: !621, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !556, file: !557, line: 786, baseType: !621, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !556, file: !557, line: 787, baseType: !621, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !556, file: !557, line: 795, baseType: !632, offset: 960)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, elements: !623)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !474, line: 27, baseType: !5)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !556, file: !557, line: 807, baseType: !620, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !556, file: !557, line: 809, baseType: !621, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !556, file: !557, line: 810, baseType: !621, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !556, file: !557, line: 811, baseType: !621, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !556, file: !557, line: 812, baseType: !621, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !556, file: !557, line: 813, baseType: !621, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !556, file: !557, line: 815, baseType: !621, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !556, file: !557, line: 816, baseType: !621, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !556, file: !557, line: 817, baseType: !621, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !556, file: !557, line: 818, baseType: !621, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !556, file: !557, line: 819, baseType: !621, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !556, file: !557, line: 821, baseType: !621, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !556, file: !557, line: 822, baseType: !621, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !556, file: !557, line: 823, baseType: !621, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !556, file: !557, line: 832, baseType: !620, offset: 976)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !556, file: !557, line: 834, baseType: !621, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !556, file: !557, line: 835, baseType: !621, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !556, file: !557, line: 836, baseType: !621, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !556, file: !557, line: 837, baseType: !621, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !556, file: !557, line: 838, baseType: !621, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !556, file: !557, line: 840, baseType: !621, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !556, file: !557, line: 843, baseType: !621, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !556, file: !557, line: 844, baseType: !621, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !556, file: !557, line: 845, baseType: !621, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !556, file: !557, line: 847, baseType: !621, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !556, file: !557, line: 848, baseType: !621, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 866, baseType: !661, size: 32, offset: 992)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 866, size: 32, elements: !662)
!662 = !{!663, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !661, file: !557, line: 867, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !665, line: 37, baseType: !633)
!665 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!666 = !DIDerivedType(tag: DW_TAG_member, scope: !661, file: !557, line: 868, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !661, file: !557, line: 868, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !667, file: !557, line: 869, baseType: !615, size: 16)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !667, file: !557, line: 870, baseType: !615, size: 16, offset: 16)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !556, file: !557, line: 873, baseType: !633, size: 32, offset: 1024)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !556, file: !557, line: 874, baseType: !30, size: 32, offset: 1056)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !556, file: !557, line: 875, baseType: !633, size: 32, offset: 1088)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !556, file: !557, line: 876, baseType: !675, size: 16, offset: 1120)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !665, line: 30, baseType: !615)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !556, file: !557, line: 877, baseType: !615, size: 16, offset: 1136)
!677 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 879, baseType: !678, size: 32, offset: 1152)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 879, size: 32, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !678, file: !557, line: 880, baseType: !5, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !678, file: !557, line: 881, baseType: !5, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 888, baseType: !683, size: 32, offset: 1184)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 888, size: 32, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !683, file: !557, line: 889, baseType: !633, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !683, file: !557, line: 890, baseType: !633, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, scope: !556, file: !557, line: 893, baseType: !688, size: 16, offset: 1216)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !556, file: !557, line: 893, size: 16, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !688, file: !557, line: 894, baseType: !675, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !688, file: !557, line: 895, baseType: !621, size: 8)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !556, file: !557, line: 898, baseType: !615, size: 16, offset: 1232)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !556, file: !557, line: 899, baseType: !615, size: 16, offset: 1248)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !556, file: !557, line: 900, baseType: !615, size: 16, offset: 1264)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !556, file: !557, line: 902, baseType: !675, size: 16, offset: 1280)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !556, file: !557, line: 903, baseType: !615, size: 16, offset: 1296)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !556, file: !557, line: 904, baseType: !615, size: 16, offset: 1312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !556, file: !557, line: 905, baseType: !615, size: 16, offset: 1328)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !556, file: !557, line: 908, baseType: !632, offset: 1344)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !556, file: !557, line: 912, baseType: !701, size: 32, offset: 1344)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !557, line: 606, baseType: !5)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !556, file: !557, line: 913, baseType: !701, size: 32, offset: 1376)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !556, file: !557, line: 914, baseType: !704, size: 64, offset: 1408)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !556, file: !557, line: 915, baseType: !704, size: 64, offset: 1472)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !556, file: !557, line: 916, baseType: !5, size: 32, offset: 1536)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !556, file: !557, line: 917, baseType: !708, size: 32, offset: 1568)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !709, line: 113, baseType: !710)
!709 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !709, line: 111, size: 32, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !710, file: !709, line: 112, baseType: !523, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !538, file: !29, line: 1290, baseType: !714, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!469, !555, !430, !469}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !538, file: !29, line: 1293, baseType: !718, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !430, !555, !430}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !472, line: 19, baseType: !615)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !538, file: !29, line: 1296, baseType: !723, size: 64, offset: 448)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !430, !30}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !538, file: !29, line: 1298, baseType: !545, size: 64, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !538, file: !29, line: 1299, baseType: !728, size: 64, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!30, !430, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !538, file: !29, line: 1301, baseType: !541, size: 64, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !538, file: !29, line: 1302, baseType: !734, size: 64, offset: 704)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!30, !430, !737, !30}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !739, line: 234, size: 320, elements: !740)
!739 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!740 = !{!741, !745}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !738, file: !739, line: 239, baseType: !742, size: 128)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !738, file: !739, line: 236, size: 128, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !742, file: !739, line: 238, baseType: !407, size: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !738, file: !739, line: 255, baseType: !746, size: 192, offset: 128)
!746 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !738, file: !739, line: 241, size: 192, elements: !747)
!747 = !{!748, !760, !761, !762, !763, !764, !766, !767, !768, !777, !778, !779, !780}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !746, file: !739, line: 242, baseType: !749, size: 128)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !750, line: 32, size: 128, elements: !751)
!750 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!751 = !{!752, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !749, file: !750, line: 33, baseType: !753, size: 16)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !750, line: 26, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !755, line: 10, baseType: !616)
!755 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !749, file: !750, line: 34, baseType: !757, size: 112, offset: 16)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 112, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 14)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !746, file: !739, line: 243, baseType: !749, size: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !746, file: !739, line: 244, baseType: !749, size: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !746, file: !739, line: 245, baseType: !749, size: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !746, file: !739, line: 246, baseType: !749, size: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !746, file: !739, line: 247, baseType: !765, size: 16)
!765 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !746, file: !739, line: 248, baseType: !30, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !746, file: !739, line: 249, baseType: !30, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !746, file: !739, line: 250, baseType: !769, size: 192)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !739, line: 196, size: 192, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !769, file: !739, line: 197, baseType: !452, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !769, file: !739, line: 198, baseType: !452, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !769, file: !739, line: 199, baseType: !616, size: 16, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !769, file: !739, line: 200, baseType: !622, size: 8, offset: 144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !769, file: !739, line: 201, baseType: !622, size: 8, offset: 152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !769, file: !739, line: 202, baseType: !622, size: 8, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !746, file: !739, line: 251, baseType: !407, size: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !746, file: !739, line: 252, baseType: !407, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !746, file: !739, line: 253, baseType: !731, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !746, file: !739, line: 254, baseType: !781, size: 128)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !739, line: 207, size: 128, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !781, file: !739, line: 208, baseType: !5, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !781, file: !739, line: 209, baseType: !5, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !781, file: !739, line: 222, baseType: !786, size: 64, offset: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !781, file: !739, line: 210, size: 64, elements: !787)
!787 = !{!788, !796, !803, !815, !821, !828, !839, !847}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !786, file: !739, line: 212, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !791, line: 56, baseType: !792)
!791 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 53, size: 32, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !792, file: !791, line: 54, baseType: !616, size: 16)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !792, file: !791, line: 55, baseType: !616, size: 16, offset: 16)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !786, file: !739, line: 213, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !791, line: 80, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 77, size: 64, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !799, file: !791, line: 78, baseType: !5, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !799, file: !791, line: 79, baseType: !5, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !786, file: !739, line: 214, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !791, line: 66, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 58, size: 192, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !806, file: !791, line: 59, baseType: !5, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !806, file: !791, line: 60, baseType: !5, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !806, file: !791, line: 61, baseType: !5, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !806, file: !791, line: 62, baseType: !5, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !806, file: !791, line: 63, baseType: !5, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !806, file: !791, line: 64, baseType: !616, size: 16, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !806, file: !791, line: 65, baseType: !616, size: 16, offset: 176)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !786, file: !739, line: 215, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !791, line: 70, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 68, size: 32, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !818, file: !791, line: 69, baseType: !5, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !786, file: !739, line: 216, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !791, line: 75, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 72, size: 160, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !824, file: !791, line: 73, baseType: !5, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !824, file: !791, line: 74, baseType: !407, size: 128, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !786, file: !739, line: 217, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !791, line: 89, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 82, size: 192, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !831, file: !791, line: 83, baseType: !616, size: 16)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !831, file: !791, line: 84, baseType: !5, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !831, file: !791, line: 85, baseType: !5, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !831, file: !791, line: 86, baseType: !5, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !831, file: !791, line: 87, baseType: !5, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !831, file: !791, line: 88, baseType: !5, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !786, file: !739, line: 220, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !791, line: 44, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 40, size: 96, elements: !843)
!843 = !{!844, !845, !846}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !842, file: !791, line: 41, baseType: !5, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !842, file: !791, line: 42, baseType: !5, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !842, file: !791, line: 43, baseType: !616, size: 16, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !786, file: !739, line: 221, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !791, line: 51, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !791, line: 46, size: 128, elements: !851)
!851 = !{!852, !853, !854, !855}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !850, file: !791, line: 47, baseType: !5, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !850, file: !791, line: 48, baseType: !5, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !850, file: !791, line: 49, baseType: !616, size: 16, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !850, file: !791, line: 50, baseType: !5, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !538, file: !29, line: 1304, baseType: !857, size: 64, offset: 768)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!30, !430, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !538, file: !29, line: 1306, baseType: !862, size: 64, offset: 832)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!30, !430, !30}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !538, file: !29, line: 1308, baseType: !866, size: 64, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!30, !430, !869}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !29, line: 206, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !538, file: !29, line: 1310, baseType: !872, size: 64, offset: 960)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !430, !5}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !538, file: !29, line: 1313, baseType: !876, size: 64, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !430, !879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !881, line: 214, size: 1536, elements: !882)
!881 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !880, file: !881, line: 215, baseType: !473, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !880, file: !881, line: 216, baseType: !473, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !880, file: !881, line: 217, baseType: !473, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !880, file: !881, line: 218, baseType: !473, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !880, file: !881, line: 219, baseType: !473, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !880, file: !881, line: 220, baseType: !473, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !880, file: !881, line: 221, baseType: !473, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !880, file: !881, line: 222, baseType: !473, size: 64, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !880, file: !881, line: 223, baseType: !473, size: 64, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !880, file: !881, line: 224, baseType: !473, size: 64, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !880, file: !881, line: 227, baseType: !473, size: 64, offset: 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !880, file: !881, line: 228, baseType: !473, size: 64, offset: 704)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !880, file: !881, line: 229, baseType: !473, size: 64, offset: 768)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !880, file: !881, line: 230, baseType: !473, size: 64, offset: 832)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !880, file: !881, line: 231, baseType: !473, size: 64, offset: 896)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !880, file: !881, line: 232, baseType: !473, size: 64, offset: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !880, file: !881, line: 235, baseType: !473, size: 64, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !880, file: !881, line: 236, baseType: !473, size: 64, offset: 1088)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !880, file: !881, line: 237, baseType: !473, size: 64, offset: 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !880, file: !881, line: 238, baseType: !473, size: 64, offset: 1216)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !880, file: !881, line: 239, baseType: !473, size: 64, offset: 1280)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !880, file: !881, line: 242, baseType: !473, size: 64, offset: 1344)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !880, file: !881, line: 243, baseType: !473, size: 64, offset: 1408)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !880, file: !881, line: 244, baseType: !473, size: 64, offset: 1472)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !538, file: !29, line: 1315, baseType: !908, size: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!911, !913, !30}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !417, line: 30, baseType: !912)
!912 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !538, file: !29, line: 1316, baseType: !916, size: 64, offset: 1152)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!30, !30, !913, !731}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !538, file: !29, line: 1319, baseType: !920, size: 64, offset: 1216)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!923, !430}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !538, file: !29, line: 1321, baseType: !925, size: 64, offset: 1280)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!30, !430, !675, !721}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !538, file: !29, line: 1323, baseType: !925, size: 64, offset: 1344)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !538, file: !29, line: 1331, baseType: !930, size: 64, offset: 1408)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!30, !430, !30, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !472, line: 17, baseType: !621)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !538, file: !29, line: 1333, baseType: !936, size: 64, offset: 1472)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!30, !430, !30, !721, !934, !675}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !538, file: !29, line: 1336, baseType: !940, size: 64, offset: 1536)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!30, !430, !30, !30, !30}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !538, file: !29, line: 1339, baseType: !944, size: 64, offset: 1600)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!30, !430, !30, !911}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !538, file: !29, line: 1341, baseType: !944, size: 64, offset: 1664)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !538, file: !29, line: 1343, baseType: !949, size: 64, offset: 1728)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!30, !430, !30, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !954, line: 20, size: 576, elements: !955)
!954 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!955 = !{!956, !957, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !953, file: !954, line: 21, baseType: !633, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !953, file: !954, line: 22, baseType: !958, size: 256, offset: 32)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 256, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !953, file: !954, line: 23, baseType: !633, size: 32, offset: 288)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !953, file: !954, line: 24, baseType: !633, size: 32, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !953, file: !954, line: 25, baseType: !633, size: 32, offset: 352)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !953, file: !954, line: 26, baseType: !633, size: 32, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !953, file: !954, line: 27, baseType: !633, size: 32, offset: 416)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !953, file: !954, line: 28, baseType: !633, size: 32, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !953, file: !954, line: 29, baseType: !633, size: 32, offset: 480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !953, file: !954, line: 30, baseType: !633, size: 32, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !953, file: !954, line: 31, baseType: !675, size: 16, offset: 544)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !538, file: !29, line: 1346, baseType: !971, size: 64, offset: 1792)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!30, !430, !30, !30}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !538, file: !29, line: 1348, baseType: !975, size: 64, offset: 1856)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!30, !430, !30, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !954, line: 9, size: 512, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !979, file: !954, line: 10, baseType: !473, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !979, file: !954, line: 11, baseType: !473, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !979, file: !954, line: 12, baseType: !473, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !979, file: !954, line: 13, baseType: !473, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !979, file: !954, line: 14, baseType: !473, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !979, file: !954, line: 15, baseType: !473, size: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !979, file: !954, line: 16, baseType: !473, size: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !979, file: !954, line: 17, baseType: !473, size: 64, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !538, file: !29, line: 1352, baseType: !990, size: 64, offset: 1920)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!30, !430, !30, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !996, line: 213, size: 32, elements: !997)
!996 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !995, file: !996, line: 214, baseType: !615, size: 16)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !995, file: !996, line: 215, baseType: !615, size: 16, offset: 16)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !538, file: !29, line: 1355, baseType: !1001, size: 64, offset: 1984)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!30, !430, !30, !555}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !538, file: !29, line: 1357, baseType: !1005, size: 64, offset: 2048)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!30, !430, !30, !1008, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !881, line: 956, size: 128, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1009, file: !881, line: 957, baseType: !633, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1009, file: !881, line: 958, baseType: !473, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !538, file: !29, line: 1361, baseType: !1014, size: 64, offset: 2112)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!30, !430, !30, !471, !30}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !538, file: !29, line: 1364, baseType: !944, size: 64, offset: 2176)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !538, file: !29, line: 1367, baseType: !1019, size: 64, offset: 2240)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!30, !430, !35, !731}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !538, file: !29, line: 1400, baseType: !1023, size: 64, offset: 2304)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!30, !430, !430, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1028, line: 75, size: 384, elements: !1029)
!1028 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1029 = !{!1030, !1031, !1034, !1038, !1042}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1027, file: !1028, line: 76, baseType: !432, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1027, file: !1028, line: 77, baseType: !1032, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1027, file: !1028, line: 78, baseType: !1035, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1037 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1028, line: 78, flags: DIFlagFwdDecl)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1027, file: !1028, line: 79, baseType: !1039, size: 160, offset: 192)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 160, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 20)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1027, file: !1028, line: 80, baseType: !934, size: 8, offset: 352)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !538, file: !29, line: 1403, baseType: !1044, size: 64, offset: 2368)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!30, !430, !430}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !538, file: !29, line: 1405, baseType: !1048, size: 64, offset: 2432)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!430, !430, !555, !911}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !538, file: !29, line: 1408, baseType: !1052, size: 64, offset: 2496)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!469, !430, !469}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !538, file: !29, line: 1410, baseType: !1056, size: 64, offset: 2560)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!30, !430, !469}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !538, file: !29, line: 1412, baseType: !1060, size: 64, offset: 2624)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!30, !430, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1065, line: 35, flags: DIFlagFwdDecl)
!1065 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !538, file: !29, line: 1414, baseType: !1067, size: 64, offset: 2688)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !430, !1063}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !538, file: !29, line: 1417, baseType: !1071, size: 64, offset: 2752)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!30, !1074, !993, !430, !1086, !721, !721, !1026}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1076, line: 8, size: 96, elements: !1077)
!1076 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1077 = !{!1078, !1079, !1080, !1081, !1083, !1084, !1085}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1075, file: !1076, line: 9, baseType: !621, size: 8)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1075, file: !1076, line: 10, baseType: !621, size: 8, offset: 8)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1075, file: !1076, line: 11, baseType: !615, size: 16, offset: 16)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1075, file: !1076, line: 12, baseType: !1082, size: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !474, line: 26, baseType: !30)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1075, file: !1076, line: 13, baseType: !615, size: 16, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1075, file: !1076, line: 14, baseType: !621, size: 8, offset: 80)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1075, file: !1076, line: 15, baseType: !621, size: 8, offset: 88)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !538, file: !29, line: 1424, baseType: !1089, size: 64, offset: 2816)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!30, !1074, !993, !430, !1086, !721}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !538, file: !29, line: 1429, baseType: !1093, size: 64, offset: 2880)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!30, !555, !1096, !430, !430, !1141}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1028, line: 203, size: 1024, elements: !1098)
!1098 = !{!1099, !1100, !1110, !1114, !1118, !1119, !1123, !1124, !1125, !1126, !1128, !1129, !1130, !1131}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1097, file: !1028, line: 204, baseType: !555, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1097, file: !1028, line: 205, baseType: !1101, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !996, line: 44, size: 128, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1103, file: !996, line: 45, baseType: !633, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1103, file: !996, line: 46, baseType: !615, size: 16, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1103, file: !996, line: 47, baseType: !615, size: 16, offset: 48)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1103, file: !996, line: 48, baseType: !633, size: 32, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1103, file: !996, line: 49, baseType: !633, size: 32, offset: 96)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1097, file: !1028, line: 206, baseType: !1111, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!30, !555, !1096}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1097, file: !1028, line: 208, baseType: !1115, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!30, !1096}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !1028, line: 209, baseType: !731, size: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1097, file: !1028, line: 211, baseType: !1120, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1122, line: 76, flags: DIFlagFwdDecl)
!1122 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1097, file: !1028, line: 212, baseType: !1026, size: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1097, file: !1028, line: 213, baseType: !721, size: 16, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1097, file: !1028, line: 214, baseType: !721, size: 16, offset: 464)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1097, file: !1028, line: 215, baseType: !1127, size: 32, offset: 480)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !472, line: 21, baseType: !633)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1097, file: !1028, line: 216, baseType: !5, size: 32, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1097, file: !1028, line: 216, baseType: !5, size: 32, offset: 544)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1097, file: !1028, line: 217, baseType: !911, size: 8, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, scope: !1097, file: !1028, line: 218, baseType: !1132, size: 384, offset: 640)
!1132 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1097, file: !1028, line: 218, size: 384, elements: !1133)
!1133 = !{!1134, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1132, file: !1028, line: 219, baseType: !1135, size: 384)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 384, elements: !598)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1132, file: !1028, line: 224, baseType: !1137, size: 384)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 384, elements: !1139)
!1138 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1139 = !{!1140}
!1140 = !DISubrange(count: 6)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !538, file: !29, line: 1434, baseType: !1143, size: 64, offset: 2944)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!30, !555, !993, !430, !1086, !721, !1127, !1127, !1026}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !538, file: !29, line: 1440, baseType: !1147, size: 64, offset: 3008)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!30, !430, !1150, !721, !1026}
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !538, file: !29, line: 1444, baseType: !1152, size: 64, offset: 3072)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!30, !555, !1127, !1127, !430, !1127, !30}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !538, file: !29, line: 1449, baseType: !1156, size: 64, offset: 3136)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!30, !430, !1150, !721}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !538, file: !29, line: 1452, baseType: !1160, size: 64, offset: 3200)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!30, !430, !911}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !538, file: !29, line: 1454, baseType: !1164, size: 64, offset: 3264)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!30, !430, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !29, line: 820, size: 264, elements: !1169)
!1169 = !{!1170, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1168, file: !29, line: 821, baseType: !1171, size: 256)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 256, elements: !959)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1168, file: !29, line: 822, baseType: !622, size: 8, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !538, file: !29, line: 1456, baseType: !1164, size: 64, offset: 3328)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !538, file: !29, line: 1458, baseType: !1175, size: 64, offset: 3392)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!30, !430, !1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !417, line: 55, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1181, line: 72, baseType: !1182)
!1181 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1181, line: 16, baseType: !452)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !538, file: !29, line: 1460, baseType: !1184, size: 64, offset: 3456)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{null, !430, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !29, line: 67, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !538, file: !29, line: 1462, baseType: !1184, size: 64, offset: 3520)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !538, file: !29, line: 1464, baseType: !1191, size: 64, offset: 3584)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!731, !430, !430}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !538, file: !29, line: 1466, baseType: !1195, size: 64, offset: 3648)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{null, !430, !731}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !538, file: !29, line: 1469, baseType: !1199, size: 64, offset: 3712)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!30, !430, !30, !1127}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !538, file: !29, line: 1472, baseType: !1203, size: 64, offset: 3776)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!30, !913}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !538, file: !29, line: 1473, baseType: !1160, size: 64, offset: 3840)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !538, file: !29, line: 1475, baseType: !1208, size: 64, offset: 3904)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!30, !430, !555}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !538, file: !29, line: 1477, baseType: !723, size: 64, offset: 3968)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !538, file: !29, line: 1479, baseType: !1213, size: 64, offset: 4032)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!30, !430, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !29, line: 894, size: 256, elements: !1218)
!1218 = !{!1219, !1220}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1217, file: !29, line: 895, baseType: !55, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, scope: !1217, file: !29, line: 896, baseType: !1221, size: 192, offset: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1217, file: !29, line: 896, size: 192, elements: !1222)
!1222 = !{!1223, !1232, !5610}
!1223 = !DIDerivedType(tag: DW_TAG_member, scope: !1221, file: !29, line: 898, baseType: !1224, size: 192)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1221, file: !29, line: 898, size: 192, elements: !1225)
!1225 = !{!1226, !1227, !1231}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1224, file: !29, line: 899, baseType: !1127, size: 32)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1224, file: !29, line: 900, baseType: !1228, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1230, line: 11, flags: DIFlagFwdDecl)
!1230 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1224, file: !29, line: 901, baseType: !1026, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, scope: !1221, file: !29, line: 904, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1221, file: !29, line: 904, size: 64, elements: !1234)
!1234 = !{!1235}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1233, file: !29, line: 905, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !63, line: 222, size: 2560, elements: !1238)
!1238 = !{!1239, !5589, !5590, !5608, !5609}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1237, file: !63, line: 223, baseType: !1240, size: 2048)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !63, line: 141, size: 2048, elements: !1241)
!1241 = !{!1242, !5563, !5564, !5565, !5566, !5567, !5568, !5569, !5570, !5571, !5572, !5573, !5574, !5575, !5580, !5581, !5582, !5583, !5584, !5585, !5586, !5587, !5588}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1240, file: !63, line: 145, baseType: !1243, size: 64, align: 512)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !63, line: 54, size: 2368, elements: !1246)
!1246 = !{!1247, !1446, !1451, !5235, !5239, !5243, !5244, !5248, !5254, !5255, !5256, !5257, !5258, !5262, !5266, !5270, !5271, !5272, !5276, !5277, !5289, !5293, !5297, !5309, !5498, !5502, !5506, !5511, !5515, !5519, !5523, !5529, !5533, !5540, !5544, !5546, !5547}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1245, file: !63, line: 56, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!30, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !94, line: 483, size: 960, align: 64, elements: !1253)
!1253 = !{!1254, !1270, !1281, !1292, !1316, !1322, !1330, !1347, !1360, !1366, !1375, !1380, !1388, !1400, !1420, !1427, !1431, !1435, !1440}
!1254 = !DIDerivedType(tag: DW_TAG_member, scope: !1252, file: !94, line: 484, baseType: !1255, size: 512)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1252, file: !94, line: 484, size: 512, elements: !1256)
!1256 = !{!1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1255, file: !94, line: 485, baseType: !633, size: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1255, file: !94, line: 486, baseType: !633, size: 32, offset: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1255, file: !94, line: 487, baseType: !633, size: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1255, file: !94, line: 488, baseType: !633, size: 32, offset: 96)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1255, file: !94, line: 489, baseType: !633, size: 32, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1255, file: !94, line: 492, baseType: !633, size: 32, offset: 160)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1255, file: !94, line: 493, baseType: !633, size: 32, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1255, file: !94, line: 496, baseType: !407, size: 128, offset: 224)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1255, file: !94, line: 497, baseType: !633, size: 32, offset: 352)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1255, file: !94, line: 498, baseType: !633, size: 32, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1255, file: !94, line: 499, baseType: !633, size: 32, offset: 416)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1255, file: !94, line: 500, baseType: !633, size: 32, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1255, file: !94, line: 501, baseType: !633, size: 32, offset: 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, scope: !1252, file: !94, line: 507, baseType: !1271, size: 256)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1252, file: !94, line: 507, size: 256, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1280}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1271, file: !94, line: 508, baseType: !633, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1271, file: !94, line: 509, baseType: !473, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, scope: !1271, file: !94, line: 510, baseType: !1276, size: 64, offset: 128)
!1276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1271, file: !94, line: 510, size: 64, elements: !1277)
!1277 = !{!1278, !1279}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1276, file: !94, line: 511, baseType: !473, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1276, file: !94, line: 512, baseType: !473, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1271, file: !94, line: 514, baseType: !473, size: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1252, file: !94, line: 532, baseType: !1282, size: 448)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1252, file: !94, line: 517, size: 448, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1282, file: !94, line: 518, baseType: !473, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1282, file: !94, line: 521, baseType: !473, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1282, file: !94, line: 522, baseType: !473, size: 64, align: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1282, file: !94, line: 523, baseType: !473, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1282, file: !94, line: 524, baseType: !633, size: 32, offset: 256)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1282, file: !94, line: 529, baseType: !633, size: 32, offset: 288)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1282, file: !94, line: 530, baseType: !473, size: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1282, file: !94, line: 531, baseType: !473, size: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_member, scope: !1252, file: !94, line: 534, baseType: !1293, size: 960)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1252, file: !94, line: 534, size: 960, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1293, file: !94, line: 535, baseType: !633, size: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1293, file: !94, line: 536, baseType: !633, size: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1293, file: !94, line: 537, baseType: !473, size: 64, align: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1293, file: !94, line: 538, baseType: !473, size: 64, align: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1293, file: !94, line: 539, baseType: !633, size: 32, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1293, file: !94, line: 540, baseType: !633, size: 32, offset: 224)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1293, file: !94, line: 541, baseType: !473, size: 64, align: 64, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1293, file: !94, line: 542, baseType: !633, size: 32, offset: 320)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1293, file: !94, line: 543, baseType: !633, size: 32, offset: 352)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1293, file: !94, line: 544, baseType: !407, size: 128, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1293, file: !94, line: 545, baseType: !633, size: 32, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1293, file: !94, line: 550, baseType: !633, size: 32, offset: 544)
