; ModuleID = '../bcout/drivers/net/wireless/ath/ath6kl/init.llvm.bc'
source_filename = "drivers/net/wireless/ath/ath6kl/init.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.ath6kl_hw = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i32, i32, %struct.ath6kl_hw_fw, i8*, i8* }
%struct.ath6kl_hw_fw = type { i8*, i8*, i8*, i8*, i8*, i8*, i8* }
%struct.fw_capa_str_map = type { i32, i8* }
%struct.sk_buff = type { %union.anon, %union.anon.126, %union.anon.127, [48 x i8], %union.anon.128, i32, i32, i16, i16, i16, [0 x i8], i8, [0 x i32], [0 x i8], i16, [0 x i8], i16, %union.anon.130, i32, i32, i32, i16, i16, %union.anon.132, %union.anon.133, %union.anon.134, i16, i16, i16, i16, i16, i16, i16, [0 x i32], i32, i32, i8*, i8*, i32, %struct.refcount_struct }
%union.anon = type { %struct.anon }
%struct.anon = type { %struct.sk_buff*, %struct.sk_buff*, %union.anon.0 }
%union.anon.0 = type { %struct.net_device* }

!414 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_MBSS", value: 3, isUnsigned: true)
!415 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_ANY", value: 4, isUnsigned: true)
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_chan_width", file: !308, line: 4521, baseType: !13, size: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!418 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20_NOHT", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_40", value: 2, isUnsigned: true)
!421 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80", value: 3, isUnsigned: true)
!422 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80P80", value: 4, isUnsigned: true)
!423 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_160", value: 5, isUnsigned: true)
!424 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_5", value: 6, isUnsigned: true)
!425 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_10", value: 7, isUnsigned: true)
!426 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_1", value: 8, isUnsigned: true)
!427 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_2", value: 9, isUnsigned: true)
!428 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_4", value: 10, isUnsigned: true)
!429 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_8", value: 11, isUnsigned: true)
!430 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_16", value: 12, isUnsigned: true)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_key_mode", file: !308, line: 4491, baseType: !13, size: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "NL80211_KEY_RX_TX", value: 0, isUnsigned: true)
!434 = !DIEnumerator(name: "NL80211_KEY_NO_TX", value: 1, isUnsigned: true)
!435 = !DIEnumerator(name: "NL80211_KEY_SET_TX", value: 2, isUnsigned: true)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_auth_type", file: !308, line: 4672, baseType: !13, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!438 = !DIEnumerator(name: "NL80211_AUTHTYPE_OPEN_SYSTEM", value: 0, isUnsigned: true)
!439 = !DIEnumerator(name: "NL80211_AUTHTYPE_SHARED_KEY", value: 1, isUnsigned: true)
!440 = !DIEnumerator(name: "NL80211_AUTHTYPE_FT", value: 2, isUnsigned: true)
!441 = !DIEnumerator(name: "NL80211_AUTHTYPE_NETWORK_EAP", value: 3, isUnsigned: true)
!442 = !DIEnumerator(name: "NL80211_AUTHTYPE_SAE", value: 4, isUnsigned: true)
!443 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK", value: 5, isUnsigned: true)
!444 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK_PFS", value: 6, isUnsigned: true)
!445 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_PK", value: 7, isUnsigned: true)
!446 = !DIEnumerator(name: "__NL80211_AUTHTYPE_NUM", value: 8, isUnsigned: true)
!447 = !DIEnumerator(name: "NL80211_AUTHTYPE_MAX", value: 7, isUnsigned: true)
!448 = !DIEnumerator(name: "NL80211_AUTHTYPE_AUTOMATIC", value: 8, isUnsigned: true)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_mfp", file: !308, line: 4709, baseType: !13, size: 32, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIEnumerator(name: "NL80211_MFP_NO", value: 0, isUnsigned: true)
!452 = !DIEnumerator(name: "NL80211_MFP_REQUIRED", value: 1, isUnsigned: true)
!453 = !DIEnumerator(name: "NL80211_MFP_OPTIONAL", value: 2, isUnsigned: true)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_bss_select_attr", file: !308, line: 6321, baseType: !13, size: 32, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461}
!456 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_INVALID", value: 0, isUnsigned: true)
!457 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_BAND_PREF", value: 2, isUnsigned: true)
!459 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI_ADJUST", value: 3, isUnsigned: true)
!460 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_AFTER_LAST", value: 4, isUnsigned: true)
!461 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_MAX", value: 3, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !6, line: 423, baseType: !13, size: 32, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!466 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!467 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !469, file: !6, line: 2085, baseType: !13, size: 32, elements: !8036)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !6, line: 1858, size: 15808, elements: !470)
!470 = !{!471, !476, !499, !516, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !533, !541, !542, !543, !544, !545, !546, !547, !548, !549, !575, !585, !586, !587, !592, !593, !597, !600, !5692, !6208, !6212, !6252, !6253, !6254, !6255, !6256, !6257, !6258, !6259, !6260, !6261, !6262, !6263, !6264, !6265, !6266, !6267, !6268, !6269, !6270, !6271, !6272, !6273, !6274, !6275, !6276, !6277, !6278, !6283, !6284, !6285, !6560, !6561, !6562, !6563, !6566, !6569, !6572, !7862, !7865, !7866, !7879, !7880, !7881, !7882, !7883, !7884, !7891, !7892, !7926, !7927, !7928, !7929, !7930, !7931, !7932, !7933, !7934, !7937, !7938, !7939, !7940, !7941, !7942, !7943, !7944, !7945, !7950, !7951, !7952, !7953, !7990, !7991, !7993, !7994, !7998, !7999, !8000, !8001, !8007, !8009, !8012, !8015, !8017, !8018, !8019, !8020, !8021, !8025, !8028}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !6, line: 1859, baseType: !472, size: 128)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 128, elements: !474)
!473 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!474 = !{!475}
!475 = !DISubrange(count: 16)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !469, file: !6, line: 1860, baseType: !477, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !6, line: 938, size: 384, elements: !479)
!479 = !{!480, !488, !494, !496}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !478, file: !6, line: 939, baseType: !481, size: 128)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !482, line: 186, size: 128, elements: !483)
!482 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!483 = !{!484, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !481, file: !482, line: 187, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !481, file: !482, line: 187, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !478, file: !6, line: 940, baseType: !489, size: 128, offset: 128)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !482, line: 178, size: 128, elements: !490)
!490 = !{!491, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !482, line: 179, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !489, file: !482, line: 179, baseType: !492, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !478, file: !6, line: 941, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !478, file: !6, line: 942, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !469, file: !6, line: 1861, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !6, line: 930, size: 128, elements: !502)
!502 = !{!503, !512}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !501, file: !6, line: 931, baseType: !504, size: 128, align: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !482, line: 216, size: 128, align: 64, elements: !505)
!505 = !{!506, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !482, line: 217, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !504, file: !482, line: 218, baseType: !509, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !507}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !501, file: !6, line: 932, baseType: !513, offset: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: -1)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !469, file: !6, line: 1866, baseType: !517, size: 64, offset: 256)
!517 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !469, file: !6, line: 1867, baseType: !517, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !469, file: !6, line: 1868, baseType: !517, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !469, file: !6, line: 1869, baseType: !7, size: 32, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !6, line: 1877, baseType: !517, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !469, file: !6, line: 1879, baseType: !489, size: 128, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !469, file: !6, line: 1880, baseType: !489, size: 128, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !469, file: !6, line: 1881, baseType: !489, size: 128, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !469, file: !6, line: 1882, baseType: !489, size: 128, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !469, file: !6, line: 1883, baseType: !489, size: 128, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !469, file: !6, line: 1884, baseType: !489, size: 128, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !469, file: !6, line: 1889, baseType: !529, size: 256, offset: 1344)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !6, line: 1886, size: 256, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !529, file: !6, line: 1887, baseType: !489, size: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !529, file: !6, line: 1888, baseType: !489, size: 128, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !469, file: !6, line: 1891, baseType: !534, size: 64, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !535, line: 12, baseType: !536)
!535 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !537, line: 23, baseType: !538)
!537 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !539, line: 31, baseType: !540)
!539 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!540 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !469, file: !6, line: 1892, baseType: !534, size: 64, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !469, file: !6, line: 1893, baseType: !534, size: 64, offset: 1728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !469, file: !6, line: 1894, baseType: !534, size: 64, offset: 1792)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !469, file: !6, line: 1895, baseType: !534, size: 64, offset: 1856)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !469, file: !6, line: 1896, baseType: !534, size: 64, offset: 1920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !469, file: !6, line: 1897, baseType: !534, size: 64, offset: 1984)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !469, file: !6, line: 1899, baseType: !7, size: 32, offset: 2048)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !469, file: !6, line: 1900, baseType: !7, size: 32, offset: 2080)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !469, file: !6, line: 1902, baseType: !550, size: 1472, offset: 2112)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !6, line: 169, size: 1472, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !550, file: !6, line: 170, baseType: !517, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !550, file: !6, line: 171, baseType: !517, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !550, file: !6, line: 172, baseType: !517, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !550, file: !6, line: 173, baseType: !517, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !550, file: !6, line: 174, baseType: !517, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !550, file: !6, line: 175, baseType: !517, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !550, file: !6, line: 176, baseType: !517, size: 64, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !550, file: !6, line: 177, baseType: !517, size: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !550, file: !6, line: 178, baseType: !517, size: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !550, file: !6, line: 179, baseType: !517, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !550, file: !6, line: 180, baseType: !517, size: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !550, file: !6, line: 181, baseType: !517, size: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !550, file: !6, line: 182, baseType: !517, size: 64, offset: 768)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !550, file: !6, line: 183, baseType: !517, size: 64, offset: 832)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !550, file: !6, line: 184, baseType: !517, size: 64, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !550, file: !6, line: 185, baseType: !517, size: 64, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !550, file: !6, line: 186, baseType: !517, size: 64, offset: 1024)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !550, file: !6, line: 187, baseType: !517, size: 64, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !550, file: !6, line: 188, baseType: !517, size: 64, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !550, file: !6, line: 189, baseType: !517, size: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !550, file: !6, line: 190, baseType: !517, size: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !550, file: !6, line: 191, baseType: !517, size: 64, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !550, file: !6, line: 192, baseType: !517, size: 64, offset: 1408)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !469, file: !6, line: 1904, baseType: !576, size: 64, offset: 3584)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !577, line: 13, baseType: !578)
!577 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !482, line: 175, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 173, size: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !579, file: !482, line: 174, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !537, line: 22, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !539, line: 30, baseType: !584)
!584 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !469, file: !6, line: 1905, baseType: !576, size: 64, offset: 3648)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !469, file: !6, line: 1906, baseType: !576, size: 64, offset: 3712)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !469, file: !6, line: 1909, baseType: !588, size: 32, offset: 3776)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !482, line: 168, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 166, size: 32, elements: !590)
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !589, file: !482, line: 167, baseType: !7, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !469, file: !6, line: 1910, baseType: !588, size: 32, offset: 3808)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !469, file: !6, line: 1913, baseType: !594, size: 64, offset: 3840)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !6, line: 1913, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !469, file: !6, line: 1914, baseType: !598, size: 64, offset: 3904)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !6, line: 1914, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !469, file: !6, line: 1916, baseType: !601, size: 64, offset: 3968)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !6, line: 1283, size: 4416, elements: !604)
!604 = !{!605, !609, !613, !614, !615, !777, !781, !786, !790, !791, !796, !797, !920, !925, !929, !935, !939, !971, !979, !983, !988, !992, !993, !999, !1003, !1007, !1011, !1012, !1034, !1038, !1053, !1064, !1068, !1077, !1081, !1082, !1086, !1107, !1111, !1115, !1119, !1123, !1130, !1134, !1152, !1156, !1206, !1210, !1215, !1219, !1223, !1227, !1237, !1238, !1247, !1253, !1254, !1258, !1262, !1266, !1270, !1271, !1275, !1276, !5652, !5672, !5676, !5682, !5688}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !603, file: !6, line: 1284, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!7, !495}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !603, file: !6, line: 1285, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !495}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !603, file: !6, line: 1286, baseType: !606, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !603, file: !6, line: 1287, baseType: !606, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !603, file: !6, line: 1288, baseType: !616, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !620, !495}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !6, line: 120, baseType: !5)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !622, line: 713, size: 1600, elements: !623)
!622 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!623 = !{!624, !646, !653, !660, !664, !676, !677, !678, !681, !682, !683, !689, !690, !691, !692, !693, !694, !695, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !735, !736, !737, !738, !740, !741, !746, !751, !756, !757, !758, !759, !760, !761, !762, !763, !764, !766, !767, !769, !770, !771}
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 714, baseType: !625, size: 192)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 714, size: 192, elements: !626)
!626 = !{!627, !637, !645}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !622, line: 715, baseType: !628, size: 192)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !622, line: 715, size: 192, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !622, line: 717, baseType: !620, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !622, line: 718, baseType: !620, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, scope: !628, file: !622, line: 720, baseType: !633, size: 64, offset: 128)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !622, line: 720, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !633, file: !622, line: 721, baseType: !495, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !633, file: !622, line: 726, baseType: !517, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !625, file: !622, line: 729, baseType: !638, size: 192, align: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !639, line: 24, size: 192, align: 64, elements: !640)
!639 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!640 = !{!641, !642, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !638, file: !639, line: 25, baseType: !517, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !638, file: !639, line: 26, baseType: !643, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !638, file: !639, line: 27, baseType: !643, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !625, file: !622, line: 730, baseType: !489, size: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 733, baseType: !647, size: 64, offset: 192)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 733, size: 64, elements: !648)
!648 = !{!649, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !647, file: !622, line: 734, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !288, line: 19, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !647, file: !622, line: 735, baseType: !7, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 738, baseType: !654, size: 64, offset: 256)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 738, size: 64, elements: !655)
!655 = !{!656, !659}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !654, file: !622, line: 739, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !658, line: 29, baseType: !582)
!658 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!659 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !654, file: !622, line: 740, baseType: !536, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !621, file: !622, line: 748, baseType: !661, size: 384, align: 64, offset: 320)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 384, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 48)
!664 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 750, baseType: !665, size: 128, offset: 704)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 750, size: 128, elements: !666)
!666 = !{!667, !675}
!667 = !DIDerivedType(tag: DW_TAG_member, scope: !665, file: !622, line: 751, baseType: !668, size: 128)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !622, line: 751, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !668, file: !622, line: 752, baseType: !517, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !668, file: !622, line: 753, baseType: !672, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !620}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !665, file: !622, line: 755, baseType: !489, size: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !621, file: !622, line: 761, baseType: !13, size: 32, offset: 832)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !621, file: !622, line: 762, baseType: !13, size: 32, offset: 864)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !621, file: !622, line: 763, baseType: !679, size: 16, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !539, line: 24, baseType: !680)
!680 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !621, file: !622, line: 764, baseType: !679, size: 16, offset: 912)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !621, file: !622, line: 769, baseType: !679, size: 16, offset: 928)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !621, file: !622, line: 780, baseType: !684, offset: 944)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, elements: !687)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !539, line: 21, baseType: !686)
!686 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!687 = !{!688}
!688 = !DISubrange(count: 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !621, file: !622, line: 782, baseType: !685, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !621, file: !622, line: 783, baseType: !685, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !621, file: !622, line: 784, baseType: !685, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !621, file: !622, line: 785, baseType: !685, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !621, file: !622, line: 786, baseType: !685, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !621, file: !622, line: 787, baseType: !685, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !621, file: !622, line: 795, baseType: !696, offset: 960)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, elements: !687)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !539, line: 27, baseType: !13)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !621, file: !622, line: 807, baseType: !684, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !621, file: !622, line: 809, baseType: !685, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !621, file: !622, line: 810, baseType: !685, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !621, file: !622, line: 811, baseType: !685, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !621, file: !622, line: 812, baseType: !685, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !621, file: !622, line: 813, baseType: !685, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !621, file: !622, line: 815, baseType: !685, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !621, file: !622, line: 816, baseType: !685, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !621, file: !622, line: 817, baseType: !685, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !621, file: !622, line: 818, baseType: !685, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !621, file: !622, line: 819, baseType: !685, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !621, file: !622, line: 821, baseType: !685, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !621, file: !622, line: 822, baseType: !685, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !621, file: !622, line: 823, baseType: !685, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !621, file: !622, line: 832, baseType: !684, offset: 976)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !621, file: !622, line: 834, baseType: !685, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !621, file: !622, line: 835, baseType: !685, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !621, file: !622, line: 836, baseType: !685, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !621, file: !622, line: 837, baseType: !685, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !621, file: !622, line: 838, baseType: !685, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !621, file: !622, line: 840, baseType: !685, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !621, file: !622, line: 843, baseType: !685, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !621, file: !622, line: 844, baseType: !685, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !621, file: !622, line: 845, baseType: !685, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !621, file: !622, line: 847, baseType: !685, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !621, file: !622, line: 848, baseType: !685, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!724 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 866, baseType: !725, size: 32, offset: 992)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 866, size: 32, elements: !726)
!726 = !{!727, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !725, file: !622, line: 867, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !729, line: 37, baseType: !697)
!729 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!730 = !DIDerivedType(tag: DW_TAG_member, scope: !725, file: !622, line: 868, baseType: !731, size: 32)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !622, line: 868, size: 32, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !731, file: !622, line: 869, baseType: !679, size: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !731, file: !622, line: 870, baseType: !679, size: 16, offset: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !621, file: !622, line: 873, baseType: !697, size: 32, offset: 1024)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !621, file: !622, line: 874, baseType: !7, size: 32, offset: 1056)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !621, file: !622, line: 875, baseType: !697, size: 32, offset: 1088)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !621, file: !622, line: 876, baseType: !739, size: 16, offset: 1120)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !729, line: 30, baseType: !679)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !621, file: !622, line: 877, baseType: !679, size: 16, offset: 1136)
!741 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 879, baseType: !742, size: 32, offset: 1152)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 879, size: 32, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !742, file: !622, line: 880, baseType: !13, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !742, file: !622, line: 881, baseType: !13, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 888, baseType: !747, size: 32, offset: 1184)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 888, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !747, file: !622, line: 889, baseType: !697, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !747, file: !622, line: 890, baseType: !697, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 893, baseType: !752, size: 16, offset: 1216)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 893, size: 16, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !752, file: !622, line: 894, baseType: !739, size: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !752, file: !622, line: 895, baseType: !685, size: 8)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !621, file: !622, line: 898, baseType: !679, size: 16, offset: 1232)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !621, file: !622, line: 899, baseType: !679, size: 16, offset: 1248)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !621, file: !622, line: 900, baseType: !679, size: 16, offset: 1264)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !621, file: !622, line: 902, baseType: !739, size: 16, offset: 1280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !621, file: !622, line: 903, baseType: !679, size: 16, offset: 1296)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !621, file: !622, line: 904, baseType: !679, size: 16, offset: 1312)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !621, file: !622, line: 905, baseType: !679, size: 16, offset: 1328)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !621, file: !622, line: 908, baseType: !696, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !621, file: !622, line: 912, baseType: !765, size: 32, offset: 1344)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !622, line: 606, baseType: !13)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !621, file: !622, line: 913, baseType: !765, size: 32, offset: 1376)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !621, file: !622, line: 914, baseType: !768, size: 64, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !622, line: 915, baseType: !768, size: 64, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !621, file: !622, line: 916, baseType: !13, size: 32, offset: 1536)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !621, file: !622, line: 917, baseType: !772, size: 32, offset: 1568)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !773, line: 113, baseType: !774)
!773 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !773, line: 111, size: 32, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !774, file: !773, line: 112, baseType: !588, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !603, file: !6, line: 1290, baseType: !778, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!534, !620, !495, !534}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !603, file: !6, line: 1293, baseType: !782, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DISubroutineType(types: !784)
!784 = !{!785, !495, !620, !495}
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !537, line: 19, baseType: !679)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !603, file: !6, line: 1296, baseType: !787, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !495, !7}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !603, file: !6, line: 1298, baseType: !610, size: 64, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !603, file: !6, line: 1299, baseType: !792, size: 64, offset: 576)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!7, !495, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !603, file: !6, line: 1301, baseType: !606, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !603, file: !6, line: 1302, baseType: !798, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{!7, !495, !801, !7}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !803, line: 234, size: 320, elements: !804)
!803 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!804 = !{!805, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !802, file: !803, line: 239, baseType: !806, size: 128)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !802, file: !803, line: 236, size: 128, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !806, file: !803, line: 238, baseType: !472, size: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !802, file: !803, line: 255, baseType: !810, size: 192, offset: 128)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !802, file: !803, line: 241, size: 192, elements: !811)
!811 = !{!812, !824, !825, !826, !827, !828, !830, !831, !832, !841, !842, !843, !844}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !810, file: !803, line: 242, baseType: !813, size: 128)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !814, line: 32, size: 128, elements: !815)
!814 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!815 = !{!816, !820}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !813, file: !814, line: 33, baseType: !817, size: 16)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !814, line: 26, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !819, line: 10, baseType: !680)
!819 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !813, file: !814, line: 34, baseType: !821, size: 112, offset: 16)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 112, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 14)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !810, file: !803, line: 243, baseType: !813, size: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !810, file: !803, line: 244, baseType: !813, size: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !810, file: !803, line: 245, baseType: !813, size: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !810, file: !803, line: 246, baseType: !813, size: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !810, file: !803, line: 247, baseType: !829, size: 16)
!829 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !810, file: !803, line: 248, baseType: !7, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !810, file: !803, line: 249, baseType: !7, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !810, file: !803, line: 250, baseType: !833, size: 192)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !803, line: 196, size: 192, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !833, file: !803, line: 197, baseType: !517, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !833, file: !803, line: 198, baseType: !517, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !833, file: !803, line: 199, baseType: !680, size: 16, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !833, file: !803, line: 200, baseType: !686, size: 8, offset: 144)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !833, file: !803, line: 201, baseType: !686, size: 8, offset: 152)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !833, file: !803, line: 202, baseType: !686, size: 8, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !810, file: !803, line: 251, baseType: !472, size: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !810, file: !803, line: 252, baseType: !472, size: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !810, file: !803, line: 253, baseType: !795, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !810, file: !803, line: 254, baseType: !845, size: 128)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !803, line: 207, size: 128, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !845, file: !803, line: 208, baseType: !13, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !845, file: !803, line: 209, baseType: !13, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !845, file: !803, line: 222, baseType: !850, size: 64, offset: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !845, file: !803, line: 210, size: 64, elements: !851)
!851 = !{!852, !860, !867, !879, !885, !892, !903, !911}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !850, file: !803, line: 212, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !855, line: 56, baseType: !856)
!855 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 53, size: 32, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !856, file: !855, line: 54, baseType: !680, size: 16)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !856, file: !855, line: 55, baseType: !680, size: 16, offset: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !850, file: !803, line: 213, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !855, line: 80, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 77, size: 64, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !863, file: !855, line: 78, baseType: !13, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !863, file: !855, line: 79, baseType: !13, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !850, file: !803, line: 214, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !855, line: 66, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 58, size: 192, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !870, file: !855, line: 59, baseType: !13, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !870, file: !855, line: 60, baseType: !13, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !870, file: !855, line: 61, baseType: !13, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !870, file: !855, line: 62, baseType: !13, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !870, file: !855, line: 63, baseType: !13, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !870, file: !855, line: 64, baseType: !680, size: 16, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !870, file: !855, line: 65, baseType: !680, size: 16, offset: 176)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !850, file: !803, line: 215, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !855, line: 70, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 68, size: 32, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !882, file: !855, line: 69, baseType: !13, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !850, file: !803, line: 216, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !855, line: 75, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 72, size: 160, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !888, file: !855, line: 73, baseType: !13, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !888, file: !855, line: 74, baseType: !472, size: 128, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !850, file: !803, line: 217, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !855, line: 89, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 82, size: 192, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !895, file: !855, line: 83, baseType: !680, size: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !895, file: !855, line: 84, baseType: !13, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !895, file: !855, line: 85, baseType: !13, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !895, file: !855, line: 86, baseType: !13, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !895, file: !855, line: 87, baseType: !13, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !895, file: !855, line: 88, baseType: !13, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !850, file: !803, line: 220, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !855, line: 44, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 40, size: 96, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !906, file: !855, line: 41, baseType: !13, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !906, file: !855, line: 42, baseType: !13, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !906, file: !855, line: 43, baseType: !680, size: 16, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !850, file: !803, line: 221, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !855, line: 51, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !855, line: 46, size: 128, elements: !915)
!915 = !{!916, !917, !918, !919}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !914, file: !855, line: 47, baseType: !13, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !914, file: !855, line: 48, baseType: !13, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !914, file: !855, line: 49, baseType: !680, size: 16, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !914, file: !855, line: 50, baseType: !13, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !603, file: !6, line: 1304, baseType: !921, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!7, !495, !924}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !603, file: !6, line: 1306, baseType: !926, size: 64, offset: 832)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!7, !495, !7}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !603, file: !6, line: 1308, baseType: !930, size: 64, offset: 896)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!7, !495, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !6, line: 206, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !603, file: !6, line: 1310, baseType: !936, size: 64, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !495, !13}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !603, file: !6, line: 1313, baseType: !940, size: 64, offset: 1024)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !495, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !945, line: 214, size: 1536, elements: !946)
!945 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !944, file: !945, line: 215, baseType: !538, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !944, file: !945, line: 216, baseType: !538, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !944, file: !945, line: 217, baseType: !538, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !944, file: !945, line: 218, baseType: !538, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !944, file: !945, line: 219, baseType: !538, size: 64, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !944, file: !945, line: 220, baseType: !538, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !944, file: !945, line: 221, baseType: !538, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !944, file: !945, line: 222, baseType: !538, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !944, file: !945, line: 223, baseType: !538, size: 64, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !944, file: !945, line: 224, baseType: !538, size: 64, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !944, file: !945, line: 227, baseType: !538, size: 64, offset: 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !944, file: !945, line: 228, baseType: !538, size: 64, offset: 704)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !944, file: !945, line: 229, baseType: !538, size: 64, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !944, file: !945, line: 230, baseType: !538, size: 64, offset: 832)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !944, file: !945, line: 231, baseType: !538, size: 64, offset: 896)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !944, file: !945, line: 232, baseType: !538, size: 64, offset: 960)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !944, file: !945, line: 235, baseType: !538, size: 64, offset: 1024)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !944, file: !945, line: 236, baseType: !538, size: 64, offset: 1088)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !944, file: !945, line: 237, baseType: !538, size: 64, offset: 1152)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !944, file: !945, line: 238, baseType: !538, size: 64, offset: 1216)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !944, file: !945, line: 239, baseType: !538, size: 64, offset: 1280)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !944, file: !945, line: 242, baseType: !538, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !944, file: !945, line: 243, baseType: !538, size: 64, offset: 1408)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !944, file: !945, line: 244, baseType: !538, size: 64, offset: 1472)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !603, file: !6, line: 1315, baseType: !972, size: 64, offset: 1088)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!975, !977, !7}
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !482, line: 30, baseType: !976)
!976 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !603, file: !6, line: 1316, baseType: !980, size: 64, offset: 1152)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!7, !7, !977, !795}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !603, file: !6, line: 1319, baseType: !984, size: 64, offset: 1216)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!987, !495}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !603, file: !6, line: 1321, baseType: !989, size: 64, offset: 1280)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!7, !495, !739, !785}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !603, file: !6, line: 1323, baseType: !989, size: 64, offset: 1344)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !603, file: !6, line: 1331, baseType: !994, size: 64, offset: 1408)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!7, !495, !7, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !537, line: 17, baseType: !685)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !603, file: !6, line: 1333, baseType: !1000, size: 64, offset: 1472)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!7, !495, !7, !785, !998, !739}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !603, file: !6, line: 1336, baseType: !1004, size: 64, offset: 1536)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!7, !495, !7, !7, !7}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !603, file: !6, line: 1339, baseType: !1008, size: 64, offset: 1600)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!7, !495, !7, !975}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !603, file: !6, line: 1341, baseType: !1008, size: 64, offset: 1664)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !603, file: !6, line: 1343, baseType: !1013, size: 64, offset: 1728)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!7, !495, !7, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !1018, line: 20, size: 576, elements: !1019)
!1018 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!1019 = !{!1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1017, file: !1018, line: 21, baseType: !697, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !1017, file: !1018, line: 22, baseType: !1022, size: 256, offset: 32)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 256, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !1017, file: !1018, line: 23, baseType: !697, size: 32, offset: 288)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !1017, file: !1018, line: 24, baseType: !697, size: 32, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !1017, file: !1018, line: 25, baseType: !697, size: 32, offset: 352)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !1017, file: !1018, line: 26, baseType: !697, size: 32, offset: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !1017, file: !1018, line: 27, baseType: !697, size: 32, offset: 416)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !1017, file: !1018, line: 28, baseType: !697, size: 32, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !1017, file: !1018, line: 29, baseType: !697, size: 32, offset: 480)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !1017, file: !1018, line: 30, baseType: !697, size: 32, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !1017, file: !1018, line: 31, baseType: !739, size: 16, offset: 544)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !603, file: !6, line: 1346, baseType: !1035, size: 64, offset: 1792)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!7, !495, !7, !7}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !603, file: !6, line: 1348, baseType: !1039, size: 64, offset: 1856)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!7, !495, !7, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !1018, line: 9, size: 512, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !1043, file: !1018, line: 10, baseType: !538, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !1043, file: !1018, line: 11, baseType: !538, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !1043, file: !1018, line: 12, baseType: !538, size: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !1043, file: !1018, line: 13, baseType: !538, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !1043, file: !1018, line: 14, baseType: !538, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !1043, file: !1018, line: 15, baseType: !538, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !1043, file: !1018, line: 16, baseType: !538, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !1043, file: !1018, line: 17, baseType: !538, size: 64, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !603, file: !6, line: 1352, baseType: !1054, size: 64, offset: 1920)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!7, !495, !7, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !1060, line: 213, size: 32, elements: !1061)
!1060 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !1059, file: !1060, line: 214, baseType: !679, size: 16)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !1059, file: !1060, line: 215, baseType: !679, size: 16, offset: 16)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !603, file: !6, line: 1355, baseType: !1065, size: 64, offset: 1984)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!7, !495, !7, !620}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !603, file: !6, line: 1357, baseType: !1069, size: 64, offset: 2048)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!7, !495, !7, !1072, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !945, line: 956, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1073, file: !945, line: 957, baseType: !697, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1073, file: !945, line: 958, baseType: !538, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !603, file: !6, line: 1361, baseType: !1078, size: 64, offset: 2112)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!7, !495, !7, !536, !7}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !603, file: !6, line: 1364, baseType: !1008, size: 64, offset: 2176)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !603, file: !6, line: 1367, baseType: !1083, size: 64, offset: 2240)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!7, !495, !12, !795}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !603, file: !6, line: 1400, baseType: !1087, size: 64, offset: 2304)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!7, !495, !495, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1092, line: 75, size: 384, elements: !1093)
!1092 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1093 = !{!1094, !1095, !1098, !1102, !1106}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1091, file: !1092, line: 76, baseType: !497, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1091, file: !1092, line: 77, baseType: !1096, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1091, file: !1092, line: 78, baseType: !1099, size: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1092, line: 78, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1091, file: !1092, line: 79, baseType: !1103, size: 160, offset: 192)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 160, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 20)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1091, file: !1092, line: 80, baseType: !998, size: 8, offset: 352)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !603, file: !6, line: 1403, baseType: !1108, size: 64, offset: 2368)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!7, !495, !495}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !603, file: !6, line: 1405, baseType: !1112, size: 64, offset: 2432)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!495, !495, !620, !975}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !603, file: !6, line: 1408, baseType: !1116, size: 64, offset: 2496)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{!534, !495, !534}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !603, file: !6, line: 1410, baseType: !1120, size: 64, offset: 2560)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!7, !495, !534}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !603, file: !6, line: 1412, baseType: !1124, size: 64, offset: 2624)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!7, !495, !1127}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1129, line: 35, flags: DIFlagFwdDecl)
!1129 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !603, file: !6, line: 1414, baseType: !1131, size: 64, offset: 2688)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !495, !1127}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !603, file: !6, line: 1417, baseType: !1135, size: 64, offset: 2752)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!7, !1138, !1057, !495, !1150, !785, !785, !1090}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1140, line: 8, size: 96, elements: !1141)
!1140 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1141 = !{!1142, !1143, !1144, !1145, !1147, !1148, !1149}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1139, file: !1140, line: 9, baseType: !685, size: 8)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1139, file: !1140, line: 10, baseType: !685, size: 8, offset: 8)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1139, file: !1140, line: 11, baseType: !679, size: 16, offset: 16)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1139, file: !1140, line: 12, baseType: !1146, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !539, line: 26, baseType: !7)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1139, file: !1140, line: 13, baseType: !679, size: 16, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1139, file: !1140, line: 14, baseType: !685, size: 8, offset: 80)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1139, file: !1140, line: 15, baseType: !685, size: 8, offset: 88)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !603, file: !6, line: 1424, baseType: !1153, size: 64, offset: 2816)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!7, !1138, !1057, !495, !1150, !785}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !603, file: !6, line: 1429, baseType: !1157, size: 64, offset: 2880)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!7, !620, !1160, !495, !495, !1205}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1092, line: 203, size: 1024, elements: !1162)
!1162 = !{!1163, !1164, !1174, !1178, !1182, !1183, !1187, !1188, !1189, !1190, !1192, !1193, !1194, !1195}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1161, file: !1092, line: 204, baseType: !620, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1161, file: !1092, line: 205, baseType: !1165, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !1060, line: 44, size: 128, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1167, file: !1060, line: 45, baseType: !697, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1167, file: !1060, line: 46, baseType: !679, size: 16, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1167, file: !1060, line: 47, baseType: !679, size: 16, offset: 48)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1167, file: !1060, line: 48, baseType: !697, size: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1167, file: !1060, line: 49, baseType: !697, size: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1161, file: !1092, line: 206, baseType: !1175, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!7, !620, !1160}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1161, file: !1092, line: 208, baseType: !1179, size: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DISubroutineType(types: !1181)
!1181 = !{!7, !1160}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !1092, line: 209, baseType: !795, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1161, file: !1092, line: 211, baseType: !1184, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1186, line: 76, flags: DIFlagFwdDecl)
!1186 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1161, file: !1092, line: 212, baseType: !1090, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1161, file: !1092, line: 213, baseType: !785, size: 16, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1161, file: !1092, line: 214, baseType: !785, size: 16, offset: 464)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1161, file: !1092, line: 215, baseType: !1191, size: 32, offset: 480)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !537, line: 21, baseType: !697)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1161, file: !1092, line: 216, baseType: !13, size: 32, offset: 512)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1161, file: !1092, line: 216, baseType: !13, size: 32, offset: 544)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1161, file: !1092, line: 217, baseType: !975, size: 8, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, scope: !1161, file: !1092, line: 218, baseType: !1196, size: 384, offset: 640)
!1196 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1161, file: !1092, line: 218, size: 384, elements: !1197)
!1197 = !{!1198, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1196, file: !1092, line: 219, baseType: !1199, size: 384)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !998, size: 384, elements: !662)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1196, file: !1092, line: 224, baseType: !1201, size: 384)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 384, elements: !1203)
!1202 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1203 = !{!1204}
!1204 = !DISubrange(count: 6)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !603, file: !6, line: 1434, baseType: !1207, size: 64, offset: 2944)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!7, !620, !1057, !495, !1150, !785, !1191, !1191, !1090}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !603, file: !6, line: 1440, baseType: !1211, size: 64, offset: 3008)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!7, !495, !1214, !785, !1090}
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !603, file: !6, line: 1444, baseType: !1216, size: 64, offset: 3072)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!7, !620, !1191, !1191, !495, !1191, !7}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !603, file: !6, line: 1449, baseType: !1220, size: 64, offset: 3136)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!7, !495, !1214, !785}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !603, file: !6, line: 1452, baseType: !1224, size: 64, offset: 3200)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!7, !495, !975}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !603, file: !6, line: 1454, baseType: !1228, size: 64, offset: 3264)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!7, !495, !1231}
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !6, line: 820, size: 264, elements: !1233)
!1233 = !{!1234, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1232, file: !6, line: 821, baseType: !1235, size: 256)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 256, elements: !1023)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1232, file: !6, line: 822, baseType: !686, size: 8, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !603, file: !6, line: 1456, baseType: !1228, size: 64, offset: 3328)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !603, file: !6, line: 1458, baseType: !1239, size: 64, offset: 3392)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!7, !495, !1242, !1243}
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !482, line: 55, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1245, line: 72, baseType: !1246)
!1245 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1245, line: 16, baseType: !517)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !603, file: !6, line: 1460, baseType: !1248, size: 64, offset: 3456)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{null, !495, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !6, line: 67, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !603, file: !6, line: 1462, baseType: !1248, size: 64, offset: 3520)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !603, file: !6, line: 1464, baseType: !1255, size: 64, offset: 3584)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!795, !495, !495}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !603, file: !6, line: 1466, baseType: !1259, size: 64, offset: 3648)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !495, !795}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !603, file: !6, line: 1469, baseType: !1263, size: 64, offset: 3712)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!7, !495, !7, !1191}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !603, file: !6, line: 1472, baseType: !1267, size: 64, offset: 3776)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!7, !977}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !603, file: !6, line: 1473, baseType: !1224, size: 64, offset: 3840)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !603, file: !6, line: 1475, baseType: !1272, size: 64, offset: 3904)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!7, !495, !620}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !603, file: !6, line: 1477, baseType: !787, size: 64, offset: 3968)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !603, file: !6, line: 1479, baseType: !1277, size: 64, offset: 4032)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!7, !495, !1280}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !6, line: 894, size: 256, elements: !1282)
!1282 = !{!1283, !1284}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1281, file: !6, line: 895, baseType: !33, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, scope: !1281, file: !6, line: 896, baseType: !1285, size: 192, offset: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1281, file: !6, line: 896, size: 192, elements: !1286)
!1286 = !{!1287, !1296, !5645}
!1287 = !DIDerivedType(tag: DW_TAG_member, scope: !1285, file: !6, line: 898, baseType: !1288, size: 192)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1285, file: !6, line: 898, size: 192, elements: !1289)
!1289 = !{!1290, !1291, !1295}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1288, file: !6, line: 899, baseType: !1191, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1288, file: !6, line: 900, baseType: !1292, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1294, line: 11, flags: DIFlagFwdDecl)
!1294 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1288, file: !6, line: 901, baseType: !1090, size: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_member, scope: !1285, file: !6, line: 904, baseType: !1297, size: 64)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1285, file: !6, line: 904, size: 64, elements: !1298)
!1298 = !{!1299}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1297, file: !6, line: 905, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !95, line: 222, size: 2560, elements: !1302)
!1302 = !{!1303, !5624, !5625, !5643, !5644}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1301, file: !95, line: 223, baseType: !1304, size: 2048)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !95, line: 141, size: 2048, elements: !1305)
!1305 = !{!1306, !5598, !5599, !5600, !5601, !5602, !5603, !5604, !5605, !5606, !5607, !5608, !5609, !5610, !5615, !5616, !5617, !5618, !5619, !5620, !5621, !5622, !5623}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1304, file: !95, line: 145, baseType: !1307, size: 64, align: 512)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !95, line: 54, size: 2368, elements: !1310)
!1310 = !{!1311, !1510, !1515, !5270, !5274, !5278, !5279, !5283, !5289, !5290, !5291, !5292, !5293, !5297, !5301, !5305, !5306, !5307, !5311, !5312, !5324, !5328, !5332, !5344, !5533, !5537, !5541, !5546, !5550, !5554, !5558, !5564, !5568, !5575, !5579, !5581, !5582}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1309, file: !95, line: 56, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!7, !1315}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !126, line: 483, size: 960, align: 64, elements: !1317)
!1317 = !{!1318, !1334, !1345, !1356, !1380, !1386, !1394, !1411, !1424, !1430, !1439, !1444, !1452, !1464, !1484, !1491, !1495, !1499, !1504}
!1318 = !DIDerivedType(tag: DW_TAG_member, scope: !1316, file: !126, line: 484, baseType: !1319, size: 512)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1316, file: !126, line: 484, size: 512, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1319, file: !126, line: 485, baseType: !697, size: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1319, file: !126, line: 486, baseType: !697, size: 32, offset: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1319, file: !126, line: 487, baseType: !697, size: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1319, file: !126, line: 488, baseType: !697, size: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1319, file: !126, line: 489, baseType: !697, size: 32, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1319, file: !126, line: 492, baseType: !697, size: 32, offset: 160)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1319, file: !126, line: 493, baseType: !697, size: 32, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1319, file: !126, line: 496, baseType: !472, size: 128, offset: 224)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1319, file: !126, line: 497, baseType: !697, size: 32, offset: 352)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1319, file: !126, line: 498, baseType: !697, size: 32, offset: 384)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1319, file: !126, line: 499, baseType: !697, size: 32, offset: 416)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1319, file: !126, line: 500, baseType: !697, size: 32, offset: 448)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1319, file: !126, line: 501, baseType: !697, size: 32, offset: 480)
!1334 = !DIDerivedType(tag: DW_TAG_member, scope: !1316, file: !126, line: 507, baseType: !1335, size: 256)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1316, file: !126, line: 507, size: 256, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1344}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1335, file: !126, line: 508, baseType: !697, size: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1335, file: !126, line: 509, baseType: !538, size: 64, align: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, scope: !1335, file: !126, line: 510, baseType: !1340, size: 64, offset: 128)
!1340 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1335, file: !126, line: 510, size: 64, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1340, file: !126, line: 511, baseType: !538, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1340, file: !126, line: 512, baseType: !538, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1335, file: !126, line: 514, baseType: !538, size: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1316, file: !126, line: 532, baseType: !1346, size: 448)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1316, file: !126, line: 517, size: 448, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1346, file: !126, line: 518, baseType: !538, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1346, file: !126, line: 521, baseType: !538, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1346, file: !126, line: 522, baseType: !538, size: 64, align: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1346, file: !126, line: 523, baseType: !538, size: 64, align: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1346, file: !126, line: 524, baseType: !697, size: 32, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1346, file: !126, line: 529, baseType: !697, size: 32, offset: 288)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1346, file: !126, line: 530, baseType: !538, size: 64, offset: 320)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1346, file: !126, line: 531, baseType: !538, size: 64, offset: 384)
!1356 = !DIDerivedType(tag: DW_TAG_member, scope: !1316, file: !126, line: 534, baseType: !1357, size: 960)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1316, file: !126, line: 534, size: 960, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1357, file: !126, line: 535, baseType: !697, size: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1357, file: !126, line: 536, baseType: !697, size: 32, offset: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1357, file: !126, line: 537, baseType: !538, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1357, file: !126, line: 538, baseType: !538, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1357, file: !126, line: 539, baseType: !697, size: 32, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1357, file: !126, line: 540, baseType: !697, size: 32, offset: 224)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1357, file: !126, line: 541, baseType: !538, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1357, file: !126, line: 542, baseType: !697, size: 32, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1357, file: !126, line: 543, baseType: !697, size: 32, offset: 352)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1357, file: !126, line: 544, baseType: !472, size: 128, offset: 384)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1357, file: !126, line: 545, baseType: !697, size: 32, offset: 512)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1357, file: !126, line: 550, baseType: !697, size: 32, offset: 544)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1357, file: !126, line: 551, baseType: !697, size: 32, offset: 576)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1357, file: !126, line: 552, baseType: !697, size: 32, offset: 608)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1357, file: !126, line: 553, baseType: !538, size: 64, align: 64, offset: 640)
