; ModuleID = '../bcout/drivers/net/wireless/ath/ath6kl/main.llvm.bc'
source_filename = "drivers/net/wireless/ath/ath6kl/main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"


!414 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_MBSS", value: 3, isUnsigned: true)
!415 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_ANY", value: 4, isUnsigned: true)
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_chan_width", file: !308, line: 4521, baseType: !13, size: 32, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430}
!418 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20_NOHT", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_40", value: 2, isUnsigned: true)
!421 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80", value: 3, isUnsigned: true)
!422 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80P80", value: 4, isUnsigned: true)
!423 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_160", value: 5, isUnsigned: true)
!424 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_5", value: 6, isUnsigned: true)
!425 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_10", value: 7, isUnsigned: true)
!426 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_1", value: 8, isUnsigned: true)
!427 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_2", value: 9, isUnsigned: true)
!428 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_4", value: 10, isUnsigned: true)
!429 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_8", value: 11, isUnsigned: true)
!430 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_16", value: 12, isUnsigned: true)
!431 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_key_mode", file: !308, line: 4491, baseType: !13, size: 32, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "NL80211_KEY_RX_TX", value: 0, isUnsigned: true)
!434 = !DIEnumerator(name: "NL80211_KEY_NO_TX", value: 1, isUnsigned: true)
!435 = !DIEnumerator(name: "NL80211_KEY_SET_TX", value: 2, isUnsigned: true)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_auth_type", file: !308, line: 4672, baseType: !13, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!438 = !DIEnumerator(name: "NL80211_AUTHTYPE_OPEN_SYSTEM", value: 0, isUnsigned: true)
!439 = !DIEnumerator(name: "NL80211_AUTHTYPE_SHARED_KEY", value: 1, isUnsigned: true)
!440 = !DIEnumerator(name: "NL80211_AUTHTYPE_FT", value: 2, isUnsigned: true)
!441 = !DIEnumerator(name: "NL80211_AUTHTYPE_NETWORK_EAP", value: 3, isUnsigned: true)
!442 = !DIEnumerator(name: "NL80211_AUTHTYPE_SAE", value: 4, isUnsigned: true)
!443 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK", value: 5, isUnsigned: true)
!444 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK_PFS", value: 6, isUnsigned: true)
!445 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_PK", value: 7, isUnsigned: true)
!446 = !DIEnumerator(name: "__NL80211_AUTHTYPE_NUM", value: 8, isUnsigned: true)
!447 = !DIEnumerator(name: "NL80211_AUTHTYPE_MAX", value: 7, isUnsigned: true)
!448 = !DIEnumerator(name: "NL80211_AUTHTYPE_AUTOMATIC", value: 8, isUnsigned: true)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_mfp", file: !308, line: 4709, baseType: !13, size: 32, elements: !450)
!450 = !{!451, !452, !453}
!451 = !DIEnumerator(name: "NL80211_MFP_NO", value: 0, isUnsigned: true)
!452 = !DIEnumerator(name: "NL80211_MFP_REQUIRED", value: 1, isUnsigned: true)
!453 = !DIEnumerator(name: "NL80211_MFP_OPTIONAL", value: 2, isUnsigned: true)
!454 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_bss_select_attr", file: !308, line: 6321, baseType: !13, size: 32, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461}
!456 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_INVALID", value: 0, isUnsigned: true)
!457 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_BAND_PREF", value: 2, isUnsigned: true)
!459 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI_ADJUST", value: 3, isUnsigned: true)
!460 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_AFTER_LAST", value: 4, isUnsigned: true)
!461 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_MAX", value: 3, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !6, line: 423, baseType: !13, size: 32, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!466 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!467 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!468 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !469, file: !6, line: 2085, baseType: !13, size: 32, elements: !8002)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !6, line: 1858, size: 15808, elements: !470)
!470 = !{!471, !476, !499, !516, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !533, !541, !542, !543, !544, !545, !546, !547, !548, !549, !575, !585, !586, !587, !592, !593, !597, !600, !5692, !6208, !6212, !6252, !6253, !6254, !6255, !6256, !6257, !6258, !6259, !6260, !6261, !6262, !6263, !6264, !6265, !6266, !6267, !6268, !6269, !6270, !6271, !6272, !6273, !6274, !6275, !6276, !6277, !6278, !6283, !6284, !6285, !6561, !6562, !6563, !6564, !6567, !6570, !6573, !7828, !7831, !7832, !7845, !7846, !7847, !7848, !7849, !7850, !7857, !7858, !7892, !7893, !7894, !7895, !7896, !7897, !7898, !7899, !7900, !7903, !7904, !7905, !7906, !7907, !7908, !7909, !7910, !7911, !7916, !7917, !7918, !7919, !7956, !7957, !7959, !7960, !7964, !7965, !7966, !7967, !7973, !7975, !7978, !7981, !7983, !7984, !7985, !7986, !7987, !7991, !7994}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !6, line: 1859, baseType: !472, size: 128)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 128, elements: !474)
!473 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!474 = !{!475}
!475 = !DISubrange(count: 16)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !469, file: !6, line: 1860, baseType: !477, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !6, line: 938, size: 384, elements: !479)
!479 = !{!480, !488, !494, !496}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !478, file: !6, line: 939, baseType: !481, size: 128)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !482, line: 186, size: 128, elements: !483)
!482 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!483 = !{!484, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !481, file: !482, line: 187, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !481, file: !482, line: 187, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !478, file: !6, line: 940, baseType: !489, size: 128, offset: 128)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !482, line: 178, size: 128, elements: !490)
!490 = !{!491, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !489, file: !482, line: 179, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !489, file: !482, line: 179, baseType: !492, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !478, file: !6, line: 941, baseType: !495, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !478, file: !6, line: 942, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !469, file: !6, line: 1861, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !6, line: 930, size: 128, elements: !502)
!502 = !{!503, !512}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !501, file: !6, line: 931, baseType: !504, size: 128, align: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !482, line: 216, size: 128, align: 64, elements: !505)
!505 = !{!506, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !482, line: 217, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !504, file: !482, line: 218, baseType: !509, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !507}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !501, file: !6, line: 932, baseType: !513, offset: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: -1)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !469, file: !6, line: 1866, baseType: !517, size: 64, offset: 256)
!517 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !469, file: !6, line: 1867, baseType: !517, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !469, file: !6, line: 1868, baseType: !517, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !469, file: !6, line: 1869, baseType: !7, size: 32, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !6, line: 1877, baseType: !517, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !469, file: !6, line: 1879, baseType: !489, size: 128, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !469, file: !6, line: 1880, baseType: !489, size: 128, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !469, file: !6, line: 1881, baseType: !489, size: 128, offset: 832)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !469, file: !6, line: 1882, baseType: !489, size: 128, offset: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !469, file: !6, line: 1883, baseType: !489, size: 128, offset: 1088)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !469, file: !6, line: 1884, baseType: !489, size: 128, offset: 1216)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !469, file: !6, line: 1889, baseType: !529, size: 256, offset: 1344)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !6, line: 1886, size: 256, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !529, file: !6, line: 1887, baseType: !489, size: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !529, file: !6, line: 1888, baseType: !489, size: 128, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !469, file: !6, line: 1891, baseType: !534, size: 64, offset: 1600)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !535, line: 12, baseType: !536)
!535 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !537, line: 23, baseType: !538)
!537 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !539, line: 31, baseType: !540)
!539 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!540 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !469, file: !6, line: 1892, baseType: !534, size: 64, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !469, file: !6, line: 1893, baseType: !534, size: 64, offset: 1728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !469, file: !6, line: 1894, baseType: !534, size: 64, offset: 1792)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !469, file: !6, line: 1895, baseType: !534, size: 64, offset: 1856)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !469, file: !6, line: 1896, baseType: !534, size: 64, offset: 1920)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !469, file: !6, line: 1897, baseType: !534, size: 64, offset: 1984)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !469, file: !6, line: 1899, baseType: !7, size: 32, offset: 2048)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !469, file: !6, line: 1900, baseType: !7, size: 32, offset: 2080)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !469, file: !6, line: 1902, baseType: !550, size: 1472, offset: 2112)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !6, line: 169, size: 1472, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !550, file: !6, line: 170, baseType: !517, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !550, file: !6, line: 171, baseType: !517, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !550, file: !6, line: 172, baseType: !517, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !550, file: !6, line: 173, baseType: !517, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !550, file: !6, line: 174, baseType: !517, size: 64, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !550, file: !6, line: 175, baseType: !517, size: 64, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !550, file: !6, line: 176, baseType: !517, size: 64, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !550, file: !6, line: 177, baseType: !517, size: 64, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !550, file: !6, line: 178, baseType: !517, size: 64, offset: 512)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !550, file: !6, line: 179, baseType: !517, size: 64, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !550, file: !6, line: 180, baseType: !517, size: 64, offset: 640)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !550, file: !6, line: 181, baseType: !517, size: 64, offset: 704)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !550, file: !6, line: 182, baseType: !517, size: 64, offset: 768)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !550, file: !6, line: 183, baseType: !517, size: 64, offset: 832)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !550, file: !6, line: 184, baseType: !517, size: 64, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !550, file: !6, line: 185, baseType: !517, size: 64, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !550, file: !6, line: 186, baseType: !517, size: 64, offset: 1024)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !550, file: !6, line: 187, baseType: !517, size: 64, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !550, file: !6, line: 188, baseType: !517, size: 64, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !550, file: !6, line: 189, baseType: !517, size: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !550, file: !6, line: 190, baseType: !517, size: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !550, file: !6, line: 191, baseType: !517, size: 64, offset: 1344)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !550, file: !6, line: 192, baseType: !517, size: 64, offset: 1408)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !469, file: !6, line: 1904, baseType: !576, size: 64, offset: 3584)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !577, line: 13, baseType: !578)
!577 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !482, line: 175, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 173, size: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !579, file: !482, line: 174, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !537, line: 22, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !539, line: 30, baseType: !584)
!584 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !469, file: !6, line: 1905, baseType: !576, size: 64, offset: 3648)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !469, file: !6, line: 1906, baseType: !576, size: 64, offset: 3712)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !469, file: !6, line: 1909, baseType: !588, size: 32, offset: 3776)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !482, line: 168, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 166, size: 32, elements: !590)
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !589, file: !482, line: 167, baseType: !7, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !469, file: !6, line: 1910, baseType: !588, size: 32, offset: 3808)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !469, file: !6, line: 1913, baseType: !594, size: 64, offset: 3840)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !6, line: 1913, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !469, file: !6, line: 1914, baseType: !598, size: 64, offset: 3904)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !6, line: 1914, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !469, file: !6, line: 1916, baseType: !601, size: 64, offset: 3968)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !6, line: 1283, size: 4416, elements: !604)
!604 = !{!605, !609, !613, !614, !615, !778, !782, !787, !791, !792, !797, !798, !921, !926, !930, !936, !940, !972, !980, !984, !989, !993, !994, !1000, !1004, !1008, !1012, !1013, !1035, !1039, !1054, !1065, !1069, !1078, !1082, !1083, !1087, !1108, !1112, !1116, !1120, !1124, !1131, !1135, !1153, !1157, !1207, !1211, !1216, !1220, !1224, !1228, !1238, !1239, !1248, !1254, !1255, !1259, !1263, !1267, !1271, !1272, !1276, !1277, !5652, !5672, !5676, !5682, !5688}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !603, file: !6, line: 1284, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!7, !495}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !603, file: !6, line: 1285, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !495}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !603, file: !6, line: 1286, baseType: !606, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !603, file: !6, line: 1287, baseType: !606, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !603, file: !6, line: 1288, baseType: !616, size: 64, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !620, !495}
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !6, line: 120, baseType: !5)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !622, line: 713, size: 1600, elements: !623)
!622 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!623 = !{!624, !646, !654, !661, !665, !677, !678, !679, !682, !683, !684, !690, !691, !692, !693, !694, !695, !696, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !736, !737, !738, !739, !741, !742, !747, !752, !757, !758, !759, !760, !761, !762, !763, !764, !765, !767, !768, !770, !771, !772}
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 714, baseType: !625, size: 192)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 714, size: 192, elements: !626)
!626 = !{!627, !637, !645}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !622, line: 715, baseType: !628, size: 192)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !622, line: 715, size: 192, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !622, line: 717, baseType: !620, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !622, line: 718, baseType: !620, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, scope: !628, file: !622, line: 720, baseType: !633, size: 64, offset: 128)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !622, line: 720, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !633, file: !622, line: 721, baseType: !495, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !633, file: !622, line: 726, baseType: !517, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !625, file: !622, line: 729, baseType: !638, size: 192, align: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !639, line: 24, size: 192, align: 64, elements: !640)
!639 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!640 = !{!641, !642, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !638, file: !639, line: 25, baseType: !517, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !638, file: !639, line: 26, baseType: !643, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !638, file: !639, line: 27, baseType: !643, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !625, file: !622, line: 730, baseType: !489, size: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 733, baseType: !647, size: 64, offset: 192)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 733, size: 64, elements: !648)
!648 = !{!649, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !647, file: !622, line: 734, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !652, line: 124, flags: DIFlagFwdDecl)
!652 = !DIFile(filename: "./include/linux/net.h", directory: "/home/lizy2001/genbc/linux")
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !647, file: !622, line: 735, baseType: !7, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 738, baseType: !655, size: 64, offset: 256)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 738, size: 64, elements: !656)
!656 = !{!657, !660}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !655, file: !622, line: 739, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !659, line: 29, baseType: !582)
!659 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!660 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !655, file: !622, line: 740, baseType: !536, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !621, file: !622, line: 748, baseType: !662, size: 384, align: 64, offset: 320)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 384, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 48)
!665 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 750, baseType: !666, size: 128, offset: 704)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 750, size: 128, elements: !667)
!667 = !{!668, !676}
!668 = !DIDerivedType(tag: DW_TAG_member, scope: !666, file: !622, line: 751, baseType: !669, size: 128)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !666, file: !622, line: 751, size: 128, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !669, file: !622, line: 752, baseType: !517, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !669, file: !622, line: 753, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !620}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !666, file: !622, line: 755, baseType: !489, size: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !621, file: !622, line: 761, baseType: !13, size: 32, offset: 832)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !621, file: !622, line: 762, baseType: !13, size: 32, offset: 864)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !621, file: !622, line: 763, baseType: !680, size: 16, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !539, line: 24, baseType: !681)
!681 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !621, file: !622, line: 764, baseType: !680, size: 16, offset: 912)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !621, file: !622, line: 769, baseType: !680, size: 16, offset: 928)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !621, file: !622, line: 780, baseType: !685, offset: 944)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, elements: !688)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !539, line: 21, baseType: !687)
!687 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!688 = !{!689}
!689 = !DISubrange(count: 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !621, file: !622, line: 782, baseType: !686, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !621, file: !622, line: 783, baseType: !686, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !621, file: !622, line: 784, baseType: !686, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !621, file: !622, line: 785, baseType: !686, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !621, file: !622, line: 786, baseType: !686, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !621, file: !622, line: 787, baseType: !686, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !621, file: !622, line: 795, baseType: !697, offset: 960)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, elements: !688)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !539, line: 27, baseType: !13)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !621, file: !622, line: 807, baseType: !685, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !621, file: !622, line: 809, baseType: !686, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !621, file: !622, line: 810, baseType: !686, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !621, file: !622, line: 811, baseType: !686, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !621, file: !622, line: 812, baseType: !686, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !621, file: !622, line: 813, baseType: !686, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !621, file: !622, line: 815, baseType: !686, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !621, file: !622, line: 816, baseType: !686, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !621, file: !622, line: 817, baseType: !686, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !621, file: !622, line: 818, baseType: !686, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !621, file: !622, line: 819, baseType: !686, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !621, file: !622, line: 821, baseType: !686, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !621, file: !622, line: 822, baseType: !686, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !621, file: !622, line: 823, baseType: !686, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !621, file: !622, line: 832, baseType: !685, offset: 976)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !621, file: !622, line: 834, baseType: !686, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !621, file: !622, line: 835, baseType: !686, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !621, file: !622, line: 836, baseType: !686, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !621, file: !622, line: 837, baseType: !686, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !621, file: !622, line: 838, baseType: !686, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !621, file: !622, line: 840, baseType: !686, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !621, file: !622, line: 843, baseType: !686, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !621, file: !622, line: 844, baseType: !686, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !621, file: !622, line: 845, baseType: !686, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !621, file: !622, line: 847, baseType: !686, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !621, file: !622, line: 848, baseType: !686, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!725 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 866, baseType: !726, size: 32, offset: 992)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 866, size: 32, elements: !727)
!727 = !{!728, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !726, file: !622, line: 867, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !730, line: 37, baseType: !698)
!730 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!731 = !DIDerivedType(tag: DW_TAG_member, scope: !726, file: !622, line: 868, baseType: !732, size: 32)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !622, line: 868, size: 32, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !732, file: !622, line: 869, baseType: !680, size: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !732, file: !622, line: 870, baseType: !680, size: 16, offset: 16)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !621, file: !622, line: 873, baseType: !698, size: 32, offset: 1024)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !621, file: !622, line: 874, baseType: !7, size: 32, offset: 1056)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !621, file: !622, line: 875, baseType: !698, size: 32, offset: 1088)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !621, file: !622, line: 876, baseType: !740, size: 16, offset: 1120)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !730, line: 30, baseType: !680)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !621, file: !622, line: 877, baseType: !680, size: 16, offset: 1136)
!742 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 879, baseType: !743, size: 32, offset: 1152)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 879, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !743, file: !622, line: 880, baseType: !13, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !743, file: !622, line: 881, baseType: !13, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 888, baseType: !748, size: 32, offset: 1184)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 888, size: 32, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !748, file: !622, line: 889, baseType: !698, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !748, file: !622, line: 890, baseType: !698, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, scope: !621, file: !622, line: 893, baseType: !753, size: 16, offset: 1216)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !621, file: !622, line: 893, size: 16, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !753, file: !622, line: 894, baseType: !740, size: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !753, file: !622, line: 895, baseType: !686, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !621, file: !622, line: 898, baseType: !680, size: 16, offset: 1232)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !621, file: !622, line: 899, baseType: !680, size: 16, offset: 1248)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !621, file: !622, line: 900, baseType: !680, size: 16, offset: 1264)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !621, file: !622, line: 902, baseType: !740, size: 16, offset: 1280)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !621, file: !622, line: 903, baseType: !680, size: 16, offset: 1296)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !621, file: !622, line: 904, baseType: !680, size: 16, offset: 1312)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !621, file: !622, line: 905, baseType: !680, size: 16, offset: 1328)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !621, file: !622, line: 908, baseType: !697, offset: 1344)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !621, file: !622, line: 912, baseType: !766, size: 32, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !622, line: 606, baseType: !13)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !621, file: !622, line: 913, baseType: !766, size: 32, offset: 1376)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !621, file: !622, line: 914, baseType: !769, size: 64, offset: 1408)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !621, file: !622, line: 915, baseType: !769, size: 64, offset: 1472)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !621, file: !622, line: 916, baseType: !13, size: 32, offset: 1536)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !621, file: !622, line: 917, baseType: !773, size: 32, offset: 1568)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !774, line: 113, baseType: !775)
!774 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !774, line: 111, size: 32, elements: !776)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !775, file: !774, line: 112, baseType: !588, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !603, file: !6, line: 1290, baseType: !779, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{!534, !620, !495, !534}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !603, file: !6, line: 1293, baseType: !783, size: 64, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!786, !495, !620, !495}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !537, line: 19, baseType: !680)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !603, file: !6, line: 1296, baseType: !788, size: 64, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !495, !7}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !603, file: !6, line: 1298, baseType: !610, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !603, file: !6, line: 1299, baseType: !793, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!7, !495, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !603, file: !6, line: 1301, baseType: !606, size: 64, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !603, file: !6, line: 1302, baseType: !799, size: 64, offset: 704)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!7, !495, !802, !7}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !804, line: 234, size: 320, elements: !805)
!804 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!805 = !{!806, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !803, file: !804, line: 239, baseType: !807, size: 128)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !804, line: 236, size: 128, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !807, file: !804, line: 238, baseType: !472, size: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !803, file: !804, line: 255, baseType: !811, size: 192, offset: 128)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !803, file: !804, line: 241, size: 192, elements: !812)
!812 = !{!813, !825, !826, !827, !828, !829, !831, !832, !833, !842, !843, !844, !845}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !811, file: !804, line: 242, baseType: !814, size: 128)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !815, line: 32, size: 128, elements: !816)
!815 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!816 = !{!817, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !814, file: !815, line: 33, baseType: !818, size: 16)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !815, line: 26, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !820, line: 10, baseType: !681)
!820 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !814, file: !815, line: 34, baseType: !822, size: 112, offset: 16)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 112, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 14)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !811, file: !804, line: 243, baseType: !814, size: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !811, file: !804, line: 244, baseType: !814, size: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !811, file: !804, line: 245, baseType: !814, size: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !811, file: !804, line: 246, baseType: !814, size: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !811, file: !804, line: 247, baseType: !830, size: 16)
!830 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !811, file: !804, line: 248, baseType: !7, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !811, file: !804, line: 249, baseType: !7, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !811, file: !804, line: 250, baseType: !834, size: 192)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !804, line: 196, size: 192, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !834, file: !804, line: 197, baseType: !517, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !834, file: !804, line: 198, baseType: !517, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !834, file: !804, line: 199, baseType: !681, size: 16, offset: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !834, file: !804, line: 200, baseType: !687, size: 8, offset: 144)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !834, file: !804, line: 201, baseType: !687, size: 8, offset: 152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !834, file: !804, line: 202, baseType: !687, size: 8, offset: 160)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !811, file: !804, line: 251, baseType: !472, size: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !811, file: !804, line: 252, baseType: !472, size: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !811, file: !804, line: 253, baseType: !796, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !811, file: !804, line: 254, baseType: !846, size: 128)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !804, line: 207, size: 128, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !846, file: !804, line: 208, baseType: !13, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !846, file: !804, line: 209, baseType: !13, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !846, file: !804, line: 222, baseType: !851, size: 64, offset: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !846, file: !804, line: 210, size: 64, elements: !852)
!852 = !{!853, !861, !868, !880, !886, !893, !904, !912}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !851, file: !804, line: 212, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !856, line: 56, baseType: !857)
!856 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 53, size: 32, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !857, file: !856, line: 54, baseType: !681, size: 16)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !857, file: !856, line: 55, baseType: !681, size: 16, offset: 16)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !851, file: !804, line: 213, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !856, line: 80, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 77, size: 64, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !864, file: !856, line: 78, baseType: !13, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !864, file: !856, line: 79, baseType: !13, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !851, file: !804, line: 214, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !856, line: 66, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 58, size: 192, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !871, file: !856, line: 59, baseType: !13, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !871, file: !856, line: 60, baseType: !13, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !871, file: !856, line: 61, baseType: !13, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !871, file: !856, line: 62, baseType: !13, size: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !871, file: !856, line: 63, baseType: !13, size: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !871, file: !856, line: 64, baseType: !681, size: 16, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !871, file: !856, line: 65, baseType: !681, size: 16, offset: 176)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !851, file: !804, line: 215, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !856, line: 70, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 68, size: 32, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !883, file: !856, line: 69, baseType: !13, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !851, file: !804, line: 216, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !856, line: 75, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 72, size: 160, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !889, file: !856, line: 73, baseType: !13, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !889, file: !856, line: 74, baseType: !472, size: 128, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !851, file: !804, line: 217, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !856, line: 89, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 82, size: 192, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !896, file: !856, line: 83, baseType: !681, size: 16)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !896, file: !856, line: 84, baseType: !13, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !896, file: !856, line: 85, baseType: !13, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !896, file: !856, line: 86, baseType: !13, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !896, file: !856, line: 87, baseType: !13, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !896, file: !856, line: 88, baseType: !13, size: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !851, file: !804, line: 220, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !856, line: 44, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 40, size: 96, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !907, file: !856, line: 41, baseType: !13, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !907, file: !856, line: 42, baseType: !13, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !907, file: !856, line: 43, baseType: !681, size: 16, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !851, file: !804, line: 221, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !856, line: 51, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !856, line: 46, size: 128, elements: !916)
!916 = !{!917, !918, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !915, file: !856, line: 47, baseType: !13, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !915, file: !856, line: 48, baseType: !13, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !915, file: !856, line: 49, baseType: !681, size: 16, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !915, file: !856, line: 50, baseType: !13, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !603, file: !6, line: 1304, baseType: !922, size: 64, offset: 768)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{!7, !495, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !603, file: !6, line: 1306, baseType: !927, size: 64, offset: 832)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!7, !495, !7}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !603, file: !6, line: 1308, baseType: !931, size: 64, offset: 896)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!7, !495, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !6, line: 206, flags: DIFlagFwdDecl)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !603, file: !6, line: 1310, baseType: !937, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{null, !495, !13}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !603, file: !6, line: 1313, baseType: !941, size: 64, offset: 1024)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !495, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !946, line: 214, size: 1536, elements: !947)
!946 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!947 = !{!948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !945, file: !946, line: 215, baseType: !538, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !945, file: !946, line: 216, baseType: !538, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !945, file: !946, line: 217, baseType: !538, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !945, file: !946, line: 218, baseType: !538, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !945, file: !946, line: 219, baseType: !538, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !945, file: !946, line: 220, baseType: !538, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !945, file: !946, line: 221, baseType: !538, size: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !945, file: !946, line: 222, baseType: !538, size: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !945, file: !946, line: 223, baseType: !538, size: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !945, file: !946, line: 224, baseType: !538, size: 64, offset: 576)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !945, file: !946, line: 227, baseType: !538, size: 64, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !945, file: !946, line: 228, baseType: !538, size: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !945, file: !946, line: 229, baseType: !538, size: 64, offset: 768)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !945, file: !946, line: 230, baseType: !538, size: 64, offset: 832)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !945, file: !946, line: 231, baseType: !538, size: 64, offset: 896)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !945, file: !946, line: 232, baseType: !538, size: 64, offset: 960)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !945, file: !946, line: 235, baseType: !538, size: 64, offset: 1024)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !945, file: !946, line: 236, baseType: !538, size: 64, offset: 1088)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !945, file: !946, line: 237, baseType: !538, size: 64, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !945, file: !946, line: 238, baseType: !538, size: 64, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !945, file: !946, line: 239, baseType: !538, size: 64, offset: 1280)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !945, file: !946, line: 242, baseType: !538, size: 64, offset: 1344)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !945, file: !946, line: 243, baseType: !538, size: 64, offset: 1408)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !945, file: !946, line: 244, baseType: !538, size: 64, offset: 1472)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !603, file: !6, line: 1315, baseType: !973, size: 64, offset: 1088)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !978, !7}
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !482, line: 30, baseType: !977)
!977 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !603, file: !6, line: 1316, baseType: !981, size: 64, offset: 1152)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!7, !7, !978, !796}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !603, file: !6, line: 1319, baseType: !985, size: 64, offset: 1216)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!988, !495}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !603, file: !6, line: 1321, baseType: !990, size: 64, offset: 1280)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!7, !495, !740, !786}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !603, file: !6, line: 1323, baseType: !990, size: 64, offset: 1344)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !603, file: !6, line: 1331, baseType: !995, size: 64, offset: 1408)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!7, !495, !7, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !537, line: 17, baseType: !686)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !603, file: !6, line: 1333, baseType: !1001, size: 64, offset: 1472)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!7, !495, !7, !786, !999, !740}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !603, file: !6, line: 1336, baseType: !1005, size: 64, offset: 1536)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!7, !495, !7, !7, !7}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !603, file: !6, line: 1339, baseType: !1009, size: 64, offset: 1600)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!7, !495, !7, !976}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !603, file: !6, line: 1341, baseType: !1009, size: 64, offset: 1664)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !603, file: !6, line: 1343, baseType: !1014, size: 64, offset: 1728)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!7, !495, !7, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !1019, line: 20, size: 576, elements: !1020)
!1019 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!1020 = !{!1021, !1022, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1018, file: !1019, line: 21, baseType: !698, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !1018, file: !1019, line: 22, baseType: !1023, size: 256, offset: 32)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 256, elements: !1024)
!1024 = !{!1025}
!1025 = !DISubrange(count: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !1018, file: !1019, line: 23, baseType: !698, size: 32, offset: 288)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !1018, file: !1019, line: 24, baseType: !698, size: 32, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !1018, file: !1019, line: 25, baseType: !698, size: 32, offset: 352)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !1018, file: !1019, line: 26, baseType: !698, size: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !1018, file: !1019, line: 27, baseType: !698, size: 32, offset: 416)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !1018, file: !1019, line: 28, baseType: !698, size: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !1018, file: !1019, line: 29, baseType: !698, size: 32, offset: 480)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !1018, file: !1019, line: 30, baseType: !698, size: 32, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !1018, file: !1019, line: 31, baseType: !740, size: 16, offset: 544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !603, file: !6, line: 1346, baseType: !1036, size: 64, offset: 1792)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!7, !495, !7, !7}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !603, file: !6, line: 1348, baseType: !1040, size: 64, offset: 1856)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!7, !495, !7, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !1019, line: 9, size: 512, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !1044, file: !1019, line: 10, baseType: !538, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !1044, file: !1019, line: 11, baseType: !538, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !1044, file: !1019, line: 12, baseType: !538, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !1044, file: !1019, line: 13, baseType: !538, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !1044, file: !1019, line: 14, baseType: !538, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !1044, file: !1019, line: 15, baseType: !538, size: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !1044, file: !1019, line: 16, baseType: !538, size: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !1044, file: !1019, line: 17, baseType: !538, size: 64, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !603, file: !6, line: 1352, baseType: !1055, size: 64, offset: 1920)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!7, !495, !7, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !1061, line: 213, size: 32, elements: !1062)
!1061 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !1060, file: !1061, line: 214, baseType: !680, size: 16)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !1060, file: !1061, line: 215, baseType: !680, size: 16, offset: 16)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !603, file: !6, line: 1355, baseType: !1066, size: 64, offset: 1984)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!7, !495, !7, !620}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !603, file: !6, line: 1357, baseType: !1070, size: 64, offset: 2048)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!7, !495, !7, !1073, !1073}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !946, line: 956, size: 128, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1074, file: !946, line: 957, baseType: !698, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1074, file: !946, line: 958, baseType: !538, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !603, file: !6, line: 1361, baseType: !1079, size: 64, offset: 2112)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!7, !495, !7, !536, !7}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !603, file: !6, line: 1364, baseType: !1009, size: 64, offset: 2176)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !603, file: !6, line: 1367, baseType: !1084, size: 64, offset: 2240)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!7, !495, !12, !796}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !603, file: !6, line: 1400, baseType: !1088, size: 64, offset: 2304)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!7, !495, !495, !1091}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1093, line: 75, size: 384, elements: !1094)
!1093 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1094 = !{!1095, !1096, !1099, !1103, !1107}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1092, file: !1093, line: 76, baseType: !497, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1092, file: !1093, line: 77, baseType: !1097, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1092, file: !1093, line: 78, baseType: !1100, size: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1102)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1093, line: 78, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1092, file: !1093, line: 79, baseType: !1104, size: 160, offset: 192)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 160, elements: !1105)
!1105 = !{!1106}
!1106 = !DISubrange(count: 20)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1092, file: !1093, line: 80, baseType: !999, size: 8, offset: 352)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !603, file: !6, line: 1403, baseType: !1109, size: 64, offset: 2368)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!7, !495, !495}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !603, file: !6, line: 1405, baseType: !1113, size: 64, offset: 2432)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!495, !495, !620, !976}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !603, file: !6, line: 1408, baseType: !1117, size: 64, offset: 2496)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!534, !495, !534}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !603, file: !6, line: 1410, baseType: !1121, size: 64, offset: 2560)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!7, !495, !534}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !603, file: !6, line: 1412, baseType: !1125, size: 64, offset: 2624)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!7, !495, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1130, line: 35, flags: DIFlagFwdDecl)
!1130 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !603, file: !6, line: 1414, baseType: !1132, size: 64, offset: 2688)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{null, !495, !1128}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !603, file: !6, line: 1417, baseType: !1136, size: 64, offset: 2752)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!7, !1139, !1058, !495, !1151, !786, !786, !1091}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1141, line: 8, size: 96, elements: !1142)
!1141 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1142 = !{!1143, !1144, !1145, !1146, !1148, !1149, !1150}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1140, file: !1141, line: 9, baseType: !686, size: 8)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1140, file: !1141, line: 10, baseType: !686, size: 8, offset: 8)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1140, file: !1141, line: 11, baseType: !680, size: 16, offset: 16)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1140, file: !1141, line: 12, baseType: !1147, size: 32, offset: 32)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !539, line: 26, baseType: !7)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1140, file: !1141, line: 13, baseType: !680, size: 16, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1140, file: !1141, line: 14, baseType: !686, size: 8, offset: 80)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1140, file: !1141, line: 15, baseType: !686, size: 8, offset: 88)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !603, file: !6, line: 1424, baseType: !1154, size: 64, offset: 2816)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!7, !1139, !1058, !495, !1151, !786}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !603, file: !6, line: 1429, baseType: !1158, size: 64, offset: 2880)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!7, !620, !1161, !495, !495, !1206}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1093, line: 203, size: 1024, elements: !1163)
!1163 = !{!1164, !1165, !1175, !1179, !1183, !1184, !1188, !1189, !1190, !1191, !1193, !1194, !1195, !1196}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1162, file: !1093, line: 204, baseType: !620, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1162, file: !1093, line: 205, baseType: !1166, size: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !1061, line: 44, size: 128, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1168, file: !1061, line: 45, baseType: !698, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1168, file: !1061, line: 46, baseType: !680, size: 16, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1168, file: !1061, line: 47, baseType: !680, size: 16, offset: 48)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1168, file: !1061, line: 48, baseType: !698, size: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1168, file: !1061, line: 49, baseType: !698, size: 32, offset: 96)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1162, file: !1093, line: 206, baseType: !1176, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!7, !620, !1161}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1162, file: !1093, line: 208, baseType: !1180, size: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!7, !1161}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !1093, line: 209, baseType: !796, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1162, file: !1093, line: 211, baseType: !1185, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1187, line: 76, flags: DIFlagFwdDecl)
!1187 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1162, file: !1093, line: 212, baseType: !1091, size: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1162, file: !1093, line: 213, baseType: !786, size: 16, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1162, file: !1093, line: 214, baseType: !786, size: 16, offset: 464)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1162, file: !1093, line: 215, baseType: !1192, size: 32, offset: 480)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !537, line: 21, baseType: !698)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1162, file: !1093, line: 216, baseType: !13, size: 32, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1162, file: !1093, line: 216, baseType: !13, size: 32, offset: 544)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1162, file: !1093, line: 217, baseType: !976, size: 8, offset: 576)
!1196 = !DIDerivedType(tag: DW_TAG_member, scope: !1162, file: !1093, line: 218, baseType: !1197, size: 384, offset: 640)
!1197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1162, file: !1093, line: 218, size: 384, elements: !1198)
!1198 = !{!1199, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1197, file: !1093, line: 219, baseType: !1200, size: 384)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 384, elements: !663)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1197, file: !1093, line: 224, baseType: !1202, size: 384)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1203, size: 384, elements: !1204)
!1203 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1204 = !{!1205}
!1205 = !DISubrange(count: 6)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !603, file: !6, line: 1434, baseType: !1208, size: 64, offset: 2944)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!7, !620, !1058, !495, !1151, !786, !1192, !1192, !1091}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !603, file: !6, line: 1440, baseType: !1212, size: 64, offset: 3008)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!7, !495, !1215, !786, !1091}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !603, file: !6, line: 1444, baseType: !1217, size: 64, offset: 3072)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!7, !620, !1192, !1192, !495, !1192, !7}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !603, file: !6, line: 1449, baseType: !1221, size: 64, offset: 3136)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!7, !495, !1215, !786}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !603, file: !6, line: 1452, baseType: !1225, size: 64, offset: 3200)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!7, !495, !976}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !603, file: !6, line: 1454, baseType: !1229, size: 64, offset: 3264)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!7, !495, !1232}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !6, line: 820, size: 264, elements: !1234)
!1234 = !{!1235, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1233, file: !6, line: 821, baseType: !1236, size: 256)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 256, elements: !1024)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1233, file: !6, line: 822, baseType: !687, size: 8, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !603, file: !6, line: 1456, baseType: !1229, size: 64, offset: 3328)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !603, file: !6, line: 1458, baseType: !1240, size: 64, offset: 3392)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!7, !495, !1243, !1244}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !482, line: 55, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1246, line: 72, baseType: !1247)
!1246 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1246, line: 16, baseType: !517)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !603, file: !6, line: 1460, baseType: !1249, size: 64, offset: 3456)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{null, !495, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !6, line: 67, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !603, file: !6, line: 1462, baseType: !1249, size: 64, offset: 3520)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !603, file: !6, line: 1464, baseType: !1256, size: 64, offset: 3584)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!796, !495, !495}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !603, file: !6, line: 1466, baseType: !1260, size: 64, offset: 3648)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !495, !796}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !603, file: !6, line: 1469, baseType: !1264, size: 64, offset: 3712)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!7, !495, !7, !1192}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !603, file: !6, line: 1472, baseType: !1268, size: 64, offset: 3776)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!7, !978}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !603, file: !6, line: 1473, baseType: !1225, size: 64, offset: 3840)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !603, file: !6, line: 1475, baseType: !1273, size: 64, offset: 3904)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!7, !495, !620}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !603, file: !6, line: 1477, baseType: !788, size: 64, offset: 3968)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !603, file: !6, line: 1479, baseType: !1278, size: 64, offset: 4032)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!7, !495, !1281}
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !6, line: 894, size: 256, elements: !1283)
!1283 = !{!1284, !1285}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1282, file: !6, line: 895, baseType: !33, size: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, scope: !1282, file: !6, line: 896, baseType: !1286, size: 192, offset: 64)
!1286 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1282, file: !6, line: 896, size: 192, elements: !1287)
!1287 = !{!1288, !1297, !5645}
!1288 = !DIDerivedType(tag: DW_TAG_member, scope: !1286, file: !6, line: 898, baseType: !1289, size: 192)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1286, file: !6, line: 898, size: 192, elements: !1290)
!1290 = !{!1291, !1292, !1296}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1289, file: !6, line: 899, baseType: !1192, size: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1289, file: !6, line: 900, baseType: !1293, size: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1295, line: 11, flags: DIFlagFwdDecl)
!1295 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1289, file: !6, line: 901, baseType: !1091, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, scope: !1286, file: !6, line: 904, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1286, file: !6, line: 904, size: 64, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1298, file: !6, line: 905, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !95, line: 222, size: 2560, elements: !1303)
!1303 = !{!1304, !5624, !5625, !5643, !5644}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1302, file: !95, line: 223, baseType: !1305, size: 2048)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !95, line: 141, size: 2048, elements: !1306)
!1306 = !{!1307, !5598, !5599, !5600, !5601, !5602, !5603, !5604, !5605, !5606, !5607, !5608, !5609, !5610, !5615, !5616, !5617, !5618, !5619, !5620, !5621, !5622, !5623}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1305, file: !95, line: 145, baseType: !1308, size: 64, align: 512)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !95, line: 54, size: 2368, elements: !1311)
!1311 = !{!1312, !1511, !1516, !5270, !5274, !5278, !5279, !5283, !5289, !5290, !5291, !5292, !5293, !5297, !5301, !5305, !5306, !5307, !5311, !5312, !5324, !5328, !5332, !5344, !5533, !5537, !5541, !5546, !5550, !5554, !5558, !5564, !5568, !5575, !5579, !5581, !5582}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1310, file: !95, line: 56, baseType: !1313, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!7, !1316}
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !126, line: 483, size: 960, align: 64, elements: !1318)
!1318 = !{!1319, !1335, !1346, !1357, !1381, !1387, !1395, !1412, !1425, !1431, !1440, !1445, !1453, !1465, !1485, !1492, !1496, !1500, !1505}
!1319 = !DIDerivedType(tag: DW_TAG_member, scope: !1317, file: !126, line: 484, baseType: !1320, size: 512)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1317, file: !126, line: 484, size: 512, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1320, file: !126, line: 485, baseType: !698, size: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1320, file: !126, line: 486, baseType: !698, size: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1320, file: !126, line: 487, baseType: !698, size: 32, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1320, file: !126, line: 488, baseType: !698, size: 32, offset: 96)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1320, file: !126, line: 489, baseType: !698, size: 32, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1320, file: !126, line: 492, baseType: !698, size: 32, offset: 160)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1320, file: !126, line: 493, baseType: !698, size: 32, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1320, file: !126, line: 496, baseType: !472, size: 128, offset: 224)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1320, file: !126, line: 497, baseType: !698, size: 32, offset: 352)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1320, file: !126, line: 498, baseType: !698, size: 32, offset: 384)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1320, file: !126, line: 499, baseType: !698, size: 32, offset: 416)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1320, file: !126, line: 500, baseType: !698, size: 32, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1320, file: !126, line: 501, baseType: !698, size: 32, offset: 480)
!1335 = !DIDerivedType(tag: DW_TAG_member, scope: !1317, file: !126, line: 507, baseType: !1336, size: 256)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1317, file: !126, line: 507, size: 256, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1345}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1336, file: !126, line: 508, baseType: !698, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1336, file: !126, line: 509, baseType: !538, size: 64, align: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, scope: !1336, file: !126, line: 510, baseType: !1341, size: 64, offset: 128)
!1341 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1336, file: !126, line: 510, size: 64, elements: !1342)
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1341, file: !126, line: 511, baseType: !538, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1341, file: !126, line: 512, baseType: !538, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1336, file: !126, line: 514, baseType: !538, size: 64, offset: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1317, file: !126, line: 532, baseType: !1347, size: 448)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1317, file: !126, line: 517, size: 448, elements: !1348)
!1348 = !{!1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1347, file: !126, line: 518, baseType: !538, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1347, file: !126, line: 521, baseType: !538, size: 64, align: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1347, file: !126, line: 522, baseType: !538, size: 64, align: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1347, file: !126, line: 523, baseType: !538, size: 64, align: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1347, file: !126, line: 524, baseType: !698, size: 32, offset: 256)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1347, file: !126, line: 529, baseType: !698, size: 32, offset: 288)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1347, file: !126, line: 530, baseType: !538, size: 64, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1347, file: !126, line: 531, baseType: !538, size: 64, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_member, scope: !1317, file: !126, line: 534, baseType: !1358, size: 960)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1317, file: !126, line: 534, size: 960, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1358, file: !126, line: 535, baseType: !698, size: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1358, file: !126, line: 536, baseType: !698, size: 32, offset: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1358, file: !126, line: 537, baseType: !538, size: 64, align: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1358, file: !126, line: 538, baseType: !538, size: 64, align: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1358, file: !126, line: 539, baseType: !698, size: 32, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1358, file: !126, line: 540, baseType: !698, size: 32, offset: 224)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1358, file: !126, line: 541, baseType: !538, size: 64, align: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1358, file: !126, line: 542, baseType: !698, size: 32, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1358, file: !126, line: 543, baseType: !698, size: 32, offset: 352)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1358, file: !126, line: 544, baseType: !472, size: 128, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1358, file: !126, line: 545, baseType: !698, size: 32, offset: 512)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1358, file: !126, line: 550, baseType: !698, size: 32, offset: 544)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1358, file: !126, line: 551, baseType: !698, size: 32, offset: 576)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1358, file: !126, line: 552, baseType: !698, size: 32, offset: 608)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "func_info", scope: !1358, file: !126, line: 553, baseType: !538, size: 64, align: 64, offset: 640)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_cnt", scope: !1358, file: !126, line: 554, baseType: !698, size: 32, offset: 704)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_rec_size", scope: !1358, file: !126, line: 555, baseType: !698, size: 32, offset: 736)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "line_info", scope: !1358, file: !126, line: 556, baseType: !538, size: 64, align: 64, offset: 768)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "line_info_cnt", scope: !1358, file: !126, line: 557, baseType: !698, size: 32, offset: 832)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "attach_btf_id", scope: !1358, file: !126, line: 558, baseType: !698, size: 32, offset: 864)
