; ModuleID = '../bcout/drivers/net/wireless/ath/ath6kl/usb.llvm.bc'
source_filename = "drivers/net/wireless/ath/ath6kl/usb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_ath6kl_usb_driver_init6:\09\09\09"
module asm ".long\09ath6kl_usb_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.usb_driver = type { i8*, i32 (%struct.usb_interface*, %struct.usb_device_id*)*, void (%struct.usb_interface*)*, i32 (%struct.usb_interface*, i32, i8*)*, i32 (%struct.usb_interface*, i32)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, %struct.usb_device_id*, %struct.attribute_group**, %struct.usb_dynids, %struct.usbdrv_wrap, i8 }
%struct.usb_interface = type { %struct.usb_host_interface*, %struct.usb_host_interface*, i32, %struct.usb_interface_assoc_descriptor*, i32, i32, i8, %struct.device, %struct.device*, %struct.work_struct }
%struct.usb_host_interface = type { %struct.usb_interface_descriptor, i32, i8*, %struct.usb_host_endpoint*, i8* }
%struct.usb_interface_descriptor = type { i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.usb_host_endpoint = type <{ %struct.usb_endpoint_descriptor, %struct.usb_ss_ep_comp_descriptor, %struct.usb_ssp_isoc_ep_comp_descriptor, i8, %struct.list_head, i8*, %struct.ep_device*, i8*, i32, i32, i32, [4 x i8] }>

!358 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_MBSS", value: 3, isUnsigned: true)
!359 = !DIEnumerator(name: "IEEE80211_BSS_TYPE_ANY", value: 4, isUnsigned: true)
!360 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_chan_width", file: !279, line: 4521, baseType: !7, size: 32, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!362 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20_NOHT", value: 0, isUnsigned: true)
!363 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_20", value: 1, isUnsigned: true)
!364 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_40", value: 2, isUnsigned: true)
!365 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80", value: 3, isUnsigned: true)
!366 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_80P80", value: 4, isUnsigned: true)
!367 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_160", value: 5, isUnsigned: true)
!368 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_5", value: 6, isUnsigned: true)
!369 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_10", value: 7, isUnsigned: true)
!370 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_1", value: 8, isUnsigned: true)
!371 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_2", value: 9, isUnsigned: true)
!372 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_4", value: 10, isUnsigned: true)
!373 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_8", value: 11, isUnsigned: true)
!374 = !DIEnumerator(name: "NL80211_CHAN_WIDTH_16", value: 12, isUnsigned: true)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_key_mode", file: !279, line: 4491, baseType: !7, size: 32, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIEnumerator(name: "NL80211_KEY_RX_TX", value: 0, isUnsigned: true)
!378 = !DIEnumerator(name: "NL80211_KEY_NO_TX", value: 1, isUnsigned: true)
!379 = !DIEnumerator(name: "NL80211_KEY_SET_TX", value: 2, isUnsigned: true)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_auth_type", file: !279, line: 4672, baseType: !7, size: 32, elements: !381)
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!382 = !DIEnumerator(name: "NL80211_AUTHTYPE_OPEN_SYSTEM", value: 0, isUnsigned: true)
!383 = !DIEnumerator(name: "NL80211_AUTHTYPE_SHARED_KEY", value: 1, isUnsigned: true)
!384 = !DIEnumerator(name: "NL80211_AUTHTYPE_FT", value: 2, isUnsigned: true)
!385 = !DIEnumerator(name: "NL80211_AUTHTYPE_NETWORK_EAP", value: 3, isUnsigned: true)
!386 = !DIEnumerator(name: "NL80211_AUTHTYPE_SAE", value: 4, isUnsigned: true)
!387 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK", value: 5, isUnsigned: true)
!388 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_SK_PFS", value: 6, isUnsigned: true)
!389 = !DIEnumerator(name: "NL80211_AUTHTYPE_FILS_PK", value: 7, isUnsigned: true)
!390 = !DIEnumerator(name: "__NL80211_AUTHTYPE_NUM", value: 8, isUnsigned: true)
!391 = !DIEnumerator(name: "NL80211_AUTHTYPE_MAX", value: 7, isUnsigned: true)
!392 = !DIEnumerator(name: "NL80211_AUTHTYPE_AUTOMATIC", value: 8, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_mfp", file: !279, line: 4709, baseType: !7, size: 32, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIEnumerator(name: "NL80211_MFP_NO", value: 0, isUnsigned: true)
!396 = !DIEnumerator(name: "NL80211_MFP_REQUIRED", value: 1, isUnsigned: true)
!397 = !DIEnumerator(name: "NL80211_MFP_OPTIONAL", value: 2, isUnsigned: true)
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nl80211_bss_select_attr", file: !279, line: 6321, baseType: !7, size: 32, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405}
!400 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_INVALID", value: 0, isUnsigned: true)
!401 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI", value: 1, isUnsigned: true)
!402 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_BAND_PREF", value: 2, isUnsigned: true)
!403 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_RSSI_ADJUST", value: 3, isUnsigned: true)
!404 = !DIEnumerator(name: "__NL80211_BSS_SELECT_ATTR_AFTER_LAST", value: 4, isUnsigned: true)
!405 = !DIEnumerator(name: "NL80211_BSS_SELECT_ATTR_MAX", value: 3, isUnsigned: true)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !38, line: 423, baseType: !7, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411}
!408 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!410 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!411 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !413, file: !38, line: 2085, baseType: !7, size: 32, elements: !8022)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !38, line: 1858, size: 15808, elements: !414)
!414 = !{!415, !420, !443, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !477, !485, !486, !487, !488, !489, !490, !491, !492, !493, !519, !529, !530, !531, !536, !537, !541, !544, !5668, !6184, !6188, !6228, !6229, !6230, !6231, !6232, !6233, !6234, !6235, !6236, !6237, !6238, !6239, !6240, !6241, !6242, !6243, !6244, !6245, !6246, !6247, !6248, !6249, !6250, !6251, !6252, !6253, !6254, !6259, !6260, !6261, !6541, !6542, !6543, !6544, !6547, !6550, !6553, !7848, !7851, !7852, !7865, !7866, !7867, !7868, !7869, !7870, !7877, !7878, !7912, !7913, !7914, !7915, !7916, !7917, !7918, !7919, !7920, !7923, !7924, !7925, !7926, !7927, !7928, !7929, !7930, !7931, !7936, !7937, !7938, !7939, !7976, !7977, !7979, !7980, !7984, !7985, !7986, !7987, !7993, !7995, !7998, !8001, !8003, !8004, !8005, !8006, !8007, !8011, !8014}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !413, file: !38, line: 1859, baseType: !416, size: 128)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 128, elements: !418)
!417 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!418 = !{!419}
!419 = !DISubrange(count: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !413, file: !38, line: 1860, baseType: !421, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !38, line: 938, size: 384, elements: !423)
!423 = !{!424, !432, !438, !440}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !422, file: !38, line: 939, baseType: !425, size: 128)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !426, line: 186, size: 128, elements: !427)
!426 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!427 = !{!428, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !426, line: 187, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !425, file: !426, line: 187, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !422, file: !38, line: 940, baseType: !433, size: 128, offset: 128)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !426, line: 178, size: 128, elements: !434)
!434 = !{!435, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !433, file: !426, line: 179, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !426, line: 179, baseType: !436, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !422, file: !38, line: 941, baseType: !439, size: 64, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !422, file: !38, line: 942, baseType: !441, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !413, file: !38, line: 1861, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !38, line: 930, size: 128, elements: !446)
!446 = !{!447, !456}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !445, file: !38, line: 931, baseType: !448, size: 128, align: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !426, line: 216, size: 128, align: 64, elements: !449)
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !426, line: 217, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !448, file: !426, line: 218, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !451}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !445, file: !38, line: 932, baseType: !457, offset: 128)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: -1)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !413, file: !38, line: 1866, baseType: !461, size: 64, offset: 256)
!461 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !413, file: !38, line: 1867, baseType: !461, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !413, file: !38, line: 1868, baseType: !461, size: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !413, file: !38, line: 1869, baseType: !39, size: 32, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !413, file: !38, line: 1877, baseType: !461, size: 64, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !413, file: !38, line: 1879, baseType: !433, size: 128, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !413, file: !38, line: 1880, baseType: !433, size: 128, offset: 704)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !413, file: !38, line: 1881, baseType: !433, size: 128, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !413, file: !38, line: 1882, baseType: !433, size: 128, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !413, file: !38, line: 1883, baseType: !433, size: 128, offset: 1088)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !413, file: !38, line: 1884, baseType: !433, size: 128, offset: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !413, file: !38, line: 1889, baseType: !473, size: 256, offset: 1344)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !413, file: !38, line: 1886, size: 256, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !473, file: !38, line: 1887, baseType: !433, size: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !473, file: !38, line: 1888, baseType: !433, size: 128, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !413, file: !38, line: 1891, baseType: !478, size: 64, offset: 1600)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !479, line: 12, baseType: !480)
!479 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !481, line: 23, baseType: !482)
!481 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !483, line: 31, baseType: !484)
!483 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!484 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !413, file: !38, line: 1892, baseType: !478, size: 64, offset: 1664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !413, file: !38, line: 1893, baseType: !478, size: 64, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !413, file: !38, line: 1894, baseType: !478, size: 64, offset: 1792)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !413, file: !38, line: 1895, baseType: !478, size: 64, offset: 1856)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !413, file: !38, line: 1896, baseType: !478, size: 64, offset: 1920)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !413, file: !38, line: 1897, baseType: !478, size: 64, offset: 1984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !413, file: !38, line: 1899, baseType: !39, size: 32, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !413, file: !38, line: 1900, baseType: !39, size: 32, offset: 2080)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !413, file: !38, line: 1902, baseType: !494, size: 1472, offset: 2112)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !38, line: 169, size: 1472, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !494, file: !38, line: 170, baseType: !461, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !494, file: !38, line: 171, baseType: !461, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !494, file: !38, line: 172, baseType: !461, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !494, file: !38, line: 173, baseType: !461, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !494, file: !38, line: 174, baseType: !461, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !494, file: !38, line: 175, baseType: !461, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !494, file: !38, line: 176, baseType: !461, size: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !494, file: !38, line: 177, baseType: !461, size: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !494, file: !38, line: 178, baseType: !461, size: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !494, file: !38, line: 179, baseType: !461, size: 64, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !494, file: !38, line: 180, baseType: !461, size: 64, offset: 640)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !494, file: !38, line: 181, baseType: !461, size: 64, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !494, file: !38, line: 182, baseType: !461, size: 64, offset: 768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !494, file: !38, line: 183, baseType: !461, size: 64, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !494, file: !38, line: 184, baseType: !461, size: 64, offset: 896)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !494, file: !38, line: 185, baseType: !461, size: 64, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !494, file: !38, line: 186, baseType: !461, size: 64, offset: 1024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !494, file: !38, line: 187, baseType: !461, size: 64, offset: 1088)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !494, file: !38, line: 188, baseType: !461, size: 64, offset: 1152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !494, file: !38, line: 189, baseType: !461, size: 64, offset: 1216)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !494, file: !38, line: 190, baseType: !461, size: 64, offset: 1280)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !494, file: !38, line: 191, baseType: !461, size: 64, offset: 1344)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !494, file: !38, line: 192, baseType: !461, size: 64, offset: 1408)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !413, file: !38, line: 1904, baseType: !520, size: 64, offset: 3584)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !521, line: 13, baseType: !522)
!521 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !426, line: 175, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 173, size: 64, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !523, file: !426, line: 174, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !481, line: 22, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !483, line: 30, baseType: !528)
!528 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !413, file: !38, line: 1905, baseType: !520, size: 64, offset: 3648)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !413, file: !38, line: 1906, baseType: !520, size: 64, offset: 3712)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !413, file: !38, line: 1909, baseType: !532, size: 32, offset: 3776)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !426, line: 168, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 166, size: 32, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !533, file: !426, line: 167, baseType: !39, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !413, file: !38, line: 1910, baseType: !532, size: 32, offset: 3808)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !413, file: !38, line: 1913, baseType: !538, size: 64, offset: 3840)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !540)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !38, line: 1913, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !413, file: !38, line: 1914, baseType: !542, size: 64, offset: 3904)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !38, line: 1914, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !413, file: !38, line: 1916, baseType: !545, size: 64, offset: 3968)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !38, line: 1283, size: 4416, elements: !548)
!548 = !{!549, !553, !557, !558, !559, !722, !726, !731, !735, !736, !741, !742, !865, !870, !874, !880, !884, !916, !924, !928, !933, !937, !938, !944, !948, !952, !956, !957, !979, !983, !998, !1009, !1013, !1022, !1026, !1027, !1031, !1052, !1056, !1060, !1064, !1068, !1075, !1079, !1097, !1101, !1151, !1155, !1160, !1164, !1168, !1172, !1182, !1183, !1192, !1198, !1199, !1203, !1207, !1211, !1215, !1216, !1220, !1221, !5628, !5648, !5652, !5658, !5664}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !547, file: !38, line: 1284, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!39, !439}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !547, file: !38, line: 1285, baseType: !554, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !439}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !547, file: !38, line: 1286, baseType: !550, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !547, file: !38, line: 1287, baseType: !550, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !547, file: !38, line: 1288, baseType: !560, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!563, !564, !439}
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !38, line: 120, baseType: !37)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !566, line: 713, size: 1600, elements: !567)
!566 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!567 = !{!568, !590, !598, !605, !609, !621, !622, !623, !626, !627, !628, !634, !635, !636, !637, !638, !639, !640, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !680, !681, !682, !683, !685, !686, !691, !696, !701, !702, !703, !704, !705, !706, !707, !708, !709, !711, !712, !714, !715, !716}
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 714, baseType: !569, size: 192)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 714, size: 192, elements: !570)
!570 = !{!571, !581, !589}
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !566, line: 715, baseType: !572, size: 192)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !566, line: 715, size: 192, elements: !573)
!573 = !{!574, !575, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !566, line: 717, baseType: !564, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !566, line: 718, baseType: !564, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !566, line: 720, baseType: !577, size: 64, offset: 128)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !566, line: 720, size: 64, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !577, file: !566, line: 721, baseType: !439, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !577, file: !566, line: 726, baseType: !461, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !569, file: !566, line: 729, baseType: !582, size: 192, align: 64)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !583, line: 24, size: 192, align: 64, elements: !584)
!583 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!584 = !{!585, !586, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !582, file: !583, line: 25, baseType: !461, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !582, file: !583, line: 26, baseType: !587, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !582, file: !583, line: 27, baseType: !587, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !569, file: !566, line: 730, baseType: !433, size: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 733, baseType: !591, size: 64, offset: 192)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 733, size: 64, elements: !592)
!592 = !{!593, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !591, file: !566, line: 734, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !596, line: 19, flags: DIFlagFwdDecl)
!596 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !591, file: !566, line: 735, baseType: !39, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 738, baseType: !599, size: 64, offset: 256)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 738, size: 64, elements: !600)
!600 = !{!601, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !599, file: !566, line: 739, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !603, line: 29, baseType: !526)
!603 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!604 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !599, file: !566, line: 740, baseType: !480, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !565, file: !566, line: 748, baseType: !606, size: 384, align: 64, offset: 320)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 384, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 48)
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 750, baseType: !610, size: 128, offset: 704)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 750, size: 128, elements: !611)
!611 = !{!612, !620}
!612 = !DIDerivedType(tag: DW_TAG_member, scope: !610, file: !566, line: 751, baseType: !613, size: 128)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !566, line: 751, size: 128, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !613, file: !566, line: 752, baseType: !461, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !613, file: !566, line: 753, baseType: !617, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !564}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !610, file: !566, line: 755, baseType: !433, size: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !565, file: !566, line: 761, baseType: !7, size: 32, offset: 832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !565, file: !566, line: 762, baseType: !7, size: 32, offset: 864)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !565, file: !566, line: 763, baseType: !624, size: 16, offset: 896)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !483, line: 24, baseType: !625)
!625 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !565, file: !566, line: 764, baseType: !624, size: 16, offset: 912)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !565, file: !566, line: 769, baseType: !624, size: 16, offset: 928)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !565, file: !566, line: 780, baseType: !629, offset: 944)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, elements: !632)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !483, line: 21, baseType: !631)
!631 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!632 = !{!633}
!633 = !DISubrange(count: 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !565, file: !566, line: 782, baseType: !630, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !565, file: !566, line: 783, baseType: !630, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !565, file: !566, line: 784, baseType: !630, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !565, file: !566, line: 785, baseType: !630, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !565, file: !566, line: 786, baseType: !630, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !565, file: !566, line: 787, baseType: !630, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !565, file: !566, line: 795, baseType: !641, offset: 960)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, elements: !632)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !483, line: 27, baseType: !7)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !565, file: !566, line: 807, baseType: !629, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !565, file: !566, line: 809, baseType: !630, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !565, file: !566, line: 810, baseType: !630, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !565, file: !566, line: 811, baseType: !630, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !565, file: !566, line: 812, baseType: !630, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !565, file: !566, line: 813, baseType: !630, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !565, file: !566, line: 815, baseType: !630, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !565, file: !566, line: 816, baseType: !630, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !565, file: !566, line: 817, baseType: !630, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !565, file: !566, line: 818, baseType: !630, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !565, file: !566, line: 819, baseType: !630, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !565, file: !566, line: 821, baseType: !630, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !565, file: !566, line: 822, baseType: !630, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !565, file: !566, line: 823, baseType: !630, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !565, file: !566, line: 832, baseType: !629, offset: 976)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !565, file: !566, line: 834, baseType: !630, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !565, file: !566, line: 835, baseType: !630, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !565, file: !566, line: 836, baseType: !630, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !565, file: !566, line: 837, baseType: !630, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !565, file: !566, line: 838, baseType: !630, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !565, file: !566, line: 840, baseType: !630, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !565, file: !566, line: 843, baseType: !630, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !565, file: !566, line: 844, baseType: !630, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !565, file: !566, line: 845, baseType: !630, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !565, file: !566, line: 847, baseType: !630, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !565, file: !566, line: 848, baseType: !630, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!669 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 866, baseType: !670, size: 32, offset: 992)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 866, size: 32, elements: !671)
!671 = !{!672, !675}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !670, file: !566, line: 867, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !674, line: 37, baseType: !642)
!674 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!675 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !566, line: 868, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !670, file: !566, line: 868, size: 32, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !676, file: !566, line: 869, baseType: !624, size: 16)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !676, file: !566, line: 870, baseType: !624, size: 16, offset: 16)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !565, file: !566, line: 873, baseType: !642, size: 32, offset: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !565, file: !566, line: 874, baseType: !39, size: 32, offset: 1056)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !565, file: !566, line: 875, baseType: !642, size: 32, offset: 1088)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !565, file: !566, line: 876, baseType: !684, size: 16, offset: 1120)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !674, line: 30, baseType: !624)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !565, file: !566, line: 877, baseType: !624, size: 16, offset: 1136)
!686 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 879, baseType: !687, size: 32, offset: 1152)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 879, size: 32, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !687, file: !566, line: 880, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !687, file: !566, line: 881, baseType: !7, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 888, baseType: !692, size: 32, offset: 1184)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 888, size: 32, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !692, file: !566, line: 889, baseType: !642, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !692, file: !566, line: 890, baseType: !642, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !566, line: 893, baseType: !697, size: 16, offset: 1216)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !566, line: 893, size: 16, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !697, file: !566, line: 894, baseType: !684, size: 16)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !697, file: !566, line: 895, baseType: !630, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !565, file: !566, line: 898, baseType: !624, size: 16, offset: 1232)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !565, file: !566, line: 899, baseType: !624, size: 16, offset: 1248)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !565, file: !566, line: 900, baseType: !624, size: 16, offset: 1264)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !565, file: !566, line: 902, baseType: !684, size: 16, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !565, file: !566, line: 903, baseType: !624, size: 16, offset: 1296)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !565, file: !566, line: 904, baseType: !624, size: 16, offset: 1312)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !565, file: !566, line: 905, baseType: !624, size: 16, offset: 1328)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !565, file: !566, line: 908, baseType: !641, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !565, file: !566, line: 912, baseType: !710, size: 32, offset: 1344)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !566, line: 606, baseType: !7)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !565, file: !566, line: 913, baseType: !710, size: 32, offset: 1376)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !565, file: !566, line: 914, baseType: !713, size: 64, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !566, line: 915, baseType: !713, size: 64, offset: 1472)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !565, file: !566, line: 916, baseType: !7, size: 32, offset: 1536)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !565, file: !566, line: 917, baseType: !717, size: 32, offset: 1568)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !718, line: 113, baseType: !719)
!718 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !718, line: 111, size: 32, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !719, file: !718, line: 112, baseType: !532, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !547, file: !38, line: 1290, baseType: !723, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!478, !564, !439, !478}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !547, file: !38, line: 1293, baseType: !727, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !439, !564, !439}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !481, line: 19, baseType: !624)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !547, file: !38, line: 1296, baseType: !732, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !439, !39}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !547, file: !38, line: 1298, baseType: !554, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !547, file: !38, line: 1299, baseType: !737, size: 64, offset: 576)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!39, !439, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !547, file: !38, line: 1301, baseType: !550, size: 64, offset: 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !547, file: !38, line: 1302, baseType: !743, size: 64, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!39, !439, !746, !39}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !748, line: 234, size: 320, elements: !749)
!748 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!749 = !{!750, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !747, file: !748, line: 239, baseType: !751, size: 128)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !747, file: !748, line: 236, size: 128, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !751, file: !748, line: 238, baseType: !416, size: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !747, file: !748, line: 255, baseType: !755, size: 192, offset: 128)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !747, file: !748, line: 241, size: 192, elements: !756)
!756 = !{!757, !769, !770, !771, !772, !773, !775, !776, !777, !786, !787, !788, !789}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !755, file: !748, line: 242, baseType: !758, size: 128)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !759, line: 32, size: 128, elements: !760)
!759 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!760 = !{!761, !765}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !758, file: !759, line: 33, baseType: !762, size: 16)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !759, line: 26, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !764, line: 10, baseType: !625)
!764 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !758, file: !759, line: 34, baseType: !766, size: 112, offset: 16)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 112, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 14)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !755, file: !748, line: 243, baseType: !758, size: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !755, file: !748, line: 244, baseType: !758, size: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !755, file: !748, line: 245, baseType: !758, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !755, file: !748, line: 246, baseType: !758, size: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !755, file: !748, line: 247, baseType: !774, size: 16)
!774 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !755, file: !748, line: 248, baseType: !39, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !755, file: !748, line: 249, baseType: !39, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !755, file: !748, line: 250, baseType: !778, size: 192)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !748, line: 196, size: 192, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !778, file: !748, line: 197, baseType: !461, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !778, file: !748, line: 198, baseType: !461, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !778, file: !748, line: 199, baseType: !625, size: 16, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !778, file: !748, line: 200, baseType: !631, size: 8, offset: 144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !778, file: !748, line: 201, baseType: !631, size: 8, offset: 152)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !778, file: !748, line: 202, baseType: !631, size: 8, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !755, file: !748, line: 251, baseType: !416, size: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !755, file: !748, line: 252, baseType: !416, size: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !755, file: !748, line: 253, baseType: !740, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !755, file: !748, line: 254, baseType: !790, size: 128)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !748, line: 207, size: 128, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !790, file: !748, line: 208, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !790, file: !748, line: 209, baseType: !7, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !790, file: !748, line: 222, baseType: !795, size: 64, offset: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !790, file: !748, line: 210, size: 64, elements: !796)
!796 = !{!797, !805, !812, !824, !830, !837, !848, !856}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !795, file: !748, line: 212, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !800, line: 56, baseType: !801)
!800 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 53, size: 32, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !801, file: !800, line: 54, baseType: !625, size: 16)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !801, file: !800, line: 55, baseType: !625, size: 16, offset: 16)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !795, file: !748, line: 213, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !800, line: 80, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 77, size: 64, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !808, file: !800, line: 78, baseType: !7, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !808, file: !800, line: 79, baseType: !7, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !795, file: !748, line: 214, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !800, line: 66, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 58, size: 192, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !815, file: !800, line: 59, baseType: !7, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !815, file: !800, line: 60, baseType: !7, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !815, file: !800, line: 61, baseType: !7, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !815, file: !800, line: 62, baseType: !7, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !815, file: !800, line: 63, baseType: !7, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !815, file: !800, line: 64, baseType: !625, size: 16, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !815, file: !800, line: 65, baseType: !625, size: 16, offset: 176)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !795, file: !748, line: 215, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !800, line: 70, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 68, size: 32, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !827, file: !800, line: 69, baseType: !7, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !795, file: !748, line: 216, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !800, line: 75, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 72, size: 160, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !833, file: !800, line: 73, baseType: !7, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !833, file: !800, line: 74, baseType: !416, size: 128, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !795, file: !748, line: 217, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !800, line: 89, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 82, size: 192, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !840, file: !800, line: 83, baseType: !625, size: 16)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !840, file: !800, line: 84, baseType: !7, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !840, file: !800, line: 85, baseType: !7, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !840, file: !800, line: 86, baseType: !7, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !840, file: !800, line: 87, baseType: !7, size: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !840, file: !800, line: 88, baseType: !7, size: 32, offset: 160)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !795, file: !748, line: 220, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !800, line: 44, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 40, size: 96, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !851, file: !800, line: 41, baseType: !7, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !851, file: !800, line: 42, baseType: !7, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !851, file: !800, line: 43, baseType: !625, size: 16, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !795, file: !748, line: 221, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !800, line: 51, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !800, line: 46, size: 128, elements: !860)
!860 = !{!861, !862, !863, !864}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !859, file: !800, line: 47, baseType: !7, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !859, file: !800, line: 48, baseType: !7, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !859, file: !800, line: 49, baseType: !625, size: 16, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !859, file: !800, line: 50, baseType: !7, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !547, file: !38, line: 1304, baseType: !866, size: 64, offset: 768)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!39, !439, !869}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !547, file: !38, line: 1306, baseType: !871, size: 64, offset: 832)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!39, !439, !39}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !547, file: !38, line: 1308, baseType: !875, size: 64, offset: 896)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!39, !439, !878}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !38, line: 206, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !547, file: !38, line: 1310, baseType: !881, size: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !439, !7}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !547, file: !38, line: 1313, baseType: !885, size: 64, offset: 1024)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !439, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !890, line: 214, size: 1536, elements: !891)
!890 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!891 = !{!892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !889, file: !890, line: 215, baseType: !482, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !889, file: !890, line: 216, baseType: !482, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !889, file: !890, line: 217, baseType: !482, size: 64, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !889, file: !890, line: 218, baseType: !482, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !889, file: !890, line: 219, baseType: !482, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !889, file: !890, line: 220, baseType: !482, size: 64, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !889, file: !890, line: 221, baseType: !482, size: 64, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !889, file: !890, line: 222, baseType: !482, size: 64, offset: 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !889, file: !890, line: 223, baseType: !482, size: 64, offset: 512)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !889, file: !890, line: 224, baseType: !482, size: 64, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !889, file: !890, line: 227, baseType: !482, size: 64, offset: 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !889, file: !890, line: 228, baseType: !482, size: 64, offset: 704)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !889, file: !890, line: 229, baseType: !482, size: 64, offset: 768)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !889, file: !890, line: 230, baseType: !482, size: 64, offset: 832)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !889, file: !890, line: 231, baseType: !482, size: 64, offset: 896)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !889, file: !890, line: 232, baseType: !482, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !889, file: !890, line: 235, baseType: !482, size: 64, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !889, file: !890, line: 236, baseType: !482, size: 64, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !889, file: !890, line: 237, baseType: !482, size: 64, offset: 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !889, file: !890, line: 238, baseType: !482, size: 64, offset: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !889, file: !890, line: 239, baseType: !482, size: 64, offset: 1280)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !889, file: !890, line: 242, baseType: !482, size: 64, offset: 1344)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !889, file: !890, line: 243, baseType: !482, size: 64, offset: 1408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !889, file: !890, line: 244, baseType: !482, size: 64, offset: 1472)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !547, file: !38, line: 1315, baseType: !917, size: 64, offset: 1088)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!920, !922, !39}
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !426, line: 30, baseType: !921)
!921 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !547, file: !38, line: 1316, baseType: !925, size: 64, offset: 1152)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!39, !39, !922, !740}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !547, file: !38, line: 1319, baseType: !929, size: 64, offset: 1216)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!932, !439}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !547, file: !38, line: 1321, baseType: !934, size: 64, offset: 1280)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!39, !439, !684, !730}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !547, file: !38, line: 1323, baseType: !934, size: 64, offset: 1344)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !547, file: !38, line: 1331, baseType: !939, size: 64, offset: 1408)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!39, !439, !39, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !481, line: 17, baseType: !630)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !547, file: !38, line: 1333, baseType: !945, size: 64, offset: 1472)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!39, !439, !39, !730, !943, !684}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !547, file: !38, line: 1336, baseType: !949, size: 64, offset: 1536)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!39, !439, !39, !39, !39}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !547, file: !38, line: 1339, baseType: !953, size: 64, offset: 1600)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!39, !439, !39, !920}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !547, file: !38, line: 1341, baseType: !953, size: 64, offset: 1664)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !547, file: !38, line: 1343, baseType: !958, size: 64, offset: 1728)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!39, !439, !39, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !963, line: 20, size: 576, elements: !964)
!963 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!964 = !{!965, !966, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !962, file: !963, line: 21, baseType: !642, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !962, file: !963, line: 22, baseType: !967, size: 256, offset: 32)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 256, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !962, file: !963, line: 23, baseType: !642, size: 32, offset: 288)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !962, file: !963, line: 24, baseType: !642, size: 32, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !962, file: !963, line: 25, baseType: !642, size: 32, offset: 352)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !962, file: !963, line: 26, baseType: !642, size: 32, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !962, file: !963, line: 27, baseType: !642, size: 32, offset: 416)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !962, file: !963, line: 28, baseType: !642, size: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !962, file: !963, line: 29, baseType: !642, size: 32, offset: 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !962, file: !963, line: 30, baseType: !642, size: 32, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !962, file: !963, line: 31, baseType: !684, size: 16, offset: 544)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !547, file: !38, line: 1346, baseType: !980, size: 64, offset: 1792)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!39, !439, !39, !39}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !547, file: !38, line: 1348, baseType: !984, size: 64, offset: 1856)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!39, !439, !39, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !963, line: 9, size: 512, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !988, file: !963, line: 10, baseType: !482, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !988, file: !963, line: 11, baseType: !482, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !988, file: !963, line: 12, baseType: !482, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !988, file: !963, line: 13, baseType: !482, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !988, file: !963, line: 14, baseType: !482, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !988, file: !963, line: 15, baseType: !482, size: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !988, file: !963, line: 16, baseType: !482, size: 64, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !988, file: !963, line: 17, baseType: !482, size: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !547, file: !38, line: 1352, baseType: !999, size: 64, offset: 1920)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!39, !439, !39, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !1005, line: 213, size: 32, elements: !1006)
!1005 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !1004, file: !1005, line: 214, baseType: !624, size: 16)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !1004, file: !1005, line: 215, baseType: !624, size: 16, offset: 16)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !547, file: !38, line: 1355, baseType: !1010, size: 64, offset: 1984)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!39, !439, !39, !564}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !547, file: !38, line: 1357, baseType: !1014, size: 64, offset: 2048)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!39, !439, !39, !1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !890, line: 956, size: 128, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1018, file: !890, line: 957, baseType: !642, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1018, file: !890, line: 958, baseType: !482, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !547, file: !38, line: 1361, baseType: !1023, size: 64, offset: 2112)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!39, !439, !39, !480, !39}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !547, file: !38, line: 1364, baseType: !953, size: 64, offset: 2176)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !547, file: !38, line: 1367, baseType: !1028, size: 64, offset: 2240)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!39, !439, !44, !740}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !547, file: !38, line: 1400, baseType: !1032, size: 64, offset: 2304)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!39, !439, !439, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1037, line: 75, size: 384, elements: !1038)
!1037 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1038 = !{!1039, !1040, !1043, !1047, !1051}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1036, file: !1037, line: 76, baseType: !441, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1036, file: !1037, line: 77, baseType: !1041, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1036, file: !1037, line: 78, baseType: !1044, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1037, line: 78, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1036, file: !1037, line: 79, baseType: !1048, size: 160, offset: 192)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 160, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 20)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1036, file: !1037, line: 80, baseType: !943, size: 8, offset: 352)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !547, file: !38, line: 1403, baseType: !1053, size: 64, offset: 2368)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!39, !439, !439}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !547, file: !38, line: 1405, baseType: !1057, size: 64, offset: 2432)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!439, !439, !564, !920}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !547, file: !38, line: 1408, baseType: !1061, size: 64, offset: 2496)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!478, !439, !478}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !547, file: !38, line: 1410, baseType: !1065, size: 64, offset: 2560)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!39, !439, !478}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !547, file: !38, line: 1412, baseType: !1069, size: 64, offset: 2624)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!39, !439, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1074, line: 35, flags: DIFlagFwdDecl)
!1074 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !547, file: !38, line: 1414, baseType: !1076, size: 64, offset: 2688)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !439, !1072}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !547, file: !38, line: 1417, baseType: !1080, size: 64, offset: 2752)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!39, !1083, !1002, !439, !1095, !730, !730, !1035}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1085, line: 8, size: 96, elements: !1086)
!1085 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1086 = !{!1087, !1088, !1089, !1090, !1092, !1093, !1094}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1084, file: !1085, line: 9, baseType: !630, size: 8)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1084, file: !1085, line: 10, baseType: !630, size: 8, offset: 8)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1084, file: !1085, line: 11, baseType: !624, size: 16, offset: 16)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1084, file: !1085, line: 12, baseType: !1091, size: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !483, line: 26, baseType: !39)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1084, file: !1085, line: 13, baseType: !624, size: 16, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1084, file: !1085, line: 14, baseType: !630, size: 8, offset: 80)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1084, file: !1085, line: 15, baseType: !630, size: 8, offset: 88)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !547, file: !38, line: 1424, baseType: !1098, size: 64, offset: 2816)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!39, !1083, !1002, !439, !1095, !730}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !547, file: !38, line: 1429, baseType: !1102, size: 64, offset: 2880)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!39, !564, !1105, !439, !439, !1150}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1037, line: 203, size: 1024, elements: !1107)
!1107 = !{!1108, !1109, !1119, !1123, !1127, !1128, !1132, !1133, !1134, !1135, !1137, !1138, !1139, !1140}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1106, file: !1037, line: 204, baseType: !564, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1106, file: !1037, line: 205, baseType: !1110, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !1005, line: 44, size: 128, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1112, file: !1005, line: 45, baseType: !642, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1112, file: !1005, line: 46, baseType: !624, size: 16, offset: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1112, file: !1005, line: 47, baseType: !624, size: 16, offset: 48)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1112, file: !1005, line: 48, baseType: !642, size: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1112, file: !1005, line: 49, baseType: !642, size: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1106, file: !1037, line: 206, baseType: !1120, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!39, !564, !1105}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1106, file: !1037, line: 208, baseType: !1124, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!39, !1105}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !1037, line: 209, baseType: !740, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1106, file: !1037, line: 211, baseType: !1129, size: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1131, line: 76, flags: DIFlagFwdDecl)
!1131 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1106, file: !1037, line: 212, baseType: !1035, size: 64, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1106, file: !1037, line: 213, baseType: !730, size: 16, offset: 448)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1106, file: !1037, line: 214, baseType: !730, size: 16, offset: 464)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1106, file: !1037, line: 215, baseType: !1136, size: 32, offset: 480)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !481, line: 21, baseType: !642)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1106, file: !1037, line: 216, baseType: !7, size: 32, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1106, file: !1037, line: 216, baseType: !7, size: 32, offset: 544)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1106, file: !1037, line: 217, baseType: !920, size: 8, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_member, scope: !1106, file: !1037, line: 218, baseType: !1141, size: 384, offset: 640)
!1141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1106, file: !1037, line: 218, size: 384, elements: !1142)
!1142 = !{!1143, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1141, file: !1037, line: 219, baseType: !1144, size: 384)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 384, elements: !607)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1141, file: !1037, line: 224, baseType: !1146, size: 384)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 384, elements: !1148)
!1147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1148 = !{!1149}
!1149 = !DISubrange(count: 6)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !547, file: !38, line: 1434, baseType: !1152, size: 64, offset: 2944)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!39, !564, !1002, !439, !1095, !730, !1136, !1136, !1035}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !547, file: !38, line: 1440, baseType: !1156, size: 64, offset: 3008)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!39, !439, !1159, !730, !1035}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !547, file: !38, line: 1444, baseType: !1161, size: 64, offset: 3072)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!39, !564, !1136, !1136, !439, !1136, !39}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !547, file: !38, line: 1449, baseType: !1165, size: 64, offset: 3136)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!39, !439, !1159, !730}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !547, file: !38, line: 1452, baseType: !1169, size: 64, offset: 3200)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!39, !439, !920}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !547, file: !38, line: 1454, baseType: !1173, size: 64, offset: 3264)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!39, !439, !1176}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !38, line: 820, size: 264, elements: !1178)
!1178 = !{!1179, !1181}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1177, file: !38, line: 821, baseType: !1180, size: 256)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 256, elements: !968)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1177, file: !38, line: 822, baseType: !631, size: 8, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !547, file: !38, line: 1456, baseType: !1173, size: 64, offset: 3328)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !547, file: !38, line: 1458, baseType: !1184, size: 64, offset: 3392)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!39, !439, !1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !426, line: 55, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1190, line: 72, baseType: !1191)
!1190 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1190, line: 16, baseType: !461)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !547, file: !38, line: 1460, baseType: !1193, size: 64, offset: 3456)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !439, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !38, line: 67, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !547, file: !38, line: 1462, baseType: !1193, size: 64, offset: 3520)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !547, file: !38, line: 1464, baseType: !1200, size: 64, offset: 3584)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!740, !439, !439}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !547, file: !38, line: 1466, baseType: !1204, size: 64, offset: 3648)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{null, !439, !740}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !547, file: !38, line: 1469, baseType: !1208, size: 64, offset: 3712)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!39, !439, !39, !1136}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !547, file: !38, line: 1472, baseType: !1212, size: 64, offset: 3776)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!39, !922}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !547, file: !38, line: 1473, baseType: !1169, size: 64, offset: 3840)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !547, file: !38, line: 1475, baseType: !1217, size: 64, offset: 3904)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!39, !439, !564}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !547, file: !38, line: 1477, baseType: !732, size: 64, offset: 3968)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !547, file: !38, line: 1479, baseType: !1222, size: 64, offset: 4032)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!39, !439, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !38, line: 894, size: 256, elements: !1227)
!1227 = !{!1228, !1229}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1226, file: !38, line: 895, baseType: !64, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, scope: !1226, file: !38, line: 896, baseType: !1230, size: 192, offset: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1226, file: !38, line: 896, size: 192, elements: !1231)
!1231 = !{!1232, !1241, !5621}
!1232 = !DIDerivedType(tag: DW_TAG_member, scope: !1230, file: !38, line: 898, baseType: !1233, size: 192)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1230, file: !38, line: 898, size: 192, elements: !1234)
!1234 = !{!1235, !1236, !1240}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1233, file: !38, line: 899, baseType: !1136, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1233, file: !38, line: 900, baseType: !1237, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1239, line: 11, flags: DIFlagFwdDecl)
!1239 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1233, file: !38, line: 901, baseType: !1035, size: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, scope: !1230, file: !38, line: 904, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1230, file: !38, line: 904, size: 64, elements: !1243)
!1243 = !{!1244}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1242, file: !38, line: 905, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !72, line: 222, size: 2560, elements: !1247)
!1247 = !{!1248, !5600, !5601, !5619, !5620}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1246, file: !72, line: 223, baseType: !1249, size: 2048)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !72, line: 141, size: 2048, elements: !1250)
!1250 = !{!1251, !5574, !5575, !5576, !5577, !5578, !5579, !5580, !5581, !5582, !5583, !5584, !5585, !5586, !5591, !5592, !5593, !5594, !5595, !5596, !5597, !5598, !5599}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1249, file: !72, line: 145, baseType: !1252, size: 64, align: 512)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !72, line: 54, size: 2368, elements: !1255)
!1255 = !{!1256, !1455, !1460, !5246, !5250, !5254, !5255, !5259, !5265, !5266, !5267, !5268, !5269, !5273, !5277, !5281, !5282, !5283, !5287, !5288, !5300, !5304, !5308, !5320, !5509, !5513, !5517, !5522, !5526, !5530, !5534, !5540, !5544, !5551, !5555, !5557, !5558}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1254, file: !72, line: 56, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!39, !1260}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !103, line: 483, size: 960, align: 64, elements: !1262)
!1262 = !{!1263, !1279, !1290, !1301, !1325, !1331, !1339, !1356, !1369, !1375, !1384, !1389, !1397, !1409, !1429, !1436, !1440, !1444, !1449}
!1263 = !DIDerivedType(tag: DW_TAG_member, scope: !1261, file: !103, line: 484, baseType: !1264, size: 512)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1261, file: !103, line: 484, size: 512, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1264, file: !103, line: 485, baseType: !642, size: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1264, file: !103, line: 486, baseType: !642, size: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1264, file: !103, line: 487, baseType: !642, size: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1264, file: !103, line: 488, baseType: !642, size: 32, offset: 96)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1264, file: !103, line: 489, baseType: !642, size: 32, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1264, file: !103, line: 492, baseType: !642, size: 32, offset: 160)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1264, file: !103, line: 493, baseType: !642, size: 32, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1264, file: !103, line: 496, baseType: !416, size: 128, offset: 224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1264, file: !103, line: 497, baseType: !642, size: 32, offset: 352)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1264, file: !103, line: 498, baseType: !642, size: 32, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1264, file: !103, line: 499, baseType: !642, size: 32, offset: 416)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1264, file: !103, line: 500, baseType: !642, size: 32, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1264, file: !103, line: 501, baseType: !642, size: 32, offset: 480)
!1279 = !DIDerivedType(tag: DW_TAG_member, scope: !1261, file: !103, line: 507, baseType: !1280, size: 256)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1261, file: !103, line: 507, size: 256, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1289}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1280, file: !103, line: 508, baseType: !642, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1280, file: !103, line: 509, baseType: !482, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, scope: !1280, file: !103, line: 510, baseType: !1285, size: 64, offset: 128)
!1285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1280, file: !103, line: 510, size: 64, elements: !1286)
!1286 = !{!1287, !1288}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1285, file: !103, line: 511, baseType: !482, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1285, file: !103, line: 512, baseType: !482, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1280, file: !103, line: 514, baseType: !482, size: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1261, file: !103, line: 532, baseType: !1291, size: 448)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1261, file: !103, line: 517, size: 448, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1291, file: !103, line: 518, baseType: !482, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1291, file: !103, line: 521, baseType: !482, size: 64, align: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1291, file: !103, line: 522, baseType: !482, size: 64, align: 64, offset: 128)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1291, file: !103, line: 523, baseType: !482, size: 64, align: 64, offset: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1291, file: !103, line: 524, baseType: !642, size: 32, offset: 256)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1291, file: !103, line: 529, baseType: !642, size: 32, offset: 288)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1291, file: !103, line: 530, baseType: !482, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1291, file: !103, line: 531, baseType: !482, size: 64, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_member, scope: !1261, file: !103, line: 534, baseType: !1302, size: 960)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1261, file: !103, line: 534, size: 960, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1302, file: !103, line: 535, baseType: !642, size: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1302, file: !103, line: 536, baseType: !642, size: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1302, file: !103, line: 537, baseType: !482, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1302, file: !103, line: 538, baseType: !482, size: 64, align: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1302, file: !103, line: 539, baseType: !642, size: 32, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1302, file: !103, line: 540, baseType: !642, size: 32, offset: 224)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1302, file: !103, line: 541, baseType: !482, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1302, file: !103, line: 542, baseType: !642, size: 32, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1302, file: !103, line: 543, baseType: !642, size: 32, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1302, file: !103, line: 544, baseType: !416, size: 128, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1302, file: !103, line: 545, baseType: !642, size: 32, offset: 512)
