; ModuleID = '../bcout/drivers/thermal/intel/int340x_thermal/int3402_thermal.llvm.bc'
source_filename = "drivers/thermal/intel/int340x_thermal/int3402_thermal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_int3402_thermal_driver_init6:\09\09\09"
module asm ".long\09int3402_thermal_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_device_mode", file: !65, line: 7, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "./include/uapi/linux/thermal.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "THERMAL_DEVICE_DISABLED", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "THERMAL_DEVICE_ENABLED", value: 1, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_trip_type", file: !65, line: 12, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "THERMAL_TRIP_ACTIVE", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "THERMAL_TRIP_PASSIVE", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "THERMAL_TRIP_HOT", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "THERMAL_TRIP_CRITICAL", value: 3, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_trend", file: !76, line: 40, baseType: !7, size: 32, elements: !77)
!76 = !DIFile(filename: "./include/linux/thermal.h", directory: "/home/lizy2001/genbc/linux")
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "THERMAL_TREND_STABLE", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "THERMAL_TREND_RAISING", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "THERMAL_TREND_DROPPING", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "THERMAL_TREND_RAISE_FULL", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "THERMAL_TREND_DROP_FULL", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_notify_event", file: !76, line: 49, baseType: !7, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93}
!85 = !DIEnumerator(name: "THERMAL_EVENT_UNSPECIFIED", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "THERMAL_EVENT_TEMP_SAMPLE", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "THERMAL_TRIP_VIOLATED", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "THERMAL_TRIP_CHANGED", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "THERMAL_DEVICE_DOWN", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "THERMAL_DEVICE_UP", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "THERMAL_DEVICE_POWER_CAPABILITY_CHANGED", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "THERMAL_TABLE_CHANGED", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "THERMAL_EVENT_KEEP_ALIVE", value: 8, isUnsigned: true)
!94 = !{!95, !98, !99, !1522, !259, !244}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !97, line: 76, flags: DIFlagFwdDecl)
!97 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !101, line: 351, size: 10880, elements: !102)
!101 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!102 = !{!103, !105, !108, !2173, !2174, !2175, !2176, !2177, !2178, !2187, !2204, !2278, !2307, !2331, !2352, !2358, !2367, !2399, !2413, !2435, !2439, !2440, !2441, !2442, !2443, !2444, !2445}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !100, file: !101, line: 352, baseType: !104, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !100, file: !101, line: 353, baseType: !106, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !107, line: 424, baseType: !98)
!107 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !100, file: !101, line: 354, baseType: !109, size: 192, offset: 128)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !110, line: 17, size: 192, elements: !111)
!110 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!111 = !{!112, !114, !2172}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !109, file: !110, line: 18, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !109, file: !110, line: 19, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !110, line: 110, size: 1152, elements: !118)
!118 = !{!119, !123, !127, !136, !2114, !2118, !2122, !2127, !2131, !2132, !2136, !2140, !2144, !2155, !2156, !2157, !2158, !2168}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !117, file: !110, line: 111, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!113, !113}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !117, file: !110, line: 112, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !113}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !117, file: !110, line: 113, baseType: !128, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !134}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !132, line: 30, baseType: !133)
!132 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!133 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !117, file: !110, line: 114, baseType: !137, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !134, !142}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !145)
!145 = !{!146, !1650, !1652, !1655, !1656, !1707, !1801, !1802, !1803, !1804, !1805, !1814, !1919, !1932, !2039, !2040, !2044, !2046, !2047, !2048, !2052, !2058, !2059, !2062, !2063, !2064, !2067, !2068, !2069, !2070, !2102, !2103, !2104, !2107, !2110, !2111, !2112, !2113}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !144, file: !30, line: 462, baseType: !147, size: 512)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !148, line: 64, size: 512, elements: !149)
!148 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!149 = !{!150, !154, !160, !162, !222, !1486, !1640, !1645, !1646, !1647, !1648, !1649}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !147, file: !148, line: 65, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !147, file: !148, line: 66, baseType: !155, size: 128, offset: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !132, line: 178, size: 128, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !132, line: 179, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !155, file: !132, line: 179, baseType: !158, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !147, file: !148, line: 67, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !147, file: !148, line: 68, baseType: !163, size: 64, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !148, line: 192, size: 704, elements: !165)
!165 = !{!166, !167, !183, !184}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !164, file: !148, line: 193, baseType: !155, size: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !164, file: !148, line: 194, baseType: !168, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !169, line: 83, baseType: !170)
!169 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !169, line: 71, elements: !171)
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 72, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 72, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !173, file: !169, line: 73, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !169, line: 20, elements: !177)
!177 = !{!178}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !176, file: !169, line: 21, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !180, line: 25, baseType: !181)
!180 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 25, elements: !182)
!182 = !{}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !164, file: !148, line: 195, baseType: !147, size: 512, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !164, file: !148, line: 196, baseType: !185, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !148, line: 156, size: 192, elements: !188)
!188 = !{!189, !194, !199}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !187, file: !148, line: 157, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!104, !163, !161}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !148, line: 158, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!151, !163, !161}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !187, file: !148, line: 159, baseType: !200, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!104, !163, !161, !204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !148, line: 148, size: 20736, elements: !206)
!206 = !{!207, !212, !216, !217, !221}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !205, file: !148, line: 149, baseType: !208, size: 192)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 192, elements: !210)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!210 = !{!211}
!211 = !DISubrange(count: 3)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !205, file: !148, line: 150, baseType: !213, size: 4096, offset: 192)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 4096, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !205, file: !148, line: 151, baseType: !104, size: 32, offset: 4288)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !148, line: 152, baseType: !218, size: 16384, offset: 4320)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 16384, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 2048)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !205, file: !148, line: 153, baseType: !104, size: 32, offset: 20704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !147, file: !148, line: 69, baseType: !223, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !148, line: 138, size: 448, elements: !225)
!225 = !{!226, !230, !260, !262, !1434, !1465, !1469}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !224, file: !148, line: 139, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{null, !161}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !224, file: !148, line: 140, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !234, line: 230, size: 128, elements: !235)
!234 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!235 = !{!236, !252}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !233, file: !234, line: 231, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!240, !161, !245, !209}
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !132, line: 60, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !242, line: 73, baseType: !243)
!242 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !242, line: 15, baseType: !244)
!244 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !234, line: 30, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !246, file: !234, line: 31, baseType: !151, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !246, file: !234, line: 32, baseType: !250, size: 16, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !132, line: 19, baseType: !251)
!251 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !233, file: !234, line: 232, baseType: !253, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!240, !161, !245, !151, !256}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !132, line: 55, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !242, line: 72, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !242, line: 16, baseType: !259)
!259 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !224, file: !148, line: 141, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !224, file: !148, line: 142, baseType: !263, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !234, line: 84, size: 320, elements: !267)
!267 = !{!268, !269, !273, !1431, !1432}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !234, line: 85, baseType: !151, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !266, file: !234, line: 86, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DISubroutineType(types: !272)
!272 = !{!250, !161, !245, !104}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !266, file: !234, line: 88, baseType: !274, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DISubroutineType(types: !276)
!276 = !{!250, !161, !277, !104}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !234, line: 168, size: 448, elements: !279)
!279 = !{!280, !281, !282, !283, !293, !294}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !278, file: !234, line: 169, baseType: !246, size: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !278, file: !234, line: 170, baseType: !256, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !278, file: !234, line: 171, baseType: !98, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !278, file: !234, line: 172, baseType: !284, size: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!240, !287, !161, !277, !209, !290, !256}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !289, line: 526, flags: DIFlagFwdDecl)
!289 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !132, line: 46, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !242, line: 88, baseType: !292)
!292 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !278, file: !234, line: 174, baseType: !284, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !278, file: !234, line: 176, baseType: !295, size: 64, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!104, !287, !161, !277, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !300, line: 305, size: 1472, elements: !301)
!300 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!301 = !{!302, !303, !304, !305, !306, !314, !315, !1405, !1411, !1412, !1417, !1418, !1421, !1425, !1426, !1427, !1428, !1429}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !299, file: !300, line: 308, baseType: !259, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !299, file: !300, line: 309, baseType: !259, size: 64, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !299, file: !300, line: 313, baseType: !298, size: 64, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !299, file: !300, line: 313, baseType: !298, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !299, file: !300, line: 315, baseType: !307, size: 192, align: 64, offset: 256)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !308, line: 24, size: 192, align: 64, elements: !309)
!308 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!309 = !{!310, !311, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !307, file: !308, line: 25, baseType: !259, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !307, file: !308, line: 26, baseType: !312, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !307, file: !308, line: 27, baseType: !312, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !299, file: !300, line: 323, baseType: !259, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !299, file: !300, line: 327, baseType: !316, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !300, line: 388, size: 7296, elements: !318)
!318 = !{!319, !1401}
!319 = !DIDerivedType(tag: DW_TAG_member, scope: !317, file: !300, line: 389, baseType: !320, size: 7296)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !317, file: !300, line: 389, size: 7296, elements: !321)
!321 = !{!322, !323, !327, !333, !337, !338, !339, !340, !341, !349, !354, !355, !356, !357, !366, !367, !368, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !403, !411, !414, !462, !463, !1371, !1372, !1375, !1379, !1380, !1383, !1384, !1385, !1388, !1400}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !320, file: !300, line: 390, baseType: !298, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !320, file: !300, line: 391, baseType: !324, size: 64, offset: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !308, line: 31, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !324, file: !308, line: 32, baseType: !312, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !320, file: !300, line: 392, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !329, line: 23, baseType: !330)
!329 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !331, line: 31, baseType: !332)
!331 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!332 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !320, file: !300, line: 394, baseType: !334, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!259, !287, !259, !259, !259, !259}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !320, file: !300, line: 398, baseType: !259, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !320, file: !300, line: 399, baseType: !259, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !320, file: !300, line: 405, baseType: !259, size: 64, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !320, file: !300, line: 406, baseType: !259, size: 64, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !320, file: !300, line: 407, baseType: !342, size: 64, offset: 512)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !289, line: 286, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 286, size: 64, elements: !345)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !344, file: !289, line: 286, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !348, line: 18, baseType: !259)
!348 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!349 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !320, file: !300, line: 416, baseType: !350, size: 32, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !132, line: 168, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 166, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !351, file: !132, line: 167, baseType: !104, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !320, file: !300, line: 428, baseType: !350, size: 32, offset: 608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !320, file: !300, line: 437, baseType: !350, size: 32, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !320, file: !300, line: 447, baseType: !350, size: 32, offset: 672)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !320, file: !300, line: 450, baseType: !358, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !359, line: 13, baseType: !360)
!359 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !132, line: 175, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !132, line: 173, size: 64, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !361, file: !132, line: 174, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !329, line: 22, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !331, line: 30, baseType: !292)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !320, file: !300, line: 452, baseType: !104, size: 32, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !320, file: !300, line: 454, baseType: !168, offset: 800)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !320, file: !300, line: 457, baseType: !369, size: 256, offset: 832)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !370, line: 35, size: 256, elements: !371)
!370 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!371 = !{!372, !373, !374, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !369, file: !370, line: 36, baseType: !358, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !369, file: !370, line: 42, baseType: !358, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !369, file: !370, line: 46, baseType: !375, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !169, line: 29, baseType: !176)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !369, file: !370, line: 47, baseType: !155, size: 128, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !320, file: !300, line: 459, baseType: !155, size: 128, offset: 1088)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !320, file: !300, line: 466, baseType: !259, size: 64, offset: 1216)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !320, file: !300, line: 467, baseType: !259, size: 64, offset: 1280)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !320, file: !300, line: 469, baseType: !259, size: 64, offset: 1344)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !320, file: !300, line: 470, baseType: !259, size: 64, offset: 1408)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !320, file: !300, line: 471, baseType: !360, size: 64, offset: 1472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !320, file: !300, line: 472, baseType: !259, size: 64, offset: 1536)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !320, file: !300, line: 473, baseType: !259, size: 64, offset: 1600)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !320, file: !300, line: 474, baseType: !259, size: 64, offset: 1664)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !320, file: !300, line: 475, baseType: !259, size: 64, offset: 1728)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !320, file: !300, line: 477, baseType: !168, offset: 1792)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !320, file: !300, line: 478, baseType: !259, size: 64, offset: 1792)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !320, file: !300, line: 478, baseType: !259, size: 64, offset: 1856)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !320, file: !300, line: 478, baseType: !259, size: 64, offset: 1920)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !320, file: !300, line: 478, baseType: !259, size: 64, offset: 1984)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !320, file: !300, line: 479, baseType: !259, size: 64, offset: 2048)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !320, file: !300, line: 479, baseType: !259, size: 64, offset: 2112)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !320, file: !300, line: 479, baseType: !259, size: 64, offset: 2176)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !320, file: !300, line: 480, baseType: !259, size: 64, offset: 2240)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !320, file: !300, line: 480, baseType: !259, size: 64, offset: 2304)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !320, file: !300, line: 480, baseType: !259, size: 64, offset: 2368)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !320, file: !300, line: 480, baseType: !259, size: 64, offset: 2432)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !320, file: !300, line: 482, baseType: !400, size: 2816, offset: 2496)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 2816, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 44)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !320, file: !300, line: 488, baseType: !404, size: 256, offset: 5312)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !405, line: 60, size: 256, elements: !406)
!405 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !404, file: !405, line: 61, baseType: !408, size: 256)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 256, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 4)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !320, file: !300, line: 490, baseType: !412, size: 64, offset: 5568)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !300, line: 490, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !320, file: !300, line: 493, baseType: !415, size: 896, offset: 5632)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !416, line: 53, baseType: !417)
!416 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 13, size: 896, elements: !418)
!418 = !{!419, !420, !421, !422, !425, !426, !433, !434, !454, !455, !458}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !417, file: !416, line: 18, baseType: !328, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !417, file: !416, line: 28, baseType: !360, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !417, file: !416, line: 31, baseType: !369, size: 256, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !417, file: !416, line: 32, baseType: !423, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !416, line: 32, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !417, file: !416, line: 37, baseType: !251, size: 16, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !417, file: !416, line: 40, baseType: !427, size: 192, offset: 512)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !428, line: 53, size: 192, elements: !429)
!428 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !427, file: !428, line: 54, baseType: !358, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !427, file: !428, line: 55, baseType: !168, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !427, file: !428, line: 59, baseType: !155, size: 128, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !417, file: !416, line: 41, baseType: !98, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !417, file: !416, line: 42, baseType: !435, size: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !438, line: 13, size: 896, elements: !439)
!438 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !438, line: 14, baseType: !98, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !437, file: !438, line: 15, baseType: !259, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !437, file: !438, line: 17, baseType: !259, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !437, file: !438, line: 17, baseType: !259, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !437, file: !438, line: 19, baseType: !244, size: 64, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !437, file: !438, line: 21, baseType: !244, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !437, file: !438, line: 22, baseType: !244, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !437, file: !438, line: 23, baseType: !244, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !437, file: !438, line: 24, baseType: !244, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !437, file: !438, line: 25, baseType: !244, size: 64, offset: 576)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !437, file: !438, line: 26, baseType: !244, size: 64, offset: 640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !437, file: !438, line: 27, baseType: !244, size: 64, offset: 704)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !437, file: !438, line: 28, baseType: !244, size: 64, offset: 768)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !437, file: !438, line: 29, baseType: !244, size: 64, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !417, file: !416, line: 44, baseType: !350, size: 32, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !417, file: !416, line: 50, baseType: !456, size: 16, offset: 864)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !329, line: 19, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !331, line: 24, baseType: !251)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !417, file: !416, line: 51, baseType: !459, size: 16, offset: 880)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !329, line: 18, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !331, line: 23, baseType: !461)
!461 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !300, line: 495, baseType: !259, size: 64, offset: 6528)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !320, file: !300, line: 497, baseType: !464, size: 64, offset: 6592)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !300, line: 381, size: 384, elements: !466)
!466 = !{!467, !468, !1370}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !465, file: !300, line: 382, baseType: !350, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !465, file: !300, line: 383, baseType: !469, size: 128, offset: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !300, line: 376, size: 128, elements: !470)
!470 = !{!471, !1368}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !469, file: !300, line: 377, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !474, line: 640, size: 48640, elements: !475)
!474 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!475 = !{!476, !484, !486, !487, !493, !494, !495, !496, !497, !498, !499, !500, !504, !522, !533, !628, !629, !630, !641, !642, !644, !645, !646, !647, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !726, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !782, !784, !785, !786, !798, !800, !801, !802, !803, !804, !810, !811, !812, !813, !814, !815, !816, !828, !833, !838, !839, !840, !843, !847, !850, !853, !856, !859, !863, !866, !869, !875, !876, !877, !883, !884, !885, !886, !887, !896, !897, !898, !899, !900, !905, !906, !907, !910, !911, !914, !917, !920, !923, !926, !929, !930, !1010, !1013, !1016, !1017, !1020, !1021, !1022, !1028, !1029, !1030, !1043, !1044, !1045, !1055, !1060, !1063, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !473, file: !474, line: 646, baseType: !477, size: 128)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !478, line: 56, size: 128, elements: !479)
!478 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !477, file: !478, line: 57, baseType: !259, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !477, file: !478, line: 58, baseType: !482, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !329, line: 21, baseType: !483)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !331, line: 27, baseType: !7)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !473, file: !474, line: 649, baseType: !485, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !244)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !473, file: !474, line: 657, baseType: !98, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !473, file: !474, line: 658, baseType: !488, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !489, line: 113, baseType: !490)
!489 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !489, line: 111, size: 32, elements: !491)
!491 = !{!492}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !490, file: !489, line: 112, baseType: !350, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !474, line: 660, baseType: !7, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !473, file: !474, line: 661, baseType: !7, size: 32, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !473, file: !474, line: 684, baseType: !104, size: 32, offset: 352)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !473, file: !474, line: 686, baseType: !104, size: 32, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !473, file: !474, line: 687, baseType: !104, size: 32, offset: 416)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !473, file: !474, line: 688, baseType: !104, size: 32, offset: 448)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !473, file: !474, line: 689, baseType: !7, size: 32, offset: 480)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !473, file: !474, line: 691, baseType: !501, size: 64, offset: 512)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !474, line: 691, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !473, file: !474, line: 692, baseType: !505, size: 832, offset: 576)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !474, line: 451, size: 832, elements: !506)
!506 = !{!507, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !505, file: !474, line: 453, baseType: !508, size: 128)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !474, line: 325, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !508, file: !474, line: 326, baseType: !259, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !508, file: !474, line: 327, baseType: !482, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !505, file: !474, line: 454, baseType: !307, size: 192, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !505, file: !474, line: 455, baseType: !155, size: 128, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !505, file: !474, line: 456, baseType: !7, size: 32, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !505, file: !474, line: 458, baseType: !328, size: 64, offset: 512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !505, file: !474, line: 459, baseType: !328, size: 64, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !505, file: !474, line: 460, baseType: !328, size: 64, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !505, file: !474, line: 461, baseType: !328, size: 64, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !505, file: !474, line: 463, baseType: !328, size: 64, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !505, file: !474, line: 465, baseType: !521, offset: 832)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !474, line: 415, elements: !182)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !473, file: !474, line: 693, baseType: !523, size: 384, offset: 1408)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !474, line: 489, size: 384, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !523, file: !474, line: 490, baseType: !155, size: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !523, file: !474, line: 491, baseType: !259, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !523, file: !474, line: 492, baseType: !259, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !523, file: !474, line: 493, baseType: !7, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !523, file: !474, line: 494, baseType: !251, size: 16, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !523, file: !474, line: 495, baseType: !251, size: 16, offset: 304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !523, file: !474, line: 497, baseType: !532, size: 64, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !473, file: !474, line: 697, baseType: !534, size: 1792, offset: 1792)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !474, line: 507, size: 1792, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !625, !626}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !534, file: !474, line: 508, baseType: !307, size: 192, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !534, file: !474, line: 515, baseType: !328, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !534, file: !474, line: 516, baseType: !328, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !534, file: !474, line: 517, baseType: !328, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !534, file: !474, line: 518, baseType: !328, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !534, file: !474, line: 519, baseType: !328, size: 64, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !534, file: !474, line: 526, baseType: !364, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !534, file: !474, line: 527, baseType: !328, size: 64, offset: 576)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !534, file: !474, line: 528, baseType: !7, size: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !534, file: !474, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !534, file: !474, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !534, file: !474, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !534, file: !474, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !534, file: !474, line: 563, baseType: !550, size: 512, offset: 704)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !551)
!551 = !{!552, !560, !561, !566, !618, !622, !623, !624}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !550, file: !6, line: 119, baseType: !553, size: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !554, line: 9, size: 256, elements: !555)
!554 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !553, file: !554, line: 10, baseType: !307, size: 192, align: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !553, file: !554, line: 11, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !559, line: 29, baseType: !364)
!559 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !550, file: !6, line: 120, baseType: !558, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !550, file: !6, line: 121, baseType: !562, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!5, !565}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !550, file: !6, line: 122, baseType: !567, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !569)
!569 = !{!570, !590, !591, !594, !604, !605, !613, !617}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !568, file: !6, line: 160, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !572, file: !6, line: 215, baseType: !375)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !572, file: !6, line: 216, baseType: !7, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !572, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !572, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !572, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !572, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !572, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !572, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !572, file: !6, line: 233, baseType: !558, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !572, file: !6, line: 234, baseType: !565, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !572, file: !6, line: 235, baseType: !558, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !572, file: !6, line: 236, baseType: !565, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !572, file: !6, line: 237, baseType: !587, size: 4096, offset: 512)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 4096, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !568, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !568, file: !6, line: 162, baseType: !592, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !132, line: 27, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !242, line: 96, baseType: !104)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !568, file: !6, line: 163, baseType: !595, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !596, line: 276, baseType: !597)
!596 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !596, line: 276, size: 32, elements: !598)
!598 = !{!599}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !597, file: !596, line: 276, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !596, line: 70, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !596, line: 65, size: 32, elements: !602)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !601, file: !596, line: 66, baseType: !7, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !568, file: !6, line: 164, baseType: !565, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !568, file: !6, line: 165, baseType: !606, size: 128, offset: 256)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !554, line: 14, size: 128, elements: !607)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !606, file: !554, line: 15, baseType: !609, size: 128)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !308, line: 125, size: 128, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !609, file: !308, line: 126, baseType: !324, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !609, file: !308, line: 127, baseType: !312, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !568, file: !6, line: 166, baseType: !614, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!558}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !568, file: !6, line: 167, baseType: !558, size: 64, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !550, file: !6, line: 123, baseType: !619, size: 8, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !329, line: 17, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !331, line: 21, baseType: !621)
!621 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !550, file: !6, line: 124, baseType: !619, size: 8, offset: 456)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !550, file: !6, line: 125, baseType: !619, size: 8, offset: 464)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !550, file: !6, line: 126, baseType: !619, size: 8, offset: 472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !534, file: !474, line: 572, baseType: !550, size: 512, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !534, file: !474, line: 580, baseType: !627, size: 64, offset: 1728)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !473, file: !474, line: 721, baseType: !7, size: 32, offset: 3584)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !473, file: !474, line: 722, baseType: !104, size: 32, offset: 3616)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !473, file: !474, line: 723, baseType: !631, size: 64, offset: 3648)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !634, line: 17, baseType: !635)
!634 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !634, line: 17, size: 64, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !635, file: !634, line: 17, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 64, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 1)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !473, file: !474, line: 724, baseType: !633, size: 64, offset: 3712)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !473, file: !474, line: 749, baseType: !643, offset: 3776)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !474, line: 290, elements: !182)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !473, file: !474, line: 751, baseType: !155, size: 128, offset: 3776)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !473, file: !474, line: 757, baseType: !316, size: 64, offset: 3904)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !473, file: !474, line: 758, baseType: !316, size: 64, offset: 3968)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !473, file: !474, line: 761, baseType: !648, size: 320, offset: 4032)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !405, line: 34, size: 320, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !648, file: !405, line: 35, baseType: !328, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !648, file: !405, line: 36, baseType: !652, size: 256, offset: 64)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 256, elements: !409)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !473, file: !474, line: 766, baseType: !104, size: 32, offset: 4352)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !473, file: !474, line: 767, baseType: !104, size: 32, offset: 4384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !473, file: !474, line: 768, baseType: !104, size: 32, offset: 4416)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !473, file: !474, line: 770, baseType: !104, size: 32, offset: 4448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !473, file: !474, line: 772, baseType: !259, size: 64, offset: 4480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !473, file: !474, line: 775, baseType: !7, size: 32, offset: 4544)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !473, file: !474, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !473, file: !474, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !473, file: !474, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !473, file: !474, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !473, file: !474, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !473, file: !474, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !473, file: !474, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !473, file: !474, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !473, file: !474, line: 831, baseType: !259, size: 64, offset: 4672)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !473, file: !474, line: 833, baseType: !669, size: 384, offset: 4736)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !670)
!670 = !{!671, !676}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !669, file: !12, line: 26, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!244, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, scope: !669, file: !12, line: 27, baseType: !677, size: 320, offset: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !669, file: !12, line: 27, size: 320, elements: !678)
!678 = !{!679, !689, !716}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !677, file: !12, line: 36, baseType: !680, size: 320)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !12, line: 29, size: 320, elements: !681)
!681 = !{!682, !684, !685, !686, !687, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !680, file: !12, line: 30, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !680, file: !12, line: 31, baseType: !482, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !12, line: 32, baseType: !482, size: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !680, file: !12, line: 33, baseType: !482, size: 32, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !680, file: !12, line: 34, baseType: !328, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !680, file: !12, line: 35, baseType: !683, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !677, file: !12, line: 46, baseType: !690, size: 192)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !12, line: 38, size: 192, elements: !691)
!691 = !{!692, !693, !694, !715}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !690, file: !12, line: 39, baseType: !592, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, scope: !690, file: !12, line: 41, baseType: !695, size: 64, offset: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !690, file: !12, line: 41, size: 64, elements: !696)
!696 = !{!697, !705}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !695, file: !12, line: 42, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !700, line: 7, size: 128, elements: !701)
!700 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!701 = !{!702, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !699, file: !700, line: 8, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !242, line: 93, baseType: !292)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !699, file: !700, line: 9, baseType: !292, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !695, file: !12, line: 43, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !708, line: 7, size: 64, elements: !709)
!708 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!709 = !{!710, !714}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !707, file: !708, line: 8, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !708, line: 5, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !329, line: 20, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !331, line: 26, baseType: !104)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !707, file: !708, line: 9, baseType: !712, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !690, file: !12, line: 45, baseType: !328, size: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !677, file: !12, line: 54, baseType: !717, size: 256)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !12, line: 48, size: 256, elements: !718)
!718 = !{!719, !722, !723, !724, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !717, file: !12, line: 49, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !717, file: !12, line: 50, baseType: !104, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !717, file: !12, line: 51, baseType: !104, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !717, file: !12, line: 52, baseType: !259, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !717, file: !12, line: 53, baseType: !259, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !473, file: !474, line: 835, baseType: !727, size: 32, offset: 5120)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !132, line: 22, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !242, line: 28, baseType: !104)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !473, file: !474, line: 836, baseType: !727, size: 32, offset: 5152)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !473, file: !474, line: 840, baseType: !259, size: 64, offset: 5184)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !473, file: !474, line: 849, baseType: !472, size: 64, offset: 5248)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !473, file: !474, line: 852, baseType: !472, size: 64, offset: 5312)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !473, file: !474, line: 857, baseType: !155, size: 128, offset: 5376)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !473, file: !474, line: 858, baseType: !155, size: 128, offset: 5504)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !473, file: !474, line: 859, baseType: !472, size: 64, offset: 5632)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !473, file: !474, line: 867, baseType: !155, size: 128, offset: 5696)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !473, file: !474, line: 868, baseType: !155, size: 128, offset: 5824)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !473, file: !474, line: 871, baseType: !739, size: 64, offset: 5952)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !741, line: 59, size: 768, elements: !742)
!741 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!742 = !{!743, !744, !745, !746, !757, !758, !765, !774}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !740, file: !741, line: 61, baseType: !488, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !740, file: !741, line: 62, baseType: !7, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !740, file: !741, line: 63, baseType: !168, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !740, file: !741, line: 65, baseType: !747, size: 256, offset: 64)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 256, elements: !409)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !132, line: 182, size: 64, elements: !749)
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !748, file: !132, line: 183, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !132, line: 186, size: 128, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !752, file: !132, line: 187, baseType: !751, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !752, file: !132, line: 187, baseType: !756, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !740, file: !741, line: 66, baseType: !748, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !740, file: !741, line: 68, baseType: !759, size: 128, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !760, line: 40, baseType: !761)
!760 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !760, line: 36, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !761, file: !760, line: 37, baseType: !168)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !761, file: !760, line: 38, baseType: !155, size: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !740, file: !741, line: 69, baseType: !766, size: 128, align: 64, offset: 512)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !132, line: 216, size: 128, align: 64, elements: !767)
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !132, line: 217, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !766, file: !132, line: 218, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !769}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !740, file: !741, line: 70, baseType: !775, size: 128, offset: 640)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 128, elements: !639)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !741, line: 54, size: 128, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !776, file: !741, line: 55, baseType: !104, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !776, file: !741, line: 56, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !741, line: 56, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !473, file: !474, line: 872, baseType: !783, size: 512, offset: 6016)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 512, elements: !409)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !473, file: !474, line: 873, baseType: !155, size: 128, offset: 6528)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !473, file: !474, line: 874, baseType: !155, size: 128, offset: 6656)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !473, file: !474, line: 876, baseType: !787, size: 64, offset: 6784)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !789, line: 26, size: 192, elements: !790)
!789 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !788, file: !789, line: 27, baseType: !7, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !788, file: !789, line: 28, baseType: !793, size: 128, offset: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !794, line: 43, size: 128, elements: !795)
!794 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !793, file: !794, line: 44, baseType: !375)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !793, file: !794, line: 45, baseType: !155, size: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !473, file: !474, line: 879, baseType: !799, size: 64, offset: 6848)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !473, file: !474, line: 882, baseType: !799, size: 64, offset: 6912)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !473, file: !474, line: 884, baseType: !328, size: 64, offset: 6976)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !473, file: !474, line: 885, baseType: !328, size: 64, offset: 7040)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !473, file: !474, line: 890, baseType: !328, size: 64, offset: 7104)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !473, file: !474, line: 891, baseType: !805, size: 128, offset: 7168)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !474, line: 242, size: 128, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !805, file: !474, line: 244, baseType: !328, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !805, file: !474, line: 245, baseType: !328, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !805, file: !474, line: 246, baseType: !375, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !473, file: !474, line: 900, baseType: !259, size: 64, offset: 7296)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !473, file: !474, line: 901, baseType: !259, size: 64, offset: 7360)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !473, file: !474, line: 904, baseType: !328, size: 64, offset: 7424)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !473, file: !474, line: 907, baseType: !328, size: 64, offset: 7488)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !473, file: !474, line: 910, baseType: !259, size: 64, offset: 7552)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !473, file: !474, line: 911, baseType: !259, size: 64, offset: 7616)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !473, file: !474, line: 914, baseType: !817, size: 640, offset: 7680)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !818, line: 123, size: 640, elements: !819)
!818 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!819 = !{!820, !826, !827}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !817, file: !818, line: 124, baseType: !821, size: 576)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 576, elements: !210)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !818, line: 108, size: 192, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !822, file: !818, line: 109, baseType: !328, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !822, file: !818, line: 110, baseType: !606, size: 128, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !817, file: !818, line: 125, baseType: !7, size: 32, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !817, file: !818, line: 126, baseType: !7, size: 32, offset: 608)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !473, file: !474, line: 917, baseType: !829, size: 192, offset: 8320)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !818, line: 134, size: 192, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !829, file: !818, line: 135, baseType: !766, size: 128, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !829, file: !818, line: 136, baseType: !7, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !473, file: !474, line: 923, baseType: !834, size: 64, offset: 8512)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !837, line: 11, flags: DIFlagFwdDecl)
!837 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!838 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !473, file: !474, line: 926, baseType: !834, size: 64, offset: 8576)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !473, file: !474, line: 929, baseType: !834, size: 64, offset: 8640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !473, file: !474, line: 933, baseType: !841, size: 64, offset: 8704)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !474, line: 933, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !473, file: !474, line: 943, baseType: !844, size: 128, offset: 8768)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 128, elements: !845)
!845 = !{!846}
!846 = !DISubrange(count: 16)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !473, file: !474, line: 945, baseType: !848, size: 64, offset: 8896)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !474, line: 49, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !473, file: !474, line: 956, baseType: !851, size: 64, offset: 8960)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !474, line: 45, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !473, file: !474, line: 959, baseType: !854, size: 64, offset: 9024)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !474, line: 959, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !473, file: !474, line: 962, baseType: !857, size: 64, offset: 9088)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !474, line: 66, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !473, file: !474, line: 966, baseType: !860, size: 64, offset: 9152)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !862, line: 35, flags: DIFlagFwdDecl)
!862 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!863 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !473, file: !474, line: 969, baseType: !864, size: 64, offset: 9216)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !818, line: 223, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !473, file: !474, line: 970, baseType: !867, size: 64, offset: 9280)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !474, line: 62, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !473, file: !474, line: 971, baseType: !870, size: 64, offset: 9344)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !871, line: 25, baseType: !872)
!871 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !871, line: 23, size: 64, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !872, file: !871, line: 24, baseType: !638, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !473, file: !474, line: 972, baseType: !870, size: 64, offset: 9408)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !473, file: !474, line: 974, baseType: !870, size: 64, offset: 9472)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !473, file: !474, line: 975, baseType: !878, size: 192, offset: 9536)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !879, line: 30, size: 192, elements: !880)
!879 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !878, file: !879, line: 31, baseType: !155, size: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !878, file: !879, line: 32, baseType: !870, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !473, file: !474, line: 976, baseType: !259, size: 64, offset: 9728)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !473, file: !474, line: 977, baseType: !256, size: 64, offset: 9792)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !473, file: !474, line: 978, baseType: !7, size: 32, offset: 9856)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !473, file: !474, line: 980, baseType: !769, size: 64, offset: 9920)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !473, file: !474, line: 989, baseType: !888, size: 128, offset: 9984)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !889, line: 35, size: 128, elements: !890)
!889 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!890 = !{!891, !892, !893}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !888, file: !889, line: 36, baseType: !104, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !888, file: !889, line: 37, baseType: !350, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !888, file: !889, line: 38, baseType: !894, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !889, line: 23, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !473, file: !474, line: 992, baseType: !328, size: 64, offset: 10112)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !473, file: !474, line: 993, baseType: !328, size: 64, offset: 10176)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !473, file: !474, line: 996, baseType: !168, offset: 10240)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !473, file: !474, line: 999, baseType: !375, offset: 10240)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !473, file: !474, line: 1001, baseType: !901, size: 64, offset: 10240)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !474, line: 636, size: 64, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !474, line: 637, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !473, file: !474, line: 1005, baseType: !609, size: 128, offset: 10304)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !473, file: !474, line: 1007, baseType: !472, size: 64, offset: 10432)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !473, file: !474, line: 1009, baseType: !908, size: 64, offset: 10496)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !474, line: 1009, flags: DIFlagFwdDecl)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !473, file: !474, line: 1043, baseType: !98, size: 64, offset: 10560)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !473, file: !474, line: 1046, baseType: !912, size: 64, offset: 10624)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !474, line: 41, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !473, file: !474, line: 1050, baseType: !915, size: 64, offset: 10688)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !474, line: 42, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !473, file: !474, line: 1054, baseType: !918, size: 64, offset: 10752)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !474, line: 55, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !473, file: !474, line: 1056, baseType: !921, size: 64, offset: 10816)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !474, line: 40, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !473, file: !474, line: 1058, baseType: !924, size: 64, offset: 10880)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !474, line: 47, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !473, file: !474, line: 1061, baseType: !927, size: 64, offset: 10944)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !474, line: 43, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !473, file: !474, line: 1064, baseType: !259, size: 64, offset: 11008)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !473, file: !474, line: 1065, baseType: !931, size: 64, offset: 11072)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !879, line: 14, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !879, line: 12, size: 384, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, scope: !933, file: !879, line: 13, baseType: !936, size: 384)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !879, line: 13, size: 384, elements: !937)
!937 = !{!938, !939, !940, !941}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !936, file: !879, line: 13, baseType: !104, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !936, file: !879, line: 13, baseType: !104, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !936, file: !879, line: 13, baseType: !104, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !936, file: !879, line: 13, baseType: !942, size: 256, offset: 128)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !943, line: 32, size: 256, elements: !944)
!943 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!944 = !{!945, !951, !964, !970, !979, !999, !1004}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !942, file: !943, line: 37, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !942, file: !943, line: 34, size: 64, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !946, file: !943, line: 35, baseType: !728, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !946, file: !943, line: 36, baseType: !950, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !242, line: 49, baseType: !7)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !942, file: !943, line: 45, baseType: !952, size: 192)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !942, file: !943, line: 40, size: 192, elements: !953)
!953 = !{!954, !956, !957, !963}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !952, file: !943, line: 41, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !242, line: 95, baseType: !104)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !952, file: !943, line: 42, baseType: !104, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !952, file: !943, line: 43, baseType: !958, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !943, line: 11, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !943, line: 8, size: 64, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !959, file: !943, line: 9, baseType: !104, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !959, file: !943, line: 10, baseType: !98, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !952, file: !943, line: 44, baseType: !104, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !942, file: !943, line: 52, baseType: !965, size: 128)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !942, file: !943, line: 48, size: 128, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !965, file: !943, line: 49, baseType: !728, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !965, file: !943, line: 50, baseType: !950, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !965, file: !943, line: 51, baseType: !958, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !942, file: !943, line: 61, baseType: !971, size: 256)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !942, file: !943, line: 55, size: 256, elements: !972)
!972 = !{!973, !974, !975, !976, !978}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !971, file: !943, line: 56, baseType: !728, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !971, file: !943, line: 57, baseType: !950, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !971, file: !943, line: 58, baseType: !104, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !971, file: !943, line: 59, baseType: !977, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !242, line: 94, baseType: !243)
