; ModuleID = '../bcout/drivers/thermal/intel/int340x_thermal/int3403_thermal.llvm.bc'
source_filename = "drivers/thermal/intel/int340x_thermal/int3403_thermal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_int3403_driver_init6:\09\09\09"
module asm ".long\09int3403_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irq_domain_bus_token", file: !51, line: 76, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/irqdomain.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!53 = !DIEnumerator(name: "DOMAIN_BUS_ANY", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "DOMAIN_BUS_WIRED", value: 1, isUnsigned: true)
!55 = !DIEnumerator(name: "DOMAIN_BUS_GENERIC_MSI", value: 2, isUnsigned: true)
!56 = !DIEnumerator(name: "DOMAIN_BUS_PCI_MSI", value: 3, isUnsigned: true)
!57 = !DIEnumerator(name: "DOMAIN_BUS_PLATFORM_MSI", value: 4, isUnsigned: true)
!58 = !DIEnumerator(name: "DOMAIN_BUS_NEXUS", value: 5, isUnsigned: true)
!59 = !DIEnumerator(name: "DOMAIN_BUS_IPI", value: 6, isUnsigned: true)
!60 = !DIEnumerator(name: "DOMAIN_BUS_FSL_MC_MSI", value: 7, isUnsigned: true)
!61 = !DIEnumerator(name: "DOMAIN_BUS_TI_SCI_INTA_MSI", value: 8, isUnsigned: true)
!62 = !DIEnumerator(name: "DOMAIN_BUS_WAKEUP", value: 9, isUnsigned: true)
!63 = !DIEnumerator(name: "DOMAIN_BUS_VMD_MSI", value: 10, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_device_mode", file: !65, line: 7, baseType: !7, size: 32, elements: !66)
!65 = !DIFile(filename: "./include/uapi/linux/thermal.h", directory: "/home/lizy2001/genbc/linux")
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "THERMAL_DEVICE_DISABLED", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "THERMAL_DEVICE_ENABLED", value: 1, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_trip_type", file: !65, line: 12, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "THERMAL_TRIP_ACTIVE", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "THERMAL_TRIP_PASSIVE", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "THERMAL_TRIP_HOT", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "THERMAL_TRIP_CRITICAL", value: 3, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_trend", file: !76, line: 40, baseType: !7, size: 32, elements: !77)
!76 = !DIFile(filename: "./include/linux/thermal.h", directory: "/home/lizy2001/genbc/linux")
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "THERMAL_TREND_STABLE", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "THERMAL_TREND_RAISING", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "THERMAL_TREND_DROPPING", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "THERMAL_TREND_RAISE_FULL", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "THERMAL_TREND_DROP_FULL", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_notify_event", file: !76, line: 49, baseType: !7, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93}
!85 = !DIEnumerator(name: "THERMAL_EVENT_UNSPECIFIED", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "THERMAL_EVENT_TEMP_SAMPLE", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "THERMAL_TRIP_VIOLATED", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "THERMAL_TRIP_CHANGED", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "THERMAL_DEVICE_DOWN", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "THERMAL_DEVICE_UP", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "THERMAL_DEVICE_POWER_CAPABILITY_CHANGED", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "THERMAL_TABLE_CHANGED", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "THERMAL_EVENT_KEEP_ALIVE", value: 8, isUnsigned: true)
!94 = !{!95, !98, !100, !101, !260, !245}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !97, line: 76, flags: DIFlagFwdDecl)
!97 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !99, line: 148, baseType: !7)
!99 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !103, line: 351, size: 10880, elements: !104)
!103 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!104 = !{!105, !107, !110, !2173, !2174, !2175, !2176, !2177, !2178, !2187, !2204, !2278, !2307, !2331, !2352, !2358, !2367, !2399, !2413, !2435, !2439, !2440, !2441, !2442, !2443, !2444, !2445}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !102, file: !103, line: 352, baseType: !106, size: 32)
!106 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !102, file: !103, line: 353, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !109, line: 424, baseType: !100)
!109 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!110 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !102, file: !103, line: 354, baseType: !111, size: 192, offset: 128)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !112, line: 17, size: 192, elements: !113)
!112 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!113 = !{!114, !116, !2172}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !111, file: !112, line: 18, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !111, file: !112, line: 19, baseType: !117, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !112, line: 110, size: 1152, elements: !120)
!120 = !{!121, !125, !129, !137, !2114, !2118, !2122, !2127, !2131, !2132, !2136, !2140, !2144, !2155, !2156, !2157, !2158, !2168}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !119, file: !112, line: 111, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!115, !115}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !119, file: !112, line: 112, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !115}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !119, file: !112, line: 113, baseType: !130, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !99, line: 30, baseType: !134)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !119, file: !112, line: 114, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !135, !143}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !146)
!146 = !{!147, !1650, !1652, !1655, !1656, !1707, !1801, !1802, !1803, !1804, !1805, !1814, !1919, !1932, !2039, !2040, !2044, !2046, !2047, !2048, !2052, !2058, !2059, !2062, !2063, !2064, !2067, !2068, !2069, !2070, !2102, !2103, !2104, !2107, !2110, !2111, !2112, !2113}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !145, file: !30, line: 462, baseType: !148, size: 512)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !149, line: 64, size: 512, elements: !150)
!149 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!150 = !{!151, !155, !161, !163, !223, !1487, !1640, !1645, !1646, !1647, !1648, !1649}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 65, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !148, file: !149, line: 66, baseType: !156, size: 128, offset: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !99, line: 178, size: 128, elements: !157)
!157 = !{!158, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !99, line: 179, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !99, line: 179, baseType: !159, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !148, file: !149, line: 67, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !148, file: !149, line: 68, baseType: !164, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !149, line: 192, size: 704, elements: !166)
!166 = !{!167, !168, !184, !185}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !165, file: !149, line: 193, baseType: !156, size: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !165, file: !149, line: 194, baseType: !169, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !170, line: 83, baseType: !171)
!170 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !170, line: 71, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !170, line: 72, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !170, line: 72, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !174, file: !170, line: 73, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !170, line: 20, elements: !178)
!178 = !{!179}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !177, file: !170, line: 21, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !181, line: 25, baseType: !182)
!181 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 25, elements: !183)
!183 = !{}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !165, file: !149, line: 195, baseType: !148, size: 512, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !165, file: !149, line: 196, baseType: !186, size: 64, offset: 640)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !149, line: 156, size: 192, elements: !189)
!189 = !{!190, !195, !200}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !188, file: !149, line: 157, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DISubroutineType(types: !194)
!194 = !{!106, !164, !162}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !149, line: 158, baseType: !196, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!152, !164, !162}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !188, file: !149, line: 159, baseType: !201, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!106, !164, !162, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !149, line: 148, size: 20736, elements: !207)
!207 = !{!208, !213, !217, !218, !222}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !206, file: !149, line: 149, baseType: !209, size: 192)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 192, elements: !211)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!211 = !{!212}
!212 = !DISubrange(count: 3)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !206, file: !149, line: 150, baseType: !214, size: 4096, offset: 192)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 4096, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !206, file: !149, line: 151, baseType: !106, size: 32, offset: 4288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !206, file: !149, line: 152, baseType: !219, size: 16384, offset: 4320)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 16384, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 2048)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !206, file: !149, line: 153, baseType: !106, size: 32, offset: 20704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !148, file: !149, line: 69, baseType: !224, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !149, line: 138, size: 448, elements: !226)
!226 = !{!227, !231, !261, !263, !1435, !1466, !1470}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !225, file: !149, line: 139, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !162}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !225, file: !149, line: 140, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !235, line: 230, size: 128, elements: !236)
!235 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!236 = !{!237, !253}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !234, file: !235, line: 231, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!241, !162, !246, !210}
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !99, line: 60, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !243, line: 73, baseType: !244)
!243 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !243, line: 15, baseType: !245)
!245 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !235, line: 30, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !247, file: !235, line: 31, baseType: !152, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !247, file: !235, line: 32, baseType: !251, size: 16, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !99, line: 19, baseType: !252)
!252 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !234, file: !235, line: 232, baseType: !254, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!241, !162, !246, !152, !257}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 55, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !243, line: 72, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !243, line: 16, baseType: !260)
!260 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !225, file: !149, line: 141, baseType: !262, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !225, file: !149, line: 142, baseType: !264, size: 64, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !235, line: 84, size: 320, elements: !268)
!268 = !{!269, !270, !274, !1432, !1433}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !235, line: 85, baseType: !152, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !267, file: !235, line: 86, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = !DISubroutineType(types: !273)
!273 = !{!251, !162, !246, !106}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !267, file: !235, line: 88, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DISubroutineType(types: !277)
!277 = !{!251, !162, !278, !106}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !235, line: 168, size: 448, elements: !280)
!280 = !{!281, !282, !283, !284, !294, !295}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !279, file: !235, line: 169, baseType: !247, size: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !279, file: !235, line: 170, baseType: !257, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !279, file: !235, line: 171, baseType: !100, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !279, file: !235, line: 172, baseType: !285, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{!241, !288, !162, !278, !210, !291, !257}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !290, line: 526, flags: DIFlagFwdDecl)
!290 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !99, line: 46, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !243, line: 88, baseType: !293)
!293 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !279, file: !235, line: 174, baseType: !285, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !279, file: !235, line: 176, baseType: !296, size: 64, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!106, !288, !162, !278, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !301, line: 305, size: 1472, elements: !302)
!301 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!302 = !{!303, !304, !305, !306, !307, !315, !316, !1406, !1412, !1413, !1418, !1419, !1422, !1426, !1427, !1428, !1429, !1430}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !300, file: !301, line: 308, baseType: !260, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !300, file: !301, line: 309, baseType: !260, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !300, file: !301, line: 313, baseType: !299, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !300, file: !301, line: 313, baseType: !299, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !300, file: !301, line: 315, baseType: !308, size: 192, align: 64, offset: 256)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !309, line: 24, size: 192, align: 64, elements: !310)
!309 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!310 = !{!311, !312, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !308, file: !309, line: 25, baseType: !260, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !308, file: !309, line: 26, baseType: !313, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !308, file: !309, line: 27, baseType: !313, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !300, file: !301, line: 323, baseType: !260, size: 64, offset: 448)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !300, file: !301, line: 327, baseType: !317, size: 64, offset: 512)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !301, line: 388, size: 7296, elements: !319)
!319 = !{!320, !1402}
!320 = !DIDerivedType(tag: DW_TAG_member, scope: !318, file: !301, line: 389, baseType: !321, size: 7296)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !318, file: !301, line: 389, size: 7296, elements: !322)
!322 = !{!323, !324, !328, !334, !338, !339, !340, !341, !342, !350, !355, !356, !357, !358, !367, !368, !369, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !404, !412, !415, !463, !464, !1372, !1373, !1376, !1380, !1381, !1384, !1385, !1386, !1389, !1401}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !321, file: !301, line: 390, baseType: !299, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !321, file: !301, line: 391, baseType: !325, size: 64, offset: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !309, line: 31, size: 64, elements: !326)
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !325, file: !309, line: 32, baseType: !313, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !321, file: !301, line: 392, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !330, line: 23, baseType: !331)
!330 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !332, line: 31, baseType: !333)
!332 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!333 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !321, file: !301, line: 394, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!260, !288, !260, !260, !260, !260}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !321, file: !301, line: 398, baseType: !260, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !321, file: !301, line: 399, baseType: !260, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !321, file: !301, line: 405, baseType: !260, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !321, file: !301, line: 406, baseType: !260, size: 64, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !321, file: !301, line: 407, baseType: !343, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !290, line: 286, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 286, size: 64, elements: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !345, file: !290, line: 286, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !349, line: 18, baseType: !260)
!349 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!350 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !321, file: !301, line: 416, baseType: !351, size: 32, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !99, line: 168, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 166, size: 32, elements: !353)
!353 = !{!354}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !352, file: !99, line: 167, baseType: !106, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !321, file: !301, line: 428, baseType: !351, size: 32, offset: 608)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !321, file: !301, line: 437, baseType: !351, size: 32, offset: 640)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !321, file: !301, line: 447, baseType: !351, size: 32, offset: 672)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !321, file: !301, line: 450, baseType: !359, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !360, line: 13, baseType: !361)
!360 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !99, line: 175, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 173, size: 64, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !362, file: !99, line: 174, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !330, line: 22, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !332, line: 30, baseType: !293)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !321, file: !301, line: 452, baseType: !106, size: 32, offset: 768)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !321, file: !301, line: 454, baseType: !169, offset: 800)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !321, file: !301, line: 457, baseType: !370, size: 256, offset: 832)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !371, line: 35, size: 256, elements: !372)
!371 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!372 = !{!373, !374, !375, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !370, file: !371, line: 36, baseType: !359, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !370, file: !371, line: 42, baseType: !359, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !370, file: !371, line: 46, baseType: !376, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !170, line: 29, baseType: !177)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !370, file: !371, line: 47, baseType: !156, size: 128, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !321, file: !301, line: 459, baseType: !156, size: 128, offset: 1088)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !321, file: !301, line: 466, baseType: !260, size: 64, offset: 1216)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !321, file: !301, line: 467, baseType: !260, size: 64, offset: 1280)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !321, file: !301, line: 469, baseType: !260, size: 64, offset: 1344)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !321, file: !301, line: 470, baseType: !260, size: 64, offset: 1408)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !321, file: !301, line: 471, baseType: !361, size: 64, offset: 1472)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !321, file: !301, line: 472, baseType: !260, size: 64, offset: 1536)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !321, file: !301, line: 473, baseType: !260, size: 64, offset: 1600)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !321, file: !301, line: 474, baseType: !260, size: 64, offset: 1664)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !321, file: !301, line: 475, baseType: !260, size: 64, offset: 1728)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !321, file: !301, line: 477, baseType: !169, offset: 1792)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !321, file: !301, line: 478, baseType: !260, size: 64, offset: 1792)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !321, file: !301, line: 478, baseType: !260, size: 64, offset: 1856)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !321, file: !301, line: 478, baseType: !260, size: 64, offset: 1920)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !321, file: !301, line: 478, baseType: !260, size: 64, offset: 1984)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !321, file: !301, line: 479, baseType: !260, size: 64, offset: 2048)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !321, file: !301, line: 479, baseType: !260, size: 64, offset: 2112)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !321, file: !301, line: 479, baseType: !260, size: 64, offset: 2176)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !321, file: !301, line: 480, baseType: !260, size: 64, offset: 2240)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !321, file: !301, line: 480, baseType: !260, size: 64, offset: 2304)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !321, file: !301, line: 480, baseType: !260, size: 64, offset: 2368)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !321, file: !301, line: 480, baseType: !260, size: 64, offset: 2432)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !321, file: !301, line: 482, baseType: !401, size: 2816, offset: 2496)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 2816, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 44)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !321, file: !301, line: 488, baseType: !405, size: 256, offset: 5312)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !406, line: 60, size: 256, elements: !407)
!406 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !405, file: !406, line: 61, baseType: !409, size: 256)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 256, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 4)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !321, file: !301, line: 490, baseType: !413, size: 64, offset: 5568)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !301, line: 490, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !321, file: !301, line: 493, baseType: !416, size: 896, offset: 5632)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !417, line: 53, baseType: !418)
!417 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !417, line: 13, size: 896, elements: !419)
!419 = !{!420, !421, !422, !423, !426, !427, !434, !435, !455, !456, !459}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !418, file: !417, line: 18, baseType: !329, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !418, file: !417, line: 28, baseType: !361, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !418, file: !417, line: 31, baseType: !370, size: 256, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !418, file: !417, line: 32, baseType: !424, size: 64, offset: 384)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !417, line: 32, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !418, file: !417, line: 37, baseType: !252, size: 16, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !418, file: !417, line: 40, baseType: !428, size: 192, offset: 512)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !429, line: 53, size: 192, elements: !430)
!429 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!430 = !{!431, !432, !433}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !428, file: !429, line: 54, baseType: !359, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !428, file: !429, line: 55, baseType: !169, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !428, file: !429, line: 59, baseType: !156, size: 128, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !418, file: !417, line: 41, baseType: !100, size: 64, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !418, file: !417, line: 42, baseType: !436, size: 64, offset: 768)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !439, line: 13, size: 896, elements: !440)
!439 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !438, file: !439, line: 14, baseType: !100, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !438, file: !439, line: 15, baseType: !260, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !438, file: !439, line: 17, baseType: !260, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !438, file: !439, line: 17, baseType: !260, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !438, file: !439, line: 19, baseType: !245, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !438, file: !439, line: 21, baseType: !245, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !438, file: !439, line: 22, baseType: !245, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !438, file: !439, line: 23, baseType: !245, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !438, file: !439, line: 24, baseType: !245, size: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !438, file: !439, line: 25, baseType: !245, size: 64, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !438, file: !439, line: 26, baseType: !245, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !438, file: !439, line: 27, baseType: !245, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !438, file: !439, line: 28, baseType: !245, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !438, file: !439, line: 29, baseType: !245, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !418, file: !417, line: 44, baseType: !351, size: 32, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !418, file: !417, line: 50, baseType: !457, size: 16, offset: 864)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !330, line: 19, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !332, line: 24, baseType: !252)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !418, file: !417, line: 51, baseType: !460, size: 16, offset: 880)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !330, line: 18, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !332, line: 23, baseType: !462)
!462 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !301, line: 495, baseType: !260, size: 64, offset: 6528)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !321, file: !301, line: 497, baseType: !465, size: 64, offset: 6592)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !301, line: 381, size: 384, elements: !467)
!467 = !{!468, !469, !1371}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !466, file: !301, line: 382, baseType: !351, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !466, file: !301, line: 383, baseType: !470, size: 128, offset: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !301, line: 376, size: 128, elements: !471)
!471 = !{!472, !1369}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !470, file: !301, line: 377, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !475, line: 640, size: 48640, elements: !476)
!475 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!476 = !{!477, !485, !487, !488, !494, !495, !496, !497, !498, !499, !500, !501, !505, !523, !534, !629, !630, !631, !642, !643, !645, !646, !647, !648, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !727, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !783, !785, !786, !787, !799, !801, !802, !803, !804, !805, !811, !812, !813, !814, !815, !816, !817, !829, !834, !839, !840, !841, !844, !848, !851, !854, !857, !860, !864, !867, !870, !876, !877, !878, !884, !885, !886, !887, !888, !897, !898, !899, !900, !901, !906, !907, !908, !911, !912, !915, !918, !921, !924, !927, !930, !931, !1011, !1014, !1017, !1018, !1021, !1022, !1023, !1029, !1030, !1031, !1044, !1045, !1046, !1056, !1061, !1064, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !474, file: !475, line: 646, baseType: !478, size: 128)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !479, line: 56, size: 128, elements: !480)
!479 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !479, line: 57, baseType: !260, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !478, file: !479, line: 58, baseType: !483, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !330, line: 21, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !332, line: 27, baseType: !7)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !474, file: !475, line: 649, baseType: !486, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !245)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !474, file: !475, line: 657, baseType: !100, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !474, file: !475, line: 658, baseType: !489, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !490, line: 113, baseType: !491)
!490 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !490, line: 111, size: 32, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !491, file: !490, line: 112, baseType: !351, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !475, line: 660, baseType: !7, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !474, file: !475, line: 661, baseType: !7, size: 32, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !474, file: !475, line: 684, baseType: !106, size: 32, offset: 352)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !474, file: !475, line: 686, baseType: !106, size: 32, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !474, file: !475, line: 687, baseType: !106, size: 32, offset: 416)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !474, file: !475, line: 688, baseType: !106, size: 32, offset: 448)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !474, file: !475, line: 689, baseType: !7, size: 32, offset: 480)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !474, file: !475, line: 691, baseType: !502, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !475, line: 691, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !474, file: !475, line: 692, baseType: !506, size: 832, offset: 576)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !475, line: 451, size: 832, elements: !507)
!507 = !{!508, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !506, file: !475, line: 453, baseType: !509, size: 128)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !475, line: 325, size: 128, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !509, file: !475, line: 326, baseType: !260, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !509, file: !475, line: 327, baseType: !483, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !506, file: !475, line: 454, baseType: !308, size: 192, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !506, file: !475, line: 455, baseType: !156, size: 128, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !506, file: !475, line: 456, baseType: !7, size: 32, offset: 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !506, file: !475, line: 458, baseType: !329, size: 64, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !506, file: !475, line: 459, baseType: !329, size: 64, offset: 576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !506, file: !475, line: 460, baseType: !329, size: 64, offset: 640)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !506, file: !475, line: 461, baseType: !329, size: 64, offset: 704)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !506, file: !475, line: 463, baseType: !329, size: 64, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !506, file: !475, line: 465, baseType: !522, offset: 832)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !475, line: 415, elements: !183)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !474, file: !475, line: 693, baseType: !524, size: 384, offset: 1408)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !475, line: 489, size: 384, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !524, file: !475, line: 490, baseType: !156, size: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !524, file: !475, line: 491, baseType: !260, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !524, file: !475, line: 492, baseType: !260, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !524, file: !475, line: 493, baseType: !7, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !524, file: !475, line: 494, baseType: !252, size: 16, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !524, file: !475, line: 495, baseType: !252, size: 16, offset: 304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !524, file: !475, line: 497, baseType: !533, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !474, file: !475, line: 697, baseType: !535, size: 1792, offset: 1792)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !475, line: 507, size: 1792, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !626, !627}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !535, file: !475, line: 508, baseType: !308, size: 192, align: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !535, file: !475, line: 515, baseType: !329, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !535, file: !475, line: 516, baseType: !329, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !535, file: !475, line: 517, baseType: !329, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !535, file: !475, line: 518, baseType: !329, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !535, file: !475, line: 519, baseType: !329, size: 64, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !535, file: !475, line: 526, baseType: !365, size: 64, offset: 512)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !535, file: !475, line: 527, baseType: !329, size: 64, offset: 576)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !475, line: 528, baseType: !7, size: 32, offset: 640)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !535, file: !475, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !535, file: !475, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !535, file: !475, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !535, file: !475, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !535, file: !475, line: 563, baseType: !551, size: 512, offset: 704)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !552)
!552 = !{!553, !561, !562, !567, !619, !623, !624, !625}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !551, file: !6, line: 119, baseType: !554, size: 256)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !555, line: 9, size: 256, elements: !556)
!555 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !554, file: !555, line: 10, baseType: !308, size: 192, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !554, file: !555, line: 11, baseType: !559, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !560, line: 29, baseType: !365)
!560 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !551, file: !6, line: 120, baseType: !559, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !551, file: !6, line: 121, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!5, !566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !551, file: !6, line: 122, baseType: !568, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !570)
!570 = !{!571, !591, !592, !595, !605, !606, !614, !618}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !569, file: !6, line: 160, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !573, file: !6, line: 215, baseType: !376)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !573, file: !6, line: 216, baseType: !7, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !573, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !573, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !573, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !573, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !573, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !573, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !573, file: !6, line: 233, baseType: !559, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !573, file: !6, line: 234, baseType: !566, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !573, file: !6, line: 235, baseType: !559, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !573, file: !6, line: 236, baseType: !566, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !573, file: !6, line: 237, baseType: !588, size: 4096, offset: 512)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 4096, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 8)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !569, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !569, file: !6, line: 162, baseType: !593, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !99, line: 27, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !243, line: 96, baseType: !106)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !569, file: !6, line: 163, baseType: !596, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !597, line: 276, baseType: !598)
!597 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !597, line: 276, size: 32, elements: !599)
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !598, file: !597, line: 276, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !597, line: 70, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !597, line: 65, size: 32, elements: !603)
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !602, file: !597, line: 66, baseType: !7, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !569, file: !6, line: 164, baseType: !566, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !569, file: !6, line: 165, baseType: !607, size: 128, offset: 256)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !555, line: 14, size: 128, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !607, file: !555, line: 15, baseType: !610, size: 128)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !309, line: 125, size: 128, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !610, file: !309, line: 126, baseType: !325, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !610, file: !309, line: 127, baseType: !313, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !569, file: !6, line: 166, baseType: !615, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!559}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !569, file: !6, line: 167, baseType: !559, size: 64, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !551, file: !6, line: 123, baseType: !620, size: 8, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !330, line: 17, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !332, line: 21, baseType: !622)
!622 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !551, file: !6, line: 124, baseType: !620, size: 8, offset: 456)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !551, file: !6, line: 125, baseType: !620, size: 8, offset: 464)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !551, file: !6, line: 126, baseType: !620, size: 8, offset: 472)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !535, file: !475, line: 572, baseType: !551, size: 512, offset: 1216)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !535, file: !475, line: 580, baseType: !628, size: 64, offset: 1728)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !474, file: !475, line: 721, baseType: !7, size: 32, offset: 3584)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !474, file: !475, line: 722, baseType: !106, size: 32, offset: 3616)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !474, file: !475, line: 723, baseType: !632, size: 64, offset: 3648)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !635, line: 17, baseType: !636)
!635 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !635, line: 17, size: 64, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !636, file: !635, line: 17, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 64, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 1)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !474, file: !475, line: 724, baseType: !634, size: 64, offset: 3712)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !474, file: !475, line: 749, baseType: !644, offset: 3776)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !475, line: 290, elements: !183)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !474, file: !475, line: 751, baseType: !156, size: 128, offset: 3776)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !474, file: !475, line: 757, baseType: !317, size: 64, offset: 3904)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !474, file: !475, line: 758, baseType: !317, size: 64, offset: 3968)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !474, file: !475, line: 761, baseType: !649, size: 320, offset: 4032)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !406, line: 34, size: 320, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !649, file: !406, line: 35, baseType: !329, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !649, file: !406, line: 36, baseType: !653, size: 256, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 256, elements: !410)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !474, file: !475, line: 766, baseType: !106, size: 32, offset: 4352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !474, file: !475, line: 767, baseType: !106, size: 32, offset: 4384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !474, file: !475, line: 768, baseType: !106, size: 32, offset: 4416)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !474, file: !475, line: 770, baseType: !106, size: 32, offset: 4448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !474, file: !475, line: 772, baseType: !260, size: 64, offset: 4480)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !474, file: !475, line: 775, baseType: !7, size: 32, offset: 4544)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !474, file: !475, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !474, file: !475, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !474, file: !475, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !474, file: !475, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !474, file: !475, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !474, file: !475, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !474, file: !475, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !474, file: !475, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !474, file: !475, line: 831, baseType: !260, size: 64, offset: 4672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !474, file: !475, line: 833, baseType: !670, size: 384, offset: 4736)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !671)
!671 = !{!672, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !670, file: !12, line: 26, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!245, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, scope: !670, file: !12, line: 27, baseType: !678, size: 320, offset: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !670, file: !12, line: 27, size: 320, elements: !679)
!679 = !{!680, !690, !717}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !678, file: !12, line: 36, baseType: !681, size: 320)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !12, line: 29, size: 320, elements: !682)
!682 = !{!683, !685, !686, !687, !688, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !681, file: !12, line: 30, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !681, file: !12, line: 31, baseType: !483, size: 32, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !681, file: !12, line: 32, baseType: !483, size: 32, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !681, file: !12, line: 33, baseType: !483, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !681, file: !12, line: 34, baseType: !329, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !681, file: !12, line: 35, baseType: !684, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !678, file: !12, line: 46, baseType: !691, size: 192)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !12, line: 38, size: 192, elements: !692)
!692 = !{!693, !694, !695, !716}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !691, file: !12, line: 39, baseType: !593, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, scope: !691, file: !12, line: 41, baseType: !696, size: 64, offset: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !691, file: !12, line: 41, size: 64, elements: !697)
!697 = !{!698, !706}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !696, file: !12, line: 42, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !701, line: 7, size: 128, elements: !702)
!701 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !700, file: !701, line: 8, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !243, line: 93, baseType: !293)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !700, file: !701, line: 9, baseType: !293, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !696, file: !12, line: 43, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !709, line: 7, size: 64, elements: !710)
!709 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!710 = !{!711, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !708, file: !709, line: 8, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !709, line: 5, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !330, line: 20, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !332, line: 26, baseType: !106)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !708, file: !709, line: 9, baseType: !713, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !691, file: !12, line: 45, baseType: !329, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !678, file: !12, line: 54, baseType: !718, size: 256)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !12, line: 48, size: 256, elements: !719)
!719 = !{!720, !723, !724, !725, !726}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !718, file: !12, line: 49, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !718, file: !12, line: 50, baseType: !106, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !718, file: !12, line: 51, baseType: !106, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !718, file: !12, line: 52, baseType: !260, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !718, file: !12, line: 53, baseType: !260, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !474, file: !475, line: 835, baseType: !728, size: 32, offset: 5120)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !99, line: 22, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !243, line: 28, baseType: !106)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !474, file: !475, line: 836, baseType: !728, size: 32, offset: 5152)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !474, file: !475, line: 840, baseType: !260, size: 64, offset: 5184)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !474, file: !475, line: 849, baseType: !473, size: 64, offset: 5248)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !474, file: !475, line: 852, baseType: !473, size: 64, offset: 5312)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !474, file: !475, line: 857, baseType: !156, size: 128, offset: 5376)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !474, file: !475, line: 858, baseType: !156, size: 128, offset: 5504)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !474, file: !475, line: 859, baseType: !473, size: 64, offset: 5632)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !474, file: !475, line: 867, baseType: !156, size: 128, offset: 5696)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !474, file: !475, line: 868, baseType: !156, size: 128, offset: 5824)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !474, file: !475, line: 871, baseType: !740, size: 64, offset: 5952)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !742, line: 59, size: 768, elements: !743)
!742 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!743 = !{!744, !745, !746, !747, !758, !759, !766, !775}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !741, file: !742, line: 61, baseType: !489, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !741, file: !742, line: 62, baseType: !7, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !741, file: !742, line: 63, baseType: !169, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !741, file: !742, line: 65, baseType: !748, size: 256, offset: 64)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 256, elements: !410)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !99, line: 182, size: 64, elements: !750)
!750 = !{!751}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !749, file: !99, line: 183, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !99, line: 186, size: 128, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !99, line: 187, baseType: !752, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !753, file: !99, line: 187, baseType: !757, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !741, file: !742, line: 66, baseType: !749, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !741, file: !742, line: 68, baseType: !760, size: 128, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !761, line: 40, baseType: !762)
!761 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !761, line: 36, size: 128, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !762, file: !761, line: 37, baseType: !169)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !762, file: !761, line: 38, baseType: !156, size: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !741, file: !742, line: 69, baseType: !767, size: 128, align: 64, offset: 512)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !99, line: 216, size: 128, align: 64, elements: !768)
!768 = !{!769, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !99, line: 217, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !767, file: !99, line: 218, baseType: !772, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !770}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !741, file: !742, line: 70, baseType: !776, size: 128, offset: 640)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 128, elements: !640)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !742, line: 54, size: 128, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !777, file: !742, line: 55, baseType: !106, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !777, file: !742, line: 56, baseType: !781, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !742, line: 56, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !474, file: !475, line: 872, baseType: !784, size: 512, offset: 6016)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 512, elements: !410)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !474, file: !475, line: 873, baseType: !156, size: 128, offset: 6528)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !474, file: !475, line: 874, baseType: !156, size: 128, offset: 6656)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !474, file: !475, line: 876, baseType: !788, size: 64, offset: 6784)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !790, line: 26, size: 192, elements: !791)
!790 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !789, file: !790, line: 27, baseType: !7, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !789, file: !790, line: 28, baseType: !794, size: 128, offset: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !795, line: 43, size: 128, elements: !796)
!795 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !794, file: !795, line: 44, baseType: !376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !794, file: !795, line: 45, baseType: !156, size: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !474, file: !475, line: 879, baseType: !800, size: 64, offset: 6848)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !474, file: !475, line: 882, baseType: !800, size: 64, offset: 6912)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !474, file: !475, line: 884, baseType: !329, size: 64, offset: 6976)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !474, file: !475, line: 885, baseType: !329, size: 64, offset: 7040)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !474, file: !475, line: 890, baseType: !329, size: 64, offset: 7104)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !474, file: !475, line: 891, baseType: !806, size: 128, offset: 7168)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !475, line: 242, size: 128, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !806, file: !475, line: 244, baseType: !329, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !806, file: !475, line: 245, baseType: !329, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !806, file: !475, line: 246, baseType: !376, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !474, file: !475, line: 900, baseType: !260, size: 64, offset: 7296)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !474, file: !475, line: 901, baseType: !260, size: 64, offset: 7360)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !474, file: !475, line: 904, baseType: !329, size: 64, offset: 7424)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !474, file: !475, line: 907, baseType: !329, size: 64, offset: 7488)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !474, file: !475, line: 910, baseType: !260, size: 64, offset: 7552)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !474, file: !475, line: 911, baseType: !260, size: 64, offset: 7616)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !474, file: !475, line: 914, baseType: !818, size: 640, offset: 7680)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !819, line: 123, size: 640, elements: !820)
!819 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!820 = !{!821, !827, !828}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !818, file: !819, line: 124, baseType: !822, size: 576)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 576, elements: !211)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !819, line: 108, size: 192, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !823, file: !819, line: 109, baseType: !329, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !823, file: !819, line: 110, baseType: !607, size: 128, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !818, file: !819, line: 125, baseType: !7, size: 32, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !818, file: !819, line: 126, baseType: !7, size: 32, offset: 608)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !474, file: !475, line: 917, baseType: !830, size: 192, offset: 8320)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !819, line: 134, size: 192, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !830, file: !819, line: 135, baseType: !767, size: 128, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !830, file: !819, line: 136, baseType: !7, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !474, file: !475, line: 923, baseType: !835, size: 64, offset: 8512)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !838, line: 11, flags: DIFlagFwdDecl)
!838 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!839 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !474, file: !475, line: 926, baseType: !835, size: 64, offset: 8576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !474, file: !475, line: 929, baseType: !835, size: 64, offset: 8640)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !474, file: !475, line: 933, baseType: !842, size: 64, offset: 8704)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !475, line: 933, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !474, file: !475, line: 943, baseType: !845, size: 128, offset: 8768)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 16)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !474, file: !475, line: 945, baseType: !849, size: 64, offset: 8896)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !475, line: 49, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !474, file: !475, line: 956, baseType: !852, size: 64, offset: 8960)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !475, line: 45, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !474, file: !475, line: 959, baseType: !855, size: 64, offset: 9024)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !475, line: 959, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !474, file: !475, line: 962, baseType: !858, size: 64, offset: 9088)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !475, line: 66, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !474, file: !475, line: 966, baseType: !861, size: 64, offset: 9152)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !863, line: 35, flags: DIFlagFwdDecl)
!863 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!864 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !474, file: !475, line: 969, baseType: !865, size: 64, offset: 9216)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !819, line: 223, flags: DIFlagFwdDecl)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !474, file: !475, line: 970, baseType: !868, size: 64, offset: 9280)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !475, line: 62, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !474, file: !475, line: 971, baseType: !871, size: 64, offset: 9344)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !872, line: 25, baseType: !873)
!872 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !872, line: 23, size: 64, elements: !874)
!874 = !{!875}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !873, file: !872, line: 24, baseType: !639, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !474, file: !475, line: 972, baseType: !871, size: 64, offset: 9408)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !474, file: !475, line: 974, baseType: !871, size: 64, offset: 9472)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !474, file: !475, line: 975, baseType: !879, size: 192, offset: 9536)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !880, line: 30, size: 192, elements: !881)
!880 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !879, file: !880, line: 31, baseType: !156, size: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !879, file: !880, line: 32, baseType: !871, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !474, file: !475, line: 976, baseType: !260, size: 64, offset: 9728)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !474, file: !475, line: 977, baseType: !257, size: 64, offset: 9792)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !474, file: !475, line: 978, baseType: !7, size: 32, offset: 9856)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !474, file: !475, line: 980, baseType: !770, size: 64, offset: 9920)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !474, file: !475, line: 989, baseType: !889, size: 128, offset: 9984)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !890, line: 35, size: 128, elements: !891)
!890 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !889, file: !890, line: 36, baseType: !106, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !889, file: !890, line: 37, baseType: !351, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !889, file: !890, line: 38, baseType: !895, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !890, line: 23, flags: DIFlagFwdDecl)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !474, file: !475, line: 992, baseType: !329, size: 64, offset: 10112)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !474, file: !475, line: 993, baseType: !329, size: 64, offset: 10176)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !474, file: !475, line: 996, baseType: !169, offset: 10240)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !474, file: !475, line: 999, baseType: !376, offset: 10240)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !474, file: !475, line: 1001, baseType: !902, size: 64, offset: 10240)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !475, line: 636, size: 64, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !902, file: !475, line: 637, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !474, file: !475, line: 1005, baseType: !610, size: 128, offset: 10304)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !474, file: !475, line: 1007, baseType: !473, size: 64, offset: 10432)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !474, file: !475, line: 1009, baseType: !909, size: 64, offset: 10496)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !475, line: 1009, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !474, file: !475, line: 1043, baseType: !100, size: 64, offset: 10560)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !474, file: !475, line: 1046, baseType: !913, size: 64, offset: 10624)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !475, line: 41, flags: DIFlagFwdDecl)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !474, file: !475, line: 1050, baseType: !916, size: 64, offset: 10688)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !475, line: 42, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !474, file: !475, line: 1054, baseType: !919, size: 64, offset: 10752)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !475, line: 55, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !474, file: !475, line: 1056, baseType: !922, size: 64, offset: 10816)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !475, line: 40, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !474, file: !475, line: 1058, baseType: !925, size: 64, offset: 10880)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !475, line: 47, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !474, file: !475, line: 1061, baseType: !928, size: 64, offset: 10944)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !475, line: 43, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !474, file: !475, line: 1064, baseType: !260, size: 64, offset: 11008)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !474, file: !475, line: 1065, baseType: !932, size: 64, offset: 11072)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !880, line: 14, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !880, line: 12, size: 384, elements: !935)
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, scope: !934, file: !880, line: 13, baseType: !937, size: 384)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !934, file: !880, line: 13, size: 384, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !937, file: !880, line: 13, baseType: !106, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !937, file: !880, line: 13, baseType: !106, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !937, file: !880, line: 13, baseType: !106, size: 32, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !937, file: !880, line: 13, baseType: !943, size: 256, offset: 128)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !944, line: 32, size: 256, elements: !945)
!944 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!945 = !{!946, !952, !965, !971, !980, !1000, !1005}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !943, file: !944, line: 37, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !943, file: !944, line: 34, size: 64, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !947, file: !944, line: 35, baseType: !729, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !947, file: !944, line: 36, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !243, line: 49, baseType: !7)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !943, file: !944, line: 45, baseType: !953, size: 192)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !943, file: !944, line: 40, size: 192, elements: !954)
!954 = !{!955, !957, !958, !964}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !953, file: !944, line: 41, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !243, line: 95, baseType: !106)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !953, file: !944, line: 42, baseType: !106, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !953, file: !944, line: 43, baseType: !959, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !944, line: 11, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !944, line: 8, size: 64, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !960, file: !944, line: 9, baseType: !106, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !960, file: !944, line: 10, baseType: !100, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !953, file: !944, line: 44, baseType: !106, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !943, file: !944, line: 52, baseType: !966, size: 128)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !943, file: !944, line: 48, size: 128, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !966, file: !944, line: 49, baseType: !729, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !966, file: !944, line: 50, baseType: !951, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !966, file: !944, line: 51, baseType: !959, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !943, file: !944, line: 61, baseType: !972, size: 256)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !943, file: !944, line: 55, size: 256, elements: !973)
!973 = !{!974, !975, !976, !977, !979}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !972, file: !944, line: 56, baseType: !729, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !972, file: !944, line: 57, baseType: !951, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !972, file: !944, line: 58, baseType: !106, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !972, file: !944, line: 59, baseType: !978, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !243, line: 94, baseType: !244)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !972, file: !944, line: 60, baseType: !978, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !943, file: !944, line: 95, baseType: !981, size: 256)
