; ModuleID = '../bcout/drivers/thermal/intel/int340x_thermal/int3400_thermal.llvm.bc'
source_filename = "drivers/thermal/intel/int340x_thermal/int3400_thermal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_int3400_thermal_driver_init6:\09\09\09"
module asm ".long\09int3400_thermal_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.platform_driver = type { i32 (%struct.platform_device*)*, i32 (%struct.platform_device*)*, void (%struct.platform_device*)*, i32 (%struct.platform_device*, i32)*, i32 (%struct.platform_device*)*, %struct.device_driver, %struct.platform_device_id*, i8 }
%struct.platform_device = type { i8*, i32, i8, %struct.device, i64, %struct.device_dma_parameters, i32, %struct.resource*, %struct.platform_device_id*, i8*, %struct.mfd_cell*, %struct.pdev_archdata }

!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "THERMAL_TRIP_ACTIVE", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "THERMAL_TRIP_PASSIVE", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "THERMAL_TRIP_HOT", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "THERMAL_TRIP_CRITICAL", value: 3, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_trend", file: !76, line: 40, baseType: !7, size: 32, elements: !77)
!76 = !DIFile(filename: "./include/linux/thermal.h", directory: "/home/lizy2001/genbc/linux")
!77 = !{!78, !79, !80, !81, !82}
!78 = !DIEnumerator(name: "THERMAL_TREND_STABLE", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "THERMAL_TREND_RAISING", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "THERMAL_TREND_DROPPING", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "THERMAL_TREND_RAISE_FULL", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "THERMAL_TREND_DROP_FULL", value: 4, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "thermal_notify_event", file: !76, line: 49, baseType: !7, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93}
!85 = !DIEnumerator(name: "THERMAL_EVENT_UNSPECIFIED", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "THERMAL_EVENT_TEMP_SAMPLE", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "THERMAL_TRIP_VIOLATED", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "THERMAL_TRIP_CHANGED", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "THERMAL_DEVICE_DOWN", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "THERMAL_DEVICE_UP", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "THERMAL_DEVICE_POWER_CAPABILITY_CHANGED", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "THERMAL_TABLE_CHANGED", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "THERMAL_EVENT_KEEP_ALIVE", value: 8, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 10, baseType: !7, size: 32, elements: !96)
!95 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!96 = !{!97, !98}
!97 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!98 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !100, line: 305, baseType: !7, size: 32, elements: !101)
!100 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!101 = !{!102, !103, !104, !105}
!102 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!103 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!104 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!105 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "int3400_thermal_uuid", file: !3, line: 19, baseType: !7, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!108 = !DIEnumerator(name: "INT3400_THERMAL_PASSIVE_1", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "INT3400_THERMAL_ACTIVE", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "INT3400_THERMAL_CRITICAL", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "INT3400_THERMAL_ADAPTIVE_PERFORMANCE", value: 3, isUnsigned: true)
!112 = !DIEnumerator(name: "INT3400_THERMAL_EMERGENCY_CALL_MODE", value: 4, isUnsigned: true)
!113 = !DIEnumerator(name: "INT3400_THERMAL_PASSIVE_2", value: 5, isUnsigned: true)
!114 = !DIEnumerator(name: "INT3400_THERMAL_POWER_BOSS", value: 6, isUnsigned: true)
!115 = !DIEnumerator(name: "INT3400_THERMAL_VIRTUAL_SENSOR", value: 7, isUnsigned: true)
!116 = !DIEnumerator(name: "INT3400_THERMAL_COOLING_MODE", value: 8, isUnsigned: true)
!117 = !DIEnumerator(name: "INT3400_THERMAL_HARDWARE_DUTY_CYCLING", value: 9, isUnsigned: true)
!118 = !DIEnumerator(name: "INT3400_THERMAL_MAXIMUM_UUID", value: 10, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobject_action", file: !120, line: 53, baseType: !7, size: 32, elements: !121)
!120 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129}
!122 = !DIEnumerator(name: "KOBJ_ADD", value: 0, isUnsigned: true)
!123 = !DIEnumerator(name: "KOBJ_REMOVE", value: 1, isUnsigned: true)
!124 = !DIEnumerator(name: "KOBJ_CHANGE", value: 2, isUnsigned: true)
!125 = !DIEnumerator(name: "KOBJ_MOVE", value: 3, isUnsigned: true)
!126 = !DIEnumerator(name: "KOBJ_ONLINE", value: 4, isUnsigned: true)
!127 = !DIEnumerator(name: "KOBJ_OFFLINE", value: 5, isUnsigned: true)
!128 = !DIEnumerator(name: "KOBJ_BIND", value: 6, isUnsigned: true)
!129 = !DIEnumerator(name: "KOBJ_UNBIND", value: 7, isUnsigned: true)
!130 = !{!131, !134, !135, !1557, !2264, !2481, !2488, !718, !294, !279}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !133, line: 76, flags: DIFlagFwdDecl)
!133 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device", file: !137, line: 351, size: 10880, elements: !138)
!137 = !DIFile(filename: "./include/acpi/acpi_bus.h", directory: "/home/lizy2001/genbc/linux")
!138 = !{!139, !141, !144, !2208, !2209, !2210, !2211, !2212, !2213, !2222, !2239, !2313, !2342, !2366, !2387, !2393, !2402, !2434, !2448, !2470, !2474, !2475, !2476, !2477, !2478, !2479, !2480}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !136, file: !137, line: 352, baseType: !140, size: 32)
!140 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !136, file: !137, line: 353, baseType: !142, size: 64, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !143, line: 424, baseType: !134)
!143 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fwnode", scope: !136, file: !137, line: 354, baseType: !145, size: 192, offset: 128)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_handle", file: !146, line: 17, size: 192, elements: !147)
!146 = !DIFile(filename: "./include/linux/fwnode.h", directory: "/home/lizy2001/genbc/linux")
!147 = !{!148, !150, !2207}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "secondary", scope: !145, file: !146, line: 18, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !145, file: !146, line: 19, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fwnode_operations", file: !146, line: 110, size: 1152, elements: !154)
!154 = !{!155, !159, !163, !172, !2149, !2153, !2157, !2162, !2166, !2167, !2171, !2175, !2179, !2190, !2191, !2192, !2193, !2203}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !153, file: !146, line: 111, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!149, !149}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !153, file: !146, line: 112, baseType: !160, size: 64, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !149}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "device_is_available", scope: !153, file: !146, line: 113, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!167, !170}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !168, line: 30, baseType: !169)
!168 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!169 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "device_get_match_data", scope: !153, file: !146, line: 114, baseType: !173, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !170, !178}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !181)
!181 = !{!182, !1685, !1687, !1690, !1691, !1742, !1836, !1837, !1838, !1839, !1840, !1849, !1954, !1967, !2074, !2075, !2079, !2081, !2082, !2083, !2087, !2093, !2094, !2097, !2098, !2099, !2102, !2103, !2104, !2105, !2137, !2138, !2139, !2142, !2145, !2146, !2147, !2148}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !180, file: !30, line: 462, baseType: !183, size: 512)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !120, line: 64, size: 512, elements: !184)
!184 = !{!185, !189, !195, !197, !257, !1521, !1675, !1680, !1681, !1682, !1683, !1684}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !120, line: 65, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !183, file: !120, line: 66, baseType: !190, size: 128, offset: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !168, line: 178, size: 128, elements: !191)
!191 = !{!192, !194}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !168, line: 179, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !168, line: 179, baseType: !193, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !183, file: !120, line: 67, baseType: !196, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !183, file: !120, line: 68, baseType: !198, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !120, line: 192, size: 704, elements: !200)
!200 = !{!201, !202, !218, !219}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !199, file: !120, line: 193, baseType: !190, size: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !199, file: !120, line: 194, baseType: !203, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !204, line: 83, baseType: !205)
!204 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !204, line: 71, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, scope: !205, file: !204, line: 72, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !205, file: !204, line: 72, elements: !209)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !208, file: !204, line: 73, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !204, line: 20, elements: !212)
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !211, file: !204, line: 21, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !215, line: 25, baseType: !216)
!215 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 25, elements: !217)
!217 = !{}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !199, file: !120, line: 195, baseType: !183, size: 512, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !199, file: !120, line: 196, baseType: !220, size: 64, offset: 640)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !120, line: 156, size: 192, elements: !223)
!223 = !{!224, !229, !234}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !222, file: !120, line: 157, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!140, !198, !196}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !120, line: 158, baseType: !230, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!186, !198, !196}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !222, file: !120, line: 159, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{!140, !198, !196, !239}
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !120, line: 148, size: 20736, elements: !241)
!241 = !{!242, !247, !251, !252, !256}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !240, file: !120, line: 149, baseType: !243, size: 192)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 192, elements: !245)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !240, file: !120, line: 150, baseType: !248, size: 4096, offset: 192)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !244, size: 4096, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !240, file: !120, line: 151, baseType: !140, size: 32, offset: 4288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !240, file: !120, line: 152, baseType: !253, size: 16384, offset: 4320)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 16384, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 2048)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !240, file: !120, line: 153, baseType: !140, size: 32, offset: 20704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !183, file: !120, line: 69, baseType: !258, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !120, line: 138, size: 448, elements: !260)
!260 = !{!261, !265, !295, !297, !1469, !1500, !1504}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !259, file: !120, line: 139, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DISubroutineType(types: !264)
!264 = !{null, !196}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !259, file: !120, line: 140, baseType: !266, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !269, line: 230, size: 128, elements: !270)
!269 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!270 = !{!271, !287}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !268, file: !269, line: 231, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !196, !280, !244}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !168, line: 60, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !277, line: 73, baseType: !278)
!277 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !277, line: 15, baseType: !279)
!279 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !269, line: 30, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !269, line: 31, baseType: !186, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !281, file: !269, line: 32, baseType: !285, size: 16, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !168, line: 19, baseType: !286)
!286 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !268, file: !269, line: 232, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DISubroutineType(types: !290)
!290 = !{!275, !196, !280, !186, !291}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !168, line: 55, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !277, line: 72, baseType: !293)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !277, line: 16, baseType: !294)
!294 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !259, file: !120, line: 141, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !259, file: !120, line: 142, baseType: !298, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !269, line: 84, size: 320, elements: !302)
!302 = !{!303, !304, !308, !1466, !1467}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !301, file: !269, line: 85, baseType: !186, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !301, file: !269, line: 86, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!285, !196, !280, !140}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !301, file: !269, line: 88, baseType: !309, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!285, !196, !312, !140}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !269, line: 168, size: 448, elements: !314)
!314 = !{!315, !316, !317, !318, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !313, file: !269, line: 169, baseType: !281, size: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !313, file: !269, line: 170, baseType: !291, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !313, file: !269, line: 171, baseType: !134, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !313, file: !269, line: 172, baseType: !319, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DISubroutineType(types: !321)
!321 = !{!275, !322, !196, !312, !244, !325, !291}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !324, line: 526, flags: DIFlagFwdDecl)
!324 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !168, line: 46, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !277, line: 88, baseType: !327)
!327 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !313, file: !269, line: 174, baseType: !319, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !313, file: !269, line: 176, baseType: !330, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!140, !322, !196, !312, !333}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !335, line: 305, size: 1472, elements: !336)
!335 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!336 = !{!337, !338, !339, !340, !341, !349, !350, !1440, !1446, !1447, !1452, !1453, !1456, !1460, !1461, !1462, !1463, !1464}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !334, file: !335, line: 308, baseType: !294, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !334, file: !335, line: 309, baseType: !294, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !334, file: !335, line: 313, baseType: !333, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !334, file: !335, line: 313, baseType: !333, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !334, file: !335, line: 315, baseType: !342, size: 192, align: 64, offset: 256)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !343, line: 24, size: 192, align: 64, elements: !344)
!343 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!344 = !{!345, !346, !348}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !342, file: !343, line: 25, baseType: !294, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !342, file: !343, line: 26, baseType: !347, size: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !342, file: !343, line: 27, baseType: !347, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !334, file: !335, line: 323, baseType: !294, size: 64, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !334, file: !335, line: 327, baseType: !351, size: 64, offset: 512)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !335, line: 388, size: 7296, elements: !353)
!353 = !{!354, !1436}
!354 = !DIDerivedType(tag: DW_TAG_member, scope: !352, file: !335, line: 389, baseType: !355, size: 7296)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !335, line: 389, size: 7296, elements: !356)
!356 = !{!357, !358, !362, !368, !372, !373, !374, !375, !376, !384, !389, !390, !391, !392, !401, !402, !403, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !438, !446, !449, !497, !498, !1406, !1407, !1410, !1414, !1415, !1418, !1419, !1420, !1423, !1435}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !355, file: !335, line: 390, baseType: !333, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !355, file: !335, line: 391, baseType: !359, size: 64, offset: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !343, line: 31, size: 64, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !359, file: !343, line: 32, baseType: !347, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !355, file: !335, line: 392, baseType: !363, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !364, line: 23, baseType: !365)
!364 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !366, line: 31, baseType: !367)
!366 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!367 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !355, file: !335, line: 394, baseType: !369, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{!294, !322, !294, !294, !294, !294}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !355, file: !335, line: 398, baseType: !294, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !355, file: !335, line: 399, baseType: !294, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !355, file: !335, line: 405, baseType: !294, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !355, file: !335, line: 406, baseType: !294, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !355, file: !335, line: 407, baseType: !377, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !324, line: 286, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 286, size: 64, elements: !380)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !379, file: !324, line: 286, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !383, line: 18, baseType: !294)
!383 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!384 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !355, file: !335, line: 416, baseType: !385, size: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !168, line: 168, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 166, size: 32, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !386, file: !168, line: 167, baseType: !140, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !355, file: !335, line: 428, baseType: !385, size: 32, offset: 608)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !355, file: !335, line: 437, baseType: !385, size: 32, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !355, file: !335, line: 447, baseType: !385, size: 32, offset: 672)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !355, file: !335, line: 450, baseType: !393, size: 64, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !394, line: 13, baseType: !395)
!394 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !168, line: 175, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !168, line: 173, size: 64, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !396, file: !168, line: 174, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !364, line: 22, baseType: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !366, line: 30, baseType: !327)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !355, file: !335, line: 452, baseType: !140, size: 32, offset: 768)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !355, file: !335, line: 454, baseType: !203, offset: 800)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !355, file: !335, line: 457, baseType: !404, size: 256, offset: 832)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !405, line: 35, size: 256, elements: !406)
!405 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!406 = !{!407, !408, !409, !411}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !404, file: !405, line: 36, baseType: !393, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !404, file: !405, line: 42, baseType: !393, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !404, file: !405, line: 46, baseType: !410, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !204, line: 29, baseType: !211)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !404, file: !405, line: 47, baseType: !190, size: 128, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !355, file: !335, line: 459, baseType: !190, size: 128, offset: 1088)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !355, file: !335, line: 466, baseType: !294, size: 64, offset: 1216)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !355, file: !335, line: 467, baseType: !294, size: 64, offset: 1280)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !355, file: !335, line: 469, baseType: !294, size: 64, offset: 1344)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !355, file: !335, line: 470, baseType: !294, size: 64, offset: 1408)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !355, file: !335, line: 471, baseType: !395, size: 64, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !355, file: !335, line: 472, baseType: !294, size: 64, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !355, file: !335, line: 473, baseType: !294, size: 64, offset: 1600)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !355, file: !335, line: 474, baseType: !294, size: 64, offset: 1664)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !355, file: !335, line: 475, baseType: !294, size: 64, offset: 1728)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !355, file: !335, line: 477, baseType: !203, offset: 1792)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !355, file: !335, line: 478, baseType: !294, size: 64, offset: 1792)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !355, file: !335, line: 478, baseType: !294, size: 64, offset: 1856)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !355, file: !335, line: 478, baseType: !294, size: 64, offset: 1920)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !355, file: !335, line: 478, baseType: !294, size: 64, offset: 1984)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !355, file: !335, line: 479, baseType: !294, size: 64, offset: 2048)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !355, file: !335, line: 479, baseType: !294, size: 64, offset: 2112)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !355, file: !335, line: 479, baseType: !294, size: 64, offset: 2176)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !355, file: !335, line: 480, baseType: !294, size: 64, offset: 2240)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !355, file: !335, line: 480, baseType: !294, size: 64, offset: 2304)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !355, file: !335, line: 480, baseType: !294, size: 64, offset: 2368)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !355, file: !335, line: 480, baseType: !294, size: 64, offset: 2432)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !355, file: !335, line: 482, baseType: !435, size: 2816, offset: 2496)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 2816, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 44)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !355, file: !335, line: 488, baseType: !439, size: 256, offset: 5312)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !440, line: 60, size: 256, elements: !441)
!440 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !439, file: !440, line: 61, baseType: !443, size: 256)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 256, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 4)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !355, file: !335, line: 490, baseType: !447, size: 64, offset: 5568)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !335, line: 490, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !355, file: !335, line: 493, baseType: !450, size: 896, offset: 5632)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !451, line: 53, baseType: !452)
!451 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 13, size: 896, elements: !453)
!453 = !{!454, !455, !456, !457, !460, !461, !468, !469, !489, !490, !493}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !452, file: !451, line: 18, baseType: !363, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !452, file: !451, line: 28, baseType: !395, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !452, file: !451, line: 31, baseType: !404, size: 256, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !452, file: !451, line: 32, baseType: !458, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !451, line: 32, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !452, file: !451, line: 37, baseType: !286, size: 16, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !452, file: !451, line: 40, baseType: !462, size: 192, offset: 512)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !463, line: 53, size: 192, elements: !464)
!463 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !462, file: !463, line: 54, baseType: !393, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !462, file: !463, line: 55, baseType: !203, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !462, file: !463, line: 59, baseType: !190, size: 128, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !452, file: !451, line: 41, baseType: !134, size: 64, offset: 704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !452, file: !451, line: 42, baseType: !470, size: 64, offset: 768)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !473, line: 13, size: 896, elements: !474)
!473 = !DIFile(filename: "./arch/x86/include/asm/vdso.h", directory: "/home/lizy2001/genbc/linux")
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !472, file: !473, line: 14, baseType: !134, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !472, file: !473, line: 15, baseType: !294, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !472, file: !473, line: 17, baseType: !294, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "alt_len", scope: !472, file: !473, line: 17, baseType: !294, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_start", scope: !472, file: !473, line: 19, baseType: !279, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "sym_vvar_page", scope: !472, file: !473, line: 21, baseType: !279, size: 64, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sym_pvclock_page", scope: !472, file: !473, line: 22, baseType: !279, size: 64, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sym_hvclock_page", scope: !472, file: !473, line: 23, baseType: !279, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sym_timens_page", scope: !472, file: !473, line: 24, baseType: !279, size: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sym_VDSO32_NOTE_MASK", scope: !472, file: !473, line: 25, baseType: !279, size: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_sigreturn", scope: !472, file: !473, line: 26, baseType: !279, size: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_rt_sigreturn", scope: !472, file: !473, line: 27, baseType: !279, size: 64, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sym___kernel_vsyscall", scope: !472, file: !473, line: 28, baseType: !279, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sym_int80_landing_pad", scope: !472, file: !473, line: 29, baseType: !279, size: 64, offset: 832)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !452, file: !451, line: 44, baseType: !385, size: 32, offset: 832)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !452, file: !451, line: 50, baseType: !491, size: 16, offset: 864)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !364, line: 19, baseType: !492)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !366, line: 24, baseType: !286)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !452, file: !451, line: 51, baseType: !494, size: 16, offset: 880)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !364, line: 18, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !366, line: 23, baseType: !496)
!496 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !335, line: 495, baseType: !294, size: 64, offset: 6528)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !355, file: !335, line: 497, baseType: !499, size: 64, offset: 6592)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !335, line: 381, size: 384, elements: !501)
!501 = !{!502, !503, !1405}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !500, file: !335, line: 382, baseType: !385, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !500, file: !335, line: 383, baseType: !504, size: 128, offset: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !335, line: 376, size: 128, elements: !505)
!505 = !{!506, !1403}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !504, file: !335, line: 377, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !509, line: 640, size: 48640, elements: !510)
!509 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!510 = !{!511, !519, !521, !522, !528, !529, !530, !531, !532, !533, !534, !535, !539, !557, !568, !663, !664, !665, !676, !677, !679, !680, !681, !682, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !761, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !817, !819, !820, !821, !833, !835, !836, !837, !838, !839, !845, !846, !847, !848, !849, !850, !851, !863, !868, !873, !874, !875, !878, !882, !885, !888, !891, !894, !898, !901, !904, !910, !911, !912, !918, !919, !920, !921, !922, !931, !932, !933, !934, !935, !940, !941, !942, !945, !946, !949, !952, !955, !958, !961, !964, !965, !1045, !1048, !1051, !1052, !1055, !1056, !1057, !1063, !1064, !1065, !1078, !1079, !1080, !1090, !1095, !1098, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !508, file: !509, line: 646, baseType: !512, size: 128)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !513, line: 56, size: 128, elements: !514)
!513 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !512, file: !513, line: 57, baseType: !294, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !512, file: !513, line: 58, baseType: !517, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !364, line: 21, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !366, line: 27, baseType: !7)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !508, file: !509, line: 649, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !279)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !508, file: !509, line: 657, baseType: !134, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !508, file: !509, line: 658, baseType: !523, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !524, line: 113, baseType: !525)
!524 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !524, line: 111, size: 32, elements: !526)
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !525, file: !524, line: 112, baseType: !385, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !509, line: 660, baseType: !7, size: 32, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !508, file: !509, line: 661, baseType: !7, size: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !508, file: !509, line: 684, baseType: !140, size: 32, offset: 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !508, file: !509, line: 686, baseType: !140, size: 32, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !508, file: !509, line: 687, baseType: !140, size: 32, offset: 416)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !508, file: !509, line: 688, baseType: !140, size: 32, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !508, file: !509, line: 689, baseType: !7, size: 32, offset: 480)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !508, file: !509, line: 691, baseType: !536, size: 64, offset: 512)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !509, line: 691, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !508, file: !509, line: 692, baseType: !540, size: 832, offset: 576)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !509, line: 451, size: 832, elements: !541)
!541 = !{!542, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !540, file: !509, line: 453, baseType: !543, size: 128)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !509, line: 325, size: 128, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !543, file: !509, line: 326, baseType: !294, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !543, file: !509, line: 327, baseType: !517, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !540, file: !509, line: 454, baseType: !342, size: 192, align: 64, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !540, file: !509, line: 455, baseType: !190, size: 128, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !540, file: !509, line: 456, baseType: !7, size: 32, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !540, file: !509, line: 458, baseType: !363, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !540, file: !509, line: 459, baseType: !363, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !540, file: !509, line: 460, baseType: !363, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !540, file: !509, line: 461, baseType: !363, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !540, file: !509, line: 463, baseType: !363, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !540, file: !509, line: 465, baseType: !556, offset: 832)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !509, line: 415, elements: !217)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !508, file: !509, line: 693, baseType: !558, size: 384, offset: 1408)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !509, line: 489, size: 384, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !558, file: !509, line: 490, baseType: !190, size: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !558, file: !509, line: 491, baseType: !294, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !558, file: !509, line: 492, baseType: !294, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !558, file: !509, line: 493, baseType: !7, size: 32, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !558, file: !509, line: 494, baseType: !286, size: 16, offset: 288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !558, file: !509, line: 495, baseType: !286, size: 16, offset: 304)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !558, file: !509, line: 497, baseType: !567, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !508, file: !509, line: 697, baseType: !569, size: 1792, offset: 1792)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !509, line: 507, size: 1792, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !660, !661}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !569, file: !509, line: 508, baseType: !342, size: 192, align: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !569, file: !509, line: 515, baseType: !363, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !569, file: !509, line: 516, baseType: !363, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !569, file: !509, line: 517, baseType: !363, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !569, file: !509, line: 518, baseType: !363, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !569, file: !509, line: 519, baseType: !363, size: 64, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !569, file: !509, line: 526, baseType: !399, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !569, file: !509, line: 527, baseType: !363, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !509, line: 528, baseType: !7, size: 32, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !569, file: !509, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !569, file: !509, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !569, file: !509, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !569, file: !509, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !569, file: !509, line: 563, baseType: !585, size: 512, offset: 704)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 118, size: 512, elements: !586)
!586 = !{!587, !595, !596, !601, !653, !657, !658, !659}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !585, file: !6, line: 119, baseType: !588, size: 256)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !589, line: 9, size: 256, elements: !590)
!589 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !588, file: !589, line: 10, baseType: !342, size: 192, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !588, file: !589, line: 11, baseType: !593, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !594, line: 29, baseType: !399)
!594 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !585, file: !6, line: 120, baseType: !593, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !585, file: !6, line: 121, baseType: !597, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!5, !600}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !585, file: !6, line: 122, baseType: !602, size: 64, offset: 384)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 159, size: 512, align: 512, elements: !604)
!604 = !{!605, !625, !626, !629, !639, !640, !648, !652}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !603, file: !6, line: 160, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 214, size: 4608, align: 512, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !607, file: !6, line: 215, baseType: !410)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !607, file: !6, line: 216, baseType: !7, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !607, file: !6, line: 217, baseType: !7, size: 32, offset: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !607, file: !6, line: 218, baseType: !7, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !607, file: !6, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !607, file: !6, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !607, file: !6, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !607, file: !6, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !607, file: !6, line: 233, baseType: !593, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !607, file: !6, line: 234, baseType: !600, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !607, file: !6, line: 235, baseType: !593, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !607, file: !6, line: 236, baseType: !600, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !607, file: !6, line: 237, baseType: !622, size: 4096, offset: 512)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 4096, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !603, file: !6, line: 161, baseType: !7, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !603, file: !6, line: 162, baseType: !627, size: 32, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !168, line: 27, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !277, line: 96, baseType: !140)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !603, file: !6, line: 163, baseType: !630, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !631, line: 276, baseType: !632)
!631 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !631, line: 276, size: 32, elements: !633)
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !632, file: !631, line: 276, baseType: !635, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !631, line: 70, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !631, line: 65, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !636, file: !631, line: 66, baseType: !7, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !603, file: !6, line: 164, baseType: !600, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !603, file: !6, line: 165, baseType: !641, size: 128, offset: 256)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !589, line: 14, size: 128, elements: !642)
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !641, file: !589, line: 15, baseType: !644, size: 128)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !343, line: 125, size: 128, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !644, file: !343, line: 126, baseType: !359, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !644, file: !343, line: 127, baseType: !347, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !603, file: !6, line: 166, baseType: !649, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!593}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !603, file: !6, line: 167, baseType: !593, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !585, file: !6, line: 123, baseType: !654, size: 8, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !364, line: 17, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !366, line: 21, baseType: !656)
!656 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !585, file: !6, line: 124, baseType: !654, size: 8, offset: 456)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !585, file: !6, line: 125, baseType: !654, size: 8, offset: 464)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !585, file: !6, line: 126, baseType: !654, size: 8, offset: 472)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !569, file: !509, line: 572, baseType: !585, size: 512, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !569, file: !509, line: 580, baseType: !662, size: 64, offset: 1728)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !508, file: !509, line: 721, baseType: !7, size: 32, offset: 3584)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !508, file: !509, line: 722, baseType: !140, size: 32, offset: 3616)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !508, file: !509, line: 723, baseType: !666, size: 64, offset: 3648)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !669, line: 17, baseType: !670)
!669 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !669, line: 17, size: 64, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !670, file: !669, line: 17, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 64, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 1)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !508, file: !509, line: 724, baseType: !668, size: 64, offset: 3712)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !508, file: !509, line: 749, baseType: !678, offset: 3776)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !509, line: 290, elements: !217)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !508, file: !509, line: 751, baseType: !190, size: 128, offset: 3776)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !508, file: !509, line: 757, baseType: !351, size: 64, offset: 3904)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !508, file: !509, line: 758, baseType: !351, size: 64, offset: 3968)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !508, file: !509, line: 761, baseType: !683, size: 320, offset: 4032)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !440, line: 34, size: 320, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !683, file: !440, line: 35, baseType: !363, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !683, file: !440, line: 36, baseType: !687, size: 256, offset: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 256, elements: !444)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !508, file: !509, line: 766, baseType: !140, size: 32, offset: 4352)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !508, file: !509, line: 767, baseType: !140, size: 32, offset: 4384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !508, file: !509, line: 768, baseType: !140, size: 32, offset: 4416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !508, file: !509, line: 770, baseType: !140, size: 32, offset: 4448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !508, file: !509, line: 772, baseType: !294, size: 64, offset: 4480)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !508, file: !509, line: 775, baseType: !7, size: 32, offset: 4544)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !508, file: !509, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !508, file: !509, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !508, file: !509, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !508, file: !509, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !508, file: !509, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !508, file: !509, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !508, file: !509, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !508, file: !509, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !508, file: !509, line: 831, baseType: !294, size: 64, offset: 4672)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !508, file: !509, line: 833, baseType: !704, size: 384, offset: 4736)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !705)
!705 = !{!706, !711}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !704, file: !12, line: 26, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!279, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, scope: !704, file: !12, line: 27, baseType: !712, size: 320, offset: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !704, file: !12, line: 27, size: 320, elements: !713)
!713 = !{!714, !724, !751}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !712, file: !12, line: 36, baseType: !715, size: 320)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !712, file: !12, line: 29, size: 320, elements: !716)
!716 = !{!717, !719, !720, !721, !722, !723}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !715, file: !12, line: 30, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !715, file: !12, line: 31, baseType: !517, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !12, line: 32, baseType: !517, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !715, file: !12, line: 33, baseType: !517, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !715, file: !12, line: 34, baseType: !363, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !715, file: !12, line: 35, baseType: !718, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !712, file: !12, line: 46, baseType: !725, size: 192)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !712, file: !12, line: 38, size: 192, elements: !726)
!726 = !{!727, !728, !729, !750}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !725, file: !12, line: 39, baseType: !627, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !725, file: !12, line: 41, baseType: !730, size: 64, offset: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !725, file: !12, line: 41, size: 64, elements: !731)
!731 = !{!732, !740}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !730, file: !12, line: 42, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !735, line: 7, size: 128, elements: !736)
!735 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!736 = !{!737, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !734, file: !735, line: 8, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !277, line: 93, baseType: !327)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !734, file: !735, line: 9, baseType: !327, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !730, file: !12, line: 43, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !743, line: 7, size: 64, elements: !744)
!743 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!744 = !{!745, !749}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !742, file: !743, line: 8, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !743, line: 5, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !364, line: 20, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !366, line: 26, baseType: !140)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !742, file: !743, line: 9, baseType: !747, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !725, file: !12, line: 45, baseType: !363, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !712, file: !12, line: 54, baseType: !752, size: 256)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !712, file: !12, line: 48, size: 256, elements: !753)
!753 = !{!754, !757, !758, !759, !760}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !752, file: !12, line: 49, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !752, file: !12, line: 50, baseType: !140, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !752, file: !12, line: 51, baseType: !140, size: 32, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !752, file: !12, line: 52, baseType: !294, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !752, file: !12, line: 53, baseType: !294, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !508, file: !509, line: 835, baseType: !762, size: 32, offset: 5120)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !168, line: 22, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !277, line: 28, baseType: !140)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !508, file: !509, line: 836, baseType: !762, size: 32, offset: 5152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !508, file: !509, line: 840, baseType: !294, size: 64, offset: 5184)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !508, file: !509, line: 849, baseType: !507, size: 64, offset: 5248)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !508, file: !509, line: 852, baseType: !507, size: 64, offset: 5312)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !508, file: !509, line: 857, baseType: !190, size: 128, offset: 5376)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !508, file: !509, line: 858, baseType: !190, size: 128, offset: 5504)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !508, file: !509, line: 859, baseType: !507, size: 64, offset: 5632)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !508, file: !509, line: 867, baseType: !190, size: 128, offset: 5696)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !508, file: !509, line: 868, baseType: !190, size: 128, offset: 5824)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !508, file: !509, line: 871, baseType: !774, size: 64, offset: 5952)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !776, line: 59, size: 768, elements: !777)
!776 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!777 = !{!778, !779, !780, !781, !792, !793, !800, !809}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !775, file: !776, line: 61, baseType: !523, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !775, file: !776, line: 62, baseType: !7, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !775, file: !776, line: 63, baseType: !203, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !775, file: !776, line: 65, baseType: !782, size: 256, offset: 64)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 256, elements: !444)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !168, line: 182, size: 64, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !783, file: !168, line: 183, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !168, line: 186, size: 128, elements: !788)
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !787, file: !168, line: 187, baseType: !786, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !787, file: !168, line: 187, baseType: !791, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !775, file: !776, line: 66, baseType: !783, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !775, file: !776, line: 68, baseType: !794, size: 128, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !795, line: 40, baseType: !796)
!795 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !795, line: 36, size: 128, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !796, file: !795, line: 37, baseType: !203)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !796, file: !795, line: 38, baseType: !190, size: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !775, file: !776, line: 69, baseType: !801, size: 128, align: 64, offset: 512)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !168, line: 216, size: 128, align: 64, elements: !802)
!802 = !{!803, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !168, line: 217, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !801, file: !168, line: 218, baseType: !806, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !804}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !775, file: !776, line: 70, baseType: !810, size: 128, offset: 640)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !674)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !776, line: 54, size: 128, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !811, file: !776, line: 55, baseType: !140, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !811, file: !776, line: 56, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !776, line: 56, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !508, file: !509, line: 872, baseType: !818, size: 512, offset: 6016)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 512, elements: !444)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !508, file: !509, line: 873, baseType: !190, size: 128, offset: 6528)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !508, file: !509, line: 874, baseType: !190, size: 128, offset: 6656)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !508, file: !509, line: 876, baseType: !822, size: 64, offset: 6784)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !824, line: 26, size: 192, elements: !825)
!824 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !823, file: !824, line: 27, baseType: !7, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !823, file: !824, line: 28, baseType: !828, size: 128, offset: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !829, line: 43, size: 128, elements: !830)
!829 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !828, file: !829, line: 44, baseType: !410)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !828, file: !829, line: 45, baseType: !190, size: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !508, file: !509, line: 879, baseType: !834, size: 64, offset: 6848)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !508, file: !509, line: 882, baseType: !834, size: 64, offset: 6912)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !508, file: !509, line: 884, baseType: !363, size: 64, offset: 6976)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !508, file: !509, line: 885, baseType: !363, size: 64, offset: 7040)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !508, file: !509, line: 890, baseType: !363, size: 64, offset: 7104)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !508, file: !509, line: 891, baseType: !840, size: 128, offset: 7168)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !509, line: 242, size: 128, elements: !841)
!841 = !{!842, !843, !844}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !840, file: !509, line: 244, baseType: !363, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !840, file: !509, line: 245, baseType: !363, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !840, file: !509, line: 246, baseType: !410, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !508, file: !509, line: 900, baseType: !294, size: 64, offset: 7296)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !508, file: !509, line: 901, baseType: !294, size: 64, offset: 7360)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !508, file: !509, line: 904, baseType: !363, size: 64, offset: 7424)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !508, file: !509, line: 907, baseType: !363, size: 64, offset: 7488)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !508, file: !509, line: 910, baseType: !294, size: 64, offset: 7552)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !508, file: !509, line: 911, baseType: !294, size: 64, offset: 7616)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !508, file: !509, line: 914, baseType: !852, size: 640, offset: 7680)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !853, line: 123, size: 640, elements: !854)
!853 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!854 = !{!855, !861, !862}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !852, file: !853, line: 124, baseType: !856, size: 576)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 576, elements: !245)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !853, line: 108, size: 192, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !857, file: !853, line: 109, baseType: !363, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !857, file: !853, line: 110, baseType: !641, size: 128, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !852, file: !853, line: 125, baseType: !7, size: 32, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !852, file: !853, line: 126, baseType: !7, size: 32, offset: 608)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !508, file: !509, line: 917, baseType: !864, size: 192, offset: 8320)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !853, line: 134, size: 192, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !864, file: !853, line: 135, baseType: !801, size: 128, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !864, file: !853, line: 136, baseType: !7, size: 32, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !508, file: !509, line: 923, baseType: !869, size: 64, offset: 8512)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !872, line: 11, flags: DIFlagFwdDecl)
!872 = !DIFile(filename: "./include/linux/umh.h", directory: "/home/lizy2001/genbc/linux")
!873 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !508, file: !509, line: 926, baseType: !869, size: 64, offset: 8576)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !508, file: !509, line: 929, baseType: !869, size: 64, offset: 8640)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !508, file: !509, line: 933, baseType: !876, size: 64, offset: 8704)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !509, line: 933, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !508, file: !509, line: 943, baseType: !879, size: 128, offset: 8768)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 16)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !508, file: !509, line: 945, baseType: !883, size: 64, offset: 8896)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !509, line: 49, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !508, file: !509, line: 956, baseType: !886, size: 64, offset: 8960)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !509, line: 45, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !508, file: !509, line: 959, baseType: !889, size: 64, offset: 9024)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !509, line: 959, flags: DIFlagFwdDecl)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !508, file: !509, line: 962, baseType: !892, size: 64, offset: 9088)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !509, line: 66, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !508, file: !509, line: 966, baseType: !895, size: 64, offset: 9152)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !897, line: 35, flags: DIFlagFwdDecl)
!897 = !DIFile(filename: "./include/linux/sysctl.h", directory: "/home/lizy2001/genbc/linux")
!898 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !508, file: !509, line: 969, baseType: !899, size: 64, offset: 9216)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !853, line: 223, flags: DIFlagFwdDecl)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !508, file: !509, line: 970, baseType: !902, size: 64, offset: 9280)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !509, line: 62, flags: DIFlagFwdDecl)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !508, file: !509, line: 971, baseType: !905, size: 64, offset: 9344)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !906, line: 25, baseType: !907)
!906 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !906, line: 23, size: 64, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !907, file: !906, line: 24, baseType: !673, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !508, file: !509, line: 972, baseType: !905, size: 64, offset: 9408)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !508, file: !509, line: 974, baseType: !905, size: 64, offset: 9472)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !508, file: !509, line: 975, baseType: !913, size: 192, offset: 9536)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !914, line: 30, size: 192, elements: !915)
!914 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !913, file: !914, line: 31, baseType: !190, size: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !913, file: !914, line: 32, baseType: !905, size: 64, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !508, file: !509, line: 976, baseType: !294, size: 64, offset: 9728)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !508, file: !509, line: 977, baseType: !291, size: 64, offset: 9792)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !508, file: !509, line: 978, baseType: !7, size: 32, offset: 9856)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !508, file: !509, line: 980, baseType: !804, size: 64, offset: 9920)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !508, file: !509, line: 989, baseType: !923, size: 128, offset: 9984)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !924, line: 35, size: 128, elements: !925)
!924 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !923, file: !924, line: 36, baseType: !140, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !923, file: !924, line: 37, baseType: !385, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !923, file: !924, line: 38, baseType: !929, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !924, line: 23, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !508, file: !509, line: 992, baseType: !363, size: 64, offset: 10112)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !508, file: !509, line: 993, baseType: !363, size: 64, offset: 10176)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !508, file: !509, line: 996, baseType: !203, offset: 10240)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !508, file: !509, line: 999, baseType: !410, offset: 10240)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !508, file: !509, line: 1001, baseType: !936, size: 64, offset: 10240)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !509, line: 636, size: 64, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !509, line: 637, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !508, file: !509, line: 1005, baseType: !644, size: 128, offset: 10304)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !508, file: !509, line: 1007, baseType: !507, size: 64, offset: 10432)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !508, file: !509, line: 1009, baseType: !943, size: 64, offset: 10496)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !509, line: 1009, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !508, file: !509, line: 1043, baseType: !134, size: 64, offset: 10560)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !508, file: !509, line: 1046, baseType: !947, size: 64, offset: 10624)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !509, line: 41, flags: DIFlagFwdDecl)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !508, file: !509, line: 1050, baseType: !950, size: 64, offset: 10688)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !509, line: 42, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !508, file: !509, line: 1054, baseType: !953, size: 64, offset: 10752)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !509, line: 55, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !508, file: !509, line: 1056, baseType: !956, size: 64, offset: 10816)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !509, line: 40, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !508, file: !509, line: 1058, baseType: !959, size: 64, offset: 10880)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !509, line: 47, flags: DIFlagFwdDecl)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !508, file: !509, line: 1061, baseType: !962, size: 64, offset: 10944)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !509, line: 43, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !508, file: !509, line: 1064, baseType: !294, size: 64, offset: 11008)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !508, file: !509, line: 1065, baseType: !966, size: 64, offset: 11072)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !914, line: 14, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !914, line: 12, size: 384, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, scope: !968, file: !914, line: 13, baseType: !971, size: 384)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !968, file: !914, line: 13, size: 384, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !971, file: !914, line: 13, baseType: !140, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !971, file: !914, line: 13, baseType: !140, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !971, file: !914, line: 13, baseType: !140, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !971, file: !914, line: 13, baseType: !977, size: 256, offset: 128)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !978, line: 32, size: 256, elements: !979)
!978 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!979 = !{!980, !986, !999, !1005, !1014, !1034, !1039}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !977, file: !978, line: 37, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !978, line: 34, size: 64, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !981, file: !978, line: 35, baseType: !763, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !981, file: !978, line: 36, baseType: !985, size: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !277, line: 49, baseType: !7)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !977, file: !978, line: 45, baseType: !987, size: 192)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !978, line: 40, size: 192, elements: !988)
!988 = !{!989, !991, !992, !998}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !987, file: !978, line: 41, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !277, line: 95, baseType: !140)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !987, file: !978, line: 42, baseType: !140, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !987, file: !978, line: 43, baseType: !993, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !978, line: 11, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !978, line: 8, size: 64, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !994, file: !978, line: 9, baseType: !140, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !994, file: !978, line: 10, baseType: !134, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !987, file: !978, line: 44, baseType: !140, size: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !977, file: !978, line: 52, baseType: !1000, size: 128)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !978, line: 48, size: 128, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1000, file: !978, line: 49, baseType: !763, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1000, file: !978, line: 50, baseType: !985, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !1000, file: !978, line: 51, baseType: !993, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !977, file: !978, line: 61, baseType: !1006, size: 256)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !977, file: !978, line: 55, size: 256, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1013}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !1006, file: !978, line: 56, baseType: !763, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !1006, file: !978, line: 57, baseType: !985, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !1006, file: !978, line: 58, baseType: !140, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !1006, file: !978, line: 59, baseType: !1012, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !277, line: 94, baseType: !278)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !1006, file: !978, line: 60, baseType: !1012, size: 64, offset: 192)
