; ModuleID = '../bcout/drivers/pnp/interface.llvm.bc'
source_filename = "drivers/pnp/interface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.attribute_group = type { i8*, i16 (%struct.kobject*, %struct.attribute*, i32)*, i16 (%struct.kobject*, %struct.bin_attribute*, i32)*, %struct.attribute**, %struct.bin_attribute** }
%struct.kobject = type { i8*, %struct.list_head, %struct.kobject*, %struct.kset*, %struct.kobj_type*, %struct.kernfs_node*, %struct.kref, i8 }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }
%struct.kset = type { %struct.list_head, %struct.spinlock, %struct.kobject, %struct.kset_uevent_ops* }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.kset_uevent_ops = type { i32 (%struct.kset*, %struct.kobject*)*, i8* (%struct.kset*, %struct.kobject*)*, i32 (%struct.kset*, %struct.kobject*, %struct.kobj_uevent_env*)* }
%struct.kobj_uevent_env = type { [3 x i8*], [64 x i8*], i32, [2048 x i8], i32 }
%struct.kobj_type = type { void (%struct.kobject*)*, %struct.sysfs_ops*, %struct.attribute**, %struct.attribute_group**, %struct.kobj_ns_type_operations* (%struct.kobject*)*, i8* (%struct.kobject*)*, void (%struct.kobject*, %struct.kuid_t*, %struct.kgid_t*)* }

!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !55, globals: !2111, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/pnp/interface.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12, !17, !23, !29, !36, !44, !50}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kobj_ns_type", file: !6, line: 26, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "KOBJ_NS_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KOBJ_NS_TYPE_NET", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KOBJ_NS_TYPES", value: 2, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !13, line: 65, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !18, line: 16, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !24, line: 44, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/device/driver.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28}
!26 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !30, line: 343, baseType: !7, size: 32, elements: !31)
!30 = !DIFile(filename: "./include/linux/device.h", directory: "/home/lizy2001/genbc/linux")
!31 = !{!32, !33, !34, !35}
!32 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!33 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!34 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!35 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !37, line: 524, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !37, line: 502, baseType: !7, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 10, baseType: !7, size: 32, elements: !52)
!51 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !54}
!53 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!54 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!55 = !{!56, !57, !2050, !252, !2070, !2110}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pnp_dev", file: !59, line: 243, size: 7488, elements: !60)
!59 = !DIFile(filename: "./include/linux/pnp.h", directory: "/home/lizy2001/genbc/linux")
!60 = !{!61, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1944, !1971, !1997, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !58, file: !59, line: 244, baseType: !62, size: 5568)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !30, line: 461, size: 5568, elements: !63)
!63 = !{!64, !1544, !1546, !1549, !1550, !1601, !1698, !1699, !1700, !1701, !1702, !1711, !1816, !1829, !1832, !1833, !1837, !1839, !1840, !1841, !1845, !1851, !1852, !1855, !1859, !1862, !1865, !1866, !1867, !1868, !1900, !1901, !1902, !1905, !1908, !1909, !1910, !1911}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !62, file: !30, line: 462, baseType: !65, size: 512)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !66, line: 64, size: 512, elements: !67)
!66 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !72, !79, !81, !142, !1380, !1534, !1539, !1540, !1541, !1542, !1543}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 65, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !65, file: !66, line: 66, baseType: !73, size: 128, offset: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !74, line: 178, size: 128, elements: !75)
!74 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!75 = !{!76, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !73, file: !74, line: 179, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !73, file: !74, line: 179, baseType: !77, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !65, file: !66, line: 67, baseType: !80, size: 64, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !65, file: !66, line: 68, baseType: !82, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !66, line: 192, size: 704, elements: !84)
!84 = !{!85, !86, !102, !103}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !83, file: !66, line: 193, baseType: !73, size: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !83, file: !66, line: 194, baseType: !87, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !88, line: 83, baseType: !89)
!88 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !88, line: 71, elements: !90)
!90 = !{!91}
!91 = !DIDerivedType(tag: DW_TAG_member, scope: !89, file: !88, line: 72, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !89, file: !88, line: 72, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !92, file: !88, line: 73, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !88, line: 20, elements: !96)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !95, file: !88, line: 21, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !99, line: 25, baseType: !100)
!99 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !99, line: 25, elements: !101)
!101 = !{}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !83, file: !66, line: 195, baseType: !65, size: 512, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !83, file: !66, line: 196, baseType: !104, size: 64, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !66, line: 156, size: 192, elements: !107)
!107 = !{!108, !114, !119}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !106, file: !66, line: 157, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !82, !80}
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !106, file: !66, line: 158, baseType: !115, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!69, !82, !80}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !106, file: !66, line: 159, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!113, !82, !80, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !66, line: 148, size: 20736, elements: !126)
!126 = !{!127, !132, !136, !137, !141}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !125, file: !66, line: 149, baseType: !128, size: 192)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 192, elements: !130)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!130 = !{!131}
!131 = !DISubrange(count: 3)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !125, file: !66, line: 150, baseType: !133, size: 4096, offset: 192)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !129, size: 4096, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !125, file: !66, line: 151, baseType: !113, size: 32, offset: 4288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !66, line: 152, baseType: !138, size: 16384, offset: 4320)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 16384, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 2048)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !125, file: !66, line: 153, baseType: !113, size: 32, offset: 20704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !65, file: !66, line: 69, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !66, line: 138, size: 448, elements: !145)
!145 = !{!146, !150, !180, !182, !1326, !1359, !1363}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !144, file: !66, line: 139, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{null, !80}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !144, file: !66, line: 140, baseType: !151, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !154, line: 230, size: 128, elements: !155)
!154 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!155 = !{!156, !172}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !153, file: !154, line: 231, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!160, !80, !165, !129}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !74, line: 60, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !162, line: 73, baseType: !163)
!162 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !162, line: 15, baseType: !164)
!164 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !154, line: 30, size: 128, elements: !167)
!167 = !{!168, !169}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !154, line: 31, baseType: !69, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !166, file: !154, line: 32, baseType: !170, size: 16, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !74, line: 19, baseType: !171)
!171 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !153, file: !154, line: 232, baseType: !173, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!160, !80, !165, !69, !176}
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 55, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !162, line: 72, baseType: !178)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !162, line: 16, baseType: !179)
!179 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !144, file: !66, line: 141, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !144, file: !66, line: 142, baseType: !183, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !154, line: 84, size: 320, elements: !187)
!187 = !{!188, !189, !193, !1323, !1324}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !154, line: 85, baseType: !69, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !186, file: !154, line: 86, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!170, !80, !165, !113}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !186, file: !154, line: 88, baseType: !194, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!170, !80, !197, !113}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !154, line: 168, size: 448, elements: !199)
!199 = !{!200, !201, !202, !203, !213, !214}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !198, file: !154, line: 169, baseType: !166, size: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !198, file: !154, line: 170, baseType: !176, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !198, file: !154, line: 171, baseType: !56, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !198, file: !154, line: 172, baseType: !204, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!160, !207, !80, !197, !129, !210, !176}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !209, line: 526, flags: DIFlagFwdDecl)
!209 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/home/lizy2001/genbc/linux")
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !74, line: 46, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !162, line: 88, baseType: !212)
!212 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !198, file: !154, line: 174, baseType: !204, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !198, file: !154, line: 176, baseType: !215, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!113, !207, !80, !197, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !220, line: 305, size: 1472, elements: !221)
!220 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!221 = !{!222, !223, !224, !225, !226, !234, !235, !1297, !1303, !1304, !1309, !1310, !1313, !1317, !1318, !1319, !1320, !1321}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !219, file: !220, line: 308, baseType: !179, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !219, file: !220, line: 309, baseType: !179, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !219, file: !220, line: 313, baseType: !218, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !219, file: !220, line: 313, baseType: !218, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !219, file: !220, line: 315, baseType: !227, size: 192, align: 64, offset: 256)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !228, line: 24, size: 192, align: 64, elements: !229)
!228 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!229 = !{!230, !231, !233}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !227, file: !228, line: 25, baseType: !179, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !227, file: !228, line: 26, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !227, file: !228, line: 27, baseType: !232, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !219, file: !220, line: 323, baseType: !179, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !219, file: !220, line: 327, baseType: !236, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !220, line: 388, size: 7296, elements: !238)
!238 = !{!239, !1293}
!239 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !220, line: 389, baseType: !240, size: 7296)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !220, line: 389, size: 7296, elements: !241)
!241 = !{!242, !243, !247, !253, !257, !258, !259, !260, !261, !269, !274, !275, !276, !277, !286, !287, !288, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !323, !331, !334, !366, !367, !1263, !1264, !1267, !1271, !1272, !1275, !1276, !1277, !1280, !1292}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !240, file: !220, line: 390, baseType: !218, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !240, file: !220, line: 391, baseType: !244, size: 64, offset: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !228, line: 31, size: 64, elements: !245)
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !244, file: !228, line: 32, baseType: !232, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !240, file: !220, line: 392, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !249, line: 23, baseType: !250)
!249 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !251, line: 31, baseType: !252)
!251 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!252 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !240, file: !220, line: 394, baseType: !254, size: 64, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{!179, !207, !179, !179, !179, !179}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !240, file: !220, line: 398, baseType: !179, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !240, file: !220, line: 399, baseType: !179, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !240, file: !220, line: 405, baseType: !179, size: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !240, file: !220, line: 406, baseType: !179, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !240, file: !220, line: 407, baseType: !262, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !209, line: 286, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !209, line: 286, size: 64, elements: !265)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !264, file: !209, line: 286, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !268, line: 18, baseType: !179)
!268 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/home/lizy2001/genbc/linux")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !240, file: !220, line: 416, baseType: !270, size: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !74, line: 168, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 166, size: 32, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !271, file: !74, line: 167, baseType: !113, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !240, file: !220, line: 428, baseType: !270, size: 32, offset: 608)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !240, file: !220, line: 437, baseType: !270, size: 32, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "has_pinned", scope: !240, file: !220, line: 447, baseType: !270, size: 32, offset: 672)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !240, file: !220, line: 450, baseType: !278, size: 64, offset: 704)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !279, line: 13, baseType: !280)
!279 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !74, line: 175, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !74, line: 173, size: 64, elements: !282)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !281, file: !74, line: 174, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !249, line: 22, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !251, line: 30, baseType: !212)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !240, file: !220, line: 452, baseType: !113, size: 32, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !240, file: !220, line: 454, baseType: !87, offset: 800)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_lock", scope: !240, file: !220, line: 457, baseType: !289, size: 256, offset: 832)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !290, line: 35, size: 256, elements: !291)
!290 = !DIFile(filename: "./include/linux/rwsem.h", directory: "/home/lizy2001/genbc/linux")
!291 = !{!292, !293, !294, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !289, file: !290, line: 36, baseType: !278, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !289, file: !290, line: 42, baseType: !278, size: 64, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !289, file: !290, line: 46, baseType: !295, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !88, line: 29, baseType: !95)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !289, file: !290, line: 47, baseType: !73, size: 128, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !240, file: !220, line: 459, baseType: !73, size: 128, offset: 1088)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !240, file: !220, line: 466, baseType: !179, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !240, file: !220, line: 467, baseType: !179, size: 64, offset: 1280)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !240, file: !220, line: 469, baseType: !179, size: 64, offset: 1344)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !240, file: !220, line: 470, baseType: !179, size: 64, offset: 1408)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !240, file: !220, line: 471, baseType: !280, size: 64, offset: 1472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !240, file: !220, line: 472, baseType: !179, size: 64, offset: 1536)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !240, file: !220, line: 473, baseType: !179, size: 64, offset: 1600)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !240, file: !220, line: 474, baseType: !179, size: 64, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !240, file: !220, line: 475, baseType: !179, size: 64, offset: 1728)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !240, file: !220, line: 477, baseType: !87, offset: 1792)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !240, file: !220, line: 478, baseType: !179, size: 64, offset: 1792)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !240, file: !220, line: 478, baseType: !179, size: 64, offset: 1856)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !240, file: !220, line: 478, baseType: !179, size: 64, offset: 1920)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !240, file: !220, line: 478, baseType: !179, size: 64, offset: 1984)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !240, file: !220, line: 479, baseType: !179, size: 64, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !240, file: !220, line: 479, baseType: !179, size: 64, offset: 2112)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !240, file: !220, line: 479, baseType: !179, size: 64, offset: 2176)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !240, file: !220, line: 480, baseType: !179, size: 64, offset: 2240)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !240, file: !220, line: 480, baseType: !179, size: 64, offset: 2304)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !240, file: !220, line: 480, baseType: !179, size: 64, offset: 2368)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !240, file: !220, line: 480, baseType: !179, size: 64, offset: 2432)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !240, file: !220, line: 482, baseType: !320, size: 2816, offset: 2496)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 2816, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 44)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !240, file: !220, line: 488, baseType: !324, size: 256, offset: 5312)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !325, line: 60, size: 256, elements: !326)
!325 = !DIFile(filename: "./include/linux/mm_types_task.h", directory: "/home/lizy2001/genbc/linux")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !324, file: !325, line: 61, baseType: !328, size: 256)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !278, size: 256, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 4)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !240, file: !220, line: 490, baseType: !332, size: 64, offset: 5568)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !220, line: 490, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !240, file: !220, line: 493, baseType: !335, size: 896, offset: 5632)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !336, line: 53, baseType: !337)
!336 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/home/lizy2001/genbc/linux")
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !336, line: 13, size: 896, elements: !338)
!338 = !{!339, !340, !341, !342, !345, !346, !353, !354, !358, !359, !362}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !337, file: !336, line: 18, baseType: !248, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !337, file: !336, line: 28, baseType: !280, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !337, file: !336, line: 31, baseType: !289, size: 256, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !337, file: !336, line: 32, baseType: !343, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !336, line: 32, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !337, file: !336, line: 37, baseType: !171, size: 16, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !337, file: !336, line: 40, baseType: !347, size: 192, offset: 512)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !348, line: 53, size: 192, elements: !349)
!348 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/lizy2001/genbc/linux")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !347, file: !348, line: 54, baseType: !278, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !347, file: !348, line: 55, baseType: !87, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !347, file: !348, line: 59, baseType: !73, size: 128, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !337, file: !336, line: 41, baseType: !56, size: 64, offset: 704)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !337, file: !336, line: 42, baseType: !355, size: 64, offset: 768)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !336, line: 42, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !337, file: !336, line: 44, baseType: !270, size: 32, offset: 832)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !337, file: !336, line: 50, baseType: !360, size: 16, offset: 864)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !249, line: 19, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !251, line: 24, baseType: !171)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !337, file: !336, line: 51, baseType: !363, size: 16, offset: 880)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !249, line: 18, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !251, line: 23, baseType: !365)
!365 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !240, file: !220, line: 495, baseType: !179, size: 64, offset: 6528)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !240, file: !220, line: 497, baseType: !368, size: 64, offset: 6592)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !220, line: 381, size: 384, elements: !370)
!370 = !{!371, !372, !1262}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !369, file: !220, line: 382, baseType: !270, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !369, file: !220, line: 383, baseType: !373, size: 128, offset: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !220, line: 376, size: 128, elements: !374)
!374 = !{!375, !1260}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !373, file: !220, line: 377, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !378, line: 640, size: 48640, elements: !379)
!378 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!379 = !{!380, !388, !390, !391, !397, !398, !399, !400, !401, !402, !403, !404, !408, !426, !437, !532, !533, !534, !545, !546, !548, !549, !550, !551, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !630, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !686, !688, !689, !690, !702, !704, !705, !706, !707, !708, !714, !715, !716, !717, !718, !719, !720, !732, !737, !741, !742, !743, !746, !750, !753, !756, !759, !762, !765, !768, !771, !777, !778, !779, !785, !786, !787, !788, !789, !798, !799, !800, !801, !802, !807, !808, !809, !812, !813, !816, !819, !822, !825, !828, !831, !832, !912, !915, !918, !919, !922, !923, !924, !930, !931, !932, !945, !946, !947, !959, !964, !967, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !377, file: !378, line: 646, baseType: !381, size: 128)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !382, line: 56, size: 128, elements: !383)
!382 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !381, file: !382, line: 57, baseType: !179, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !381, file: !382, line: 58, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !249, line: 21, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !251, line: 27, baseType: !7)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !378, line: 649, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !164)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !377, file: !378, line: 657, baseType: !56, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !377, file: !378, line: 658, baseType: !392, size: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !393, line: 113, baseType: !394)
!393 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !393, line: 111, size: 32, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !394, file: !393, line: 112, baseType: !270, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !378, line: 660, baseType: !7, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !377, file: !378, line: 661, baseType: !7, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !377, file: !378, line: 684, baseType: !113, size: 32, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !377, file: !378, line: 686, baseType: !113, size: 32, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !377, file: !378, line: 687, baseType: !113, size: 32, offset: 416)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !377, file: !378, line: 688, baseType: !113, size: 32, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !377, file: !378, line: 689, baseType: !7, size: 32, offset: 480)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !377, file: !378, line: 691, baseType: !405, size: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !378, line: 691, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !377, file: !378, line: 692, baseType: !409, size: 832, offset: 576)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !378, line: 451, size: 832, elements: !410)
!410 = !{!411, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !409, file: !378, line: 453, baseType: !412, size: 128)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !378, line: 325, size: 128, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !412, file: !378, line: 326, baseType: !179, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !412, file: !378, line: 327, baseType: !386, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !409, file: !378, line: 454, baseType: !227, size: 192, align: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !409, file: !378, line: 455, baseType: !73, size: 128, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !409, file: !378, line: 456, baseType: !7, size: 32, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !409, file: !378, line: 458, baseType: !248, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !409, file: !378, line: 459, baseType: !248, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !409, file: !378, line: 460, baseType: !248, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !409, file: !378, line: 461, baseType: !248, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !409, file: !378, line: 463, baseType: !248, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !409, file: !378, line: 465, baseType: !425, offset: 832)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !378, line: 415, elements: !101)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !377, file: !378, line: 693, baseType: !427, size: 384, offset: 1408)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !378, line: 489, size: 384, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !427, file: !378, line: 490, baseType: !73, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !427, file: !378, line: 491, baseType: !179, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !427, file: !378, line: 492, baseType: !179, size: 64, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !427, file: !378, line: 493, baseType: !7, size: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !427, file: !378, line: 494, baseType: !171, size: 16, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !427, file: !378, line: 495, baseType: !171, size: 16, offset: 304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !427, file: !378, line: 497, baseType: !436, size: 64, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !377, file: !378, line: 697, baseType: !438, size: 1792, offset: 1792)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !378, line: 507, size: 1792, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !529, !530}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !438, file: !378, line: 508, baseType: !227, size: 192, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !438, file: !378, line: 515, baseType: !248, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !438, file: !378, line: 516, baseType: !248, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !438, file: !378, line: 517, baseType: !248, size: 64, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !438, file: !378, line: 518, baseType: !248, size: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !438, file: !378, line: 519, baseType: !248, size: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !438, file: !378, line: 526, baseType: !284, size: 64, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !438, file: !378, line: 527, baseType: !248, size: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !438, file: !378, line: 528, baseType: !7, size: 32, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !438, file: !378, line: 554, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !438, file: !378, line: 555, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !438, file: !378, line: 556, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !438, file: !378, line: 557, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !438, file: !378, line: 563, baseType: !454, size: 512, offset: 704)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !13, line: 118, size: 512, elements: !455)
!455 = !{!456, !464, !465, !470, !522, !526, !527, !528}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !13, line: 119, baseType: !457, size: 256)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !458, line: 9, size: 256, elements: !459)
!458 = !DIFile(filename: "./include/linux/timerqueue.h", directory: "/home/lizy2001/genbc/linux")
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !457, file: !458, line: 10, baseType: !227, size: 192, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !457, file: !458, line: 11, baseType: !462, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !463, line: 29, baseType: !284)
!463 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !454, file: !13, line: 120, baseType: !462, size: 64, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !454, file: !13, line: 121, baseType: !466, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!12, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !454, file: !13, line: 122, baseType: !471, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !13, line: 159, size: 512, align: 512, elements: !473)
!473 = !{!474, !494, !495, !498, !508, !509, !517, !521}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !472, file: !13, line: 160, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !13, line: 214, size: 4608, align: 512, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !476, file: !13, line: 215, baseType: !295)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !476, file: !13, line: 216, baseType: !7, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !476, file: !13, line: 217, baseType: !7, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !476, file: !13, line: 218, baseType: !7, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !476, file: !13, line: 219, baseType: !7, size: 1, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !476, file: !13, line: 220, baseType: !7, size: 1, offset: 97, flags: DIFlagBitField, extraData: i64 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !476, file: !13, line: 221, baseType: !7, size: 1, offset: 98, flags: DIFlagBitField, extraData: i64 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !476, file: !13, line: 222, baseType: !7, size: 1, offset: 99, flags: DIFlagBitField, extraData: i64 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !476, file: !13, line: 233, baseType: !462, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !476, file: !13, line: 234, baseType: !469, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !476, file: !13, line: 235, baseType: !462, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !476, file: !13, line: 236, baseType: !469, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !476, file: !13, line: 237, baseType: !491, size: 4096, offset: 512)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 4096, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !472, file: !13, line: 161, baseType: !7, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !472, file: !13, line: 162, baseType: !496, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !74, line: 27, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !162, line: 96, baseType: !113)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !472, file: !13, line: 163, baseType: !499, size: 32, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_raw_spinlock_t", file: !500, line: 276, baseType: !501)
!500 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/lizy2001/genbc/linux")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount_raw_spinlock", file: !500, line: 276, size: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "seqcount", scope: !501, file: !500, line: 276, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !500, line: 70, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !500, line: 65, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !505, file: !500, line: 66, baseType: !7, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !472, file: !13, line: 164, baseType: !469, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !472, file: !13, line: 165, baseType: !510, size: 128, offset: 256)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !458, line: 14, size: 128, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !510, file: !458, line: 15, baseType: !513, size: 128)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !228, line: 125, size: 128, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !513, file: !228, line: 126, baseType: !244, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !513, file: !228, line: 127, baseType: !232, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !472, file: !13, line: 166, baseType: !518, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!462}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !472, file: !13, line: 167, baseType: !462, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !454, file: !13, line: 123, baseType: !523, size: 8, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !249, line: 17, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !251, line: 21, baseType: !525)
!525 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !454, file: !13, line: 124, baseType: !523, size: 8, offset: 456)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !454, file: !13, line: 125, baseType: !523, size: 8, offset: 464)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !454, file: !13, line: 126, baseType: !523, size: 8, offset: 472)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !438, file: !378, line: 572, baseType: !454, size: 512, offset: 1216)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pi_se", scope: !438, file: !378, line: 580, baseType: !531, size: 64, offset: 1728)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !377, file: !378, line: 721, baseType: !7, size: 32, offset: 3584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !377, file: !378, line: 722, baseType: !113, size: 32, offset: 3616)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !377, file: !378, line: 723, baseType: !535, size: 64, offset: 3648)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !538, line: 17, baseType: !539)
!538 = !DIFile(filename: "./include/linux/cpumask.h", directory: "/home/lizy2001/genbc/linux")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !538, line: 17, size: 64, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !539, file: !538, line: 17, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 1)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !377, file: !378, line: 724, baseType: !537, size: 64, offset: 3712)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !377, file: !378, line: 749, baseType: !547, offset: 3776)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !378, line: 290, elements: !101)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !377, file: !378, line: 751, baseType: !73, size: 128, offset: 3776)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !377, file: !378, line: 757, baseType: !236, size: 64, offset: 3904)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !377, file: !378, line: 758, baseType: !236, size: 64, offset: 3968)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !377, file: !378, line: 761, baseType: !552, size: 320, offset: 4032)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !325, line: 34, size: 320, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !552, file: !325, line: 35, baseType: !248, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !552, file: !325, line: 36, baseType: !556, size: 256, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 256, elements: !329)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !377, file: !378, line: 766, baseType: !113, size: 32, offset: 4352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !377, file: !378, line: 767, baseType: !113, size: 32, offset: 4384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !377, file: !378, line: 768, baseType: !113, size: 32, offset: 4416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !377, file: !378, line: 770, baseType: !113, size: 32, offset: 4448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !377, file: !378, line: 772, baseType: !179, size: 64, offset: 4480)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !377, file: !378, line: 775, baseType: !7, size: 32, offset: 4544)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !377, file: !378, line: 778, baseType: !7, size: 1, offset: 4576, flags: DIFlagBitField, extraData: i64 4576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !377, file: !378, line: 779, baseType: !7, size: 1, offset: 4577, flags: DIFlagBitField, extraData: i64 4576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !377, file: !378, line: 780, baseType: !7, size: 1, offset: 4578, flags: DIFlagBitField, extraData: i64 4576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !377, file: !378, line: 803, baseType: !7, size: 1, offset: 4608, flags: DIFlagBitField, extraData: i64 4608)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !377, file: !378, line: 806, baseType: !7, size: 1, offset: 4609, flags: DIFlagBitField, extraData: i64 4608)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !377, file: !378, line: 807, baseType: !7, size: 1, offset: 4610, flags: DIFlagBitField, extraData: i64 4608)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !377, file: !378, line: 809, baseType: !7, size: 1, offset: 4611, flags: DIFlagBitField, extraData: i64 4608)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "brk_randomized", scope: !377, file: !378, line: 815, baseType: !7, size: 1, offset: 4612, flags: DIFlagBitField, extraData: i64 4608)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !377, file: !378, line: 831, baseType: !179, size: 64, offset: 4672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !377, file: !378, line: 833, baseType: !573, size: 384, offset: 4736)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !18, line: 25, size: 384, elements: !574)
!574 = !{!575, !580}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !573, file: !18, line: 26, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!164, !579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !573, file: !18, line: 27, baseType: !581, size: 320, offset: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !573, file: !18, line: 27, size: 320, elements: !582)
!582 = !{!583, !593, !620}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !581, file: !18, line: 36, baseType: !584, size: 320)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !18, line: 29, size: 320, elements: !585)
!585 = !{!586, !588, !589, !590, !591, !592}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !584, file: !18, line: 30, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !584, file: !18, line: 31, baseType: !386, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !18, line: 32, baseType: !386, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !584, file: !18, line: 33, baseType: !386, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !584, file: !18, line: 34, baseType: !248, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !584, file: !18, line: 35, baseType: !587, size: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !581, file: !18, line: 46, baseType: !594, size: 192)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !18, line: 38, size: 192, elements: !595)
!595 = !{!596, !597, !598, !619}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !594, file: !18, line: 39, baseType: !496, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !18, line: 40, baseType: !17, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !594, file: !18, line: 41, baseType: !599, size: 64, offset: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !594, file: !18, line: 41, size: 64, elements: !600)
!600 = !{!601, !609}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !599, file: !18, line: 42, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !604, line: 7, size: 128, elements: !605)
!604 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/home/lizy2001/genbc/linux")
!605 = !{!606, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !603, file: !604, line: 8, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !162, line: 93, baseType: !212)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !603, file: !604, line: 9, baseType: !212, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !599, file: !18, line: 43, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !612, line: 7, size: 64, elements: !613)
!612 = !DIFile(filename: "./include/vdso/time32.h", directory: "/home/lizy2001/genbc/linux")
!613 = !{!614, !618}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !611, file: !612, line: 8, baseType: !615, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !612, line: 5, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !249, line: 20, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !251, line: 26, baseType: !113)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !611, file: !612, line: 9, baseType: !616, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !594, file: !18, line: 45, baseType: !248, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !581, file: !18, line: 54, baseType: !621, size: 256)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !581, file: !18, line: 48, size: 256, elements: !622)
!622 = !{!623, !626, !627, !628, !629}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !621, file: !18, line: 49, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !18, line: 14, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !621, file: !18, line: 50, baseType: !113, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !621, file: !18, line: 51, baseType: !113, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !621, file: !18, line: 52, baseType: !179, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !621, file: !18, line: 53, baseType: !179, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !377, file: !378, line: 835, baseType: !631, size: 32, offset: 5120)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !74, line: 22, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !162, line: 28, baseType: !113)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !377, file: !378, line: 836, baseType: !631, size: 32, offset: 5152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !377, file: !378, line: 840, baseType: !179, size: 64, offset: 5184)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !377, file: !378, line: 849, baseType: !376, size: 64, offset: 5248)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !377, file: !378, line: 852, baseType: !376, size: 64, offset: 5312)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !377, file: !378, line: 857, baseType: !73, size: 128, offset: 5376)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !377, file: !378, line: 858, baseType: !73, size: 128, offset: 5504)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !377, file: !378, line: 859, baseType: !376, size: 64, offset: 5632)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !377, file: !378, line: 867, baseType: !73, size: 128, offset: 5696)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !377, file: !378, line: 868, baseType: !73, size: 128, offset: 5824)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !377, file: !378, line: 871, baseType: !643, size: 64, offset: 5952)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !645, line: 59, size: 768, elements: !646)
!645 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/lizy2001/genbc/linux")
!646 = !{!647, !648, !649, !650, !661, !662, !669, !678}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !644, file: !645, line: 61, baseType: !392, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !644, file: !645, line: 62, baseType: !7, size: 32, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !644, file: !645, line: 63, baseType: !87, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !644, file: !645, line: 65, baseType: !651, size: 256, offset: 64)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 256, elements: !329)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !74, line: 182, size: 64, elements: !653)
!653 = !{!654}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !652, file: !74, line: 183, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !74, line: 186, size: 128, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !74, line: 187, baseType: !655, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !656, file: !74, line: 187, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "inodes", scope: !644, file: !645, line: 66, baseType: !652, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !644, file: !645, line: 68, baseType: !663, size: 128, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !664, line: 40, baseType: !665)
!664 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/lizy2001/genbc/linux")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !664, line: 36, size: 128, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !665, file: !664, line: 37, baseType: !87)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !665, file: !664, line: 38, baseType: !73, size: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !644, file: !645, line: 69, baseType: !670, size: 128, align: 64, offset: 512)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !74, line: 216, size: 128, align: 64, elements: !671)
!671 = !{!672, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !74, line: 217, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !670, file: !74, line: 218, baseType: !675, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !673}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !644, file: !645, line: 70, baseType: !679, size: 128, offset: 640)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 128, elements: !543)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !645, line: 54, size: 128, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !680, file: !645, line: 55, baseType: !113, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !680, file: !645, line: 56, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !645, line: 56, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !377, file: !378, line: 872, baseType: !687, size: 512, offset: 6016)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 512, elements: !329)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !377, file: !378, line: 873, baseType: !73, size: 128, offset: 6528)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !377, file: !378, line: 874, baseType: !73, size: 128, offset: 6656)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !377, file: !378, line: 876, baseType: !691, size: 64, offset: 6784)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !693, line: 26, size: 192, elements: !694)
!693 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/lizy2001/genbc/linux")
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !692, file: !693, line: 27, baseType: !7, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !692, file: !693, line: 28, baseType: !697, size: 128, offset: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "swait_queue_head", file: !698, line: 43, size: 128, elements: !699)
!698 = !DIFile(filename: "./include/linux/swait.h", directory: "/home/lizy2001/genbc/linux")
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !697, file: !698, line: 44, baseType: !295)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "task_list", scope: !697, file: !698, line: 45, baseType: !73, size: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !377, file: !378, line: 879, baseType: !703, size: 64, offset: 6848)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !377, file: !378, line: 882, baseType: !703, size: 64, offset: 6912)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !377, file: !378, line: 884, baseType: !248, size: 64, offset: 6976)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !377, file: !378, line: 885, baseType: !248, size: 64, offset: 7040)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !377, file: !378, line: 890, baseType: !248, size: 64, offset: 7104)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !377, file: !378, line: 891, baseType: !709, size: 128, offset: 7168)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !378, line: 242, size: 128, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !709, file: !378, line: 244, baseType: !248, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !709, file: !378, line: 245, baseType: !248, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !709, file: !378, line: 246, baseType: !295, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !377, file: !378, line: 900, baseType: !179, size: 64, offset: 7296)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !377, file: !378, line: 901, baseType: !179, size: 64, offset: 7360)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !377, file: !378, line: 904, baseType: !248, size: 64, offset: 7424)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "start_boottime", scope: !377, file: !378, line: 907, baseType: !248, size: 64, offset: 7488)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !377, file: !378, line: 910, baseType: !179, size: 64, offset: 7552)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !377, file: !378, line: 911, baseType: !179, size: 64, offset: 7616)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !377, file: !378, line: 914, baseType: !721, size: 640, offset: 7680)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !722, line: 123, size: 640, elements: !723)
!722 = !DIFile(filename: "./include/linux/posix-timers.h", directory: "/home/lizy2001/genbc/linux")
!723 = !{!724, !730, !731}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !721, file: !722, line: 124, baseType: !725, size: 576)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 576, elements: !130)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !722, line: 108, size: 192, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !726, file: !722, line: 109, baseType: !248, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !726, file: !722, line: 110, baseType: !510, size: 128, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !721, file: !722, line: 125, baseType: !7, size: 32, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !721, file: !722, line: 126, baseType: !7, size: 32, offset: 608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers_work", scope: !377, file: !378, line: 917, baseType: !733, size: 192, offset: 8320)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers_work", file: !722, line: 134, size: 192, elements: !734)
!734 = !{!735, !736}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !733, file: !722, line: 135, baseType: !670, size: 128, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "scheduled", scope: !733, file: !722, line: 136, baseType: !7, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !377, file: !378, line: 923, baseType: !738, size: 64, offset: 8512)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !378, line: 923, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !377, file: !378, line: 926, baseType: !738, size: 64, offset: 8576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !377, file: !378, line: 929, baseType: !738, size: 64, offset: 8640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !377, file: !378, line: 933, baseType: !744, size: 64, offset: 8704)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !378, line: 933, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !377, file: !378, line: 943, baseType: !747, size: 128, offset: 8768)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 16)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !377, file: !378, line: 945, baseType: !751, size: 64, offset: 8896)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !378, line: 49, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !377, file: !378, line: 956, baseType: !754, size: 64, offset: 8960)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !378, line: 45, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !377, file: !378, line: 959, baseType: !757, size: 64, offset: 9024)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !378, line: 959, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "io_uring", scope: !377, file: !378, line: 962, baseType: !760, size: 64, offset: 9088)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_uring_task", file: !378, line: 66, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !377, file: !378, line: 966, baseType: !763, size: 64, offset: 9152)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !378, line: 50, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !377, file: !378, line: 969, baseType: !766, size: 64, offset: 9216)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !722, line: 223, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !377, file: !378, line: 970, baseType: !769, size: 64, offset: 9280)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !378, line: 62, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !377, file: !378, line: 971, baseType: !772, size: 64, offset: 9344)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !773, line: 25, baseType: !774)
!773 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/home/lizy2001/genbc/linux")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !773, line: 23, size: 64, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !774, file: !773, line: 24, baseType: !542, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !377, file: !378, line: 972, baseType: !772, size: 64, offset: 9408)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !377, file: !378, line: 974, baseType: !772, size: 64, offset: 9472)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !377, file: !378, line: 975, baseType: !780, size: 192, offset: 9536)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !781, line: 30, size: 192, elements: !782)
!781 = !DIFile(filename: "./include/linux/signal_types.h", directory: "/home/lizy2001/genbc/linux")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !780, file: !781, line: 31, baseType: !73, size: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !780, file: !781, line: 32, baseType: !772, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !377, file: !378, line: 976, baseType: !179, size: 64, offset: 9728)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !377, file: !378, line: 977, baseType: !176, size: 64, offset: 9792)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !377, file: !378, line: 978, baseType: !7, size: 32, offset: 9856)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !377, file: !378, line: 980, baseType: !673, size: 64, offset: 9920)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !377, file: !378, line: 989, baseType: !790, size: 128, offset: 9984)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !791, line: 35, size: 128, elements: !792)
!791 = !DIFile(filename: "./include/linux/seccomp.h", directory: "/home/lizy2001/genbc/linux")
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !790, file: !791, line: 36, baseType: !113, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "filter_count", scope: !790, file: !791, line: 37, baseType: !270, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !790, file: !791, line: 38, baseType: !796, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !791, line: 23, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !377, file: !378, line: 992, baseType: !248, size: 64, offset: 10112)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !377, file: !378, line: 993, baseType: !248, size: 64, offset: 10176)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !377, file: !378, line: 996, baseType: !87, offset: 10240)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !377, file: !378, line: 999, baseType: !295, offset: 10240)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !377, file: !378, line: 1001, baseType: !803, size: 64, offset: 10240)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !378, line: 636, size: 64, elements: !804)
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !378, line: 637, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !377, file: !378, line: 1005, baseType: !513, size: 128, offset: 10304)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !377, file: !378, line: 1007, baseType: !376, size: 64, offset: 10432)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !377, file: !378, line: 1009, baseType: !810, size: 64, offset: 10496)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !378, line: 1009, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !377, file: !378, line: 1043, baseType: !56, size: 64, offset: 10560)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bio_list", scope: !377, file: !378, line: 1046, baseType: !814, size: 64, offset: 10624)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "bio_list", file: !378, line: 41, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "plug", scope: !377, file: !378, line: 1050, baseType: !817, size: 64, offset: 10688)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "blk_plug", file: !378, line: 42, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reclaim_state", scope: !377, file: !378, line: 1054, baseType: !820, size: 64, offset: 10752)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_structure_type, name: "reclaim_state", file: !378, line: 55, flags: DIFlagFwdDecl)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "backing_dev_info", scope: !377, file: !378, line: 1056, baseType: !823, size: 64, offset: 10816)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "backing_dev_info", file: !378, line: 40, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "io_context", scope: !377, file: !378, line: 1058, baseType: !826, size: 64, offset: 10880)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "io_context", file: !378, line: 47, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "capture_control", scope: !377, file: !378, line: 1061, baseType: !829, size: 64, offset: 10944)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "capture_control", file: !378, line: 43, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_message", scope: !377, file: !378, line: 1064, baseType: !179, size: 64, offset: 11008)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "last_siginfo", scope: !377, file: !378, line: 1065, baseType: !833, size: 64, offset: 11072)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "kernel_siginfo_t", file: !781, line: 14, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_siginfo", file: !781, line: 12, size: 384, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, scope: !835, file: !781, line: 13, baseType: !838, size: 384)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !835, file: !781, line: 13, size: 384, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !838, file: !781, line: 13, baseType: !113, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !838, file: !781, line: 13, baseType: !113, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !838, file: !781, line: 13, baseType: !113, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !838, file: !781, line: 13, baseType: !844, size: 256, offset: 128)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "__sifields", file: !845, line: 32, size: 256, elements: !846)
!845 = !DIFile(filename: "./include/uapi/asm-generic/siginfo.h", directory: "/home/lizy2001/genbc/linux")
!846 = !{!847, !853, !866, !872, !881, !901, !906}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !844, file: !845, line: 37, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 34, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !848, file: !845, line: 35, baseType: !632, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !848, file: !845, line: 36, baseType: !852, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !162, line: 49, baseType: !7)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !844, file: !845, line: 45, baseType: !854, size: 192)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 40, size: 192, elements: !855)
!855 = !{!856, !858, !859, !865}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_tid", scope: !854, file: !845, line: 41, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_timer_t", file: !162, line: 95, baseType: !113)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "_overrun", scope: !854, file: !845, line: 42, baseType: !113, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !854, file: !845, line: 43, baseType: !860, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigval_t", file: !845, line: 11, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !845, line: 8, size: 64, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !861, file: !845, line: 9, baseType: !113, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !861, file: !845, line: 10, baseType: !56, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_sys_private", scope: !854, file: !845, line: 44, baseType: !113, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !844, file: !845, line: 52, baseType: !867, size: 128)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 48, size: 128, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !867, file: !845, line: 49, baseType: !632, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !867, file: !845, line: 50, baseType: !852, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_sigval", scope: !867, file: !845, line: 51, baseType: !860, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !844, file: !845, line: 61, baseType: !873, size: 256)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 55, size: 256, elements: !874)
!874 = !{!875, !876, !877, !878, !880}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_pid", scope: !873, file: !845, line: 56, baseType: !632, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_uid", scope: !873, file: !845, line: 57, baseType: !852, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_status", scope: !873, file: !845, line: 58, baseType: !113, size: 32, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_utime", scope: !873, file: !845, line: 59, baseType: !879, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clock_t", file: !162, line: 94, baseType: !163)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_stime", scope: !873, file: !845, line: 60, baseType: !879, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_sigfault", scope: !844, file: !845, line: 95, baseType: !882, size: 256)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 64, size: 256, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_addr", scope: !882, file: !845, line: 65, baseType: !56, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, scope: !882, file: !845, line: 77, baseType: !886, size: 192, offset: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !882, file: !845, line: 77, size: 192, elements: !887)
!887 = !{!888, !889, !896}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_lsb", scope: !886, file: !845, line: 82, baseType: !365, size: 16)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_bnd", scope: !886, file: !845, line: 88, baseType: !890, size: 192)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !886, file: !845, line: 84, size: 192, elements: !891)
!891 = !{!892, !894, !895}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_bnd", scope: !890, file: !845, line: 85, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !492)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_lower", scope: !890, file: !845, line: 86, baseType: !56, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_upper", scope: !890, file: !845, line: 87, baseType: !56, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_addr_pkey", scope: !886, file: !845, line: 93, baseType: !897, size: 96)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !886, file: !845, line: 90, size: 96, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_dummy_pkey", scope: !897, file: !845, line: 91, baseType: !893, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_pkey", scope: !897, file: !845, line: 92, baseType: !387, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_sigpoll", scope: !844, file: !845, line: 101, baseType: !902, size: 128)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 98, size: 128, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_band", scope: !902, file: !845, line: 99, baseType: !164, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_fd", scope: !902, file: !845, line: 100, baseType: !113, size: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_sigsys", scope: !844, file: !845, line: 108, baseType: !907, size: 128)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !845, line: 104, size: 128, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_call_addr", scope: !907, file: !845, line: 105, baseType: !56, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_syscall", scope: !907, file: !845, line: 106, baseType: !113, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_arch", scope: !907, file: !845, line: 107, baseType: !7, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ioac", scope: !377, file: !378, line: 1067, baseType: !913, offset: 11136)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_io_accounting", file: !914, line: 12, elements: !101)
!914 = !DIFile(filename: "./include/linux/task_io_accounting.h", directory: "/home/lizy2001/genbc/linux")
!915 = !DIDerivedType(tag: DW_TAG_member, name: "robust_list", scope: !377, file: !378, line: 1099, baseType: !916, size: 64, offset: 11136)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "robust_list_head", file: !378, line: 56, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_list", scope: !377, file: !378, line: 1103, baseType: !73, size: 128, offset: 11200)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pi_state_cache", scope: !377, file: !378, line: 1104, baseType: !920, size: 64, offset: 11328)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "futex_pi_state", file: !378, line: 46, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "futex_exit_mutex", scope: !377, file: !378, line: 1105, baseType: !347, size: 192, offset: 11392)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "futex_state", scope: !377, file: !378, line: 1106, baseType: !7, size: 32, offset: 11584)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_ctxp", scope: !377, file: !378, line: 1109, baseType: !925, size: 128, offset: 11648)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, elements: !928)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "perf_event_context", file: !378, line: 51, flags: DIFlagFwdDecl)
!928 = !{!929}
!929 = !DISubrange(count: 2)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_mutex", scope: !377, file: !378, line: 1110, baseType: !347, size: 192, offset: 11776)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "perf_event_list", scope: !377, file: !378, line: 1111, baseType: !73, size: 128, offset: 11968)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rseq", scope: !377, file: !378, line: 1173, baseType: !933, size: 64, offset: 12096)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rseq", file: !935, line: 62, size: 256, align: 256, elements: !936)
!935 = !DIFile(filename: "./include/uapi/linux/rseq.h", directory: "/home/lizy2001/genbc/linux")
!936 = !{!937, !938, !939, !944}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_id_start", scope: !934, file: !935, line: 75, baseType: !387, size: 32)
