; ModuleID = '../bcout/drivers/acpi/acpica/dsfield.llvm.bc'
source_filename = "drivers/acpi/acpica/dsfield.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 23, type: !799, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !798, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/dsfield.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !13, line: 305, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!19 = !{!20, !25, !29, !32, !33, !37, !39, !34, !27, !115, !795, !797}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !21, line: 19, baseType: !22)
!21 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !23, line: 24, baseType: !24)
!23 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !26, line: 421, baseType: !27)
!26 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !21, line: 21, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !23, line: 27, baseType: !7)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !21, line: 17, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !23, line: 21, baseType: !31)
!31 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !26, line: 805, baseType: !29)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !26, line: 127, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !21, line: 23, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !23, line: 31, baseType: !36)
!36 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !41)
!41 = !{!42, !782, !783, !784, !785, !791, !792, !793, !794}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !40, file: !6, line: 134, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !45, line: 367, size: 576, elements: !46)
!45 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !55, !68, !78, !92, !106, !116, !433, !450, !465, !478, !556, !568, !582, !592, !610, !632, !651, !670, !689, !702, !728, !745, !758, !772, !781}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !44, file: !45, line: 368, baseType: !48, size: 128)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !45, line: 73, size: 128, elements: !49)
!49 = !{!50, !51, !52, !53, !54}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !48, file: !45, line: 74, baseType: !43, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !48, file: !45, line: 74, baseType: !29, size: 8, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !45, line: 74, baseType: !29, size: 8, offset: 72)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !48, file: !45, line: 74, baseType: !20, size: 16, offset: 80)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !45, line: 74, baseType: !29, size: 8, offset: 96)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !44, file: !45, line: 369, baseType: !56, size: 192)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !45, line: 76, size: 192, elements: !57)
!57 = !{!58, !59, !60, !61, !62, !63, !67}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !56, file: !45, line: 77, baseType: !43, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !56, file: !45, line: 77, baseType: !29, size: 8, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !45, line: 77, baseType: !29, size: 8, offset: 72)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !56, file: !45, line: 77, baseType: !20, size: 16, offset: 80)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !45, line: 77, baseType: !29, size: 8, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !56, file: !45, line: 77, baseType: !64, size: 24, offset: 104)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 24, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !56, file: !45, line: 78, baseType: !34, size: 64, offset: 128)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !44, file: !45, line: 370, baseType: !69, size: 256)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !45, line: 93, size: 256, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !77}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !69, file: !45, line: 94, baseType: !43, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !69, file: !45, line: 94, baseType: !29, size: 8, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !45, line: 94, baseType: !29, size: 8, offset: 72)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !69, file: !45, line: 94, baseType: !20, size: 16, offset: 80)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !45, line: 94, baseType: !29, size: 8, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !69, file: !45, line: 94, baseType: !37, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !69, file: !45, line: 94, baseType: !27, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !44, file: !45, line: 371, baseType: !79, size: 384)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !45, line: 97, size: 384, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !88, !89, !90, !91}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !79, file: !45, line: 98, baseType: !43, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !79, file: !45, line: 98, baseType: !29, size: 8, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !45, line: 98, baseType: !29, size: 8, offset: 72)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !79, file: !45, line: 98, baseType: !20, size: 16, offset: 80)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !45, line: 98, baseType: !29, size: 8, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !79, file: !45, line: 98, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !79, file: !45, line: 98, baseType: !27, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !79, file: !45, line: 99, baseType: !27, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !79, file: !45, line: 100, baseType: !87, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !79, file: !45, line: 101, baseType: !39, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !44, file: !45, line: 372, baseType: !93, size: 384)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !45, line: 104, size: 384, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !103, !104, !105}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !93, file: !45, line: 105, baseType: !43, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !93, file: !45, line: 105, baseType: !29, size: 8, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !45, line: 105, baseType: !29, size: 8, offset: 72)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !93, file: !45, line: 105, baseType: !20, size: 16, offset: 80)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !45, line: 105, baseType: !29, size: 8, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !93, file: !45, line: 105, baseType: !39, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !93, file: !45, line: 106, baseType: !102, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !93, file: !45, line: 107, baseType: !87, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !93, file: !45, line: 108, baseType: !27, size: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !93, file: !45, line: 109, baseType: !27, size: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !44, file: !45, line: 373, baseType: !107, size: 192)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !45, line: 118, size: 192, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !114}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !107, file: !45, line: 119, baseType: !43, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !107, file: !45, line: 119, baseType: !29, size: 8, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !45, line: 119, baseType: !29, size: 8, offset: 72)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !107, file: !45, line: 119, baseType: !20, size: 16, offset: 80)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !45, line: 119, baseType: !29, size: 8, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !107, file: !45, line: 119, baseType: !115, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !44, file: !45, line: 374, baseType: !117, size: 448)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !45, line: 143, size: 448, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !430, !431, !432}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !117, file: !45, line: 144, baseType: !43, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !117, file: !45, line: 144, baseType: !29, size: 8, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !45, line: 144, baseType: !29, size: 8, offset: 72)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !117, file: !45, line: 144, baseType: !20, size: 16, offset: 80)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !117, file: !45, line: 144, baseType: !29, size: 8, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !117, file: !45, line: 144, baseType: !29, size: 8, offset: 104)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !117, file: !45, line: 145, baseType: !29, size: 8, offset: 112)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !117, file: !45, line: 146, baseType: !29, size: 8, offset: 120)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !117, file: !45, line: 147, baseType: !43, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !117, file: !45, line: 148, baseType: !43, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !117, file: !45, line: 149, baseType: !87, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !117, file: !45, line: 153, baseType: !131, size: 64, offset: 320)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !117, file: !45, line: 150, size: 64, elements: !132)
!132 = !{!133, !429}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !131, file: !45, line: 151, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!25, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !140, line: 37, size: 9024, elements: !141)
!140 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !375, !376, !377, !378, !379, !383, !385, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !412, !413, !414, !415, !416, !417, !418, !419, !421, !427}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !139, file: !140, line: 38, baseType: !138, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !139, file: !140, line: 39, baseType: !29, size: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !139, file: !140, line: 40, baseType: !29, size: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !139, file: !140, line: 41, baseType: !20, size: 16, offset: 80)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !139, file: !140, line: 42, baseType: !29, size: 8, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !139, file: !140, line: 43, baseType: !29, size: 8, offset: 104)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !139, file: !140, line: 44, baseType: !29, size: 8, offset: 112)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !139, file: !140, line: 45, baseType: !150, size: 16, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !26, line: 445, baseType: !20)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !139, file: !140, line: 46, baseType: !29, size: 8, offset: 144)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !139, file: !140, line: 47, baseType: !29, size: 8, offset: 152)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !139, file: !140, line: 48, baseType: !29, size: 8, offset: 160)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !139, file: !140, line: 49, baseType: !29, size: 8, offset: 168)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !139, file: !140, line: 50, baseType: !29, size: 8, offset: 176)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !139, file: !140, line: 51, baseType: !29, size: 8, offset: 184)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !139, file: !140, line: 52, baseType: !29, size: 8, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !139, file: !140, line: 53, baseType: !29, size: 8, offset: 200)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !139, file: !140, line: 54, baseType: !87, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !139, file: !140, line: 55, baseType: !27, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !139, file: !140, line: 56, baseType: !27, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !139, file: !140, line: 57, baseType: !27, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !139, file: !140, line: 58, baseType: !27, size: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !139, file: !140, line: 60, baseType: !165, size: 640, offset: 448)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !256, !257, !373, !374}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !165, file: !6, line: 894, baseType: !87, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !165, file: !6, line: 895, baseType: !87, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !165, file: !6, line: 896, baseType: !87, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !165, file: !6, line: 897, baseType: !87, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !165, file: !6, line: 898, baseType: !87, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !165, file: !6, line: 899, baseType: !173, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !175)
!175 = !{!176, !196, !212}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !174, file: !6, line: 876, baseType: !177, size: 448)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !195}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !177, file: !6, line: 829, baseType: !173, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !177, file: !6, line: 829, baseType: !29, size: 8, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !6, line: 829, baseType: !29, size: 8, offset: 72)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !177, file: !6, line: 829, baseType: !20, size: 16, offset: 80)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !177, file: !6, line: 829, baseType: !87, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !6, line: 829, baseType: !173, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !177, file: !6, line: 829, baseType: !39, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !177, file: !6, line: 829, baseType: !187, size: 64, offset: 320)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !187, file: !6, line: 717, baseType: !34, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !6, line: 718, baseType: !27, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !187, file: !6, line: 719, baseType: !37, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !187, file: !6, line: 720, baseType: !87, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !6, line: 721, baseType: !37, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !187, file: !6, line: 722, baseType: !173, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !177, file: !6, line: 829, baseType: !29, size: 8, offset: 384)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !174, file: !6, line: 877, baseType: !197, size: 640)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !197, file: !6, line: 836, baseType: !173, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !197, file: !6, line: 836, baseType: !29, size: 8, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !6, line: 836, baseType: !29, size: 8, offset: 72)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !197, file: !6, line: 836, baseType: !20, size: 16, offset: 80)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !197, file: !6, line: 836, baseType: !87, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !6, line: 836, baseType: !173, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !6, line: 836, baseType: !39, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !6, line: 836, baseType: !187, size: 64, offset: 320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !197, file: !6, line: 836, baseType: !29, size: 8, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !197, file: !6, line: 836, baseType: !37, size: 64, offset: 448)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !197, file: !6, line: 837, baseType: !87, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !197, file: !6, line: 838, baseType: !27, size: 32, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !6, line: 839, baseType: !27, size: 32, offset: 608)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !174, file: !6, line: 878, baseType: !213, size: 1600)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !6, line: 847, baseType: !173, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !213, file: !6, line: 847, baseType: !29, size: 8, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !213, file: !6, line: 847, baseType: !29, size: 8, offset: 72)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !213, file: !6, line: 847, baseType: !20, size: 16, offset: 80)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !213, file: !6, line: 847, baseType: !87, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !6, line: 847, baseType: !173, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !213, file: !6, line: 847, baseType: !39, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !6, line: 847, baseType: !187, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !213, file: !6, line: 847, baseType: !29, size: 8, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !213, file: !6, line: 847, baseType: !173, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !213, file: !6, line: 848, baseType: !173, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !213, file: !6, line: 849, baseType: !37, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !213, file: !6, line: 850, baseType: !29, size: 8, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !213, file: !6, line: 851, baseType: !37, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !213, file: !6, line: 852, baseType: !37, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !213, file: !6, line: 853, baseType: !37, size: 64, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !213, file: !6, line: 854, baseType: !232, size: 32, offset: 896)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 4)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !213, file: !6, line: 855, baseType: !27, size: 32, offset: 928)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !213, file: !6, line: 856, baseType: !27, size: 32, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !213, file: !6, line: 857, baseType: !27, size: 32, offset: 992)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !213, file: !6, line: 858, baseType: !27, size: 32, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !213, file: !6, line: 859, baseType: !27, size: 32, offset: 1056)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !213, file: !6, line: 860, baseType: !27, size: 32, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !213, file: !6, line: 861, baseType: !27, size: 32, offset: 1120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !213, file: !6, line: 862, baseType: !27, size: 32, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !213, file: !6, line: 863, baseType: !27, size: 32, offset: 1184)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !213, file: !6, line: 864, baseType: !27, size: 32, offset: 1216)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !213, file: !6, line: 865, baseType: !27, size: 32, offset: 1248)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !213, file: !6, line: 866, baseType: !27, size: 32, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !213, file: !6, line: 867, baseType: !27, size: 32, offset: 1312)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !213, file: !6, line: 868, baseType: !20, size: 16, offset: 1344)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !213, file: !6, line: 869, baseType: !29, size: 8, offset: 1360)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !213, file: !6, line: 870, baseType: !29, size: 8, offset: 1368)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !213, file: !6, line: 871, baseType: !29, size: 8, offset: 1376)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !213, file: !6, line: 872, baseType: !253, size: 160, offset: 1384)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 20)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !165, file: !6, line: 900, baseType: !39, size: 64, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !165, file: !6, line: 901, baseType: !258, size: 64, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !260)
!260 = !{!261, !269, !282, !291, !300, !313, !327, !339, !351}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !259, file: !6, line: 664, baseType: !262, size: 128)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !6, line: 568, baseType: !115, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !262, file: !6, line: 568, baseType: !29, size: 8, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !262, file: !6, line: 568, baseType: !29, size: 8, offset: 72)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !262, file: !6, line: 568, baseType: !20, size: 16, offset: 80)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !6, line: 568, baseType: !20, size: 16, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !259, file: !6, line: 665, baseType: !270, size: 384)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !270, file: !6, line: 594, baseType: !115, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !270, file: !6, line: 594, baseType: !29, size: 8, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !6, line: 594, baseType: !29, size: 8, offset: 72)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !270, file: !6, line: 594, baseType: !20, size: 16, offset: 80)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !270, file: !6, line: 594, baseType: !20, size: 16, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !270, file: !6, line: 594, baseType: !20, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !270, file: !6, line: 595, baseType: !173, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !270, file: !6, line: 596, baseType: !87, size: 64, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !270, file: !6, line: 597, baseType: !87, size: 64, offset: 256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !270, file: !6, line: 598, baseType: !34, size: 64, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !259, file: !6, line: 666, baseType: !283, size: 192)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !6, line: 574, baseType: !115, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !283, file: !6, line: 574, baseType: !29, size: 8, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !6, line: 574, baseType: !29, size: 8, offset: 72)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !283, file: !6, line: 574, baseType: !20, size: 16, offset: 80)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !283, file: !6, line: 574, baseType: !20, size: 16, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !283, file: !6, line: 574, baseType: !43, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !259, file: !6, line: 667, baseType: !292, size: 192)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !6, line: 605, baseType: !115, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !292, file: !6, line: 605, baseType: !29, size: 8, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !6, line: 605, baseType: !29, size: 8, offset: 72)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !292, file: !6, line: 605, baseType: !20, size: 16, offset: 80)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !6, line: 605, baseType: !20, size: 16, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !292, file: !6, line: 605, baseType: !39, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !259, file: !6, line: 668, baseType: !301, size: 448)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !6, line: 609, baseType: !115, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !301, file: !6, line: 609, baseType: !29, size: 8, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !6, line: 609, baseType: !29, size: 8, offset: 72)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !6, line: 609, baseType: !20, size: 16, offset: 80)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !301, file: !6, line: 609, baseType: !20, size: 16, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !301, file: !6, line: 609, baseType: !27, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !301, file: !6, line: 610, baseType: !173, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !301, file: !6, line: 611, baseType: !87, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !301, file: !6, line: 612, baseType: !87, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !301, file: !6, line: 613, baseType: !27, size: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !259, file: !6, line: 669, baseType: !314, size: 512)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !6, line: 581, baseType: !115, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !314, file: !6, line: 581, baseType: !29, size: 8, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !6, line: 581, baseType: !29, size: 8, offset: 72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !314, file: !6, line: 581, baseType: !20, size: 16, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !6, line: 581, baseType: !20, size: 16, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !314, file: !6, line: 581, baseType: !27, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !314, file: !6, line: 582, baseType: !43, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !314, file: !6, line: 583, baseType: !43, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !314, file: !6, line: 584, baseType: !138, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !314, file: !6, line: 585, baseType: !115, size: 64, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !314, file: !6, line: 586, baseType: !27, size: 32, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !259, file: !6, line: 670, baseType: !328, size: 320)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !6, line: 621, baseType: !115, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !328, file: !6, line: 621, baseType: !29, size: 8, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !328, file: !6, line: 621, baseType: !29, size: 8, offset: 72)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !328, file: !6, line: 621, baseType: !20, size: 16, offset: 80)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !6, line: 621, baseType: !20, size: 16, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !328, file: !6, line: 621, baseType: !29, size: 8, offset: 112)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !328, file: !6, line: 622, baseType: !138, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !328, file: !6, line: 623, baseType: !43, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !328, file: !6, line: 624, baseType: !34, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !259, file: !6, line: 671, baseType: !340, size: 640)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !6, line: 632, baseType: !115, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !340, file: !6, line: 632, baseType: !29, size: 8, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !6, line: 632, baseType: !29, size: 8, offset: 72)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !340, file: !6, line: 632, baseType: !20, size: 16, offset: 80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !340, file: !6, line: 632, baseType: !20, size: 16, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !340, file: !6, line: 633, baseType: !348, size: 512, offset: 128)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 512, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !259, file: !6, line: 672, baseType: !352, size: 320)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !6, line: 655, baseType: !115, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !352, file: !6, line: 655, baseType: !29, size: 8, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !6, line: 655, baseType: !29, size: 8, offset: 72)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !352, file: !6, line: 655, baseType: !20, size: 16, offset: 80)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !6, line: 655, baseType: !20, size: 16, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !352, file: !6, line: 655, baseType: !29, size: 8, offset: 112)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !352, file: !6, line: 656, baseType: !39, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !352, file: !6, line: 657, baseType: !43, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !352, file: !6, line: 658, baseType: !363, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !365)
!365 = !{!366, !372}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !364, file: !6, line: 646, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !26, line: 1052, baseType: !368)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !371, !27, !115}
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !26, line: 424, baseType: !115)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !364, file: !6, line: 647, baseType: !115, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !165, file: !6, line: 902, baseType: !173, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !165, file: !6, line: 903, baseType: !27, size: 32, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !139, file: !140, line: 61, baseType: !27, size: 32, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !139, file: !140, line: 62, baseType: !27, size: 32, offset: 1120)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !139, file: !140, line: 63, baseType: !20, size: 16, offset: 1152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !139, file: !140, line: 64, baseType: !29, size: 8, offset: 1168)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !139, file: !140, line: 66, baseType: !380, size: 2688, offset: 1216)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2688, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 7)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !139, file: !140, line: 67, baseType: !384, size: 3072, offset: 3904)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3072, elements: !349)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !139, file: !140, line: 68, baseType: !386, size: 576, offset: 6976)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 576, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 9)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !139, file: !140, line: 69, baseType: !102, size: 64, offset: 7552)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !139, file: !140, line: 71, baseType: !87, size: 64, offset: 7616)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !139, file: !140, line: 72, baseType: !102, size: 64, offset: 7680)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !139, file: !140, line: 73, baseType: !258, size: 64, offset: 7744)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !139, file: !140, line: 74, baseType: !39, size: 64, offset: 7808)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !139, file: !140, line: 75, baseType: !43, size: 64, offset: 7872)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !139, file: !140, line: 76, baseType: !39, size: 64, offset: 7936)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !139, file: !140, line: 77, baseType: !173, size: 64, offset: 8000)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !139, file: !140, line: 78, baseType: !43, size: 64, offset: 8064)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !139, file: !140, line: 79, baseType: !39, size: 64, offset: 8128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !139, file: !140, line: 80, baseType: !37, size: 64, offset: 8192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !139, file: !140, line: 81, baseType: !173, size: 64, offset: 8256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !139, file: !140, line: 82, baseType: !402, size: 64, offset: 8320)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !404, file: !6, line: 706, baseType: !27, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !404, file: !6, line: 707, baseType: !27, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !404, file: !6, line: 708, baseType: !20, size: 16, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !404, file: !6, line: 709, baseType: !29, size: 8, offset: 80)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !404, file: !6, line: 710, baseType: !29, size: 8, offset: 88)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !6, line: 711, baseType: !29, size: 8, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !139, file: !140, line: 83, baseType: !173, size: 64, offset: 8384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !139, file: !140, line: 84, baseType: !43, size: 64, offset: 8448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !139, file: !140, line: 85, baseType: !258, size: 64, offset: 8512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !139, file: !140, line: 86, baseType: !43, size: 64, offset: 8576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !139, file: !140, line: 87, baseType: !258, size: 64, offset: 8640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !139, file: !140, line: 88, baseType: !173, size: 64, offset: 8704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !139, file: !140, line: 89, baseType: !173, size: 64, offset: 8768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !139, file: !140, line: 90, baseType: !420, size: 64, offset: 8832)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !139, file: !140, line: 91, baseType: !422, size: 64, offset: 8896)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!25, !138, !426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !139, file: !140, line: 92, baseType: !428, size: 64, offset: 8960)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !135)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !131, file: !45, line: 152, baseType: !43, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !117, file: !45, line: 155, baseType: !27, size: 32, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !117, file: !45, line: 156, baseType: !150, size: 16, offset: 416)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !117, file: !45, line: 157, baseType: !29, size: 8, offset: 432)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !44, file: !45, line: 375, baseType: !434, size: 576)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !45, line: 122, size: 576, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !434, file: !45, line: 123, baseType: !43, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !434, file: !45, line: 123, baseType: !29, size: 8, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !45, line: 123, baseType: !29, size: 8, offset: 72)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !434, file: !45, line: 123, baseType: !20, size: 16, offset: 80)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !434, file: !45, line: 123, baseType: !29, size: 8, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !434, file: !45, line: 123, baseType: !29, size: 8, offset: 104)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !434, file: !45, line: 124, baseType: !20, size: 16, offset: 112)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !434, file: !45, line: 125, baseType: !115, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !434, file: !45, line: 126, baseType: !34, size: 64, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !434, file: !45, line: 127, baseType: !420, size: 64, offset: 256)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !434, file: !45, line: 128, baseType: !43, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !434, file: !45, line: 129, baseType: !43, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !434, file: !45, line: 130, baseType: !39, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !434, file: !45, line: 131, baseType: !29, size: 8, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !44, file: !45, line: 376, baseType: !451, size: 448)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !45, line: 134, size: 448, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !464}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !451, file: !45, line: 135, baseType: !43, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !451, file: !45, line: 135, baseType: !29, size: 8, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !451, file: !45, line: 135, baseType: !29, size: 8, offset: 72)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !451, file: !45, line: 135, baseType: !20, size: 16, offset: 80)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !45, line: 135, baseType: !29, size: 8, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !451, file: !45, line: 135, baseType: !29, size: 8, offset: 104)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !451, file: !45, line: 136, baseType: !39, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !451, file: !45, line: 137, baseType: !43, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !451, file: !45, line: 138, baseType: !43, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !451, file: !45, line: 139, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !26, line: 129, baseType: !34)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !451, file: !45, line: 140, baseType: !27, size: 32, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !44, file: !45, line: 377, baseType: !466, size: 320)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !45, line: 184, size: 320, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !477}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !466, file: !45, line: 185, baseType: !43, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !466, file: !45, line: 185, baseType: !29, size: 8, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !45, line: 185, baseType: !29, size: 8, offset: 72)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !466, file: !45, line: 185, baseType: !20, size: 16, offset: 80)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !45, line: 185, baseType: !29, size: 8, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !466, file: !45, line: 185, baseType: !474, size: 128, offset: 128)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !466, file: !45, line: 185, baseType: !43, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !44, file: !45, line: 378, baseType: !479, size: 384)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !45, line: 187, size: 384, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !479, file: !45, line: 188, baseType: !43, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !479, file: !45, line: 188, baseType: !29, size: 8, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !479, file: !45, line: 188, baseType: !29, size: 8, offset: 72)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !479, file: !45, line: 188, baseType: !20, size: 16, offset: 80)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !479, file: !45, line: 188, baseType: !29, size: 8, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !479, file: !45, line: 189, baseType: !474, size: 128, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !479, file: !45, line: 189, baseType: !43, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !479, file: !45, line: 189, baseType: !489, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !491)
!491 = !{!492, !493, !494, !495, !503, !518, !550, !551, !552, !553, !554, !555}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !490, file: !6, line: 481, baseType: !39, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !490, file: !6, line: 482, baseType: !489, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !490, file: !6, line: 483, baseType: !489, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !490, file: !6, line: 484, baseType: !496, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !498)
!498 = !{!499, !500, !501, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !497, file: !6, line: 498, baseType: !496, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !6, line: 499, baseType: !496, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !497, file: !6, line: 500, baseType: !489, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !497, file: !6, line: 501, baseType: !27, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !490, file: !6, line: 485, baseType: !504, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !506)
!506 = !{!507, !512, !513, !514, !515, !516, !517}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !505, file: !6, line: 467, baseType: !508, size: 128)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !509)
!509 = !{!510, !511}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !508, file: !6, line: 460, baseType: !29, size: 8)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !508, file: !6, line: 461, baseType: !34, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !505, file: !6, line: 468, baseType: !508, size: 128, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !505, file: !6, line: 469, baseType: !20, size: 16, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !505, file: !6, line: 470, baseType: !29, size: 8, offset: 272)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !505, file: !6, line: 471, baseType: !29, size: 8, offset: 280)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !505, file: !6, line: 472, baseType: !29, size: 8, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !505, file: !6, line: 473, baseType: !29, size: 8, offset: 296)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !490, file: !6, line: 486, baseType: !519, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !521)
!521 = !{!522, !545, !546, !547, !548, !549}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !520, file: !6, line: 449, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !524)
!524 = !{!525, !526, !539}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !523, file: !6, line: 439, baseType: !39, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !523, file: !6, line: 440, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !529)
!529 = !{!530, !535, !536, !537, !538}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !528, file: !6, line: 420, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !26, line: 1049, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{!27, !371, !27, !115}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !528, file: !6, line: 421, baseType: !115, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !528, file: !6, line: 422, baseType: !39, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !528, file: !6, line: 423, baseType: !29, size: 8, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !528, file: !6, line: 424, baseType: !29, size: 8, offset: 200)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !523, file: !6, line: 441, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !541, file: !6, line: 430, baseType: !39, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !6, line: 431, baseType: !540, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !520, file: !6, line: 450, baseType: !504, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !520, file: !6, line: 451, baseType: !29, size: 8, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !520, file: !6, line: 452, baseType: !29, size: 8, offset: 136)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !520, file: !6, line: 453, baseType: !29, size: 8, offset: 144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !520, file: !6, line: 454, baseType: !29, size: 8, offset: 152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !490, file: !6, line: 487, baseType: !34, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !490, file: !6, line: 488, baseType: !27, size: 32, offset: 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !490, file: !6, line: 489, baseType: !20, size: 16, offset: 480)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !490, file: !6, line: 490, baseType: !20, size: 16, offset: 496)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !490, file: !6, line: 491, baseType: !29, size: 8, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !490, file: !6, line: 492, baseType: !29, size: 8, offset: 520)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !44, file: !45, line: 379, baseType: !557, size: 384)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !45, line: 192, size: 384, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !557, file: !45, line: 193, baseType: !43, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !557, file: !45, line: 193, baseType: !29, size: 8, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !557, file: !45, line: 193, baseType: !29, size: 8, offset: 72)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !557, file: !45, line: 193, baseType: !20, size: 16, offset: 80)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !557, file: !45, line: 193, baseType: !29, size: 8, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !557, file: !45, line: 193, baseType: !474, size: 128, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !557, file: !45, line: 193, baseType: !43, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !557, file: !45, line: 193, baseType: !27, size: 32, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !557, file: !45, line: 194, baseType: !27, size: 32, offset: 352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !44, file: !45, line: 380, baseType: !569, size: 384)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !45, line: 197, size: 384, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !569, file: !45, line: 198, baseType: !43, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !569, file: !45, line: 198, baseType: !29, size: 8, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !45, line: 198, baseType: !29, size: 8, offset: 72)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !569, file: !45, line: 198, baseType: !20, size: 16, offset: 80)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !45, line: 198, baseType: !29, size: 8, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !569, file: !45, line: 200, baseType: !29, size: 8, offset: 104)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !569, file: !45, line: 201, baseType: !29, size: 8, offset: 112)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !569, file: !45, line: 202, baseType: !474, size: 128, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !569, file: !45, line: 202, baseType: !43, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !569, file: !45, line: 202, baseType: !581, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !26, line: 128, baseType: !34)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !44, file: !45, line: 381, baseType: !583, size: 320)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !45, line: 205, size: 320, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !583, file: !45, line: 206, baseType: !43, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !583, file: !45, line: 206, baseType: !29, size: 8, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !583, file: !45, line: 206, baseType: !29, size: 8, offset: 72)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !583, file: !45, line: 206, baseType: !20, size: 16, offset: 80)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !45, line: 206, baseType: !29, size: 8, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !583, file: !45, line: 206, baseType: !474, size: 128, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !583, file: !45, line: 206, baseType: !43, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !44, file: !45, line: 382, baseType: !593, size: 384)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !45, line: 233, size: 384, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !593, file: !45, line: 234, baseType: !43, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 72)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !593, file: !45, line: 234, baseType: !20, size: 16, offset: 80)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 104)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 112)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 120)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !593, file: !45, line: 234, baseType: !39, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !593, file: !45, line: 234, baseType: !27, size: 32, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !593, file: !45, line: 234, baseType: !27, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !593, file: !45, line: 234, baseType: !27, size: 32, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 288)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !593, file: !45, line: 234, baseType: !29, size: 8, offset: 296)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !593, file: !45, line: 234, baseType: !43, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !44, file: !45, line: 383, baseType: !611, size: 576)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !45, line: 237, size: 576, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !611, file: !45, line: 238, baseType: !43, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 72)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !611, file: !45, line: 238, baseType: !20, size: 16, offset: 80)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 104)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 112)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 120)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !611, file: !45, line: 238, baseType: !39, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !611, file: !45, line: 238, baseType: !27, size: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !611, file: !45, line: 238, baseType: !27, size: 32, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !611, file: !45, line: 238, baseType: !27, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !611, file: !45, line: 238, baseType: !29, size: 8, offset: 296)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !611, file: !45, line: 238, baseType: !20, size: 16, offset: 304)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !611, file: !45, line: 239, baseType: !43, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !611, file: !45, line: 240, baseType: !87, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !611, file: !45, line: 241, baseType: !20, size: 16, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !611, file: !45, line: 242, baseType: !87, size: 64, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !44, file: !45, line: 384, baseType: !633, size: 384)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !45, line: 262, size: 384, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !633, file: !45, line: 263, baseType: !43, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 72)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !633, file: !45, line: 263, baseType: !20, size: 16, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 104)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 120)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !633, file: !45, line: 263, baseType: !39, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !633, file: !45, line: 263, baseType: !27, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !633, file: !45, line: 263, baseType: !27, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !633, file: !45, line: 263, baseType: !27, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 296)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !633, file: !45, line: 263, baseType: !29, size: 8, offset: 304)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !633, file: !45, line: 264, baseType: !43, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !44, file: !45, line: 385, baseType: !652, size: 448)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !45, line: 245, size: 448, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !652, file: !45, line: 246, baseType: !43, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 72)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !652, file: !45, line: 246, baseType: !20, size: 16, offset: 80)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 104)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 120)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !652, file: !45, line: 246, baseType: !39, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !652, file: !45, line: 246, baseType: !27, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !652, file: !45, line: 246, baseType: !27, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !652, file: !45, line: 246, baseType: !27, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !652, file: !45, line: 246, baseType: !29, size: 8, offset: 296)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !652, file: !45, line: 246, baseType: !43, size: 64, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !652, file: !45, line: 247, baseType: !43, size: 64, offset: 384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !44, file: !45, line: 386, baseType: !671, size: 448)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !45, line: 250, size: 448, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !671, file: !45, line: 251, baseType: !43, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 72)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !671, file: !45, line: 251, baseType: !20, size: 16, offset: 80)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 104)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !671, file: !45, line: 251, baseType: !39, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !671, file: !45, line: 251, baseType: !27, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !671, file: !45, line: 251, baseType: !27, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !671, file: !45, line: 251, baseType: !27, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !671, file: !45, line: 251, baseType: !29, size: 8, offset: 296)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !671, file: !45, line: 256, baseType: !43, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !671, file: !45, line: 257, baseType: !43, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !44, file: !45, line: 387, baseType: !690, size: 512)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !45, line: 273, size: 512, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !690, file: !45, line: 274, baseType: !43, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !690, file: !45, line: 274, baseType: !29, size: 8, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !45, line: 274, baseType: !29, size: 8, offset: 72)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !690, file: !45, line: 274, baseType: !20, size: 16, offset: 80)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !690, file: !45, line: 274, baseType: !29, size: 8, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !690, file: !45, line: 274, baseType: !39, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !690, file: !45, line: 275, baseType: !27, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !690, file: !45, line: 276, baseType: !367, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !690, file: !45, line: 277, baseType: !115, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !45, line: 278, baseType: !474, size: 128, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !44, file: !45, line: 388, baseType: !703, size: 512)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !45, line: 281, size: 512, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !718, !719, !720, !726, !727}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !703, file: !45, line: 282, baseType: !43, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !703, file: !45, line: 282, baseType: !29, size: 8, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !45, line: 282, baseType: !29, size: 8, offset: 72)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !703, file: !45, line: 282, baseType: !20, size: 16, offset: 80)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !45, line: 282, baseType: !29, size: 8, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !703, file: !45, line: 282, baseType: !29, size: 8, offset: 104)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !703, file: !45, line: 283, baseType: !29, size: 8, offset: 112)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !703, file: !45, line: 284, baseType: !713, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !26, line: 1084, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!25, !27, !463, !27, !717, !115, !115}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !703, file: !45, line: 285, baseType: !39, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !703, file: !45, line: 286, baseType: !115, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !703, file: !45, line: 287, baseType: !721, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !26, line: 1102, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!25, !371, !27, !115, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !703, file: !45, line: 288, baseType: !43, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !45, line: 289, baseType: !43, size: 64, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !44, file: !45, line: 389, baseType: !729, size: 512)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !45, line: 307, size: 512, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !729, file: !45, line: 308, baseType: !43, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !729, file: !45, line: 308, baseType: !29, size: 8, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !729, file: !45, line: 308, baseType: !29, size: 8, offset: 72)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !729, file: !45, line: 308, baseType: !20, size: 16, offset: 80)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !729, file: !45, line: 308, baseType: !29, size: 8, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !729, file: !45, line: 308, baseType: !29, size: 8, offset: 104)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !729, file: !45, line: 309, baseType: !29, size: 8, offset: 112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !729, file: !45, line: 310, baseType: !29, size: 8, offset: 120)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !729, file: !45, line: 311, baseType: !115, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !729, file: !45, line: 312, baseType: !39, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !729, file: !45, line: 313, baseType: !102, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !729, file: !45, line: 314, baseType: !87, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !729, file: !45, line: 315, baseType: !87, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !729, file: !45, line: 316, baseType: !27, size: 32, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !44, file: !45, line: 390, baseType: !746, size: 448)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !45, line: 340, size: 448, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !746, file: !45, line: 341, baseType: !43, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !746, file: !45, line: 341, baseType: !29, size: 8, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !45, line: 341, baseType: !29, size: 8, offset: 72)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !746, file: !45, line: 341, baseType: !20, size: 16, offset: 80)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !45, line: 341, baseType: !29, size: 8, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !746, file: !45, line: 341, baseType: !39, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !746, file: !45, line: 342, baseType: !39, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !746, file: !45, line: 343, baseType: !115, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !746, file: !45, line: 344, baseType: !87, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !746, file: !45, line: 345, baseType: !27, size: 32, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !44, file: !45, line: 391, baseType: !759, size: 256)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !45, line: 350, size: 256, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !771}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !759, file: !45, line: 351, baseType: !43, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !759, file: !45, line: 351, baseType: !29, size: 8, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !45, line: 351, baseType: !29, size: 8, offset: 72)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !759, file: !45, line: 351, baseType: !20, size: 16, offset: 80)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !45, line: 351, baseType: !29, size: 8, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !759, file: !45, line: 351, baseType: !767, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !26, line: 1055, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !371, !115}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !759, file: !45, line: 352, baseType: !115, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !44, file: !45, line: 392, baseType: !773, size: 192)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !45, line: 357, size: 192, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !773, file: !45, line: 358, baseType: !43, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !773, file: !45, line: 358, baseType: !29, size: 8, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !773, file: !45, line: 358, baseType: !29, size: 8, offset: 72)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !773, file: !45, line: 358, baseType: !20, size: 16, offset: 80)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !45, line: 358, baseType: !29, size: 8, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !773, file: !45, line: 358, baseType: !43, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !44, file: !45, line: 399, baseType: !40, size: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !40, file: !6, line: 135, baseType: !29, size: 8, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !6, line: 136, baseType: !29, size: 8, offset: 72)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !6, line: 137, baseType: !20, size: 16, offset: 80)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !6, line: 138, baseType: !786, size: 32, offset: 96)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !787, line: 327, size: 32, elements: !788)
!787 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !786, file: !787, line: 328, baseType: !27, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !786, file: !787, line: 329, baseType: !232, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !40, file: !6, line: 139, baseType: !39, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !40, file: !6, line: 140, baseType: !39, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !40, file: !6, line: 141, baseType: !39, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !40, file: !6, line: 142, baseType: !150, size: 16, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !796, line: 148, baseType: !7)
!796 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!797 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!798 = !{!0}
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 64, elements: !349)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!801 = !{!"rsp"}
!802 = !{i32 7, !"Dwarf Version", i32 4}
!803 = !{i32 2, !"Debug Info Version", i32 3}
!804 = !{i32 1, !"wchar_size", i32 2}
!805 = !{i32 1, !"Code Model", i32 2}
!806 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!807 = distinct !DISubprogram(name: "acpi_ds_create_buffer_field", scope: !3, file: !3, line: 120, type: !808, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!25, !173, !138}
!810 = !{}
!811 = !DILocalVariable(name: "op", arg: 1, scope: !807, file: !3, line: 120, type: !173)
!812 = !DILocation(line: 120, column: 54, scope: !807)
!813 = !DILocalVariable(name: "walk_state", arg: 2, scope: !807, file: !3, line: 121, type: !138)
!814 = !DILocation(line: 121, column: 32, scope: !807)
!815 = !DILocalVariable(name: "arg", scope: !807, file: !3, line: 123, type: !173)
!816 = !DILocation(line: 123, column: 27, scope: !807)
!817 = !DILocalVariable(name: "node", scope: !807, file: !3, line: 124, type: !39)
!818 = !DILocation(line: 124, column: 30, scope: !807)
!819 = !DILocalVariable(name: "status", scope: !807, file: !3, line: 125, type: !25)
!820 = !DILocation(line: 125, column: 14, scope: !807)
!821 = !DILocalVariable(name: "obj_desc", scope: !807, file: !3, line: 126, type: !43)
!822 = !DILocation(line: 126, column: 29, scope: !807)
!823 = !DILocalVariable(name: "second_desc", scope: !807, file: !3, line: 127, type: !43)
!824 = !DILocation(line: 127, column: 29, scope: !807)
!825 = !DILocalVariable(name: "flags", scope: !807, file: !3, line: 128, type: !27)
!826 = !DILocation(line: 128, column: 6, scope: !807)
!827 = !DILocation(line: 135, column: 6, scope: !828)
!828 = distinct !DILexicalBlock(scope: !807, file: !3, line: 135, column: 6)
!829 = !DILocation(line: 135, column: 10, scope: !828)
!830 = !DILocation(line: 135, column: 17, scope: !828)
!831 = !DILocation(line: 135, column: 28, scope: !828)
!832 = !DILocation(line: 135, column: 6, scope: !807)
!833 = !DILocation(line: 139, column: 25, scope: !834)
!834 = distinct !DILexicalBlock(scope: !828, file: !3, line: 135, column: 52)
!835 = !DILocation(line: 139, column: 9, scope: !834)
!836 = !DILocation(line: 139, column: 7, scope: !834)
!837 = !DILocation(line: 140, column: 2, scope: !834)
!838 = !DILocation(line: 143, column: 25, scope: !839)
!839 = distinct !DILexicalBlock(scope: !828, file: !3, line: 140, column: 9)
!840 = !DILocation(line: 143, column: 9, scope: !839)
!841 = !DILocation(line: 143, column: 7, scope: !839)
!842 = !DILocation(line: 146, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !807, file: !3, line: 146, column: 6)
!844 = !DILocation(line: 146, column: 6, scope: !807)
!845 = !DILocation(line: 147, column: 3, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !3, line: 146, column: 12)
!847 = !DILocation(line: 150, column: 6, scope: !848)
!848 = distinct !DILexicalBlock(scope: !807, file: !3, line: 150, column: 6)
!849 = !DILocation(line: 150, column: 18, scope: !848)
!850 = !DILocation(line: 150, column: 6, scope: !807)
!851 = !DILocation(line: 151, column: 10, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !3, line: 150, column: 33)
!853 = !DILocation(line: 151, column: 22, scope: !852)
!854 = !DILocation(line: 151, column: 8, scope: !852)
!855 = !DILocation(line: 152, column: 2, scope: !852)
!856 = !DILocation(line: 155, column: 9, scope: !857)
!857 = distinct !DILexicalBlock(scope: !858, file: !3, line: 155, column: 7)
