; ModuleID = '../bcout/drivers/acpi/acpica/dsmethod.llvm.bc'
source_filename = "drivers/acpi/acpica/dsmethod.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 20, type: !1928, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !1927, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/dsmethod.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12, !17, !23}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !13, line: 65, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !18, line: 16, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22}
!20 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !24, line: 305, baseType: !7, size: 32, elements: !25)
!24 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !27, !28, !29}
!26 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!27 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!30 = !{!31, !36, !38, !40, !44, !48, !45, !49, !41, !805, !806, !807, !1926}
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !32, line: 19, baseType: !33)
!32 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !34, line: 24, baseType: !35)
!34 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!35 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !37, line: 421, baseType: !38)
!37 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !32, line: 21, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !34, line: 27, baseType: !7)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !37, line: 127, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !32, line: 23, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !34, line: 31, baseType: !43)
!43 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !32, line: 17, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !34, line: 21, baseType: !47)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !51)
!51 = !{!52, !792, !793, !794, !795, !801, !802, !803, !804}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !50, file: !6, line: 134, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !55, line: 367, size: 576, elements: !56)
!55 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!56 = !{!57, !65, !78, !90, !103, !117, !126, !443, !460, !475, !488, !566, !578, !592, !602, !620, !642, !661, !680, !699, !712, !738, !755, !768, !782, !791}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !54, file: !55, line: 368, baseType: !58, size: 128)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !55, line: 73, size: 128, elements: !59)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !58, file: !55, line: 74, baseType: !53, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !58, file: !55, line: 74, baseType: !45, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !55, line: 74, baseType: !45, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !58, file: !55, line: 74, baseType: !31, size: 16, offset: 80)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !55, line: 74, baseType: !45, size: 8, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !54, file: !55, line: 369, baseType: !66, size: 192)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !55, line: 76, size: 192, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !66, file: !55, line: 77, baseType: !53, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !66, file: !55, line: 77, baseType: !45, size: 8, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !55, line: 77, baseType: !45, size: 8, offset: 72)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !66, file: !55, line: 77, baseType: !31, size: 16, offset: 80)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !55, line: 77, baseType: !45, size: 8, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !66, file: !55, line: 77, baseType: !74, size: 24, offset: 104)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 24, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !66, file: !55, line: 78, baseType: !41, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !54, file: !55, line: 370, baseType: !79, size: 256)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !55, line: 93, size: 256, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !89}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !79, file: !55, line: 94, baseType: !53, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !79, file: !55, line: 94, baseType: !45, size: 8, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !55, line: 94, baseType: !45, size: 8, offset: 72)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !79, file: !55, line: 94, baseType: !31, size: 16, offset: 80)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !55, line: 94, baseType: !45, size: 8, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !79, file: !55, line: 94, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !79, file: !55, line: 94, baseType: !38, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !54, file: !55, line: 371, baseType: !91, size: 384)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !55, line: 97, size: 384, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !91, file: !55, line: 98, baseType: !53, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !91, file: !55, line: 98, baseType: !45, size: 8, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !55, line: 98, baseType: !45, size: 8, offset: 72)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !91, file: !55, line: 98, baseType: !31, size: 16, offset: 80)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !55, line: 98, baseType: !45, size: 8, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !91, file: !55, line: 98, baseType: !44, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !55, line: 98, baseType: !38, size: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !91, file: !55, line: 99, baseType: !38, size: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !91, file: !55, line: 100, baseType: !44, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !91, file: !55, line: 101, baseType: !49, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !54, file: !55, line: 372, baseType: !104, size: 384)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !55, line: 104, size: 384, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !114, !115, !116}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !104, file: !55, line: 105, baseType: !53, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !104, file: !55, line: 105, baseType: !45, size: 8, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !55, line: 105, baseType: !45, size: 8, offset: 72)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !104, file: !55, line: 105, baseType: !31, size: 16, offset: 80)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !55, line: 105, baseType: !45, size: 8, offset: 96)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !104, file: !55, line: 105, baseType: !49, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !104, file: !55, line: 106, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !104, file: !55, line: 107, baseType: !44, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !104, file: !55, line: 108, baseType: !38, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !104, file: !55, line: 109, baseType: !38, size: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !54, file: !55, line: 373, baseType: !118, size: 192)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !55, line: 118, size: 192, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !118, file: !55, line: 119, baseType: !53, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !118, file: !55, line: 119, baseType: !45, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !55, line: 119, baseType: !45, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !118, file: !55, line: 119, baseType: !31, size: 16, offset: 80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !55, line: 119, baseType: !45, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !118, file: !55, line: 119, baseType: !48, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !54, file: !55, line: 374, baseType: !127, size: 448)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !55, line: 143, size: 448, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !440, !441, !442}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !127, file: !55, line: 144, baseType: !53, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !127, file: !55, line: 144, baseType: !45, size: 8, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !55, line: 144, baseType: !45, size: 8, offset: 72)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !127, file: !55, line: 144, baseType: !31, size: 16, offset: 80)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !55, line: 144, baseType: !45, size: 8, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !127, file: !55, line: 144, baseType: !45, size: 8, offset: 104)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !127, file: !55, line: 145, baseType: !45, size: 8, offset: 112)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !127, file: !55, line: 146, baseType: !45, size: 8, offset: 120)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !127, file: !55, line: 147, baseType: !53, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !127, file: !55, line: 148, baseType: !53, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !127, file: !55, line: 149, baseType: !44, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !127, file: !55, line: 153, baseType: !141, size: 64, offset: 320)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !127, file: !55, line: 150, size: 64, elements: !142)
!142 = !{!143, !439}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !141, file: !55, line: 151, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{!36, !148}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !150, line: 37, size: 9024, elements: !151)
!150 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!151 = !{!152, !153, !154, !155, !156, !157, !158, !159, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !385, !386, !387, !388, !389, !393, !395, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !422, !423, !424, !425, !426, !427, !428, !429, !431, !437}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !150, line: 38, baseType: !148, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !149, file: !150, line: 39, baseType: !45, size: 8, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !149, file: !150, line: 40, baseType: !45, size: 8, offset: 72)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !149, file: !150, line: 41, baseType: !31, size: 16, offset: 80)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !149, file: !150, line: 42, baseType: !45, size: 8, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !149, file: !150, line: 43, baseType: !45, size: 8, offset: 104)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !149, file: !150, line: 44, baseType: !45, size: 8, offset: 112)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !149, file: !150, line: 45, baseType: !160, size: 16, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !37, line: 445, baseType: !31)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !149, file: !150, line: 46, baseType: !45, size: 8, offset: 144)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !149, file: !150, line: 47, baseType: !45, size: 8, offset: 152)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !149, file: !150, line: 48, baseType: !45, size: 8, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !149, file: !150, line: 49, baseType: !45, size: 8, offset: 168)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !149, file: !150, line: 50, baseType: !45, size: 8, offset: 176)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !149, file: !150, line: 51, baseType: !45, size: 8, offset: 184)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !149, file: !150, line: 52, baseType: !45, size: 8, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !149, file: !150, line: 53, baseType: !45, size: 8, offset: 200)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !149, file: !150, line: 54, baseType: !44, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !149, file: !150, line: 55, baseType: !38, size: 32, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !149, file: !150, line: 56, baseType: !38, size: 32, offset: 352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !149, file: !150, line: 57, baseType: !38, size: 32, offset: 384)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !149, file: !150, line: 58, baseType: !38, size: 32, offset: 416)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !149, file: !150, line: 60, baseType: !175, size: 640, offset: 448)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !266, !267, !383, !384}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !175, file: !6, line: 894, baseType: !44, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !175, file: !6, line: 895, baseType: !44, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !175, file: !6, line: 896, baseType: !44, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !175, file: !6, line: 897, baseType: !44, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !175, file: !6, line: 898, baseType: !44, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !175, file: !6, line: 899, baseType: !183, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !185)
!185 = !{!186, !206, !222}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !184, file: !6, line: 876, baseType: !187, size: 448)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !205}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !187, file: !6, line: 829, baseType: !183, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !187, file: !6, line: 829, baseType: !45, size: 8, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !6, line: 829, baseType: !45, size: 8, offset: 72)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !187, file: !6, line: 829, baseType: !31, size: 16, offset: 80)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !187, file: !6, line: 829, baseType: !44, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !187, file: !6, line: 829, baseType: !183, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !187, file: !6, line: 829, baseType: !49, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !187, file: !6, line: 829, baseType: !197, size: 64, offset: 320)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !197, file: !6, line: 717, baseType: !41, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !6, line: 718, baseType: !38, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !197, file: !6, line: 719, baseType: !87, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !197, file: !6, line: 720, baseType: !44, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !6, line: 721, baseType: !87, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !197, file: !6, line: 722, baseType: !183, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !187, file: !6, line: 829, baseType: !45, size: 8, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !184, file: !6, line: 877, baseType: !207, size: 640)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !207, file: !6, line: 836, baseType: !183, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !207, file: !6, line: 836, baseType: !45, size: 8, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !6, line: 836, baseType: !45, size: 8, offset: 72)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !207, file: !6, line: 836, baseType: !31, size: 16, offset: 80)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !207, file: !6, line: 836, baseType: !44, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !6, line: 836, baseType: !183, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !6, line: 836, baseType: !49, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !207, file: !6, line: 836, baseType: !197, size: 64, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !207, file: !6, line: 836, baseType: !45, size: 8, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !207, file: !6, line: 836, baseType: !87, size: 64, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !6, line: 837, baseType: !44, size: 64, offset: 512)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !207, file: !6, line: 838, baseType: !38, size: 32, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !6, line: 839, baseType: !38, size: 32, offset: 608)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !184, file: !6, line: 878, baseType: !223, size: 1600)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !223, file: !6, line: 847, baseType: !183, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !223, file: !6, line: 847, baseType: !45, size: 8, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !6, line: 847, baseType: !45, size: 8, offset: 72)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !223, file: !6, line: 847, baseType: !31, size: 16, offset: 80)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !223, file: !6, line: 847, baseType: !44, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !6, line: 847, baseType: !183, size: 64, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !223, file: !6, line: 847, baseType: !49, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !223, file: !6, line: 847, baseType: !197, size: 64, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !223, file: !6, line: 847, baseType: !45, size: 8, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !223, file: !6, line: 847, baseType: !183, size: 64, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !223, file: !6, line: 848, baseType: !183, size: 64, offset: 512)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !223, file: !6, line: 849, baseType: !87, size: 64, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !223, file: !6, line: 850, baseType: !45, size: 8, offset: 640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !223, file: !6, line: 851, baseType: !87, size: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !223, file: !6, line: 852, baseType: !87, size: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !223, file: !6, line: 853, baseType: !87, size: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !223, file: !6, line: 854, baseType: !242, size: 32, offset: 896)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !223, file: !6, line: 855, baseType: !38, size: 32, offset: 928)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !223, file: !6, line: 856, baseType: !38, size: 32, offset: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !223, file: !6, line: 857, baseType: !38, size: 32, offset: 992)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !223, file: !6, line: 858, baseType: !38, size: 32, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !223, file: !6, line: 859, baseType: !38, size: 32, offset: 1056)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !223, file: !6, line: 860, baseType: !38, size: 32, offset: 1088)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !223, file: !6, line: 861, baseType: !38, size: 32, offset: 1120)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !223, file: !6, line: 862, baseType: !38, size: 32, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !223, file: !6, line: 863, baseType: !38, size: 32, offset: 1184)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !223, file: !6, line: 864, baseType: !38, size: 32, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !223, file: !6, line: 865, baseType: !38, size: 32, offset: 1248)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !223, file: !6, line: 866, baseType: !38, size: 32, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !223, file: !6, line: 867, baseType: !38, size: 32, offset: 1312)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !223, file: !6, line: 868, baseType: !31, size: 16, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !223, file: !6, line: 869, baseType: !45, size: 8, offset: 1360)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !223, file: !6, line: 870, baseType: !45, size: 8, offset: 1368)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !223, file: !6, line: 871, baseType: !45, size: 8, offset: 1376)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !223, file: !6, line: 872, baseType: !263, size: 160, offset: 1384)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 160, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 20)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !175, file: !6, line: 900, baseType: !49, size: 64, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !175, file: !6, line: 901, baseType: !268, size: 64, offset: 448)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !270)
!270 = !{!271, !279, !292, !301, !310, !323, !337, !349, !361}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !269, file: !6, line: 664, baseType: !272, size: 128)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !6, line: 568, baseType: !48, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !272, file: !6, line: 568, baseType: !45, size: 8, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !272, file: !6, line: 568, baseType: !45, size: 8, offset: 72)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !6, line: 568, baseType: !31, size: 16, offset: 80)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !272, file: !6, line: 568, baseType: !31, size: 16, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !269, file: !6, line: 665, baseType: !280, size: 384)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !6, line: 594, baseType: !48, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !280, file: !6, line: 594, baseType: !45, size: 8, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !280, file: !6, line: 594, baseType: !45, size: 8, offset: 72)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !280, file: !6, line: 594, baseType: !31, size: 16, offset: 80)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !280, file: !6, line: 594, baseType: !31, size: 16, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !280, file: !6, line: 594, baseType: !31, size: 16, offset: 112)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !280, file: !6, line: 595, baseType: !183, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !280, file: !6, line: 596, baseType: !44, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !280, file: !6, line: 597, baseType: !44, size: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !280, file: !6, line: 598, baseType: !41, size: 64, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !269, file: !6, line: 666, baseType: !293, size: 192)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !6, line: 574, baseType: !48, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !293, file: !6, line: 574, baseType: !45, size: 8, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !293, file: !6, line: 574, baseType: !45, size: 8, offset: 72)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !293, file: !6, line: 574, baseType: !31, size: 16, offset: 80)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !293, file: !6, line: 574, baseType: !31, size: 16, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !293, file: !6, line: 574, baseType: !53, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !269, file: !6, line: 667, baseType: !302, size: 192)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !6, line: 605, baseType: !48, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !302, file: !6, line: 605, baseType: !45, size: 8, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !6, line: 605, baseType: !45, size: 8, offset: 72)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !302, file: !6, line: 605, baseType: !31, size: 16, offset: 80)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !302, file: !6, line: 605, baseType: !31, size: 16, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !302, file: !6, line: 605, baseType: !49, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !269, file: !6, line: 668, baseType: !311, size: 448)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !6, line: 609, baseType: !48, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !311, file: !6, line: 609, baseType: !45, size: 8, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !6, line: 609, baseType: !45, size: 8, offset: 72)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !311, file: !6, line: 609, baseType: !31, size: 16, offset: 80)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !311, file: !6, line: 609, baseType: !31, size: 16, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !311, file: !6, line: 609, baseType: !38, size: 32, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !311, file: !6, line: 610, baseType: !183, size: 64, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !311, file: !6, line: 611, baseType: !44, size: 64, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !311, file: !6, line: 612, baseType: !44, size: 64, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !311, file: !6, line: 613, baseType: !38, size: 32, offset: 384)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !269, file: !6, line: 669, baseType: !324, size: 512)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !6, line: 581, baseType: !48, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !324, file: !6, line: 581, baseType: !45, size: 8, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !324, file: !6, line: 581, baseType: !45, size: 8, offset: 72)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !324, file: !6, line: 581, baseType: !31, size: 16, offset: 80)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !324, file: !6, line: 581, baseType: !31, size: 16, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !324, file: !6, line: 581, baseType: !38, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !324, file: !6, line: 582, baseType: !53, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !324, file: !6, line: 583, baseType: !53, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !324, file: !6, line: 584, baseType: !148, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !324, file: !6, line: 585, baseType: !48, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !324, file: !6, line: 586, baseType: !38, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !269, file: !6, line: 670, baseType: !338, size: 320)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !6, line: 621, baseType: !48, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !338, file: !6, line: 621, baseType: !45, size: 8, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !338, file: !6, line: 621, baseType: !45, size: 8, offset: 72)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !338, file: !6, line: 621, baseType: !31, size: 16, offset: 80)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !6, line: 621, baseType: !31, size: 16, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !338, file: !6, line: 621, baseType: !45, size: 8, offset: 112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !338, file: !6, line: 622, baseType: !148, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !338, file: !6, line: 623, baseType: !53, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !338, file: !6, line: 624, baseType: !41, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !269, file: !6, line: 671, baseType: !350, size: 640)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !6, line: 632, baseType: !48, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !350, file: !6, line: 632, baseType: !45, size: 8, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !6, line: 632, baseType: !45, size: 8, offset: 72)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !6, line: 632, baseType: !31, size: 16, offset: 80)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !350, file: !6, line: 632, baseType: !31, size: 16, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !350, file: !6, line: 633, baseType: !358, size: 512, offset: 128)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !269, file: !6, line: 672, baseType: !362, size: 320)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !6, line: 655, baseType: !48, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !362, file: !6, line: 655, baseType: !45, size: 8, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !6, line: 655, baseType: !45, size: 8, offset: 72)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !362, file: !6, line: 655, baseType: !31, size: 16, offset: 80)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !362, file: !6, line: 655, baseType: !31, size: 16, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !362, file: !6, line: 655, baseType: !45, size: 8, offset: 112)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !6, line: 656, baseType: !49, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !362, file: !6, line: 657, baseType: !53, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !362, file: !6, line: 658, baseType: !373, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !375)
!375 = !{!376, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !374, file: !6, line: 646, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !37, line: 1052, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381, !38, !48}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !37, line: 424, baseType: !48)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !374, file: !6, line: 647, baseType: !48, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !175, file: !6, line: 902, baseType: !183, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !175, file: !6, line: 903, baseType: !38, size: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !149, file: !150, line: 61, baseType: !38, size: 32, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !149, file: !150, line: 62, baseType: !38, size: 32, offset: 1120)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !149, file: !150, line: 63, baseType: !31, size: 16, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !149, file: !150, line: 64, baseType: !45, size: 8, offset: 1168)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !149, file: !150, line: 66, baseType: !390, size: 2688, offset: 1216)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 2688, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 7)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !149, file: !150, line: 67, baseType: !394, size: 3072, offset: 3904)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 3072, elements: !359)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !149, file: !150, line: 68, baseType: !396, size: 576, offset: 6976)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 576, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 9)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !149, file: !150, line: 69, baseType: !113, size: 64, offset: 7552)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !149, file: !150, line: 71, baseType: !44, size: 64, offset: 7616)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !149, file: !150, line: 72, baseType: !113, size: 64, offset: 7680)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !149, file: !150, line: 73, baseType: !268, size: 64, offset: 7744)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !149, file: !150, line: 74, baseType: !49, size: 64, offset: 7808)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !149, file: !150, line: 75, baseType: !53, size: 64, offset: 7872)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !149, file: !150, line: 76, baseType: !49, size: 64, offset: 7936)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !149, file: !150, line: 77, baseType: !183, size: 64, offset: 8000)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !149, file: !150, line: 78, baseType: !53, size: 64, offset: 8064)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !149, file: !150, line: 79, baseType: !49, size: 64, offset: 8128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !149, file: !150, line: 80, baseType: !87, size: 64, offset: 8192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !149, file: !150, line: 81, baseType: !183, size: 64, offset: 8256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !149, file: !150, line: 82, baseType: !412, size: 64, offset: 8320)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !414, file: !6, line: 706, baseType: !38, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !414, file: !6, line: 707, baseType: !38, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !6, line: 708, baseType: !31, size: 16, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !414, file: !6, line: 709, baseType: !45, size: 8, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !414, file: !6, line: 710, baseType: !45, size: 8, offset: 88)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !414, file: !6, line: 711, baseType: !45, size: 8, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !149, file: !150, line: 83, baseType: !183, size: 64, offset: 8384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !149, file: !150, line: 84, baseType: !53, size: 64, offset: 8448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !149, file: !150, line: 85, baseType: !268, size: 64, offset: 8512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !149, file: !150, line: 86, baseType: !53, size: 64, offset: 8576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !149, file: !150, line: 87, baseType: !268, size: 64, offset: 8640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !149, file: !150, line: 88, baseType: !183, size: 64, offset: 8704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !149, file: !150, line: 89, baseType: !183, size: 64, offset: 8768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !149, file: !150, line: 90, baseType: !430, size: 64, offset: 8832)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !149, file: !150, line: 91, baseType: !432, size: 64, offset: 8896)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!36, !148, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !149, file: !150, line: 92, baseType: !438, size: 64, offset: 8960)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !145)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !141, file: !55, line: 152, baseType: !53, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !127, file: !55, line: 155, baseType: !38, size: 32, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !127, file: !55, line: 156, baseType: !160, size: 16, offset: 416)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !127, file: !55, line: 157, baseType: !45, size: 8, offset: 432)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !54, file: !55, line: 375, baseType: !444, size: 576)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !55, line: 122, size: 576, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !444, file: !55, line: 123, baseType: !53, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !444, file: !55, line: 123, baseType: !45, size: 8, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !444, file: !55, line: 123, baseType: !45, size: 8, offset: 72)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !444, file: !55, line: 123, baseType: !31, size: 16, offset: 80)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !444, file: !55, line: 123, baseType: !45, size: 8, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !444, file: !55, line: 123, baseType: !45, size: 8, offset: 104)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !444, file: !55, line: 124, baseType: !31, size: 16, offset: 112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !444, file: !55, line: 125, baseType: !48, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !444, file: !55, line: 126, baseType: !41, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !444, file: !55, line: 127, baseType: !430, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !444, file: !55, line: 128, baseType: !53, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !55, line: 129, baseType: !53, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !444, file: !55, line: 130, baseType: !49, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !444, file: !55, line: 131, baseType: !45, size: 8, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !54, file: !55, line: 376, baseType: !461, size: 448)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !55, line: 134, size: 448, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !474}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !461, file: !55, line: 135, baseType: !53, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !461, file: !55, line: 135, baseType: !45, size: 8, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !461, file: !55, line: 135, baseType: !45, size: 8, offset: 72)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !461, file: !55, line: 135, baseType: !31, size: 16, offset: 80)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !461, file: !55, line: 135, baseType: !45, size: 8, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !461, file: !55, line: 135, baseType: !45, size: 8, offset: 104)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !461, file: !55, line: 136, baseType: !49, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !461, file: !55, line: 137, baseType: !53, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !55, line: 138, baseType: !53, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !461, file: !55, line: 139, baseType: !473, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !37, line: 129, baseType: !41)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !461, file: !55, line: 140, baseType: !38, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !54, file: !55, line: 377, baseType: !476, size: 320)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !55, line: 184, size: 320, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !476, file: !55, line: 185, baseType: !53, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !476, file: !55, line: 185, baseType: !45, size: 8, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !55, line: 185, baseType: !45, size: 8, offset: 72)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !476, file: !55, line: 185, baseType: !31, size: 16, offset: 80)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !55, line: 185, baseType: !45, size: 8, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !476, file: !55, line: 185, baseType: !484, size: 128, offset: 128)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 2)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !476, file: !55, line: 185, baseType: !53, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !54, file: !55, line: 378, baseType: !489, size: 384)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !55, line: 187, size: 384, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !489, file: !55, line: 188, baseType: !53, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !489, file: !55, line: 188, baseType: !45, size: 8, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !55, line: 188, baseType: !45, size: 8, offset: 72)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !489, file: !55, line: 188, baseType: !31, size: 16, offset: 80)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !489, file: !55, line: 188, baseType: !45, size: 8, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !489, file: !55, line: 189, baseType: !484, size: 128, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !489, file: !55, line: 189, baseType: !53, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !489, file: !55, line: 189, baseType: !499, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !501)
!501 = !{!502, !503, !504, !505, !513, !528, !560, !561, !562, !563, !564, !565}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !500, file: !6, line: 481, baseType: !49, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !500, file: !6, line: 482, baseType: !499, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !500, file: !6, line: 483, baseType: !499, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !500, file: !6, line: 484, baseType: !506, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !507, file: !6, line: 498, baseType: !506, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !6, line: 499, baseType: !506, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !507, file: !6, line: 500, baseType: !499, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !507, file: !6, line: 501, baseType: !38, size: 32, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !500, file: !6, line: 485, baseType: !514, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !516)
!516 = !{!517, !522, !523, !524, !525, !526, !527}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !515, file: !6, line: 467, baseType: !518, size: 128)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !518, file: !6, line: 460, baseType: !45, size: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !518, file: !6, line: 461, baseType: !41, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !515, file: !6, line: 468, baseType: !518, size: 128, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !515, file: !6, line: 469, baseType: !31, size: 16, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !515, file: !6, line: 470, baseType: !45, size: 8, offset: 272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !515, file: !6, line: 471, baseType: !45, size: 8, offset: 280)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !515, file: !6, line: 472, baseType: !45, size: 8, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !515, file: !6, line: 473, baseType: !45, size: 8, offset: 296)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !500, file: !6, line: 486, baseType: !529, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !531)
!531 = !{!532, !555, !556, !557, !558, !559}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !530, file: !6, line: 449, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !534)
!534 = !{!535, !536, !549}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !533, file: !6, line: 439, baseType: !49, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !533, file: !6, line: 440, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !539)
!539 = !{!540, !545, !546, !547, !548}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !538, file: !6, line: 420, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !37, line: 1049, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{!38, !381, !38, !48}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !538, file: !6, line: 421, baseType: !48, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !538, file: !6, line: 422, baseType: !49, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !538, file: !6, line: 423, baseType: !45, size: 8, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !538, file: !6, line: 424, baseType: !45, size: 8, offset: 200)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !533, file: !6, line: 441, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !551, file: !6, line: 430, baseType: !49, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !6, line: 431, baseType: !550, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !530, file: !6, line: 450, baseType: !514, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !6, line: 451, baseType: !45, size: 8, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !530, file: !6, line: 452, baseType: !45, size: 8, offset: 136)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !530, file: !6, line: 453, baseType: !45, size: 8, offset: 144)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !530, file: !6, line: 454, baseType: !45, size: 8, offset: 152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !500, file: !6, line: 487, baseType: !41, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !500, file: !6, line: 488, baseType: !38, size: 32, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !500, file: !6, line: 489, baseType: !31, size: 16, offset: 480)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !500, file: !6, line: 490, baseType: !31, size: 16, offset: 496)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !500, file: !6, line: 491, baseType: !45, size: 8, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !500, file: !6, line: 492, baseType: !45, size: 8, offset: 520)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !54, file: !55, line: 379, baseType: !567, size: 384)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !55, line: 192, size: 384, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !567, file: !55, line: 193, baseType: !53, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !567, file: !55, line: 193, baseType: !45, size: 8, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !55, line: 193, baseType: !45, size: 8, offset: 72)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !567, file: !55, line: 193, baseType: !31, size: 16, offset: 80)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !567, file: !55, line: 193, baseType: !45, size: 8, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !567, file: !55, line: 193, baseType: !484, size: 128, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !567, file: !55, line: 193, baseType: !53, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !567, file: !55, line: 193, baseType: !38, size: 32, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !567, file: !55, line: 194, baseType: !38, size: 32, offset: 352)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !54, file: !55, line: 380, baseType: !579, size: 384)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !55, line: 197, size: 384, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !579, file: !55, line: 198, baseType: !53, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !579, file: !55, line: 198, baseType: !45, size: 8, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !55, line: 198, baseType: !45, size: 8, offset: 72)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !579, file: !55, line: 198, baseType: !31, size: 16, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !55, line: 198, baseType: !45, size: 8, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !579, file: !55, line: 200, baseType: !45, size: 8, offset: 104)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !579, file: !55, line: 201, baseType: !45, size: 8, offset: 112)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !579, file: !55, line: 202, baseType: !484, size: 128, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !579, file: !55, line: 202, baseType: !53, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !579, file: !55, line: 202, baseType: !591, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !37, line: 128, baseType: !41)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !54, file: !55, line: 381, baseType: !593, size: 320)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !55, line: 205, size: 320, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !593, file: !55, line: 206, baseType: !53, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !593, file: !55, line: 206, baseType: !45, size: 8, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !55, line: 206, baseType: !45, size: 8, offset: 72)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !593, file: !55, line: 206, baseType: !31, size: 16, offset: 80)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !593, file: !55, line: 206, baseType: !45, size: 8, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !593, file: !55, line: 206, baseType: !484, size: 128, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !593, file: !55, line: 206, baseType: !53, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !54, file: !55, line: 382, baseType: !603, size: 384)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !55, line: 233, size: 384, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !603, file: !55, line: 234, baseType: !53, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 72)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !603, file: !55, line: 234, baseType: !31, size: 16, offset: 80)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 104)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 112)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 120)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !603, file: !55, line: 234, baseType: !49, size: 64, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !603, file: !55, line: 234, baseType: !38, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !603, file: !55, line: 234, baseType: !38, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !603, file: !55, line: 234, baseType: !38, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !603, file: !55, line: 234, baseType: !45, size: 8, offset: 296)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !603, file: !55, line: 234, baseType: !53, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !54, file: !55, line: 383, baseType: !621, size: 576)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !55, line: 237, size: 576, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !621, file: !55, line: 238, baseType: !53, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 72)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !621, file: !55, line: 238, baseType: !31, size: 16, offset: 80)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 104)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 112)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 120)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !621, file: !55, line: 238, baseType: !49, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !621, file: !55, line: 238, baseType: !38, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !621, file: !55, line: 238, baseType: !38, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !621, file: !55, line: 238, baseType: !38, size: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !621, file: !55, line: 238, baseType: !45, size: 8, offset: 296)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !621, file: !55, line: 238, baseType: !31, size: 16, offset: 304)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !621, file: !55, line: 239, baseType: !53, size: 64, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !621, file: !55, line: 240, baseType: !44, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !621, file: !55, line: 241, baseType: !31, size: 16, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !621, file: !55, line: 242, baseType: !44, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !54, file: !55, line: 384, baseType: !643, size: 384)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !55, line: 262, size: 384, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !643, file: !55, line: 263, baseType: !53, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 72)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !643, file: !55, line: 263, baseType: !31, size: 16, offset: 80)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 104)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 112)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 120)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !643, file: !55, line: 263, baseType: !49, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !643, file: !55, line: 263, baseType: !38, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !643, file: !55, line: 263, baseType: !38, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !643, file: !55, line: 263, baseType: !38, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 296)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !643, file: !55, line: 263, baseType: !45, size: 8, offset: 304)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !643, file: !55, line: 264, baseType: !53, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !54, file: !55, line: 385, baseType: !662, size: 448)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !55, line: 245, size: 448, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !662, file: !55, line: 246, baseType: !53, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 72)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !662, file: !55, line: 246, baseType: !31, size: 16, offset: 80)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 104)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 120)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !662, file: !55, line: 246, baseType: !49, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !662, file: !55, line: 246, baseType: !38, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !662, file: !55, line: 246, baseType: !38, size: 32, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !55, line: 246, baseType: !38, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 288)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !662, file: !55, line: 246, baseType: !45, size: 8, offset: 296)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !662, file: !55, line: 246, baseType: !53, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !662, file: !55, line: 247, baseType: !53, size: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !54, file: !55, line: 386, baseType: !681, size: 448)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !55, line: 250, size: 448, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !681, file: !55, line: 251, baseType: !53, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 72)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !681, file: !55, line: 251, baseType: !31, size: 16, offset: 80)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 104)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 112)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 120)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !681, file: !55, line: 251, baseType: !49, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !681, file: !55, line: 251, baseType: !38, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !681, file: !55, line: 251, baseType: !38, size: 32, offset: 224)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !681, file: !55, line: 251, baseType: !38, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !681, file: !55, line: 251, baseType: !45, size: 8, offset: 296)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !681, file: !55, line: 256, baseType: !53, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !681, file: !55, line: 257, baseType: !53, size: 64, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !54, file: !55, line: 387, baseType: !700, size: 512)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !55, line: 273, size: 512, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !700, file: !55, line: 274, baseType: !53, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !700, file: !55, line: 274, baseType: !45, size: 8, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !55, line: 274, baseType: !45, size: 8, offset: 72)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !700, file: !55, line: 274, baseType: !31, size: 16, offset: 80)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !700, file: !55, line: 274, baseType: !45, size: 8, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !700, file: !55, line: 274, baseType: !49, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !700, file: !55, line: 275, baseType: !38, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !700, file: !55, line: 276, baseType: !377, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !700, file: !55, line: 277, baseType: !48, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !55, line: 278, baseType: !484, size: 128, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !54, file: !55, line: 388, baseType: !713, size: 512)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !55, line: 281, size: 512, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !728, !729, !730, !736, !737}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !713, file: !55, line: 282, baseType: !53, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !713, file: !55, line: 282, baseType: !45, size: 8, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !55, line: 282, baseType: !45, size: 8, offset: 72)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !713, file: !55, line: 282, baseType: !31, size: 16, offset: 80)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !713, file: !55, line: 282, baseType: !45, size: 8, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !713, file: !55, line: 282, baseType: !45, size: 8, offset: 104)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !713, file: !55, line: 283, baseType: !45, size: 8, offset: 112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !713, file: !55, line: 284, baseType: !723, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !37, line: 1084, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{!36, !38, !473, !38, !727, !48, !48}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !713, file: !55, line: 285, baseType: !49, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !713, file: !55, line: 286, baseType: !48, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !713, file: !55, line: 287, baseType: !731, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !37, line: 1102, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!36, !381, !38, !48, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !713, file: !55, line: 288, baseType: !53, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !55, line: 289, baseType: !53, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !54, file: !55, line: 389, baseType: !739, size: 512)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !55, line: 307, size: 512, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !739, file: !55, line: 308, baseType: !53, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !739, file: !55, line: 308, baseType: !45, size: 8, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !739, file: !55, line: 308, baseType: !45, size: 8, offset: 72)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !739, file: !55, line: 308, baseType: !31, size: 16, offset: 80)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !739, file: !55, line: 308, baseType: !45, size: 8, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !739, file: !55, line: 308, baseType: !45, size: 8, offset: 104)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !739, file: !55, line: 309, baseType: !45, size: 8, offset: 112)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !739, file: !55, line: 310, baseType: !45, size: 8, offset: 120)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !739, file: !55, line: 311, baseType: !48, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !739, file: !55, line: 312, baseType: !49, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !739, file: !55, line: 313, baseType: !113, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !739, file: !55, line: 314, baseType: !44, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !739, file: !55, line: 315, baseType: !44, size: 64, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !739, file: !55, line: 316, baseType: !38, size: 32, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !54, file: !55, line: 390, baseType: !756, size: 448)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !55, line: 340, size: 448, elements: !757)
!757 = !{!758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !756, file: !55, line: 341, baseType: !53, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !756, file: !55, line: 341, baseType: !45, size: 8, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !55, line: 341, baseType: !45, size: 8, offset: 72)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !756, file: !55, line: 341, baseType: !31, size: 16, offset: 80)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !756, file: !55, line: 341, baseType: !45, size: 8, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !756, file: !55, line: 341, baseType: !49, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !756, file: !55, line: 342, baseType: !49, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !756, file: !55, line: 343, baseType: !48, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !756, file: !55, line: 344, baseType: !44, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !756, file: !55, line: 345, baseType: !38, size: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !55, line: 391, baseType: !769, size: 256)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !55, line: 350, size: 256, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !781}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !769, file: !55, line: 351, baseType: !53, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !769, file: !55, line: 351, baseType: !45, size: 8, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !769, file: !55, line: 351, baseType: !45, size: 8, offset: 72)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !769, file: !55, line: 351, baseType: !31, size: 16, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !55, line: 351, baseType: !45, size: 8, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !769, file: !55, line: 351, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !37, line: 1055, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !381, !48}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !769, file: !55, line: 352, baseType: !48, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !54, file: !55, line: 392, baseType: !783, size: 192)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !55, line: 357, size: 192, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !783, file: !55, line: 358, baseType: !53, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !783, file: !55, line: 358, baseType: !45, size: 8, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !55, line: 358, baseType: !45, size: 8, offset: 72)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !783, file: !55, line: 358, baseType: !31, size: 16, offset: 80)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !55, line: 358, baseType: !45, size: 8, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !55, line: 358, baseType: !53, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !54, file: !55, line: 399, baseType: !50, size: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !50, file: !6, line: 135, baseType: !45, size: 8, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !6, line: 136, baseType: !45, size: 8, offset: 72)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !6, line: 137, baseType: !31, size: 16, offset: 80)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !50, file: !6, line: 138, baseType: !796, size: 32, offset: 96)
!796 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !797, line: 327, size: 32, elements: !798)
!797 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !796, file: !797, line: 328, baseType: !38, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !796, file: !797, line: 329, baseType: !242, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !50, file: !6, line: 139, baseType: !49, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !50, file: !6, line: 140, baseType: !49, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !50, file: !6, line: 141, baseType: !49, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !50, file: !6, line: 142, baseType: !160, size: 16, offset: 320)
!805 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !809, line: 640, size: 48640, elements: !810)
!809 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!810 = !{!811, !817, !820, !821, !833, !834, !835, !836, !837, !838, !839, !840, !844, !875, !886, !991, !992, !993, !1004, !1005, !1007, !1008, !1226, !1227, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1306, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1362, !1364, !1365, !1366, !1368, !1370, !1371, !1372, !1373, !1374, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1398, !1403, !1407, !1408, !1409, !1412, !1416, !1419, !1422, !1425, !1428, !1431, !1434, !1437, !1443, !1444, !1445, !1451, !1452, !1456, !1457, !1458, !1467, !1468, !1469, !1470, !1471, !1476, !1477, !1478, !1481, !1482, !1485, !1488, !1491, !1494, !1497, !1500, !1501, !1582, !1585, !1588, !1589, !1592, !1593, !1594, !1598, !1599, !1600, !1613, !1614, !1615, !1625, !1630, !1633, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !808, file: !809, line: 646, baseType: !812, size: 128)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !813, line: 56, size: 128, elements: !814)
!813 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !812, file: !813, line: 57, baseType: !805, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !812, file: !813, line: 58, baseType: !38, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !808, file: !809, line: 649, baseType: !818, size: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !819)
!819 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !808, file: !809, line: 657, baseType: !48, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !808, file: !809, line: 658, baseType: !822, size: 32, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !823, line: 113, baseType: !824)
!823 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !823, line: 111, size: 32, elements: !825)
!825 = !{!826}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !824, file: !823, line: 112, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !828, line: 168, baseType: !829)
!828 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 166, size: 32, elements: !830)
!830 = !{!831}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !829, file: !828, line: 167, baseType: !832, size: 32)
!832 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !808, file: !809, line: 660, baseType: !7, size: 32, offset: 288)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !808, file: !809, line: 661, baseType: !7, size: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !808, file: !809, line: 684, baseType: !832, size: 32, offset: 352)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !808, file: !809, line: 686, baseType: !832, size: 32, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !808, file: !809, line: 687, baseType: !832, size: 32, offset: 416)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !808, file: !809, line: 688, baseType: !832, size: 32, offset: 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !808, file: !809, line: 689, baseType: !7, size: 32, offset: 480)
