; ModuleID = '../bcout/drivers/acpi/acpica/dsopcode.llvm.bc'
source_filename = "drivers/acpi/acpica/dsopcode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 21, type: !804, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !15, globals: !803, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/dsopcode.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 404, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/amlcode.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "AML_FIELD_ACCESS_ANY", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "AML_FIELD_ACCESS_BYTE", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "AML_FIELD_ACCESS_WORD", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "AML_FIELD_ACCESS_DWORD", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "AML_FIELD_ACCESS_QWORD", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "AML_FIELD_ACCESS_BUFFER", value: 5, isUnsigned: true)
!15 = !{!16, !22, !25, !18, !29, !33, !34, !35, !36}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !17, line: 421, baseType: !18)
!17 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !19, line: 21, baseType: !20)
!19 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !21, line: 27, baseType: !7)
!21 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !19, line: 19, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !21, line: 24, baseType: !24)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !17, line: 805, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !19, line: 17, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !21, line: 21, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !17, line: 129, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !19, line: 23, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !21, line: 31, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !17, line: 127, baseType: !30)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_descriptor", file: !38, line: 432, size: 1600, elements: !39)
!38 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!39 = !{!40, !45, !801, !802}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !37, file: !38, line: 433, baseType: !41, size: 128)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_descriptor", file: !38, line: 427, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "common_pointer", scope: !41, file: !38, line: 428, baseType: !35, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !41, file: !38, line: 429, baseType: !26, size: 8, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !37, file: !38, line: 434, baseType: !46, size: 576)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !38, line: 367, size: 576, elements: !47)
!47 = !{!48, !57, !70, !82, !117, !131, !140, !453, !470, !484, !497, !575, !587, !601, !611, !629, !651, !670, !689, !708, !721, !747, !764, !777, !791, !800}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !46, file: !38, line: 368, baseType: !49, size: 128)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !38, line: 73, size: 128, elements: !50)
!50 = !{!51, !53, !54, !55, !56}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !49, file: !38, line: 74, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !49, file: !38, line: 74, baseType: !26, size: 8, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !38, line: 74, baseType: !26, size: 8, offset: 72)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !49, file: !38, line: 74, baseType: !22, size: 16, offset: 80)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !38, line: 74, baseType: !26, size: 8, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !46, file: !38, line: 369, baseType: !58, size: 192)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !38, line: 76, size: 192, elements: !59)
!59 = !{!60, !61, !62, !63, !64, !65, !69}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !58, file: !38, line: 77, baseType: !52, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !58, file: !38, line: 77, baseType: !26, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !38, line: 77, baseType: !26, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !58, file: !38, line: 77, baseType: !22, size: 16, offset: 80)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !38, line: 77, baseType: !26, size: 8, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !38, line: 77, baseType: !66, size: 24, offset: 104)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 3)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !58, file: !38, line: 78, baseType: !30, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !46, file: !38, line: 370, baseType: !71, size: 256)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !38, line: 93, size: 256, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !81}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !71, file: !38, line: 94, baseType: !52, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !71, file: !38, line: 94, baseType: !26, size: 8, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !71, file: !38, line: 94, baseType: !26, size: 8, offset: 72)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !71, file: !38, line: 94, baseType: !22, size: 16, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !71, file: !38, line: 94, baseType: !26, size: 8, offset: 96)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !71, file: !38, line: 94, baseType: !79, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !71, file: !38, line: 94, baseType: !18, size: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !46, file: !38, line: 371, baseType: !83, size: 384)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !38, line: 97, size: 384, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !83, file: !38, line: 98, baseType: !52, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !83, file: !38, line: 98, baseType: !26, size: 8, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !38, line: 98, baseType: !26, size: 8, offset: 72)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !83, file: !38, line: 98, baseType: !22, size: 16, offset: 80)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !83, file: !38, line: 98, baseType: !26, size: 8, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !83, file: !38, line: 98, baseType: !34, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !83, file: !38, line: 98, baseType: !18, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !83, file: !38, line: 99, baseType: !18, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !83, file: !38, line: 100, baseType: !34, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !83, file: !38, line: 101, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !97, line: 133, size: 384, elements: !98)
!97 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!98 = !{!99, !100, !101, !102, !103, !112, !113, !114, !115}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !96, file: !97, line: 134, baseType: !52, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !96, file: !97, line: 135, baseType: !26, size: 8, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !97, line: 136, baseType: !26, size: 8, offset: 72)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !97, line: 137, baseType: !22, size: 16, offset: 80)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !96, file: !97, line: 138, baseType: !104, size: 32, offset: 96)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !105, line: 327, size: 32, elements: !106)
!105 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !104, file: !105, line: 328, baseType: !18, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !104, file: !105, line: 329, baseType: !109, size: 32)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 4)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !96, file: !97, line: 139, baseType: !95, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !96, file: !97, line: 140, baseType: !95, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !96, file: !97, line: 141, baseType: !95, size: 64, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !96, file: !97, line: 142, baseType: !116, size: 16, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !17, line: 445, baseType: !22)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !46, file: !38, line: 372, baseType: !118, size: 384)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !38, line: 104, size: 384, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !128, !129, !130}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !118, file: !38, line: 105, baseType: !52, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !118, file: !38, line: 105, baseType: !26, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !38, line: 105, baseType: !26, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !118, file: !38, line: 105, baseType: !22, size: 16, offset: 80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !38, line: 105, baseType: !26, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !118, file: !38, line: 105, baseType: !95, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !118, file: !38, line: 106, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !118, file: !38, line: 107, baseType: !34, size: 64, offset: 256)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !118, file: !38, line: 108, baseType: !18, size: 32, offset: 320)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !118, file: !38, line: 109, baseType: !18, size: 32, offset: 352)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !46, file: !38, line: 373, baseType: !132, size: 192)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !38, line: 118, size: 192, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !132, file: !38, line: 119, baseType: !52, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !132, file: !38, line: 119, baseType: !26, size: 8, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !38, line: 119, baseType: !26, size: 8, offset: 72)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !132, file: !38, line: 119, baseType: !22, size: 16, offset: 80)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !38, line: 119, baseType: !26, size: 8, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !132, file: !38, line: 119, baseType: !35, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !46, file: !38, line: 374, baseType: !141, size: 448)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !38, line: 143, size: 448, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !450, !451, !452}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !141, file: !38, line: 144, baseType: !52, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !141, file: !38, line: 144, baseType: !26, size: 8, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !38, line: 144, baseType: !26, size: 8, offset: 72)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !141, file: !38, line: 144, baseType: !22, size: 16, offset: 80)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !141, file: !38, line: 144, baseType: !26, size: 8, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !141, file: !38, line: 144, baseType: !26, size: 8, offset: 104)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !141, file: !38, line: 145, baseType: !26, size: 8, offset: 112)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !141, file: !38, line: 146, baseType: !26, size: 8, offset: 120)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !141, file: !38, line: 147, baseType: !52, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !141, file: !38, line: 148, baseType: !52, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !141, file: !38, line: 149, baseType: !34, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !141, file: !38, line: 153, baseType: !155, size: 64, offset: 320)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !141, file: !38, line: 150, size: 64, elements: !156)
!156 = !{!157, !449}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !155, file: !38, line: 151, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !97, line: 248, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{!16, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !164, line: 37, size: 9024, elements: !165)
!164 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !395, !396, !397, !398, !399, !403, !405, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !432, !433, !434, !435, !436, !437, !438, !439, !441, !447}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !163, file: !164, line: 38, baseType: !162, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !163, file: !164, line: 39, baseType: !26, size: 8, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !163, file: !164, line: 40, baseType: !26, size: 8, offset: 72)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !163, file: !164, line: 41, baseType: !22, size: 16, offset: 80)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !163, file: !164, line: 42, baseType: !26, size: 8, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !163, file: !164, line: 43, baseType: !26, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !163, file: !164, line: 44, baseType: !26, size: 8, offset: 112)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !163, file: !164, line: 45, baseType: !116, size: 16, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !163, file: !164, line: 46, baseType: !26, size: 8, offset: 144)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !163, file: !164, line: 47, baseType: !26, size: 8, offset: 152)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !163, file: !164, line: 48, baseType: !26, size: 8, offset: 160)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !163, file: !164, line: 49, baseType: !26, size: 8, offset: 168)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !163, file: !164, line: 50, baseType: !26, size: 8, offset: 176)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !163, file: !164, line: 51, baseType: !26, size: 8, offset: 184)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !163, file: !164, line: 52, baseType: !26, size: 8, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !163, file: !164, line: 53, baseType: !26, size: 8, offset: 200)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !163, file: !164, line: 54, baseType: !34, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !163, file: !164, line: 55, baseType: !18, size: 32, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !163, file: !164, line: 56, baseType: !18, size: 32, offset: 352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !163, file: !164, line: 57, baseType: !18, size: 32, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !163, file: !164, line: 58, baseType: !18, size: 32, offset: 416)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !163, file: !164, line: 60, baseType: !188, size: 640, offset: 448)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !97, line: 893, size: 640, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !276, !277, !393, !394}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !188, file: !97, line: 894, baseType: !34, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !188, file: !97, line: 895, baseType: !34, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !188, file: !97, line: 896, baseType: !34, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !188, file: !97, line: 897, baseType: !34, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !188, file: !97, line: 898, baseType: !34, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !188, file: !97, line: 899, baseType: !196, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !97, line: 875, size: 1600, elements: !198)
!198 = !{!199, !219, !235}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !197, file: !97, line: 876, baseType: !200, size: 448)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !97, line: 828, size: 448, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !218}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !200, file: !97, line: 829, baseType: !196, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !200, file: !97, line: 829, baseType: !26, size: 8, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !200, file: !97, line: 829, baseType: !26, size: 8, offset: 72)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !200, file: !97, line: 829, baseType: !22, size: 16, offset: 80)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !200, file: !97, line: 829, baseType: !34, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !97, line: 829, baseType: !196, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !97, line: 829, baseType: !95, size: 64, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !97, line: 829, baseType: !210, size: 64, offset: 320)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !97, line: 716, size: 64, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !210, file: !97, line: 717, baseType: !30, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !210, file: !97, line: 718, baseType: !18, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !210, file: !97, line: 719, baseType: !79, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !210, file: !97, line: 720, baseType: !34, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !97, line: 721, baseType: !79, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !210, file: !97, line: 722, baseType: !196, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !200, file: !97, line: 829, baseType: !26, size: 8, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !197, file: !97, line: 877, baseType: !220, size: 640)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !97, line: 835, size: 640, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !220, file: !97, line: 836, baseType: !196, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !220, file: !97, line: 836, baseType: !26, size: 8, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !220, file: !97, line: 836, baseType: !26, size: 8, offset: 72)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !220, file: !97, line: 836, baseType: !22, size: 16, offset: 80)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !220, file: !97, line: 836, baseType: !34, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !97, line: 836, baseType: !196, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !97, line: 836, baseType: !95, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !220, file: !97, line: 836, baseType: !210, size: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !220, file: !97, line: 836, baseType: !26, size: 8, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !220, file: !97, line: 836, baseType: !79, size: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !220, file: !97, line: 837, baseType: !34, size: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !220, file: !97, line: 838, baseType: !18, size: 32, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !220, file: !97, line: 839, baseType: !18, size: 32, offset: 608)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !197, file: !97, line: 878, baseType: !236, size: 1600)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !97, line: 846, size: 1600, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !236, file: !97, line: 847, baseType: !196, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !236, file: !97, line: 847, baseType: !26, size: 8, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !236, file: !97, line: 847, baseType: !26, size: 8, offset: 72)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !236, file: !97, line: 847, baseType: !22, size: 16, offset: 80)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !236, file: !97, line: 847, baseType: !34, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !97, line: 847, baseType: !196, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !236, file: !97, line: 847, baseType: !95, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !236, file: !97, line: 847, baseType: !210, size: 64, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !236, file: !97, line: 847, baseType: !26, size: 8, offset: 384)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !236, file: !97, line: 847, baseType: !196, size: 64, offset: 448)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !236, file: !97, line: 848, baseType: !196, size: 64, offset: 512)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !236, file: !97, line: 849, baseType: !79, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !236, file: !97, line: 850, baseType: !26, size: 8, offset: 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !236, file: !97, line: 851, baseType: !79, size: 64, offset: 704)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !236, file: !97, line: 852, baseType: !79, size: 64, offset: 768)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !236, file: !97, line: 853, baseType: !79, size: 64, offset: 832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !236, file: !97, line: 854, baseType: !109, size: 32, offset: 896)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !236, file: !97, line: 855, baseType: !18, size: 32, offset: 928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !236, file: !97, line: 856, baseType: !18, size: 32, offset: 960)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !236, file: !97, line: 857, baseType: !18, size: 32, offset: 992)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !236, file: !97, line: 858, baseType: !18, size: 32, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !236, file: !97, line: 859, baseType: !18, size: 32, offset: 1056)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !236, file: !97, line: 860, baseType: !18, size: 32, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !236, file: !97, line: 861, baseType: !18, size: 32, offset: 1120)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !236, file: !97, line: 862, baseType: !18, size: 32, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !236, file: !97, line: 863, baseType: !18, size: 32, offset: 1184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !236, file: !97, line: 864, baseType: !18, size: 32, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !236, file: !97, line: 865, baseType: !18, size: 32, offset: 1248)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !236, file: !97, line: 866, baseType: !18, size: 32, offset: 1280)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !236, file: !97, line: 867, baseType: !18, size: 32, offset: 1312)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !236, file: !97, line: 868, baseType: !22, size: 16, offset: 1344)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !236, file: !97, line: 869, baseType: !26, size: 8, offset: 1360)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !236, file: !97, line: 870, baseType: !26, size: 8, offset: 1368)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !236, file: !97, line: 871, baseType: !26, size: 8, offset: 1376)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !236, file: !97, line: 872, baseType: !273, size: 160, offset: 1384)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 160, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 20)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !188, file: !97, line: 900, baseType: !95, size: 64, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !188, file: !97, line: 901, baseType: !278, size: 64, offset: 448)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !97, line: 663, size: 640, elements: !280)
!280 = !{!281, !289, !302, !311, !320, !333, !347, !359, !371}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !279, file: !97, line: 664, baseType: !282, size: 128)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !97, line: 567, size: 128, elements: !283)
!283 = !{!284, !285, !286, !287, !288}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !97, line: 568, baseType: !35, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !282, file: !97, line: 568, baseType: !26, size: 8, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !282, file: !97, line: 568, baseType: !26, size: 8, offset: 72)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !282, file: !97, line: 568, baseType: !22, size: 16, offset: 80)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !282, file: !97, line: 568, baseType: !22, size: 16, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !279, file: !97, line: 665, baseType: !290, size: 384)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !97, line: 593, size: 384, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !97, line: 594, baseType: !35, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !290, file: !97, line: 594, baseType: !26, size: 8, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !290, file: !97, line: 594, baseType: !26, size: 8, offset: 72)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !290, file: !97, line: 594, baseType: !22, size: 16, offset: 80)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !290, file: !97, line: 594, baseType: !22, size: 16, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !290, file: !97, line: 594, baseType: !22, size: 16, offset: 112)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !290, file: !97, line: 595, baseType: !196, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !290, file: !97, line: 596, baseType: !34, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !290, file: !97, line: 597, baseType: !34, size: 64, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !290, file: !97, line: 598, baseType: !30, size: 64, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !279, file: !97, line: 666, baseType: !303, size: 192)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !97, line: 573, size: 192, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !97, line: 574, baseType: !35, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !303, file: !97, line: 574, baseType: !26, size: 8, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !97, line: 574, baseType: !26, size: 8, offset: 72)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !303, file: !97, line: 574, baseType: !22, size: 16, offset: 80)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !303, file: !97, line: 574, baseType: !22, size: 16, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !303, file: !97, line: 574, baseType: !52, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !279, file: !97, line: 667, baseType: !312, size: 192)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !97, line: 604, size: 192, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !97, line: 605, baseType: !35, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !312, file: !97, line: 605, baseType: !26, size: 8, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !97, line: 605, baseType: !26, size: 8, offset: 72)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !97, line: 605, baseType: !22, size: 16, offset: 80)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !312, file: !97, line: 605, baseType: !22, size: 16, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !312, file: !97, line: 605, baseType: !95, size: 64, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !279, file: !97, line: 668, baseType: !321, size: 448)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !97, line: 608, size: 448, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !97, line: 609, baseType: !35, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !321, file: !97, line: 609, baseType: !26, size: 8, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !97, line: 609, baseType: !26, size: 8, offset: 72)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !321, file: !97, line: 609, baseType: !22, size: 16, offset: 80)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !321, file: !97, line: 609, baseType: !22, size: 16, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !321, file: !97, line: 609, baseType: !18, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !321, file: !97, line: 610, baseType: !196, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !321, file: !97, line: 611, baseType: !34, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !321, file: !97, line: 612, baseType: !34, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !321, file: !97, line: 613, baseType: !18, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !279, file: !97, line: 669, baseType: !334, size: 512)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !97, line: 580, size: 512, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !334, file: !97, line: 581, baseType: !35, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !334, file: !97, line: 581, baseType: !26, size: 8, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !97, line: 581, baseType: !26, size: 8, offset: 72)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !334, file: !97, line: 581, baseType: !22, size: 16, offset: 80)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !334, file: !97, line: 581, baseType: !22, size: 16, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !334, file: !97, line: 581, baseType: !18, size: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !334, file: !97, line: 582, baseType: !52, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !334, file: !97, line: 583, baseType: !52, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !334, file: !97, line: 584, baseType: !162, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !334, file: !97, line: 585, baseType: !35, size: 64, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !334, file: !97, line: 586, baseType: !18, size: 32, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !279, file: !97, line: 670, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !97, line: 620, size: 320, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !97, line: 621, baseType: !35, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !348, file: !97, line: 621, baseType: !26, size: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !348, file: !97, line: 621, baseType: !26, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !348, file: !97, line: 621, baseType: !22, size: 16, offset: 80)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !97, line: 621, baseType: !22, size: 16, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !348, file: !97, line: 621, baseType: !26, size: 8, offset: 112)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !348, file: !97, line: 622, baseType: !162, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !348, file: !97, line: 623, baseType: !52, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !348, file: !97, line: 624, baseType: !30, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !279, file: !97, line: 671, baseType: !360, size: 640)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !97, line: 631, size: 640, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !97, line: 632, baseType: !35, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !360, file: !97, line: 632, baseType: !26, size: 8, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !360, file: !97, line: 632, baseType: !26, size: 8, offset: 72)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !360, file: !97, line: 632, baseType: !22, size: 16, offset: 80)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !360, file: !97, line: 632, baseType: !22, size: 16, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !360, file: !97, line: 633, baseType: !368, size: 512, offset: 128)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 8)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !279, file: !97, line: 672, baseType: !372, size: 320)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !97, line: 654, size: 320, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !372, file: !97, line: 655, baseType: !35, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !372, file: !97, line: 655, baseType: !26, size: 8, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !97, line: 655, baseType: !26, size: 8, offset: 72)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !372, file: !97, line: 655, baseType: !22, size: 16, offset: 80)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !372, file: !97, line: 655, baseType: !22, size: 16, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !372, file: !97, line: 655, baseType: !26, size: 8, offset: 112)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !97, line: 656, baseType: !95, size: 64, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !372, file: !97, line: 657, baseType: !52, size: 64, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !372, file: !97, line: 658, baseType: !383, size: 64, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !97, line: 645, size: 128, elements: !385)
!385 = !{!386, !392}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !384, file: !97, line: 646, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !17, line: 1052, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !391, !18, !35}
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !17, line: 424, baseType: !35)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !384, file: !97, line: 647, baseType: !35, size: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !188, file: !97, line: 902, baseType: !196, size: 64, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !188, file: !97, line: 903, baseType: !18, size: 32, offset: 576)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !163, file: !164, line: 61, baseType: !18, size: 32, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !163, file: !164, line: 62, baseType: !18, size: 32, offset: 1120)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !163, file: !164, line: 63, baseType: !22, size: 16, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !163, file: !164, line: 64, baseType: !26, size: 8, offset: 1168)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !163, file: !164, line: 66, baseType: !400, size: 2688, offset: 1216)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2688, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 7)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !163, file: !164, line: 67, baseType: !404, size: 3072, offset: 3904)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 3072, elements: !369)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !163, file: !164, line: 68, baseType: !406, size: 576, offset: 6976)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 576, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 9)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !163, file: !164, line: 69, baseType: !127, size: 64, offset: 7552)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !163, file: !164, line: 71, baseType: !34, size: 64, offset: 7616)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !163, file: !164, line: 72, baseType: !127, size: 64, offset: 7680)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !163, file: !164, line: 73, baseType: !278, size: 64, offset: 7744)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !163, file: !164, line: 74, baseType: !95, size: 64, offset: 7808)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !163, file: !164, line: 75, baseType: !52, size: 64, offset: 7872)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !163, file: !164, line: 76, baseType: !95, size: 64, offset: 7936)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !163, file: !164, line: 77, baseType: !196, size: 64, offset: 8000)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !163, file: !164, line: 78, baseType: !52, size: 64, offset: 8064)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !163, file: !164, line: 79, baseType: !95, size: 64, offset: 8128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !163, file: !164, line: 80, baseType: !79, size: 64, offset: 8192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !163, file: !164, line: 81, baseType: !196, size: 64, offset: 8256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !163, file: !164, line: 82, baseType: !422, size: 64, offset: 8320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !97, line: 702, size: 128, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !424, file: !97, line: 706, baseType: !18, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !424, file: !97, line: 707, baseType: !18, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !424, file: !97, line: 708, baseType: !22, size: 16, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !424, file: !97, line: 709, baseType: !26, size: 8, offset: 80)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !424, file: !97, line: 710, baseType: !26, size: 8, offset: 88)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !97, line: 711, baseType: !26, size: 8, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !163, file: !164, line: 83, baseType: !196, size: 64, offset: 8384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !163, file: !164, line: 84, baseType: !52, size: 64, offset: 8448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !163, file: !164, line: 85, baseType: !278, size: 64, offset: 8512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !163, file: !164, line: 86, baseType: !52, size: 64, offset: 8576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !163, file: !164, line: 87, baseType: !278, size: 64, offset: 8640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !163, file: !164, line: 88, baseType: !196, size: 64, offset: 8704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !163, file: !164, line: 89, baseType: !196, size: 64, offset: 8768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !163, file: !164, line: 90, baseType: !440, size: 64, offset: 8832)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !163, file: !164, line: 91, baseType: !442, size: 64, offset: 8896)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !97, line: 637, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DISubroutineType(types: !445)
!445 = !{!16, !162, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !163, file: !164, line: 92, baseType: !448, size: 64, offset: 8960)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !97, line: 641, baseType: !159)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !155, file: !38, line: 152, baseType: !52, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !141, file: !38, line: 155, baseType: !18, size: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !141, file: !38, line: 156, baseType: !116, size: 16, offset: 416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !141, file: !38, line: 157, baseType: !26, size: 8, offset: 432)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !46, file: !38, line: 375, baseType: !454, size: 576)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !38, line: 122, size: 576, elements: !455)
!455 = !{!456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !454, file: !38, line: 123, baseType: !52, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !454, file: !38, line: 123, baseType: !26, size: 8, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !454, file: !38, line: 123, baseType: !26, size: 8, offset: 72)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !454, file: !38, line: 123, baseType: !22, size: 16, offset: 80)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !454, file: !38, line: 123, baseType: !26, size: 8, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !454, file: !38, line: 123, baseType: !26, size: 8, offset: 104)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !454, file: !38, line: 124, baseType: !22, size: 16, offset: 112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !454, file: !38, line: 125, baseType: !35, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !454, file: !38, line: 126, baseType: !30, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !454, file: !38, line: 127, baseType: !440, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !454, file: !38, line: 128, baseType: !52, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !454, file: !38, line: 129, baseType: !52, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !38, line: 130, baseType: !95, size: 64, offset: 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !454, file: !38, line: 131, baseType: !26, size: 8, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !46, file: !38, line: 376, baseType: !471, size: 448)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !38, line: 134, size: 448, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !471, file: !38, line: 135, baseType: !52, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !471, file: !38, line: 135, baseType: !26, size: 8, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, file: !38, line: 135, baseType: !26, size: 8, offset: 72)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !471, file: !38, line: 135, baseType: !22, size: 16, offset: 80)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !471, file: !38, line: 135, baseType: !26, size: 8, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !471, file: !38, line: 135, baseType: !26, size: 8, offset: 104)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !471, file: !38, line: 136, baseType: !95, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !471, file: !38, line: 137, baseType: !52, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !38, line: 138, baseType: !52, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !471, file: !38, line: 139, baseType: !29, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !471, file: !38, line: 140, baseType: !18, size: 32, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !46, file: !38, line: 377, baseType: !485, size: 320)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !38, line: 184, size: 320, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !496}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !485, file: !38, line: 185, baseType: !52, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !485, file: !38, line: 185, baseType: !26, size: 8, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !38, line: 185, baseType: !26, size: 8, offset: 72)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !485, file: !38, line: 185, baseType: !22, size: 16, offset: 80)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !38, line: 185, baseType: !26, size: 8, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !485, file: !38, line: 185, baseType: !493, size: 128, offset: 128)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 2)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !485, file: !38, line: 185, baseType: !52, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !46, file: !38, line: 378, baseType: !498, size: 384)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !38, line: 187, size: 384, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !498, file: !38, line: 188, baseType: !52, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !498, file: !38, line: 188, baseType: !26, size: 8, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !498, file: !38, line: 188, baseType: !26, size: 8, offset: 72)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !498, file: !38, line: 188, baseType: !22, size: 16, offset: 80)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !498, file: !38, line: 188, baseType: !26, size: 8, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !498, file: !38, line: 189, baseType: !493, size: 128, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !498, file: !38, line: 189, baseType: !52, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !498, file: !38, line: 189, baseType: !508, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !97, line: 480, size: 576, elements: !510)
!510 = !{!511, !512, !513, !514, !522, !537, !569, !570, !571, !572, !573, !574}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !509, file: !97, line: 481, baseType: !95, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !509, file: !97, line: 482, baseType: !508, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !97, line: 483, baseType: !508, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !509, file: !97, line: 484, baseType: !515, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !97, line: 497, size: 256, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !516, file: !97, line: 498, baseType: !515, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !97, line: 499, baseType: !515, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !516, file: !97, line: 500, baseType: !508, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !516, file: !97, line: 501, baseType: !18, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !509, file: !97, line: 485, baseType: !523, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !97, line: 466, size: 320, elements: !525)
!525 = !{!526, !531, !532, !533, !534, !535, !536}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !524, file: !97, line: 467, baseType: !527, size: 128)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !97, line: 459, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !527, file: !97, line: 460, baseType: !26, size: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !527, file: !97, line: 461, baseType: !30, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !524, file: !97, line: 468, baseType: !527, size: 128, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !524, file: !97, line: 469, baseType: !22, size: 16, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !524, file: !97, line: 470, baseType: !26, size: 8, offset: 272)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !524, file: !97, line: 471, baseType: !26, size: 8, offset: 280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !524, file: !97, line: 472, baseType: !26, size: 8, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !524, file: !97, line: 473, baseType: !26, size: 8, offset: 296)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !509, file: !97, line: 486, baseType: !538, size: 64, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !97, line: 448, size: 192, elements: !540)
!540 = !{!541, !564, !565, !566, !567, !568}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !539, file: !97, line: 449, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !97, line: 438, size: 64, elements: !543)
!543 = !{!544, !545, !558}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !542, file: !97, line: 439, baseType: !95, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !542, file: !97, line: 440, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !97, line: 419, size: 256, elements: !548)
!548 = !{!549, !554, !555, !556, !557}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !547, file: !97, line: 420, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !17, line: 1049, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!18, !391, !18, !35}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !547, file: !97, line: 421, baseType: !35, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !547, file: !97, line: 422, baseType: !95, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !547, file: !97, line: 423, baseType: !26, size: 8, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !547, file: !97, line: 424, baseType: !26, size: 8, offset: 200)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !542, file: !97, line: 441, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !97, line: 429, size: 128, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !560, file: !97, line: 430, baseType: !95, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !97, line: 431, baseType: !559, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !539, file: !97, line: 450, baseType: !523, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !539, file: !97, line: 451, baseType: !26, size: 8, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !539, file: !97, line: 452, baseType: !26, size: 8, offset: 136)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !539, file: !97, line: 453, baseType: !26, size: 8, offset: 144)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !539, file: !97, line: 454, baseType: !26, size: 8, offset: 152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !509, file: !97, line: 487, baseType: !30, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !509, file: !97, line: 488, baseType: !18, size: 32, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !509, file: !97, line: 489, baseType: !22, size: 16, offset: 480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !509, file: !97, line: 490, baseType: !22, size: 16, offset: 496)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !509, file: !97, line: 491, baseType: !26, size: 8, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !509, file: !97, line: 492, baseType: !26, size: 8, offset: 520)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !46, file: !38, line: 379, baseType: !576, size: 384)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !38, line: 192, size: 384, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !585, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !576, file: !38, line: 193, baseType: !52, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !576, file: !38, line: 193, baseType: !26, size: 8, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !576, file: !38, line: 193, baseType: !26, size: 8, offset: 72)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !576, file: !38, line: 193, baseType: !22, size: 16, offset: 80)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !576, file: !38, line: 193, baseType: !26, size: 8, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !576, file: !38, line: 193, baseType: !493, size: 128, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !576, file: !38, line: 193, baseType: !52, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !576, file: !38, line: 193, baseType: !18, size: 32, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !576, file: !38, line: 194, baseType: !18, size: 32, offset: 352)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !46, file: !38, line: 380, baseType: !588, size: 384)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !38, line: 197, size: 384, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !588, file: !38, line: 198, baseType: !52, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !588, file: !38, line: 198, baseType: !26, size: 8, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !38, line: 198, baseType: !26, size: 8, offset: 72)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !588, file: !38, line: 198, baseType: !22, size: 16, offset: 80)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !588, file: !38, line: 198, baseType: !26, size: 8, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !588, file: !38, line: 200, baseType: !26, size: 8, offset: 104)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !588, file: !38, line: 201, baseType: !26, size: 8, offset: 112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !588, file: !38, line: 202, baseType: !493, size: 128, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !588, file: !38, line: 202, baseType: !52, size: 64, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !588, file: !38, line: 202, baseType: !600, size: 64, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !17, line: 128, baseType: !30)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !46, file: !38, line: 381, baseType: !602, size: 320)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !38, line: 205, size: 320, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !602, file: !38, line: 206, baseType: !52, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !602, file: !38, line: 206, baseType: !26, size: 8, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !38, line: 206, baseType: !26, size: 8, offset: 72)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !602, file: !38, line: 206, baseType: !22, size: 16, offset: 80)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !38, line: 206, baseType: !26, size: 8, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !602, file: !38, line: 206, baseType: !493, size: 128, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !602, file: !38, line: 206, baseType: !52, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !46, file: !38, line: 382, baseType: !612, size: 384)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !38, line: 233, size: 384, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !612, file: !38, line: 234, baseType: !52, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 72)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !612, file: !38, line: 234, baseType: !22, size: 16, offset: 80)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 104)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 120)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !612, file: !38, line: 234, baseType: !95, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !612, file: !38, line: 234, baseType: !18, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !612, file: !38, line: 234, baseType: !18, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !612, file: !38, line: 234, baseType: !18, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !612, file: !38, line: 234, baseType: !26, size: 8, offset: 296)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !612, file: !38, line: 234, baseType: !52, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !46, file: !38, line: 383, baseType: !630, size: 576)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !38, line: 237, size: 576, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !630, file: !38, line: 238, baseType: !52, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 72)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !630, file: !38, line: 238, baseType: !22, size: 16, offset: 80)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 104)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 120)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !630, file: !38, line: 238, baseType: !95, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !630, file: !38, line: 238, baseType: !18, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !630, file: !38, line: 238, baseType: !18, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !630, file: !38, line: 238, baseType: !18, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !630, file: !38, line: 238, baseType: !26, size: 8, offset: 296)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !630, file: !38, line: 238, baseType: !22, size: 16, offset: 304)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !630, file: !38, line: 239, baseType: !52, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !630, file: !38, line: 240, baseType: !34, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !630, file: !38, line: 241, baseType: !22, size: 16, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !630, file: !38, line: 242, baseType: !34, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !46, file: !38, line: 384, baseType: !652, size: 384)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !38, line: 262, size: 384, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !652, file: !38, line: 263, baseType: !52, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 72)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !652, file: !38, line: 263, baseType: !22, size: 16, offset: 80)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 104)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 120)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !652, file: !38, line: 263, baseType: !95, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !652, file: !38, line: 263, baseType: !18, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !652, file: !38, line: 263, baseType: !18, size: 32, offset: 224)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !652, file: !38, line: 263, baseType: !18, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 296)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !652, file: !38, line: 263, baseType: !26, size: 8, offset: 304)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !652, file: !38, line: 264, baseType: !52, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !46, file: !38, line: 385, baseType: !671, size: 448)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !38, line: 245, size: 448, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !671, file: !38, line: 246, baseType: !52, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 72)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !671, file: !38, line: 246, baseType: !22, size: 16, offset: 80)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 104)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !671, file: !38, line: 246, baseType: !95, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !671, file: !38, line: 246, baseType: !18, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !671, file: !38, line: 246, baseType: !18, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !671, file: !38, line: 246, baseType: !18, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !671, file: !38, line: 246, baseType: !26, size: 8, offset: 296)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !671, file: !38, line: 246, baseType: !52, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !671, file: !38, line: 247, baseType: !52, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !46, file: !38, line: 386, baseType: !690, size: 448)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !38, line: 250, size: 448, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !690, file: !38, line: 251, baseType: !52, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 72)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !690, file: !38, line: 251, baseType: !22, size: 16, offset: 80)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 104)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 112)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !690, file: !38, line: 251, baseType: !95, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !690, file: !38, line: 251, baseType: !18, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !690, file: !38, line: 251, baseType: !18, size: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !690, file: !38, line: 251, baseType: !18, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !690, file: !38, line: 251, baseType: !26, size: 8, offset: 296)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !690, file: !38, line: 256, baseType: !52, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !690, file: !38, line: 257, baseType: !52, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !46, file: !38, line: 387, baseType: !709, size: 512)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !38, line: 273, size: 512, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !709, file: !38, line: 274, baseType: !52, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !709, file: !38, line: 274, baseType: !26, size: 8, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !38, line: 274, baseType: !26, size: 8, offset: 72)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !709, file: !38, line: 274, baseType: !22, size: 16, offset: 80)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !709, file: !38, line: 274, baseType: !26, size: 8, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !709, file: !38, line: 274, baseType: !95, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !709, file: !38, line: 275, baseType: !18, size: 32, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !709, file: !38, line: 276, baseType: !387, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !709, file: !38, line: 277, baseType: !35, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !38, line: 278, baseType: !493, size: 128, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !46, file: !38, line: 388, baseType: !722, size: 512)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !38, line: 281, size: 512, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !737, !738, !739, !745, !746}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !722, file: !38, line: 282, baseType: !52, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !722, file: !38, line: 282, baseType: !26, size: 8, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !722, file: !38, line: 282, baseType: !26, size: 8, offset: 72)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !722, file: !38, line: 282, baseType: !22, size: 16, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !722, file: !38, line: 282, baseType: !26, size: 8, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !722, file: !38, line: 282, baseType: !26, size: 8, offset: 104)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !722, file: !38, line: 283, baseType: !26, size: 8, offset: 112)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !722, file: !38, line: 284, baseType: !732, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !17, line: 1084, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!16, !18, !29, !18, !736, !35, !35}
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !722, file: !38, line: 285, baseType: !95, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !722, file: !38, line: 286, baseType: !35, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !722, file: !38, line: 287, baseType: !740, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !17, line: 1102, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!16, !391, !18, !35, !744}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !722, file: !38, line: 288, baseType: !52, size: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !722, file: !38, line: 289, baseType: !52, size: 64, offset: 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !46, file: !38, line: 389, baseType: !748, size: 512)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !38, line: 307, size: 512, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !748, file: !38, line: 308, baseType: !52, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !748, file: !38, line: 308, baseType: !26, size: 8, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !38, line: 308, baseType: !26, size: 8, offset: 72)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !748, file: !38, line: 308, baseType: !22, size: 16, offset: 80)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !748, file: !38, line: 308, baseType: !26, size: 8, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !748, file: !38, line: 308, baseType: !26, size: 8, offset: 104)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !748, file: !38, line: 309, baseType: !26, size: 8, offset: 112)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !748, file: !38, line: 310, baseType: !26, size: 8, offset: 120)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !748, file: !38, line: 311, baseType: !35, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !748, file: !38, line: 312, baseType: !95, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !748, file: !38, line: 313, baseType: !127, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !748, file: !38, line: 314, baseType: !34, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !748, file: !38, line: 315, baseType: !34, size: 64, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !748, file: !38, line: 316, baseType: !18, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !46, file: !38, line: 390, baseType: !765, size: 448)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !38, line: 340, size: 448, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !765, file: !38, line: 341, baseType: !52, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !765, file: !38, line: 341, baseType: !26, size: 8, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !38, line: 341, baseType: !26, size: 8, offset: 72)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !765, file: !38, line: 341, baseType: !22, size: 16, offset: 80)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !38, line: 341, baseType: !26, size: 8, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !765, file: !38, line: 341, baseType: !95, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !765, file: !38, line: 342, baseType: !95, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !765, file: !38, line: 343, baseType: !35, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !765, file: !38, line: 344, baseType: !34, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !765, file: !38, line: 345, baseType: !18, size: 32, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !38, line: 391, baseType: !778, size: 256)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !38, line: 350, size: 256, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !790}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !778, file: !38, line: 351, baseType: !52, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !778, file: !38, line: 351, baseType: !26, size: 8, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !778, file: !38, line: 351, baseType: !26, size: 8, offset: 72)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !778, file: !38, line: 351, baseType: !22, size: 16, offset: 80)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !778, file: !38, line: 351, baseType: !26, size: 8, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !778, file: !38, line: 351, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !17, line: 1055, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !391, !35}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !778, file: !38, line: 352, baseType: !35, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !46, file: !38, line: 392, baseType: !792, size: 192)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !38, line: 357, size: 192, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !792, file: !38, line: 358, baseType: !52, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !792, file: !38, line: 358, baseType: !26, size: 8, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !38, line: 358, baseType: !26, size: 8, offset: 72)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !792, file: !38, line: 358, baseType: !22, size: 16, offset: 80)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !792, file: !38, line: 358, baseType: !26, size: 8, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !38, line: 358, baseType: !52, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !46, file: !38, line: 399, baseType: !96, size: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !37, file: !38, line: 435, baseType: !96, size: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !37, file: !38, line: 436, baseType: !197, size: 1600)
!803 = !{!0}
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 72, elements: !407)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!806 = !{i32 7, !"Dwarf Version", i32 4}
!807 = !{i32 2, !"Debug Info Version", i32 3}
!808 = !{i32 1, !"wchar_size", i32 2}
!809 = !{i32 1, !"Code Model", i32 2}
!810 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!811 = distinct !DISubprogram(name: "acpi_ds_initialize_region", scope: !3, file: !3, line: 44, type: !812, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!16, !391}
!814 = !{}
!815 = !DILocalVariable(name: "obj_handle", arg: 1, scope: !811, file: !3, line: 44, type: !391)
!816 = !DILocation(line: 44, column: 51, scope: !811)
!817 = !DILocalVariable(name: "obj_desc", scope: !811, file: !3, line: 46, type: !52)
!818 = !DILocation(line: 46, column: 29, scope: !811)
!819 = !DILocalVariable(name: "status", scope: !811, file: !3, line: 47, type: !16)
!820 = !DILocation(line: 47, column: 14, scope: !811)
!821 = !DILocation(line: 49, column: 41, scope: !811)
!822 = !DILocation(line: 49, column: 13, scope: !811)
!823 = !DILocation(line: 49, column: 11, scope: !811)
!824 = !DILocation(line: 53, column: 37, scope: !811)
!825 = !DILocation(line: 53, column: 11, scope: !811)
!826 = !DILocation(line: 53, column: 9, scope: !811)
!827 = !DILocation(line: 54, column: 10, scope: !811)
!828 = !DILocation(line: 54, column: 2, scope: !811)
!829 = distinct !DISubprogram(name: "acpi_ds_eval_buffer_field_operands", scope: !3, file: !3, line: 268, type: !830, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !814)
!830 = !DISubroutineType(types: !831)
!831 = !{!16, !162, !196}
!832 = !DILocalVariable(name: "walk_state", arg: 1, scope: !829, file: !3, line: 268, type: !162)
!833 = !DILocation(line: 268, column: 60, scope: !829)
!834 = !DILocalVariable(name: "op", arg: 2, scope: !829, file: !3, line: 269, type: !196)
!835 = !DILocation(line: 269, column: 33, scope: !829)
!836 = !DILocalVariable(name: "status", scope: !829, file: !3, line: 271, type: !16)
!837 = !DILocation(line: 271, column: 14, scope: !829)
!838 = !DILocalVariable(name: "obj_desc", scope: !829, file: !3, line: 272, type: !52)
!839 = !DILocation(line: 272, column: 29, scope: !829)
!840 = !DILocalVariable(name: "node", scope: !829, file: !3, line: 273, type: !95)
!841 = !DILocation(line: 273, column: 30, scope: !829)
!842 = !DILocalVariable(name: "next_op", scope: !829, file: !3, line: 274, type: !196)
!843 = !DILocation(line: 274, column: 27, scope: !829)
!844 = !DILocation(line: 282, column: 9, scope: !829)
!845 = !DILocation(line: 282, column: 13, scope: !829)
!846 = !DILocation(line: 282, column: 20, scope: !829)
!847 = !DILocation(line: 282, column: 7, scope: !829)
!848 = !DILocation(line: 286, column: 12, scope: !829)
!849 = !DILocation(line: 286, column: 16, scope: !829)
!850 = !DILocation(line: 286, column: 23, scope: !829)
!851 = !DILocation(line: 286, column: 29, scope: !829)
!852 = !DILocation(line: 286, column: 10, scope: !829)
!853 = !DILocation(line: 290, column: 35, scope: !829)
!854 = !DILocation(line: 290, column: 47, scope: !829)
!855 = !DILocation(line: 290, column: 11, scope: !829)
!856 = !DILocation(line: 290, column: 9, scope: !829)
!857 = !DILocation(line: 291, column: 6, scope: !858)
!858 = distinct !DILexicalBlock(scope: !829, file: !3, line: 291, column: 6)
!859 = !DILocation(line: 291, column: 6, scope: !829)
!860 = !DILocation(line: 292, column: 3, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !3, line: 291, column: 28)
