; ModuleID = '../bcout/drivers/acpi/acpica/dspkginit.llvm.bc'
source_filename = "drivers/acpi/acpica/dspkginit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 19, type: !798, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !797, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/dspkginit.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 116, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!19 = !{!20, !26, !29, !33, !131, !22, !87, !118, !794, !796, !70}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !21, line: 421, baseType: !22)
!21 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !25, line: 27, baseType: !7)
!25 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !23, line: 19, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !25, line: 24, baseType: !28)
!28 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !21, line: 127, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !23, line: 23, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !25, line: 31, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !35, line: 367, size: 576, elements: !36)
!35 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !48, !61, !73, !108, !122, !132, !445, !462, !477, !490, !568, !580, !594, !604, !622, !644, !663, !682, !701, !714, !740, !757, !770, !784, !793}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !34, file: !35, line: 368, baseType: !38, size: 128)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !35, line: 73, size: 128, elements: !39)
!39 = !{!40, !41, !45, !46, !47}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !38, file: !35, line: 74, baseType: !33, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !38, file: !35, line: 74, baseType: !42, size: 8, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !23, line: 17, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !25, line: 21, baseType: !44)
!44 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !35, line: 74, baseType: !42, size: 8, offset: 72)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !38, file: !35, line: 74, baseType: !26, size: 16, offset: 80)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !38, file: !35, line: 74, baseType: !42, size: 8, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !34, file: !35, line: 369, baseType: !49, size: 192)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !35, line: 76, size: 192, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !60}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !49, file: !35, line: 77, baseType: !33, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !49, file: !35, line: 77, baseType: !42, size: 8, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !35, line: 77, baseType: !42, size: 8, offset: 72)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !49, file: !35, line: 77, baseType: !26, size: 16, offset: 80)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !35, line: 77, baseType: !42, size: 8, offset: 96)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !49, file: !35, line: 77, baseType: !57, size: 24, offset: 104)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 24, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 3)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !49, file: !35, line: 78, baseType: !30, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !34, file: !35, line: 370, baseType: !62, size: 256)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !35, line: 93, size: 256, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !62, file: !35, line: 94, baseType: !33, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !62, file: !35, line: 94, baseType: !42, size: 8, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !35, line: 94, baseType: !42, size: 8, offset: 72)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !62, file: !35, line: 94, baseType: !26, size: 16, offset: 80)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !62, file: !35, line: 94, baseType: !42, size: 8, offset: 96)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !62, file: !35, line: 94, baseType: !70, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !62, file: !35, line: 94, baseType: !22, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !34, file: !35, line: 371, baseType: !74, size: 384)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !35, line: 97, size: 384, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !83, !84, !85, !86}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !74, file: !35, line: 98, baseType: !33, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !74, file: !35, line: 98, baseType: !42, size: 8, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !35, line: 98, baseType: !42, size: 8, offset: 72)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !74, file: !35, line: 98, baseType: !26, size: 16, offset: 80)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !35, line: 98, baseType: !42, size: 8, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !74, file: !35, line: 98, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !74, file: !35, line: 98, baseType: !22, size: 32, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !74, file: !35, line: 99, baseType: !22, size: 32, offset: 224)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !74, file: !35, line: 100, baseType: !82, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !74, file: !35, line: 101, baseType: !87, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !14, line: 133, size: 384, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !103, !104, !105, !106}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !88, file: !14, line: 134, baseType: !33, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !88, file: !14, line: 135, baseType: !42, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !14, line: 136, baseType: !42, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !14, line: 137, baseType: !26, size: 16, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !88, file: !14, line: 138, baseType: !95, size: 32, offset: 96)
!95 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !96, line: 327, size: 32, elements: !97)
!96 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !95, file: !96, line: 328, baseType: !22, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !95, file: !96, line: 329, baseType: !100, size: 32)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 32, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 4)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !88, file: !14, line: 139, baseType: !87, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !88, file: !14, line: 140, baseType: !87, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !88, file: !14, line: 141, baseType: !87, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !88, file: !14, line: 142, baseType: !107, size: 16, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !21, line: 445, baseType: !26)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !34, file: !35, line: 372, baseType: !109, size: 384)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !35, line: 104, size: 384, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117, !119, !120, !121}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !109, file: !35, line: 105, baseType: !33, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !109, file: !35, line: 105, baseType: !42, size: 8, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !35, line: 105, baseType: !42, size: 8, offset: 72)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !109, file: !35, line: 105, baseType: !26, size: 16, offset: 80)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !35, line: 105, baseType: !42, size: 8, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !109, file: !35, line: 105, baseType: !87, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !109, file: !35, line: 106, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !109, file: !35, line: 107, baseType: !82, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !109, file: !35, line: 108, baseType: !22, size: 32, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !109, file: !35, line: 109, baseType: !22, size: 32, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !34, file: !35, line: 373, baseType: !123, size: 192)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !35, line: 118, size: 192, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !123, file: !35, line: 119, baseType: !33, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !123, file: !35, line: 119, baseType: !42, size: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !35, line: 119, baseType: !42, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !123, file: !35, line: 119, baseType: !26, size: 16, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !35, line: 119, baseType: !42, size: 8, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !123, file: !35, line: 119, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !34, file: !35, line: 374, baseType: !133, size: 448)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !35, line: 143, size: 448, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !442, !443, !444}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !133, file: !35, line: 144, baseType: !33, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !133, file: !35, line: 144, baseType: !42, size: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !35, line: 144, baseType: !42, size: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !133, file: !35, line: 144, baseType: !26, size: 16, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !35, line: 144, baseType: !42, size: 8, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !133, file: !35, line: 144, baseType: !42, size: 8, offset: 104)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !133, file: !35, line: 145, baseType: !42, size: 8, offset: 112)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !133, file: !35, line: 146, baseType: !42, size: 8, offset: 120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !133, file: !35, line: 147, baseType: !33, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !133, file: !35, line: 148, baseType: !33, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !133, file: !35, line: 149, baseType: !82, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !133, file: !35, line: 153, baseType: !147, size: 64, offset: 320)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !133, file: !35, line: 150, size: 64, elements: !148)
!148 = !{!149, !441}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !147, file: !35, line: 151, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !14, line: 248, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!20, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !156, line: 37, size: 9024, elements: !157)
!156 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !387, !388, !389, !390, !391, !395, !397, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !424, !425, !426, !427, !428, !429, !430, !431, !433, !439}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !156, line: 38, baseType: !154, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !155, file: !156, line: 39, baseType: !42, size: 8, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !155, file: !156, line: 40, baseType: !42, size: 8, offset: 72)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !155, file: !156, line: 41, baseType: !26, size: 16, offset: 80)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !155, file: !156, line: 42, baseType: !42, size: 8, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !155, file: !156, line: 43, baseType: !42, size: 8, offset: 104)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !155, file: !156, line: 44, baseType: !42, size: 8, offset: 112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !155, file: !156, line: 45, baseType: !107, size: 16, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !155, file: !156, line: 46, baseType: !42, size: 8, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !155, file: !156, line: 47, baseType: !42, size: 8, offset: 152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !155, file: !156, line: 48, baseType: !42, size: 8, offset: 160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !155, file: !156, line: 49, baseType: !42, size: 8, offset: 168)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !155, file: !156, line: 50, baseType: !42, size: 8, offset: 176)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !155, file: !156, line: 51, baseType: !42, size: 8, offset: 184)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !155, file: !156, line: 52, baseType: !42, size: 8, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !155, file: !156, line: 53, baseType: !42, size: 8, offset: 200)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !155, file: !156, line: 54, baseType: !82, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !155, file: !156, line: 55, baseType: !22, size: 32, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !155, file: !156, line: 56, baseType: !22, size: 32, offset: 352)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !155, file: !156, line: 57, baseType: !22, size: 32, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !155, file: !156, line: 58, baseType: !22, size: 32, offset: 416)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !155, file: !156, line: 60, baseType: !180, size: 640, offset: 448)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !14, line: 893, size: 640, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !268, !269, !385, !386}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !180, file: !14, line: 894, baseType: !82, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !180, file: !14, line: 895, baseType: !82, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !180, file: !14, line: 896, baseType: !82, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !180, file: !14, line: 897, baseType: !82, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !180, file: !14, line: 898, baseType: !82, size: 64, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !180, file: !14, line: 899, baseType: !188, size: 64, offset: 320)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !14, line: 875, size: 1600, elements: !190)
!190 = !{!191, !211, !227}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !189, file: !14, line: 876, baseType: !192, size: 448)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !14, line: 828, size: 448, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !210}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !192, file: !14, line: 829, baseType: !188, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !192, file: !14, line: 829, baseType: !42, size: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !14, line: 829, baseType: !42, size: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !192, file: !14, line: 829, baseType: !26, size: 16, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !192, file: !14, line: 829, baseType: !82, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !14, line: 829, baseType: !188, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !192, file: !14, line: 829, baseType: !87, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !192, file: !14, line: 829, baseType: !202, size: 64, offset: 320)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !14, line: 716, size: 64, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !202, file: !14, line: 717, baseType: !30, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !202, file: !14, line: 718, baseType: !22, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !202, file: !14, line: 719, baseType: !70, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !202, file: !14, line: 720, baseType: !82, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !14, line: 721, baseType: !70, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !202, file: !14, line: 722, baseType: !188, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !192, file: !14, line: 829, baseType: !42, size: 8, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !189, file: !14, line: 877, baseType: !212, size: 640)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !14, line: 835, size: 640, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !212, file: !14, line: 836, baseType: !188, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !212, file: !14, line: 836, baseType: !42, size: 8, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !212, file: !14, line: 836, baseType: !42, size: 8, offset: 72)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !212, file: !14, line: 836, baseType: !26, size: 16, offset: 80)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !212, file: !14, line: 836, baseType: !82, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !212, file: !14, line: 836, baseType: !188, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !212, file: !14, line: 836, baseType: !87, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !14, line: 836, baseType: !202, size: 64, offset: 320)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !212, file: !14, line: 836, baseType: !42, size: 8, offset: 384)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !212, file: !14, line: 836, baseType: !70, size: 64, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !212, file: !14, line: 837, baseType: !82, size: 64, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !212, file: !14, line: 838, baseType: !22, size: 32, offset: 576)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !14, line: 839, baseType: !22, size: 32, offset: 608)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !189, file: !14, line: 878, baseType: !228, size: 1600)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !14, line: 846, size: 1600, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !228, file: !14, line: 847, baseType: !188, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !228, file: !14, line: 847, baseType: !42, size: 8, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !228, file: !14, line: 847, baseType: !42, size: 8, offset: 72)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !228, file: !14, line: 847, baseType: !26, size: 16, offset: 80)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !228, file: !14, line: 847, baseType: !82, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !14, line: 847, baseType: !188, size: 64, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !228, file: !14, line: 847, baseType: !87, size: 64, offset: 256)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !228, file: !14, line: 847, baseType: !202, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !228, file: !14, line: 847, baseType: !42, size: 8, offset: 384)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !228, file: !14, line: 847, baseType: !188, size: 64, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !228, file: !14, line: 848, baseType: !188, size: 64, offset: 512)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !228, file: !14, line: 849, baseType: !70, size: 64, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !228, file: !14, line: 850, baseType: !42, size: 8, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !228, file: !14, line: 851, baseType: !70, size: 64, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !228, file: !14, line: 852, baseType: !70, size: 64, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !228, file: !14, line: 853, baseType: !70, size: 64, offset: 832)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !228, file: !14, line: 854, baseType: !100, size: 32, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !228, file: !14, line: 855, baseType: !22, size: 32, offset: 928)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !228, file: !14, line: 856, baseType: !22, size: 32, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !228, file: !14, line: 857, baseType: !22, size: 32, offset: 992)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !228, file: !14, line: 858, baseType: !22, size: 32, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !228, file: !14, line: 859, baseType: !22, size: 32, offset: 1056)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !228, file: !14, line: 860, baseType: !22, size: 32, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !228, file: !14, line: 861, baseType: !22, size: 32, offset: 1120)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !228, file: !14, line: 862, baseType: !22, size: 32, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !228, file: !14, line: 863, baseType: !22, size: 32, offset: 1184)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !228, file: !14, line: 864, baseType: !22, size: 32, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !228, file: !14, line: 865, baseType: !22, size: 32, offset: 1248)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !228, file: !14, line: 866, baseType: !22, size: 32, offset: 1280)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !228, file: !14, line: 867, baseType: !22, size: 32, offset: 1312)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !228, file: !14, line: 868, baseType: !26, size: 16, offset: 1344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !228, file: !14, line: 869, baseType: !42, size: 8, offset: 1360)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !228, file: !14, line: 870, baseType: !42, size: 8, offset: 1368)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !228, file: !14, line: 871, baseType: !42, size: 8, offset: 1376)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !228, file: !14, line: 872, baseType: !265, size: 160, offset: 1384)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 160, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 20)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !180, file: !14, line: 900, baseType: !87, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !180, file: !14, line: 901, baseType: !270, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !14, line: 663, size: 640, elements: !272)
!272 = !{!273, !281, !294, !303, !312, !325, !339, !351, !363}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !271, file: !14, line: 664, baseType: !274, size: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !14, line: 567, size: 128, elements: !275)
!275 = !{!276, !277, !278, !279, !280}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !14, line: 568, baseType: !131, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !274, file: !14, line: 568, baseType: !42, size: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !14, line: 568, baseType: !42, size: 8, offset: 72)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !274, file: !14, line: 568, baseType: !26, size: 16, offset: 80)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !14, line: 568, baseType: !26, size: 16, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !271, file: !14, line: 665, baseType: !282, size: 384)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !14, line: 593, size: 384, elements: !283)
!283 = !{!284, !285, !286, !287, !288, !289, !290, !291, !292, !293}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !282, file: !14, line: 594, baseType: !131, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !282, file: !14, line: 594, baseType: !42, size: 8, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !282, file: !14, line: 594, baseType: !42, size: 8, offset: 72)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !282, file: !14, line: 594, baseType: !26, size: 16, offset: 80)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !282, file: !14, line: 594, baseType: !26, size: 16, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !282, file: !14, line: 594, baseType: !26, size: 16, offset: 112)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !282, file: !14, line: 595, baseType: !188, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !282, file: !14, line: 596, baseType: !82, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !282, file: !14, line: 597, baseType: !82, size: 64, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !282, file: !14, line: 598, baseType: !30, size: 64, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !271, file: !14, line: 666, baseType: !295, size: 192)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !14, line: 573, size: 192, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !14, line: 574, baseType: !131, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !295, file: !14, line: 574, baseType: !42, size: 8, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !14, line: 574, baseType: !42, size: 8, offset: 72)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !14, line: 574, baseType: !26, size: 16, offset: 80)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !295, file: !14, line: 574, baseType: !26, size: 16, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !295, file: !14, line: 574, baseType: !33, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !271, file: !14, line: 667, baseType: !304, size: 192)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !14, line: 604, size: 192, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !14, line: 605, baseType: !131, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !304, file: !14, line: 605, baseType: !42, size: 8, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !304, file: !14, line: 605, baseType: !42, size: 8, offset: 72)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !304, file: !14, line: 605, baseType: !26, size: 16, offset: 80)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !304, file: !14, line: 605, baseType: !26, size: 16, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !304, file: !14, line: 605, baseType: !87, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !271, file: !14, line: 668, baseType: !313, size: 448)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !14, line: 608, size: 448, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !14, line: 609, baseType: !131, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !313, file: !14, line: 609, baseType: !42, size: 8, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !313, file: !14, line: 609, baseType: !42, size: 8, offset: 72)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !313, file: !14, line: 609, baseType: !26, size: 16, offset: 80)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !14, line: 609, baseType: !26, size: 16, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !313, file: !14, line: 609, baseType: !22, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !313, file: !14, line: 610, baseType: !188, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !313, file: !14, line: 611, baseType: !82, size: 64, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !313, file: !14, line: 612, baseType: !82, size: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !313, file: !14, line: 613, baseType: !22, size: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !271, file: !14, line: 669, baseType: !326, size: 512)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !14, line: 580, size: 512, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !14, line: 581, baseType: !131, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !326, file: !14, line: 581, baseType: !42, size: 8, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !14, line: 581, baseType: !42, size: 8, offset: 72)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !326, file: !14, line: 581, baseType: !26, size: 16, offset: 80)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !326, file: !14, line: 581, baseType: !26, size: 16, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !326, file: !14, line: 581, baseType: !22, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !326, file: !14, line: 582, baseType: !33, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !326, file: !14, line: 583, baseType: !33, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !326, file: !14, line: 584, baseType: !154, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !326, file: !14, line: 585, baseType: !131, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !326, file: !14, line: 586, baseType: !22, size: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !271, file: !14, line: 670, baseType: !340, size: 320)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !14, line: 620, size: 320, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !340, file: !14, line: 621, baseType: !131, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !340, file: !14, line: 621, baseType: !42, size: 8, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !14, line: 621, baseType: !42, size: 8, offset: 72)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !340, file: !14, line: 621, baseType: !26, size: 16, offset: 80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !340, file: !14, line: 621, baseType: !26, size: 16, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !340, file: !14, line: 621, baseType: !42, size: 8, offset: 112)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !340, file: !14, line: 622, baseType: !154, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !340, file: !14, line: 623, baseType: !33, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !340, file: !14, line: 624, baseType: !30, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !271, file: !14, line: 671, baseType: !352, size: 640)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !14, line: 631, size: 640, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !14, line: 632, baseType: !131, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !352, file: !14, line: 632, baseType: !42, size: 8, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !352, file: !14, line: 632, baseType: !42, size: 8, offset: 72)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !352, file: !14, line: 632, baseType: !26, size: 16, offset: 80)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !14, line: 632, baseType: !26, size: 16, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !352, file: !14, line: 633, baseType: !360, size: 512, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !271, file: !14, line: 672, baseType: !364, size: 320)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !14, line: 654, size: 320, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !14, line: 655, baseType: !131, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !364, file: !14, line: 655, baseType: !42, size: 8, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !364, file: !14, line: 655, baseType: !42, size: 8, offset: 72)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !364, file: !14, line: 655, baseType: !26, size: 16, offset: 80)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !364, file: !14, line: 655, baseType: !26, size: 16, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !364, file: !14, line: 655, baseType: !42, size: 8, offset: 112)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !364, file: !14, line: 656, baseType: !87, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !364, file: !14, line: 657, baseType: !33, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !364, file: !14, line: 658, baseType: !375, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !14, line: 645, size: 128, elements: !377)
!377 = !{!378, !384}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !376, file: !14, line: 646, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !21, line: 1052, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383, !22, !131}
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !21, line: 424, baseType: !131)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !376, file: !14, line: 647, baseType: !131, size: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !180, file: !14, line: 902, baseType: !188, size: 64, offset: 512)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !180, file: !14, line: 903, baseType: !22, size: 32, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !155, file: !156, line: 61, baseType: !22, size: 32, offset: 1088)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !155, file: !156, line: 62, baseType: !22, size: 32, offset: 1120)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !155, file: !156, line: 63, baseType: !26, size: 16, offset: 1152)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !155, file: !156, line: 64, baseType: !42, size: 8, offset: 1168)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !155, file: !156, line: 66, baseType: !392, size: 2688, offset: 1216)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2688, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 7)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !155, file: !156, line: 67, baseType: !396, size: 3072, offset: 3904)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 3072, elements: !361)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !155, file: !156, line: 68, baseType: !398, size: 576, offset: 6976)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 576, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 9)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !155, file: !156, line: 69, baseType: !118, size: 64, offset: 7552)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !155, file: !156, line: 71, baseType: !82, size: 64, offset: 7616)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !155, file: !156, line: 72, baseType: !118, size: 64, offset: 7680)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !155, file: !156, line: 73, baseType: !270, size: 64, offset: 7744)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !155, file: !156, line: 74, baseType: !87, size: 64, offset: 7808)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !155, file: !156, line: 75, baseType: !33, size: 64, offset: 7872)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !155, file: !156, line: 76, baseType: !87, size: 64, offset: 7936)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !155, file: !156, line: 77, baseType: !188, size: 64, offset: 8000)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !155, file: !156, line: 78, baseType: !33, size: 64, offset: 8064)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !155, file: !156, line: 79, baseType: !87, size: 64, offset: 8128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !155, file: !156, line: 80, baseType: !70, size: 64, offset: 8192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !155, file: !156, line: 81, baseType: !188, size: 64, offset: 8256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !155, file: !156, line: 82, baseType: !414, size: 64, offset: 8320)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !14, line: 702, size: 128, elements: !417)
!417 = !{!418, !419, !420, !421, !422, !423}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !416, file: !14, line: 706, baseType: !22, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !416, file: !14, line: 707, baseType: !22, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !416, file: !14, line: 708, baseType: !26, size: 16, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !416, file: !14, line: 709, baseType: !42, size: 8, offset: 80)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !416, file: !14, line: 710, baseType: !42, size: 8, offset: 88)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !416, file: !14, line: 711, baseType: !42, size: 8, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !155, file: !156, line: 83, baseType: !188, size: 64, offset: 8384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !155, file: !156, line: 84, baseType: !33, size: 64, offset: 8448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !155, file: !156, line: 85, baseType: !270, size: 64, offset: 8512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !155, file: !156, line: 86, baseType: !33, size: 64, offset: 8576)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !155, file: !156, line: 87, baseType: !270, size: 64, offset: 8640)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !155, file: !156, line: 88, baseType: !188, size: 64, offset: 8704)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !155, file: !156, line: 89, baseType: !188, size: 64, offset: 8768)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !155, file: !156, line: 90, baseType: !432, size: 64, offset: 8832)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !155, file: !156, line: 91, baseType: !434, size: 64, offset: 8896)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !14, line: 637, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!20, !154, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !155, file: !156, line: 92, baseType: !440, size: 64, offset: 8960)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !14, line: 641, baseType: !151)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !147, file: !35, line: 152, baseType: !33, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !133, file: !35, line: 155, baseType: !22, size: 32, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !133, file: !35, line: 156, baseType: !107, size: 16, offset: 416)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !133, file: !35, line: 157, baseType: !42, size: 8, offset: 432)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !34, file: !35, line: 375, baseType: !446, size: 576)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !35, line: 122, size: 576, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !446, file: !35, line: 123, baseType: !33, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !446, file: !35, line: 123, baseType: !42, size: 8, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !35, line: 123, baseType: !42, size: 8, offset: 72)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !446, file: !35, line: 123, baseType: !26, size: 16, offset: 80)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !446, file: !35, line: 123, baseType: !42, size: 8, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !446, file: !35, line: 123, baseType: !42, size: 8, offset: 104)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !446, file: !35, line: 124, baseType: !26, size: 16, offset: 112)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !446, file: !35, line: 125, baseType: !131, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !446, file: !35, line: 126, baseType: !30, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !446, file: !35, line: 127, baseType: !432, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !446, file: !35, line: 128, baseType: !33, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !35, line: 129, baseType: !33, size: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !446, file: !35, line: 130, baseType: !87, size: 64, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !446, file: !35, line: 131, baseType: !42, size: 8, offset: 512)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !34, file: !35, line: 376, baseType: !463, size: 448)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !35, line: 134, size: 448, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !463, file: !35, line: 135, baseType: !33, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !463, file: !35, line: 135, baseType: !42, size: 8, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !35, line: 135, baseType: !42, size: 8, offset: 72)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !463, file: !35, line: 135, baseType: !26, size: 16, offset: 80)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !463, file: !35, line: 135, baseType: !42, size: 8, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !463, file: !35, line: 135, baseType: !42, size: 8, offset: 104)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !463, file: !35, line: 136, baseType: !87, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !463, file: !35, line: 137, baseType: !33, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !35, line: 138, baseType: !33, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !463, file: !35, line: 139, baseType: !475, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !21, line: 129, baseType: !30)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !463, file: !35, line: 140, baseType: !22, size: 32, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !34, file: !35, line: 377, baseType: !478, size: 320)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !35, line: 184, size: 320, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !489}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !478, file: !35, line: 185, baseType: !33, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !478, file: !35, line: 185, baseType: !42, size: 8, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !35, line: 185, baseType: !42, size: 8, offset: 72)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !478, file: !35, line: 185, baseType: !26, size: 16, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !35, line: 185, baseType: !42, size: 8, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !478, file: !35, line: 185, baseType: !486, size: 128, offset: 128)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 2)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !478, file: !35, line: 185, baseType: !33, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !34, file: !35, line: 378, baseType: !491, size: 384)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !35, line: 187, size: 384, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !491, file: !35, line: 188, baseType: !33, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !491, file: !35, line: 188, baseType: !42, size: 8, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !35, line: 188, baseType: !42, size: 8, offset: 72)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !491, file: !35, line: 188, baseType: !26, size: 16, offset: 80)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !491, file: !35, line: 188, baseType: !42, size: 8, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !491, file: !35, line: 189, baseType: !486, size: 128, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !491, file: !35, line: 189, baseType: !33, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !491, file: !35, line: 189, baseType: !501, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !14, line: 480, size: 576, elements: !503)
!503 = !{!504, !505, !506, !507, !515, !530, !562, !563, !564, !565, !566, !567}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !502, file: !14, line: 481, baseType: !87, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !502, file: !14, line: 482, baseType: !501, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !14, line: 483, baseType: !501, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !502, file: !14, line: 484, baseType: !508, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !14, line: 497, size: 256, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !509, file: !14, line: 498, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !14, line: 499, baseType: !508, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !509, file: !14, line: 500, baseType: !501, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !509, file: !14, line: 501, baseType: !22, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !502, file: !14, line: 485, baseType: !516, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !14, line: 466, size: 320, elements: !518)
!518 = !{!519, !524, !525, !526, !527, !528, !529}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !517, file: !14, line: 467, baseType: !520, size: 128)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !14, line: 459, size: 128, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !520, file: !14, line: 460, baseType: !42, size: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !520, file: !14, line: 461, baseType: !30, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !517, file: !14, line: 468, baseType: !520, size: 128, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !517, file: !14, line: 469, baseType: !26, size: 16, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !517, file: !14, line: 470, baseType: !42, size: 8, offset: 272)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !517, file: !14, line: 471, baseType: !42, size: 8, offset: 280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !517, file: !14, line: 472, baseType: !42, size: 8, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !517, file: !14, line: 473, baseType: !42, size: 8, offset: 296)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !502, file: !14, line: 486, baseType: !531, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !14, line: 448, size: 192, elements: !533)
!533 = !{!534, !557, !558, !559, !560, !561}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !532, file: !14, line: 449, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !14, line: 438, size: 64, elements: !536)
!536 = !{!537, !538, !551}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !535, file: !14, line: 439, baseType: !87, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !535, file: !14, line: 440, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !14, line: 419, size: 256, elements: !541)
!541 = !{!542, !547, !548, !549, !550}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !540, file: !14, line: 420, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !21, line: 1049, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!22, !383, !22, !131}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !540, file: !14, line: 421, baseType: !131, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !540, file: !14, line: 422, baseType: !87, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !540, file: !14, line: 423, baseType: !42, size: 8, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !540, file: !14, line: 424, baseType: !42, size: 8, offset: 200)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !535, file: !14, line: 441, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !14, line: 429, size: 128, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !553, file: !14, line: 430, baseType: !87, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !14, line: 431, baseType: !552, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !532, file: !14, line: 450, baseType: !516, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !532, file: !14, line: 451, baseType: !42, size: 8, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !532, file: !14, line: 452, baseType: !42, size: 8, offset: 136)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !532, file: !14, line: 453, baseType: !42, size: 8, offset: 144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !532, file: !14, line: 454, baseType: !42, size: 8, offset: 152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !502, file: !14, line: 487, baseType: !30, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !502, file: !14, line: 488, baseType: !22, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !502, file: !14, line: 489, baseType: !26, size: 16, offset: 480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !502, file: !14, line: 490, baseType: !26, size: 16, offset: 496)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !502, file: !14, line: 491, baseType: !42, size: 8, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !502, file: !14, line: 492, baseType: !42, size: 8, offset: 520)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !34, file: !35, line: 379, baseType: !569, size: 384)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !35, line: 192, size: 384, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !569, file: !35, line: 193, baseType: !33, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !569, file: !35, line: 193, baseType: !42, size: 8, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !35, line: 193, baseType: !42, size: 8, offset: 72)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !569, file: !35, line: 193, baseType: !26, size: 16, offset: 80)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !35, line: 193, baseType: !42, size: 8, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !569, file: !35, line: 193, baseType: !486, size: 128, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !569, file: !35, line: 193, baseType: !33, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !569, file: !35, line: 193, baseType: !22, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !569, file: !35, line: 194, baseType: !22, size: 32, offset: 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !34, file: !35, line: 380, baseType: !581, size: 384)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !35, line: 197, size: 384, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !581, file: !35, line: 198, baseType: !33, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !581, file: !35, line: 198, baseType: !42, size: 8, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !35, line: 198, baseType: !42, size: 8, offset: 72)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !581, file: !35, line: 198, baseType: !26, size: 16, offset: 80)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !581, file: !35, line: 198, baseType: !42, size: 8, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !581, file: !35, line: 200, baseType: !42, size: 8, offset: 104)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !581, file: !35, line: 201, baseType: !42, size: 8, offset: 112)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !581, file: !35, line: 202, baseType: !486, size: 128, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !581, file: !35, line: 202, baseType: !33, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !581, file: !35, line: 202, baseType: !593, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !21, line: 128, baseType: !30)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !34, file: !35, line: 381, baseType: !595, size: 320)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !35, line: 205, size: 320, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !595, file: !35, line: 206, baseType: !33, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !595, file: !35, line: 206, baseType: !42, size: 8, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !35, line: 206, baseType: !42, size: 8, offset: 72)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !595, file: !35, line: 206, baseType: !26, size: 16, offset: 80)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !595, file: !35, line: 206, baseType: !42, size: 8, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !595, file: !35, line: 206, baseType: !486, size: 128, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !595, file: !35, line: 206, baseType: !33, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !34, file: !35, line: 382, baseType: !605, size: 384)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !35, line: 233, size: 384, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !605, file: !35, line: 234, baseType: !33, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 72)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !605, file: !35, line: 234, baseType: !26, size: 16, offset: 80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 104)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 120)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !605, file: !35, line: 234, baseType: !87, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !605, file: !35, line: 234, baseType: !22, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !605, file: !35, line: 234, baseType: !22, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !605, file: !35, line: 234, baseType: !22, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !605, file: !35, line: 234, baseType: !42, size: 8, offset: 296)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !605, file: !35, line: 234, baseType: !33, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !34, file: !35, line: 383, baseType: !623, size: 576)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !35, line: 237, size: 576, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !623, file: !35, line: 238, baseType: !33, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 72)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !623, file: !35, line: 238, baseType: !26, size: 16, offset: 80)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 104)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 112)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 120)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !35, line: 238, baseType: !87, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !623, file: !35, line: 238, baseType: !22, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !623, file: !35, line: 238, baseType: !22, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !623, file: !35, line: 238, baseType: !22, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !623, file: !35, line: 238, baseType: !42, size: 8, offset: 296)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !623, file: !35, line: 238, baseType: !26, size: 16, offset: 304)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !623, file: !35, line: 239, baseType: !33, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !623, file: !35, line: 240, baseType: !82, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !623, file: !35, line: 241, baseType: !26, size: 16, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !623, file: !35, line: 242, baseType: !82, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !34, file: !35, line: 384, baseType: !645, size: 384)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !35, line: 262, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !645, file: !35, line: 263, baseType: !33, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !645, file: !35, line: 263, baseType: !26, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 104)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 112)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 120)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !645, file: !35, line: 263, baseType: !87, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !645, file: !35, line: 263, baseType: !22, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !645, file: !35, line: 263, baseType: !22, size: 32, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !35, line: 263, baseType: !22, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 296)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !645, file: !35, line: 263, baseType: !42, size: 8, offset: 304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !645, file: !35, line: 264, baseType: !33, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !34, file: !35, line: 385, baseType: !664, size: 448)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !35, line: 245, size: 448, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !664, file: !35, line: 246, baseType: !33, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 72)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !664, file: !35, line: 246, baseType: !26, size: 16, offset: 80)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 104)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 120)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !664, file: !35, line: 246, baseType: !87, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !664, file: !35, line: 246, baseType: !22, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !664, file: !35, line: 246, baseType: !22, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !664, file: !35, line: 246, baseType: !22, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !664, file: !35, line: 246, baseType: !42, size: 8, offset: 296)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !664, file: !35, line: 246, baseType: !33, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !664, file: !35, line: 247, baseType: !33, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !34, file: !35, line: 386, baseType: !683, size: 448)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !35, line: 250, size: 448, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !683, file: !35, line: 251, baseType: !33, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 72)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !683, file: !35, line: 251, baseType: !26, size: 16, offset: 80)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 104)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 120)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !683, file: !35, line: 251, baseType: !87, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !683, file: !35, line: 251, baseType: !22, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !683, file: !35, line: 251, baseType: !22, size: 32, offset: 224)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !683, file: !35, line: 251, baseType: !22, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !683, file: !35, line: 251, baseType: !42, size: 8, offset: 296)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !683, file: !35, line: 256, baseType: !33, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !683, file: !35, line: 257, baseType: !33, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !34, file: !35, line: 387, baseType: !702, size: 512)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !35, line: 273, size: 512, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !702, file: !35, line: 274, baseType: !33, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !702, file: !35, line: 274, baseType: !42, size: 8, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !35, line: 274, baseType: !42, size: 8, offset: 72)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !702, file: !35, line: 274, baseType: !26, size: 16, offset: 80)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !702, file: !35, line: 274, baseType: !42, size: 8, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !702, file: !35, line: 274, baseType: !87, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !702, file: !35, line: 275, baseType: !22, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !702, file: !35, line: 276, baseType: !379, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !702, file: !35, line: 277, baseType: !131, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !702, file: !35, line: 278, baseType: !486, size: 128, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !34, file: !35, line: 388, baseType: !715, size: 512)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !35, line: 281, size: 512, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !730, !731, !732, !738, !739}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !715, file: !35, line: 282, baseType: !33, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !35, line: 282, baseType: !42, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !35, line: 282, baseType: !42, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !715, file: !35, line: 282, baseType: !26, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !35, line: 282, baseType: !42, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !715, file: !35, line: 282, baseType: !42, size: 8, offset: 104)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !715, file: !35, line: 283, baseType: !42, size: 8, offset: 112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !715, file: !35, line: 284, baseType: !725, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !21, line: 1084, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!20, !22, !475, !22, !729, !131, !131}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !35, line: 285, baseType: !87, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !715, file: !35, line: 286, baseType: !131, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !715, file: !35, line: 287, baseType: !733, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !21, line: 1102, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!20, !383, !22, !131, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !715, file: !35, line: 288, baseType: !33, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !35, line: 289, baseType: !33, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !34, file: !35, line: 389, baseType: !741, size: 512)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !35, line: 307, size: 512, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !741, file: !35, line: 308, baseType: !33, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !741, file: !35, line: 308, baseType: !42, size: 8, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !35, line: 308, baseType: !42, size: 8, offset: 72)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !741, file: !35, line: 308, baseType: !26, size: 16, offset: 80)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !741, file: !35, line: 308, baseType: !42, size: 8, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !741, file: !35, line: 308, baseType: !42, size: 8, offset: 104)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !741, file: !35, line: 309, baseType: !42, size: 8, offset: 112)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !741, file: !35, line: 310, baseType: !42, size: 8, offset: 120)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !741, file: !35, line: 311, baseType: !131, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !741, file: !35, line: 312, baseType: !87, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !741, file: !35, line: 313, baseType: !118, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !741, file: !35, line: 314, baseType: !82, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !741, file: !35, line: 315, baseType: !82, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !741, file: !35, line: 316, baseType: !22, size: 32, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !34, file: !35, line: 390, baseType: !758, size: 448)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !35, line: 340, size: 448, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !758, file: !35, line: 341, baseType: !33, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !758, file: !35, line: 341, baseType: !42, size: 8, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !35, line: 341, baseType: !42, size: 8, offset: 72)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !758, file: !35, line: 341, baseType: !26, size: 16, offset: 80)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !758, file: !35, line: 341, baseType: !42, size: 8, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !758, file: !35, line: 341, baseType: !87, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !758, file: !35, line: 342, baseType: !87, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !758, file: !35, line: 343, baseType: !131, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !758, file: !35, line: 344, baseType: !82, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !758, file: !35, line: 345, baseType: !22, size: 32, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !35, line: 391, baseType: !771, size: 256)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !35, line: 350, size: 256, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !783}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !771, file: !35, line: 351, baseType: !33, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !771, file: !35, line: 351, baseType: !42, size: 8, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !35, line: 351, baseType: !42, size: 8, offset: 72)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !771, file: !35, line: 351, baseType: !26, size: 16, offset: 80)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !771, file: !35, line: 351, baseType: !42, size: 8, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !771, file: !35, line: 351, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !21, line: 1055, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !383, !131}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !771, file: !35, line: 352, baseType: !131, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !34, file: !35, line: 392, baseType: !785, size: 192)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !35, line: 357, size: 192, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !785, file: !35, line: 358, baseType: !33, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !785, file: !35, line: 358, baseType: !42, size: 8, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !35, line: 358, baseType: !42, size: 8, offset: 72)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !785, file: !35, line: 358, baseType: !26, size: 16, offset: 80)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !785, file: !35, line: 358, baseType: !42, size: 8, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !35, line: 358, baseType: !33, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !34, file: !35, line: 399, baseType: !88, size: 384)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !795, line: 148, baseType: !7)
!795 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!796 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!797 = !{!0}
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !799, size: 80, elements: !800)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!800 = !{!801}
!801 = !DISubrange(count: 10)
!802 = !{!"rsp"}
!803 = !{i32 7, !"Dwarf Version", i32 4}
!804 = !{i32 2, !"Debug Info Version", i32 3}
!805 = !{i32 1, !"wchar_size", i32 2}
!806 = !{i32 1, !"Code Model", i32 2}
!807 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!808 = distinct !DISubprogram(name: "acpi_ds_build_internal_package_obj", scope: !3, file: !3, line: 55, type: !809, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !811)
!809 = !DISubroutineType(types: !810)
!810 = !{!20, !154, !188, !22, !118}
!811 = !{}
!812 = !DILocalVariable(name: "walk_state", arg: 1, scope: !808, file: !3, line: 55, type: !154)
!813 = !DILocation(line: 55, column: 60, scope: !808)
!814 = !DILocalVariable(name: "op", arg: 2, scope: !808, file: !3, line: 56, type: !188)
!815 = !DILocation(line: 56, column: 33, scope: !808)
!816 = !DILocalVariable(name: "element_count", arg: 3, scope: !808, file: !3, line: 57, type: !22)
!817 = !DILocation(line: 57, column: 12, scope: !808)
!818 = !DILocalVariable(name: "obj_desc_ptr", arg: 4, scope: !808, file: !3, line: 58, type: !118)
!819 = !DILocation(line: 58, column: 36, scope: !808)
!820 = !DILocalVariable(name: "arg", scope: !808, file: !3, line: 60, type: !188)
!821 = !DILocation(line: 60, column: 27, scope: !808)
!822 = !DILocalVariable(name: "parent", scope: !808, file: !3, line: 61, type: !188)
!823 = !DILocation(line: 61, column: 27, scope: !808)
!824 = !DILocalVariable(name: "obj_desc", scope: !808, file: !3, line: 62, type: !33)
!825 = !DILocation(line: 62, column: 29, scope: !808)
!826 = !DILocalVariable(name: "status", scope: !808, file: !3, line: 63, type: !20)
!827 = !DILocation(line: 63, column: 14, scope: !808)
!828 = !DILocalVariable(name: "module_level_code", scope: !808, file: !3, line: 64, type: !42)
!829 = !DILocation(line: 64, column: 5, scope: !808)
!830 = !DILocalVariable(name: "reference_count", scope: !808, file: !3, line: 65, type: !26)
!831 = !DILocation(line: 65, column: 6, scope: !808)
!832 = !DILocalVariable(name: "index", scope: !808, file: !3, line: 66, type: !22)
!833 = !DILocation(line: 66, column: 6, scope: !808)
!834 = !DILocalVariable(name: "i", scope: !808, file: !3, line: 67, type: !22)
!835 = !DILocation(line: 67, column: 6, scope: !808)
!836 = !DILocation(line: 73, column: 6, scope: !837)
!837 = distinct !DILexicalBlock(scope: !808, file: !3, line: 73, column: 6)
!838 = !DILocation(line: 73, column: 18, scope: !837)
!839 = !DILocation(line: 73, column: 30, scope: !837)
!840 = !DILocation(line: 73, column: 6, scope: !808)
!841 = !DILocation(line: 74, column: 21, scope: !842)
!842 = distinct !DILexicalBlock(scope: !837, file: !3, line: 73, column: 57)
!843 = !DILocation(line: 75, column: 2, scope: !842)
!844 = !DILocation(line: 79, column: 11, scope: !808)
!845 = !DILocation(line: 79, column: 15, scope: !808)
!846 = !DILocation(line: 79, column: 22, scope: !808)
!847 = !DILocation(line: 79, column: 9, scope: !808)
!848 = !DILocation(line: 80, column: 2, scope: !808)
!849 = !DILocation(line: 80, column: 10, scope: !808)
!850 = !DILocation(line: 80, column: 18, scope: !808)
!851 = !DILocation(line: 80, column: 25, scope: !808)
!852 = !DILocation(line: 80, column: 36, scope: !808)
