; ModuleID = '../bcout/drivers/acpi/acpica/dsutils.llvm.bc'
source_filename = "drivers/acpi/acpica/dsutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 18, type: !788, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !787, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/dsutils.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !{!13, !18, !20, !22, !123, !786, !31}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !14, line: 19, baseType: !15)
!14 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !16, line: 24, baseType: !17)
!16 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !19, line: 421, baseType: !20)
!19 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !14, line: 21, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !16, line: 27, baseType: !7)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !24, line: 367, size: 576, elements: !25)
!24 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !37, !53, !65, !100, !114, !124, !437, !454, !469, !482, !560, !572, !586, !596, !614, !636, !655, !674, !693, !706, !732, !749, !762, !776, !785}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !23, file: !24, line: 368, baseType: !27, size: 128)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !24, line: 73, size: 128, elements: !28)
!28 = !{!29, !30, !34, !35, !36}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !27, file: !24, line: 74, baseType: !22, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !27, file: !24, line: 74, baseType: !31, size: 8, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !14, line: 17, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !16, line: 21, baseType: !33)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !24, line: 74, baseType: !31, size: 8, offset: 72)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !27, file: !24, line: 74, baseType: !13, size: 16, offset: 80)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !24, line: 74, baseType: !31, size: 8, offset: 96)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !23, file: !24, line: 369, baseType: !38, size: 192)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !24, line: 76, size: 192, elements: !39)
!39 = !{!40, !41, !42, !43, !44, !45, !49}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !38, file: !24, line: 77, baseType: !22, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !38, file: !24, line: 77, baseType: !31, size: 8, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !24, line: 77, baseType: !31, size: 8, offset: 72)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !38, file: !24, line: 77, baseType: !13, size: 16, offset: 80)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !38, file: !24, line: 77, baseType: !31, size: 8, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !38, file: !24, line: 77, baseType: !46, size: 24, offset: 104)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 3)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !38, file: !24, line: 78, baseType: !50, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !14, line: 23, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !16, line: 31, baseType: !52)
!52 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !23, file: !24, line: 370, baseType: !54, size: 256)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !24, line: 93, size: 256, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !64}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !54, file: !24, line: 94, baseType: !22, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !54, file: !24, line: 94, baseType: !31, size: 8, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !24, line: 94, baseType: !31, size: 8, offset: 72)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !54, file: !24, line: 94, baseType: !13, size: 16, offset: 80)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !54, file: !24, line: 94, baseType: !31, size: 8, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !54, file: !24, line: 94, baseType: !62, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !54, file: !24, line: 94, baseType: !20, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !23, file: !24, line: 371, baseType: !66, size: 384)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !24, line: 97, size: 384, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !75, !76, !77, !78}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !66, file: !24, line: 98, baseType: !22, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !66, file: !24, line: 98, baseType: !31, size: 8, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !24, line: 98, baseType: !31, size: 8, offset: 72)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !66, file: !24, line: 98, baseType: !13, size: 16, offset: 80)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !24, line: 98, baseType: !31, size: 8, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !66, file: !24, line: 98, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !66, file: !24, line: 98, baseType: !20, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !66, file: !24, line: 99, baseType: !20, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !66, file: !24, line: 100, baseType: !74, size: 64, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !66, file: !24, line: 101, baseType: !79, size: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !95, !96, !97, !98}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !80, file: !6, line: 134, baseType: !22, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !80, file: !6, line: 135, baseType: !31, size: 8, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !6, line: 136, baseType: !31, size: 8, offset: 72)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !80, file: !6, line: 137, baseType: !13, size: 16, offset: 80)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !80, file: !6, line: 138, baseType: !87, size: 32, offset: 96)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !88, line: 327, size: 32, elements: !89)
!88 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !87, file: !88, line: 328, baseType: !20, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !87, file: !88, line: 329, baseType: !92, size: 32)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 4)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !80, file: !6, line: 139, baseType: !79, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !80, file: !6, line: 140, baseType: !79, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !80, file: !6, line: 141, baseType: !79, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !80, file: !6, line: 142, baseType: !99, size: 16, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !19, line: 445, baseType: !13)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !23, file: !24, line: 372, baseType: !101, size: 384)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !24, line: 104, size: 384, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !111, !112, !113}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !101, file: !24, line: 105, baseType: !22, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !101, file: !24, line: 105, baseType: !31, size: 8, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !24, line: 105, baseType: !31, size: 8, offset: 72)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !101, file: !24, line: 105, baseType: !13, size: 16, offset: 80)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !24, line: 105, baseType: !31, size: 8, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !101, file: !24, line: 105, baseType: !79, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !101, file: !24, line: 106, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !101, file: !24, line: 107, baseType: !74, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !101, file: !24, line: 108, baseType: !20, size: 32, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !101, file: !24, line: 109, baseType: !20, size: 32, offset: 352)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !23, file: !24, line: 373, baseType: !115, size: 192)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !24, line: 118, size: 192, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !115, file: !24, line: 119, baseType: !22, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !115, file: !24, line: 119, baseType: !31, size: 8, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !24, line: 119, baseType: !31, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !115, file: !24, line: 119, baseType: !13, size: 16, offset: 80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !24, line: 119, baseType: !31, size: 8, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !115, file: !24, line: 119, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !23, file: !24, line: 374, baseType: !125, size: 448)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !24, line: 143, size: 448, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !434, !435, !436}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !125, file: !24, line: 144, baseType: !22, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !125, file: !24, line: 144, baseType: !31, size: 8, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !24, line: 144, baseType: !31, size: 8, offset: 72)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !125, file: !24, line: 144, baseType: !13, size: 16, offset: 80)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !24, line: 144, baseType: !31, size: 8, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !125, file: !24, line: 144, baseType: !31, size: 8, offset: 104)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !125, file: !24, line: 145, baseType: !31, size: 8, offset: 112)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !125, file: !24, line: 146, baseType: !31, size: 8, offset: 120)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !125, file: !24, line: 147, baseType: !22, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !125, file: !24, line: 148, baseType: !22, size: 64, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !125, file: !24, line: 149, baseType: !74, size: 64, offset: 256)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !125, file: !24, line: 153, baseType: !139, size: 64, offset: 320)
!139 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !125, file: !24, line: 150, size: 64, elements: !140)
!140 = !{!141, !433}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !139, file: !24, line: 151, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!18, !146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !148, line: 37, size: 9024, elements: !149)
!148 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !379, !380, !381, !382, !383, !387, !389, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !416, !417, !418, !419, !420, !421, !422, !423, !425, !431}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !148, line: 38, baseType: !146, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !147, file: !148, line: 39, baseType: !31, size: 8, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !147, file: !148, line: 40, baseType: !31, size: 8, offset: 72)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !147, file: !148, line: 41, baseType: !13, size: 16, offset: 80)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !147, file: !148, line: 42, baseType: !31, size: 8, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !147, file: !148, line: 43, baseType: !31, size: 8, offset: 104)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !147, file: !148, line: 44, baseType: !31, size: 8, offset: 112)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !147, file: !148, line: 45, baseType: !99, size: 16, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !147, file: !148, line: 46, baseType: !31, size: 8, offset: 144)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !147, file: !148, line: 47, baseType: !31, size: 8, offset: 152)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !147, file: !148, line: 48, baseType: !31, size: 8, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !147, file: !148, line: 49, baseType: !31, size: 8, offset: 168)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !147, file: !148, line: 50, baseType: !31, size: 8, offset: 176)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !147, file: !148, line: 51, baseType: !31, size: 8, offset: 184)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !147, file: !148, line: 52, baseType: !31, size: 8, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !147, file: !148, line: 53, baseType: !31, size: 8, offset: 200)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !147, file: !148, line: 54, baseType: !74, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !147, file: !148, line: 55, baseType: !20, size: 32, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !147, file: !148, line: 56, baseType: !20, size: 32, offset: 352)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !147, file: !148, line: 57, baseType: !20, size: 32, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !147, file: !148, line: 58, baseType: !20, size: 32, offset: 416)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !147, file: !148, line: 60, baseType: !172, size: 640, offset: 448)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !260, !261, !377, !378}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !172, file: !6, line: 894, baseType: !74, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !172, file: !6, line: 895, baseType: !74, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !172, file: !6, line: 896, baseType: !74, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !172, file: !6, line: 897, baseType: !74, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !172, file: !6, line: 898, baseType: !74, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !172, file: !6, line: 899, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !182)
!182 = !{!183, !203, !219}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !181, file: !6, line: 876, baseType: !184, size: 448)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193, !202}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !6, line: 829, baseType: !180, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !184, file: !6, line: 829, baseType: !31, size: 8, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !184, file: !6, line: 829, baseType: !31, size: 8, offset: 72)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !184, file: !6, line: 829, baseType: !13, size: 16, offset: 80)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !184, file: !6, line: 829, baseType: !74, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !6, line: 829, baseType: !180, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !184, file: !6, line: 829, baseType: !79, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !184, file: !6, line: 829, baseType: !194, size: 64, offset: 320)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !194, file: !6, line: 717, baseType: !50, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !194, file: !6, line: 718, baseType: !20, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !194, file: !6, line: 719, baseType: !62, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !194, file: !6, line: 720, baseType: !74, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !6, line: 721, baseType: !62, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !194, file: !6, line: 722, baseType: !180, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !184, file: !6, line: 829, baseType: !31, size: 8, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !181, file: !6, line: 877, baseType: !204, size: 640)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !204, file: !6, line: 836, baseType: !180, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !204, file: !6, line: 836, baseType: !31, size: 8, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !6, line: 836, baseType: !31, size: 8, offset: 72)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !204, file: !6, line: 836, baseType: !13, size: 16, offset: 80)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !204, file: !6, line: 836, baseType: !74, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !6, line: 836, baseType: !180, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !204, file: !6, line: 836, baseType: !79, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !204, file: !6, line: 836, baseType: !194, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !204, file: !6, line: 836, baseType: !31, size: 8, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !204, file: !6, line: 836, baseType: !62, size: 64, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !204, file: !6, line: 837, baseType: !74, size: 64, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !204, file: !6, line: 838, baseType: !20, size: 32, offset: 576)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !6, line: 839, baseType: !20, size: 32, offset: 608)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !181, file: !6, line: 878, baseType: !220, size: 1600)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !220, file: !6, line: 847, baseType: !180, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !220, file: !6, line: 847, baseType: !31, size: 8, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !220, file: !6, line: 847, baseType: !31, size: 8, offset: 72)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !220, file: !6, line: 847, baseType: !13, size: 16, offset: 80)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !220, file: !6, line: 847, baseType: !74, size: 64, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !6, line: 847, baseType: !180, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !6, line: 847, baseType: !79, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !220, file: !6, line: 847, baseType: !194, size: 64, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !220, file: !6, line: 847, baseType: !31, size: 8, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !220, file: !6, line: 847, baseType: !180, size: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !220, file: !6, line: 848, baseType: !180, size: 64, offset: 512)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !220, file: !6, line: 849, baseType: !62, size: 64, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !220, file: !6, line: 850, baseType: !31, size: 8, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !220, file: !6, line: 851, baseType: !62, size: 64, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !220, file: !6, line: 852, baseType: !62, size: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !220, file: !6, line: 853, baseType: !62, size: 64, offset: 832)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !220, file: !6, line: 854, baseType: !92, size: 32, offset: 896)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !220, file: !6, line: 855, baseType: !20, size: 32, offset: 928)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !220, file: !6, line: 856, baseType: !20, size: 32, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !220, file: !6, line: 857, baseType: !20, size: 32, offset: 992)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !220, file: !6, line: 858, baseType: !20, size: 32, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !220, file: !6, line: 859, baseType: !20, size: 32, offset: 1056)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !220, file: !6, line: 860, baseType: !20, size: 32, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !220, file: !6, line: 861, baseType: !20, size: 32, offset: 1120)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !220, file: !6, line: 862, baseType: !20, size: 32, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !220, file: !6, line: 863, baseType: !20, size: 32, offset: 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !220, file: !6, line: 864, baseType: !20, size: 32, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !220, file: !6, line: 865, baseType: !20, size: 32, offset: 1248)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !220, file: !6, line: 866, baseType: !20, size: 32, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !220, file: !6, line: 867, baseType: !20, size: 32, offset: 1312)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !220, file: !6, line: 868, baseType: !13, size: 16, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !220, file: !6, line: 869, baseType: !31, size: 8, offset: 1360)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !220, file: !6, line: 870, baseType: !31, size: 8, offset: 1368)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !220, file: !6, line: 871, baseType: !31, size: 8, offset: 1376)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !220, file: !6, line: 872, baseType: !257, size: 160, offset: 1384)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 160, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 20)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !172, file: !6, line: 900, baseType: !79, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !172, file: !6, line: 901, baseType: !262, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !264)
!264 = !{!265, !273, !286, !295, !304, !317, !331, !343, !355}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !263, file: !6, line: 664, baseType: !266, size: 128)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !267)
!267 = !{!268, !269, !270, !271, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !6, line: 568, baseType: !123, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !266, file: !6, line: 568, baseType: !31, size: 8, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !6, line: 568, baseType: !31, size: 8, offset: 72)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !266, file: !6, line: 568, baseType: !13, size: 16, offset: 80)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !6, line: 568, baseType: !13, size: 16, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !263, file: !6, line: 665, baseType: !274, size: 384)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !6, line: 594, baseType: !123, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !274, file: !6, line: 594, baseType: !31, size: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !6, line: 594, baseType: !31, size: 8, offset: 72)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !274, file: !6, line: 594, baseType: !13, size: 16, offset: 80)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !6, line: 594, baseType: !13, size: 16, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !274, file: !6, line: 594, baseType: !13, size: 16, offset: 112)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !274, file: !6, line: 595, baseType: !180, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !274, file: !6, line: 596, baseType: !74, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !274, file: !6, line: 597, baseType: !74, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !274, file: !6, line: 598, baseType: !50, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !263, file: !6, line: 666, baseType: !287, size: 192)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !6, line: 574, baseType: !123, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !6, line: 574, baseType: !31, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !6, line: 574, baseType: !31, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !6, line: 574, baseType: !13, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !6, line: 574, baseType: !13, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !287, file: !6, line: 574, baseType: !22, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !263, file: !6, line: 667, baseType: !296, size: 192)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !6, line: 605, baseType: !123, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !296, file: !6, line: 605, baseType: !31, size: 8, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !6, line: 605, baseType: !31, size: 8, offset: 72)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !6, line: 605, baseType: !13, size: 16, offset: 80)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !6, line: 605, baseType: !13, size: 16, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !296, file: !6, line: 605, baseType: !79, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !263, file: !6, line: 668, baseType: !305, size: 448)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !6, line: 609, baseType: !123, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !305, file: !6, line: 609, baseType: !31, size: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !6, line: 609, baseType: !31, size: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !6, line: 609, baseType: !13, size: 16, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !305, file: !6, line: 609, baseType: !13, size: 16, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !305, file: !6, line: 609, baseType: !20, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !305, file: !6, line: 610, baseType: !180, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !305, file: !6, line: 611, baseType: !74, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !305, file: !6, line: 612, baseType: !74, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !305, file: !6, line: 613, baseType: !20, size: 32, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !263, file: !6, line: 669, baseType: !318, size: 512)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !6, line: 581, baseType: !123, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !318, file: !6, line: 581, baseType: !31, size: 8, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !6, line: 581, baseType: !31, size: 8, offset: 72)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !6, line: 581, baseType: !13, size: 16, offset: 80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !6, line: 581, baseType: !13, size: 16, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !318, file: !6, line: 581, baseType: !20, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !318, file: !6, line: 582, baseType: !22, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !318, file: !6, line: 583, baseType: !22, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !318, file: !6, line: 584, baseType: !146, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !318, file: !6, line: 585, baseType: !123, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !318, file: !6, line: 586, baseType: !20, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !263, file: !6, line: 670, baseType: !332, size: 320)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !6, line: 621, baseType: !123, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !332, file: !6, line: 621, baseType: !31, size: 8, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !332, file: !6, line: 621, baseType: !31, size: 8, offset: 72)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !6, line: 621, baseType: !13, size: 16, offset: 80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !6, line: 621, baseType: !13, size: 16, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !332, file: !6, line: 621, baseType: !31, size: 8, offset: 112)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !332, file: !6, line: 622, baseType: !146, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !332, file: !6, line: 623, baseType: !22, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !332, file: !6, line: 624, baseType: !50, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !263, file: !6, line: 671, baseType: !344, size: 640)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !6, line: 632, baseType: !123, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !344, file: !6, line: 632, baseType: !31, size: 8, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !6, line: 632, baseType: !31, size: 8, offset: 72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !344, file: !6, line: 632, baseType: !13, size: 16, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !6, line: 632, baseType: !13, size: 16, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !344, file: !6, line: 633, baseType: !352, size: 512, offset: 128)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 512, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !263, file: !6, line: 672, baseType: !356, size: 320)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !6, line: 655, baseType: !123, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !356, file: !6, line: 655, baseType: !31, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !6, line: 655, baseType: !31, size: 8, offset: 72)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !356, file: !6, line: 655, baseType: !13, size: 16, offset: 80)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !6, line: 655, baseType: !13, size: 16, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !356, file: !6, line: 655, baseType: !31, size: 8, offset: 112)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !356, file: !6, line: 656, baseType: !79, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !356, file: !6, line: 657, baseType: !22, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !356, file: !6, line: 658, baseType: !367, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !368, file: !6, line: 646, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !19, line: 1052, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375, !20, !123}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !19, line: 424, baseType: !123)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !368, file: !6, line: 647, baseType: !123, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !172, file: !6, line: 902, baseType: !180, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !172, file: !6, line: 903, baseType: !20, size: 32, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !147, file: !148, line: 61, baseType: !20, size: 32, offset: 1088)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !147, file: !148, line: 62, baseType: !20, size: 32, offset: 1120)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !147, file: !148, line: 63, baseType: !13, size: 16, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !147, file: !148, line: 64, baseType: !31, size: 8, offset: 1168)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !147, file: !148, line: 66, baseType: !384, size: 2688, offset: 1216)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 2688, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 7)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !147, file: !148, line: 67, baseType: !388, size: 3072, offset: 3904)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 3072, elements: !353)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !147, file: !148, line: 68, baseType: !390, size: 576, offset: 6976)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 576, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 9)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !147, file: !148, line: 69, baseType: !110, size: 64, offset: 7552)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !147, file: !148, line: 71, baseType: !74, size: 64, offset: 7616)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !147, file: !148, line: 72, baseType: !110, size: 64, offset: 7680)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !147, file: !148, line: 73, baseType: !262, size: 64, offset: 7744)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !147, file: !148, line: 74, baseType: !79, size: 64, offset: 7808)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !147, file: !148, line: 75, baseType: !22, size: 64, offset: 7872)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !147, file: !148, line: 76, baseType: !79, size: 64, offset: 7936)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !147, file: !148, line: 77, baseType: !180, size: 64, offset: 8000)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !147, file: !148, line: 78, baseType: !22, size: 64, offset: 8064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !147, file: !148, line: 79, baseType: !79, size: 64, offset: 8128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !147, file: !148, line: 80, baseType: !62, size: 64, offset: 8192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !147, file: !148, line: 81, baseType: !180, size: 64, offset: 8256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !147, file: !148, line: 82, baseType: !406, size: 64, offset: 8320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !408, file: !6, line: 706, baseType: !20, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !408, file: !6, line: 707, baseType: !20, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !6, line: 708, baseType: !13, size: 16, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !408, file: !6, line: 709, baseType: !31, size: 8, offset: 80)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !408, file: !6, line: 710, baseType: !31, size: 8, offset: 88)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !6, line: 711, baseType: !31, size: 8, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !147, file: !148, line: 83, baseType: !180, size: 64, offset: 8384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !147, file: !148, line: 84, baseType: !22, size: 64, offset: 8448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !147, file: !148, line: 85, baseType: !262, size: 64, offset: 8512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !147, file: !148, line: 86, baseType: !22, size: 64, offset: 8576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !147, file: !148, line: 87, baseType: !262, size: 64, offset: 8640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !147, file: !148, line: 88, baseType: !180, size: 64, offset: 8704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !147, file: !148, line: 89, baseType: !180, size: 64, offset: 8768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !147, file: !148, line: 90, baseType: !424, size: 64, offset: 8832)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !147, file: !148, line: 91, baseType: !426, size: 64, offset: 8896)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!18, !146, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !147, file: !148, line: 92, baseType: !432, size: 64, offset: 8960)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !143)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !139, file: !24, line: 152, baseType: !22, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !125, file: !24, line: 155, baseType: !20, size: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !125, file: !24, line: 156, baseType: !99, size: 16, offset: 416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !125, file: !24, line: 157, baseType: !31, size: 8, offset: 432)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !23, file: !24, line: 375, baseType: !438, size: 576)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !24, line: 122, size: 576, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !438, file: !24, line: 123, baseType: !22, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !438, file: !24, line: 123, baseType: !31, size: 8, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !438, file: !24, line: 123, baseType: !31, size: 8, offset: 72)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !438, file: !24, line: 123, baseType: !13, size: 16, offset: 80)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !438, file: !24, line: 123, baseType: !31, size: 8, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !438, file: !24, line: 123, baseType: !31, size: 8, offset: 104)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !438, file: !24, line: 124, baseType: !13, size: 16, offset: 112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !438, file: !24, line: 125, baseType: !123, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !438, file: !24, line: 126, baseType: !50, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !438, file: !24, line: 127, baseType: !424, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !24, line: 128, baseType: !22, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !24, line: 129, baseType: !22, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !438, file: !24, line: 130, baseType: !79, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !438, file: !24, line: 131, baseType: !31, size: 8, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !23, file: !24, line: 376, baseType: !455, size: 448)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !24, line: 134, size: 448, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !468}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !455, file: !24, line: 135, baseType: !22, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !455, file: !24, line: 135, baseType: !31, size: 8, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !24, line: 135, baseType: !31, size: 8, offset: 72)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !455, file: !24, line: 135, baseType: !13, size: 16, offset: 80)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !24, line: 135, baseType: !31, size: 8, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !455, file: !24, line: 135, baseType: !31, size: 8, offset: 104)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !455, file: !24, line: 136, baseType: !79, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !455, file: !24, line: 137, baseType: !22, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !24, line: 138, baseType: !22, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !455, file: !24, line: 139, baseType: !467, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !19, line: 129, baseType: !50)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !455, file: !24, line: 140, baseType: !20, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !23, file: !24, line: 377, baseType: !470, size: 320)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !24, line: 184, size: 320, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !470, file: !24, line: 185, baseType: !22, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !470, file: !24, line: 185, baseType: !31, size: 8, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !470, file: !24, line: 185, baseType: !31, size: 8, offset: 72)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !470, file: !24, line: 185, baseType: !13, size: 16, offset: 80)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !24, line: 185, baseType: !31, size: 8, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !470, file: !24, line: 185, baseType: !478, size: 128, offset: 128)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 2)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !470, file: !24, line: 185, baseType: !22, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !23, file: !24, line: 378, baseType: !483, size: 384)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !24, line: 187, size: 384, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !483, file: !24, line: 188, baseType: !22, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !483, file: !24, line: 188, baseType: !31, size: 8, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !24, line: 188, baseType: !31, size: 8, offset: 72)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !483, file: !24, line: 188, baseType: !13, size: 16, offset: 80)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !24, line: 188, baseType: !31, size: 8, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !483, file: !24, line: 189, baseType: !478, size: 128, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !483, file: !24, line: 189, baseType: !22, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !483, file: !24, line: 189, baseType: !493, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !495)
!495 = !{!496, !497, !498, !499, !507, !522, !554, !555, !556, !557, !558, !559}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !494, file: !6, line: 481, baseType: !79, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !494, file: !6, line: 482, baseType: !493, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !6, line: 483, baseType: !493, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !494, file: !6, line: 484, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !501, file: !6, line: 498, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !6, line: 499, baseType: !500, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !501, file: !6, line: 500, baseType: !493, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !501, file: !6, line: 501, baseType: !20, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !494, file: !6, line: 485, baseType: !508, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !510)
!510 = !{!511, !516, !517, !518, !519, !520, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !509, file: !6, line: 467, baseType: !512, size: 128)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !512, file: !6, line: 460, baseType: !31, size: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !512, file: !6, line: 461, baseType: !50, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !509, file: !6, line: 468, baseType: !512, size: 128, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !509, file: !6, line: 469, baseType: !13, size: 16, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !509, file: !6, line: 470, baseType: !31, size: 8, offset: 272)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !509, file: !6, line: 471, baseType: !31, size: 8, offset: 280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !509, file: !6, line: 472, baseType: !31, size: 8, offset: 288)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !509, file: !6, line: 473, baseType: !31, size: 8, offset: 296)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !494, file: !6, line: 486, baseType: !523, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !525)
!525 = !{!526, !549, !550, !551, !552, !553}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !524, file: !6, line: 449, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !528)
!528 = !{!529, !530, !543}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !527, file: !6, line: 439, baseType: !79, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !527, file: !6, line: 440, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !533)
!533 = !{!534, !539, !540, !541, !542}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !532, file: !6, line: 420, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !19, line: 1049, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!20, !375, !20, !123}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !532, file: !6, line: 421, baseType: !123, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !532, file: !6, line: 422, baseType: !79, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !532, file: !6, line: 423, baseType: !31, size: 8, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !532, file: !6, line: 424, baseType: !31, size: 8, offset: 200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !527, file: !6, line: 441, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !545, file: !6, line: 430, baseType: !79, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !6, line: 431, baseType: !544, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !524, file: !6, line: 450, baseType: !508, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !524, file: !6, line: 451, baseType: !31, size: 8, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !524, file: !6, line: 452, baseType: !31, size: 8, offset: 136)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !524, file: !6, line: 453, baseType: !31, size: 8, offset: 144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !524, file: !6, line: 454, baseType: !31, size: 8, offset: 152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !494, file: !6, line: 487, baseType: !50, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !494, file: !6, line: 488, baseType: !20, size: 32, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !494, file: !6, line: 489, baseType: !13, size: 16, offset: 480)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !494, file: !6, line: 490, baseType: !13, size: 16, offset: 496)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !494, file: !6, line: 491, baseType: !31, size: 8, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !494, file: !6, line: 492, baseType: !31, size: 8, offset: 520)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !23, file: !24, line: 379, baseType: !561, size: 384)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !24, line: 192, size: 384, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !561, file: !24, line: 193, baseType: !22, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !561, file: !24, line: 193, baseType: !31, size: 8, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !561, file: !24, line: 193, baseType: !31, size: 8, offset: 72)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !561, file: !24, line: 193, baseType: !13, size: 16, offset: 80)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !24, line: 193, baseType: !31, size: 8, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !561, file: !24, line: 193, baseType: !478, size: 128, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !561, file: !24, line: 193, baseType: !22, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !561, file: !24, line: 193, baseType: !20, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !561, file: !24, line: 194, baseType: !20, size: 32, offset: 352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !23, file: !24, line: 380, baseType: !573, size: 384)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !24, line: 197, size: 384, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !573, file: !24, line: 198, baseType: !22, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !573, file: !24, line: 198, baseType: !31, size: 8, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !24, line: 198, baseType: !31, size: 8, offset: 72)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !573, file: !24, line: 198, baseType: !13, size: 16, offset: 80)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !573, file: !24, line: 198, baseType: !31, size: 8, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !573, file: !24, line: 200, baseType: !31, size: 8, offset: 104)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !573, file: !24, line: 201, baseType: !31, size: 8, offset: 112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !573, file: !24, line: 202, baseType: !478, size: 128, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !573, file: !24, line: 202, baseType: !22, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !573, file: !24, line: 202, baseType: !585, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !19, line: 128, baseType: !50)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !23, file: !24, line: 381, baseType: !587, size: 320)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !24, line: 205, size: 320, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !587, file: !24, line: 206, baseType: !22, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !587, file: !24, line: 206, baseType: !31, size: 8, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !24, line: 206, baseType: !31, size: 8, offset: 72)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !587, file: !24, line: 206, baseType: !13, size: 16, offset: 80)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !24, line: 206, baseType: !31, size: 8, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !587, file: !24, line: 206, baseType: !478, size: 128, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !587, file: !24, line: 206, baseType: !22, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !23, file: !24, line: 382, baseType: !597, size: 384)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !24, line: 233, size: 384, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !597, file: !24, line: 234, baseType: !22, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 72)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !597, file: !24, line: 234, baseType: !13, size: 16, offset: 80)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 104)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 112)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 120)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !597, file: !24, line: 234, baseType: !79, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !597, file: !24, line: 234, baseType: !20, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !597, file: !24, line: 234, baseType: !20, size: 32, offset: 224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !597, file: !24, line: 234, baseType: !20, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !597, file: !24, line: 234, baseType: !31, size: 8, offset: 296)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !597, file: !24, line: 234, baseType: !22, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !23, file: !24, line: 383, baseType: !615, size: 576)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !24, line: 237, size: 576, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !615, file: !24, line: 238, baseType: !22, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 72)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !615, file: !24, line: 238, baseType: !13, size: 16, offset: 80)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 104)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 112)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 120)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !615, file: !24, line: 238, baseType: !79, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !615, file: !24, line: 238, baseType: !20, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !615, file: !24, line: 238, baseType: !20, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !615, file: !24, line: 238, baseType: !20, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !615, file: !24, line: 238, baseType: !31, size: 8, offset: 296)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !615, file: !24, line: 238, baseType: !13, size: 16, offset: 304)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !615, file: !24, line: 239, baseType: !22, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !615, file: !24, line: 240, baseType: !74, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !615, file: !24, line: 241, baseType: !13, size: 16, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !615, file: !24, line: 242, baseType: !74, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !23, file: !24, line: 384, baseType: !637, size: 384)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !24, line: 262, size: 384, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !637, file: !24, line: 263, baseType: !22, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 72)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !637, file: !24, line: 263, baseType: !13, size: 16, offset: 80)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 104)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 120)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !637, file: !24, line: 263, baseType: !79, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !637, file: !24, line: 263, baseType: !20, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !637, file: !24, line: 263, baseType: !20, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !637, file: !24, line: 263, baseType: !20, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 296)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !637, file: !24, line: 263, baseType: !31, size: 8, offset: 304)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !637, file: !24, line: 264, baseType: !22, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !23, file: !24, line: 385, baseType: !656, size: 448)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !24, line: 245, size: 448, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !656, file: !24, line: 246, baseType: !22, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 72)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !656, file: !24, line: 246, baseType: !13, size: 16, offset: 80)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 104)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 120)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !656, file: !24, line: 246, baseType: !79, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !656, file: !24, line: 246, baseType: !20, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !656, file: !24, line: 246, baseType: !20, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !24, line: 246, baseType: !20, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !656, file: !24, line: 246, baseType: !31, size: 8, offset: 296)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !656, file: !24, line: 246, baseType: !22, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !656, file: !24, line: 247, baseType: !22, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !23, file: !24, line: 386, baseType: !675, size: 448)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !24, line: 250, size: 448, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !675, file: !24, line: 251, baseType: !22, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 72)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !675, file: !24, line: 251, baseType: !13, size: 16, offset: 80)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 104)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 120)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !675, file: !24, line: 251, baseType: !79, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !675, file: !24, line: 251, baseType: !20, size: 32, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !675, file: !24, line: 251, baseType: !20, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !675, file: !24, line: 251, baseType: !20, size: 32, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !675, file: !24, line: 251, baseType: !31, size: 8, offset: 296)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !675, file: !24, line: 256, baseType: !22, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !675, file: !24, line: 257, baseType: !22, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !23, file: !24, line: 387, baseType: !694, size: 512)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !24, line: 273, size: 512, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !694, file: !24, line: 274, baseType: !22, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !694, file: !24, line: 274, baseType: !31, size: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !24, line: 274, baseType: !31, size: 8, offset: 72)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !694, file: !24, line: 274, baseType: !13, size: 16, offset: 80)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !24, line: 274, baseType: !31, size: 8, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !694, file: !24, line: 274, baseType: !79, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !694, file: !24, line: 275, baseType: !20, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !694, file: !24, line: 276, baseType: !371, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !694, file: !24, line: 277, baseType: !123, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !24, line: 278, baseType: !478, size: 128, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !23, file: !24, line: 388, baseType: !707, size: 512)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !24, line: 281, size: 512, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !722, !723, !724, !730, !731}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !707, file: !24, line: 282, baseType: !22, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !707, file: !24, line: 282, baseType: !31, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !24, line: 282, baseType: !31, size: 8, offset: 72)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !707, file: !24, line: 282, baseType: !13, size: 16, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !24, line: 282, baseType: !31, size: 8, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !707, file: !24, line: 282, baseType: !31, size: 8, offset: 104)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !707, file: !24, line: 283, baseType: !31, size: 8, offset: 112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !707, file: !24, line: 284, baseType: !717, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !19, line: 1084, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!18, !20, !467, !20, !721, !123, !123}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !24, line: 285, baseType: !79, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !707, file: !24, line: 286, baseType: !123, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !707, file: !24, line: 287, baseType: !725, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !19, line: 1102, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!18, !375, !20, !123, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !707, file: !24, line: 288, baseType: !22, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !24, line: 289, baseType: !22, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !23, file: !24, line: 389, baseType: !733, size: 512)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !24, line: 307, size: 512, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !733, file: !24, line: 308, baseType: !22, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !733, file: !24, line: 308, baseType: !31, size: 8, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !733, file: !24, line: 308, baseType: !31, size: 8, offset: 72)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !733, file: !24, line: 308, baseType: !13, size: 16, offset: 80)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !24, line: 308, baseType: !31, size: 8, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !733, file: !24, line: 308, baseType: !31, size: 8, offset: 104)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !733, file: !24, line: 309, baseType: !31, size: 8, offset: 112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !733, file: !24, line: 310, baseType: !31, size: 8, offset: 120)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !733, file: !24, line: 311, baseType: !123, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !733, file: !24, line: 312, baseType: !79, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !733, file: !24, line: 313, baseType: !110, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !733, file: !24, line: 314, baseType: !74, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !733, file: !24, line: 315, baseType: !74, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !733, file: !24, line: 316, baseType: !20, size: 32, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !23, file: !24, line: 390, baseType: !750, size: 448)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !24, line: 340, size: 448, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !750, file: !24, line: 341, baseType: !22, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !750, file: !24, line: 341, baseType: !31, size: 8, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !750, file: !24, line: 341, baseType: !31, size: 8, offset: 72)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !750, file: !24, line: 341, baseType: !13, size: 16, offset: 80)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !750, file: !24, line: 341, baseType: !31, size: 8, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !750, file: !24, line: 341, baseType: !79, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !750, file: !24, line: 342, baseType: !79, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !750, file: !24, line: 343, baseType: !123, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !750, file: !24, line: 344, baseType: !74, size: 64, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !750, file: !24, line: 345, baseType: !20, size: 32, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !23, file: !24, line: 391, baseType: !763, size: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !24, line: 350, size: 256, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !763, file: !24, line: 351, baseType: !22, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !763, file: !24, line: 351, baseType: !31, size: 8, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !24, line: 351, baseType: !31, size: 8, offset: 72)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !763, file: !24, line: 351, baseType: !13, size: 16, offset: 80)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !24, line: 351, baseType: !31, size: 8, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !763, file: !24, line: 351, baseType: !771, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !19, line: 1055, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !375, !123}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !763, file: !24, line: 352, baseType: !123, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !23, file: !24, line: 392, baseType: !777, size: 192)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !24, line: 357, size: 192, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !777, file: !24, line: 358, baseType: !22, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !777, file: !24, line: 358, baseType: !31, size: 8, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !24, line: 358, baseType: !31, size: 8, offset: 72)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !777, file: !24, line: 358, baseType: !13, size: 16, offset: 80)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !777, file: !24, line: 358, baseType: !31, size: 8, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !24, line: 358, baseType: !22, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !23, file: !24, line: 399, baseType: !80, size: 384)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!787 = !{!0}
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 64, elements: !353)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!790 = !{i32 7, !"Dwarf Version", i32 4}
!791 = !{i32 2, !"Debug Info Version", i32 3}
!792 = !{i32 1, !"wchar_size", i32 2}
!793 = !{i32 1, !"Code Model", i32 2}
!794 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!795 = distinct !DISubprogram(name: "acpi_ds_clear_implicit_return", scope: !3, file: !3, line: 34, type: !796, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !798)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !146}
!798 = !{}
!799 = !DILocalVariable(name: "walk_state", arg: 1, scope: !795, file: !3, line: 34, type: !146)
!800 = !DILocation(line: 34, column: 60, scope: !795)
!801 = !DILocation(line: 41, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !795, file: !3, line: 41, column: 6)
!803 = !DILocation(line: 41, column: 6, scope: !795)
!804 = !DILocation(line: 42, column: 3, scope: !805)
!805 = distinct !DILexicalBlock(scope: !802, file: !3, line: 41, column: 42)
!806 = !DILocation(line: 45, column: 6, scope: !807)
!807 = distinct !DILexicalBlock(scope: !795, file: !3, line: 45, column: 6)
!808 = !DILocation(line: 45, column: 18, scope: !807)
!809 = !DILocation(line: 45, column: 6, scope: !795)
!810 = !DILocation(line: 55, column: 28, scope: !811)
!811 = distinct !DILexicalBlock(scope: !807, file: !3, line: 45, column: 39)
!812 = !DILocation(line: 55, column: 40, scope: !811)
!813 = !DILocation(line: 55, column: 3, scope: !811)
!814 = !DILocation(line: 56, column: 3, scope: !811)
!815 = !DILocation(line: 56, column: 15, scope: !811)
!816 = !DILocation(line: 56, column: 35, scope: !811)
!817 = !DILocation(line: 57, column: 2, scope: !811)
!818 = !DILocation(line: 58, column: 1, scope: !795)
!819 = distinct !DISubprogram(name: "acpi_ds_do_implicit_return", scope: !3, file: !3, line: 79, type: !820, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !798)
!820 = !DISubroutineType(types: !821)
!821 = !{!31, !22, !146, !31}
!822 = !DILocalVariable(name: "return_desc", arg: 1, scope: !819, file: !3, line: 79, type: !22)
!823 = !DILocation(line: 79, column: 55, scope: !819)
!824 = !DILocalVariable(name: "walk_state", arg: 2, scope: !819, file: !3, line: 80, type: !146)
!825 = !DILocation(line: 80, column: 31, scope: !819)
!826 = !DILocalVariable(name: "add_reference", arg: 3, scope: !819, file: !3, line: 80, type: !31)
!827 = !DILocation(line: 80, column: 46, scope: !819)
!828 = !DILocation(line: 88, column: 8, scope: !829)
!829 = distinct !DILexicalBlock(scope: !819, file: !3, line: 88, column: 6)
!830 = !DILocation(line: 88, column: 43, scope: !829)
!831 = !DILocation(line: 88, column: 48, scope: !829)
!832 = !DILocation(line: 88, column: 6, scope: !819)
!833 = !DILocation(line: 89, column: 3, scope: !834)
!834 = distinct !DILexicalBlock(scope: !829, file: !3, line: 88, column: 62)
!835 = !DILocation(line: 102, column: 6, scope: !836)
!836 = distinct !DILexicalBlock(scope: !819, file: !3, line: 102, column: 6)
!837 = !DILocation(line: 102, column: 18, scope: !836)
!838 = !DILocation(line: 102, column: 6, scope: !819)
!839 = !DILocation(line: 103, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 103, column: 7)
!841 = distinct !DILexicalBlock(scope: !836, file: !3, line: 102, column: 39)
!842 = !DILocation(line: 103, column: 19, scope: !840)
!843 = !DILocation(line: 103, column: 42, scope: !840)
!844 = !DILocation(line: 103, column: 39, scope: !840)
