; ModuleID = '../bcout/drivers/acpi/acpica/dswstate.llvm.bc'
source_filename = "drivers/acpi/acpica/dswstate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !31, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/dswstate.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !16, !20, !23, !27, !28, !30}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !17, line: 20, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !19, line: 26, baseType: !22)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !26)
!26 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !29, line: 148, baseType: !7)
!29 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!0}
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 72, elements: !35)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !{!36}
!36 = !DISubrange(count: 9)
!37 = !{!"rsp"}
!38 = !{i32 7, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 2}
!41 = !{i32 1, !"Code Model", i32 2}
!42 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!43 = distinct !DISubprogram(name: "acpi_ds_result_pop", scope: !3, file: !3, line: 38, type: !44, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !807)
!44 = !DISubroutineType(types: !45)
!45 = !{!14, !46, !169}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !49, line: 367, size: 576, elements: !50)
!49 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!50 = !{!51, !65, !78, !89, !125, !138, !147, !458, !475, !490, !503, !581, !593, !607, !617, !635, !657, !676, !695, !714, !727, !753, !770, !783, !797, !806}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !48, file: !49, line: 368, baseType: !52, size: 128)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !49, line: 73, size: 128, elements: !53)
!53 = !{!54, !55, !59, !60, !64}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !52, file: !49, line: 74, baseType: !47, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !52, file: !49, line: 74, baseType: !56, size: 8, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !58)
!58 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !49, line: 74, baseType: !56, size: 8, offset: 72)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !52, file: !49, line: 74, baseType: !61, size: 16, offset: 80)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !63)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !49, line: 74, baseType: !56, size: 8, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !48, file: !49, line: 369, baseType: !66, size: 192)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !49, line: 76, size: 192, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !66, file: !49, line: 77, baseType: !47, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !66, file: !49, line: 77, baseType: !56, size: 8, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !49, line: 77, baseType: !56, size: 8, offset: 72)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !66, file: !49, line: 77, baseType: !61, size: 16, offset: 80)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !49, line: 77, baseType: !56, size: 8, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !66, file: !49, line: 77, baseType: !74, size: 24, offset: 104)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 24, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !66, file: !49, line: 78, baseType: !24, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !48, file: !49, line: 370, baseType: !79, size: 256)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !49, line: 93, size: 256, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !88}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !79, file: !49, line: 94, baseType: !47, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !79, file: !49, line: 94, baseType: !56, size: 8, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !79, file: !49, line: 94, baseType: !56, size: 8, offset: 72)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !79, file: !49, line: 94, baseType: !61, size: 16, offset: 80)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !49, line: 94, baseType: !56, size: 8, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !79, file: !49, line: 94, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !79, file: !49, line: 94, baseType: !16, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !48, file: !49, line: 371, baseType: !90, size: 384)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !49, line: 97, size: 384, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !99, !100, !101, !102}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !90, file: !49, line: 98, baseType: !47, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !90, file: !49, line: 98, baseType: !56, size: 8, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !49, line: 98, baseType: !56, size: 8, offset: 72)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !90, file: !49, line: 98, baseType: !61, size: 16, offset: 80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !49, line: 98, baseType: !56, size: 8, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !90, file: !49, line: 98, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !90, file: !49, line: 98, baseType: !16, size: 32, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !90, file: !49, line: 99, baseType: !16, size: 32, offset: 224)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !90, file: !49, line: 100, baseType: !98, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !90, file: !49, line: 101, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !105, line: 133, size: 384, elements: !106)
!105 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!106 = !{!107, !108, !109, !110, !111, !120, !121, !122, !123}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !104, file: !105, line: 134, baseType: !47, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !104, file: !105, line: 135, baseType: !56, size: 8, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !105, line: 136, baseType: !56, size: 8, offset: 72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !105, line: 137, baseType: !61, size: 16, offset: 80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !105, line: 138, baseType: !112, size: 32, offset: 96)
!112 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !113, line: 327, size: 32, elements: !114)
!113 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!114 = !{!115, !116}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !112, file: !113, line: 328, baseType: !16, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !112, file: !113, line: 329, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 4)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !104, file: !105, line: 139, baseType: !103, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !104, file: !105, line: 140, baseType: !103, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !104, file: !105, line: 141, baseType: !103, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !104, file: !105, line: 142, baseType: !124, size: 16, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !61)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !48, file: !49, line: 372, baseType: !126, size: 384)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !49, line: 104, size: 384, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !126, file: !49, line: 105, baseType: !47, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !126, file: !49, line: 105, baseType: !56, size: 8, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !49, line: 105, baseType: !56, size: 8, offset: 72)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !126, file: !49, line: 105, baseType: !61, size: 16, offset: 80)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !49, line: 105, baseType: !56, size: 8, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !126, file: !49, line: 105, baseType: !103, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !126, file: !49, line: 106, baseType: !46, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !126, file: !49, line: 107, baseType: !98, size: 64, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !126, file: !49, line: 108, baseType: !16, size: 32, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !126, file: !49, line: 109, baseType: !16, size: 32, offset: 352)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !48, file: !49, line: 373, baseType: !139, size: 192)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !49, line: 118, size: 192, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !139, file: !49, line: 119, baseType: !47, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !139, file: !49, line: 119, baseType: !56, size: 8, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !139, file: !49, line: 119, baseType: !56, size: 8, offset: 72)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !139, file: !49, line: 119, baseType: !61, size: 16, offset: 80)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !139, file: !49, line: 119, baseType: !56, size: 8, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !139, file: !49, line: 119, baseType: !27, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !48, file: !49, line: 374, baseType: !148, size: 448)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !49, line: 143, size: 448, elements: !149)
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !455, !456, !457}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !148, file: !49, line: 144, baseType: !47, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !148, file: !49, line: 144, baseType: !56, size: 8, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !49, line: 144, baseType: !56, size: 8, offset: 72)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !148, file: !49, line: 144, baseType: !61, size: 16, offset: 80)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !49, line: 144, baseType: !56, size: 8, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !148, file: !49, line: 144, baseType: !56, size: 8, offset: 104)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !148, file: !49, line: 145, baseType: !56, size: 8, offset: 112)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !148, file: !49, line: 146, baseType: !56, size: 8, offset: 120)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !148, file: !49, line: 147, baseType: !47, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !148, file: !49, line: 148, baseType: !47, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !148, file: !49, line: 149, baseType: !98, size: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !148, file: !49, line: 153, baseType: !162, size: 64, offset: 320)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !148, file: !49, line: 150, size: 64, elements: !163)
!163 = !{!164, !454}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !162, file: !49, line: 151, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !105, line: 248, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!14, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !171, line: 37, size: 9024, elements: !172)
!171 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !402, !403, !404, !405, !406, !410, !412, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !437, !438, !439, !440, !441, !442, !443, !444, !446, !452}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !171, line: 38, baseType: !169, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !170, file: !171, line: 39, baseType: !56, size: 8, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !170, file: !171, line: 40, baseType: !56, size: 8, offset: 72)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !170, file: !171, line: 41, baseType: !61, size: 16, offset: 80)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !170, file: !171, line: 42, baseType: !56, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !170, file: !171, line: 43, baseType: !56, size: 8, offset: 104)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !170, file: !171, line: 44, baseType: !56, size: 8, offset: 112)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !170, file: !171, line: 45, baseType: !124, size: 16, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !170, file: !171, line: 46, baseType: !56, size: 8, offset: 144)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !170, file: !171, line: 47, baseType: !56, size: 8, offset: 152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !170, file: !171, line: 48, baseType: !56, size: 8, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !170, file: !171, line: 49, baseType: !56, size: 8, offset: 168)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !170, file: !171, line: 50, baseType: !56, size: 8, offset: 176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !170, file: !171, line: 51, baseType: !56, size: 8, offset: 184)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !170, file: !171, line: 52, baseType: !56, size: 8, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !170, file: !171, line: 53, baseType: !56, size: 8, offset: 200)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !170, file: !171, line: 54, baseType: !98, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !170, file: !171, line: 55, baseType: !16, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !170, file: !171, line: 56, baseType: !16, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !170, file: !171, line: 57, baseType: !16, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !170, file: !171, line: 58, baseType: !16, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !170, file: !171, line: 60, baseType: !195, size: 640, offset: 448)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !105, line: 893, size: 640, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !283, !284, !400, !401}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !195, file: !105, line: 894, baseType: !98, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !195, file: !105, line: 895, baseType: !98, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !195, file: !105, line: 896, baseType: !98, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !195, file: !105, line: 897, baseType: !98, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !195, file: !105, line: 898, baseType: !98, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !195, file: !105, line: 899, baseType: !203, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !105, line: 875, size: 1600, elements: !205)
!205 = !{!206, !226, !242}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !204, file: !105, line: 876, baseType: !207, size: 448)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !105, line: 828, size: 448, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !225}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !207, file: !105, line: 829, baseType: !203, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !207, file: !105, line: 829, baseType: !56, size: 8, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !105, line: 829, baseType: !56, size: 8, offset: 72)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !207, file: !105, line: 829, baseType: !61, size: 16, offset: 80)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !207, file: !105, line: 829, baseType: !98, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !105, line: 829, baseType: !203, size: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !105, line: 829, baseType: !103, size: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !207, file: !105, line: 829, baseType: !217, size: 64, offset: 320)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !105, line: 716, size: 64, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !217, file: !105, line: 717, baseType: !24, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !217, file: !105, line: 718, baseType: !16, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !217, file: !105, line: 719, baseType: !87, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !217, file: !105, line: 720, baseType: !98, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !217, file: !105, line: 721, baseType: !87, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !217, file: !105, line: 722, baseType: !203, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !207, file: !105, line: 829, baseType: !56, size: 8, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !204, file: !105, line: 877, baseType: !227, size: 640)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !105, line: 835, size: 640, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !227, file: !105, line: 836, baseType: !203, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !227, file: !105, line: 836, baseType: !56, size: 8, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !227, file: !105, line: 836, baseType: !56, size: 8, offset: 72)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !227, file: !105, line: 836, baseType: !61, size: 16, offset: 80)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !227, file: !105, line: 836, baseType: !98, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !105, line: 836, baseType: !203, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !227, file: !105, line: 836, baseType: !103, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !227, file: !105, line: 836, baseType: !217, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !227, file: !105, line: 836, baseType: !56, size: 8, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !227, file: !105, line: 836, baseType: !87, size: 64, offset: 448)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !227, file: !105, line: 837, baseType: !98, size: 64, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !227, file: !105, line: 838, baseType: !16, size: 32, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !227, file: !105, line: 839, baseType: !16, size: 32, offset: 608)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !204, file: !105, line: 878, baseType: !243, size: 1600)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !105, line: 846, size: 1600, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !243, file: !105, line: 847, baseType: !203, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !243, file: !105, line: 847, baseType: !56, size: 8, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !105, line: 847, baseType: !56, size: 8, offset: 72)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !243, file: !105, line: 847, baseType: !61, size: 16, offset: 80)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !243, file: !105, line: 847, baseType: !98, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !105, line: 847, baseType: !203, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !243, file: !105, line: 847, baseType: !103, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !243, file: !105, line: 847, baseType: !217, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !243, file: !105, line: 847, baseType: !56, size: 8, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !243, file: !105, line: 847, baseType: !203, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !243, file: !105, line: 848, baseType: !203, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !243, file: !105, line: 849, baseType: !87, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !243, file: !105, line: 850, baseType: !56, size: 8, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !243, file: !105, line: 851, baseType: !87, size: 64, offset: 704)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !243, file: !105, line: 852, baseType: !87, size: 64, offset: 768)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !243, file: !105, line: 853, baseType: !87, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !243, file: !105, line: 854, baseType: !117, size: 32, offset: 896)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !243, file: !105, line: 855, baseType: !16, size: 32, offset: 928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !243, file: !105, line: 856, baseType: !16, size: 32, offset: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !243, file: !105, line: 857, baseType: !16, size: 32, offset: 992)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !243, file: !105, line: 858, baseType: !16, size: 32, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !243, file: !105, line: 859, baseType: !16, size: 32, offset: 1056)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !243, file: !105, line: 860, baseType: !16, size: 32, offset: 1088)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !243, file: !105, line: 861, baseType: !16, size: 32, offset: 1120)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !243, file: !105, line: 862, baseType: !16, size: 32, offset: 1152)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !243, file: !105, line: 863, baseType: !16, size: 32, offset: 1184)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !243, file: !105, line: 864, baseType: !16, size: 32, offset: 1216)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !243, file: !105, line: 865, baseType: !16, size: 32, offset: 1248)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !243, file: !105, line: 866, baseType: !16, size: 32, offset: 1280)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !243, file: !105, line: 867, baseType: !16, size: 32, offset: 1312)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !243, file: !105, line: 868, baseType: !61, size: 16, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !243, file: !105, line: 869, baseType: !56, size: 8, offset: 1360)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !243, file: !105, line: 870, baseType: !56, size: 8, offset: 1368)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !243, file: !105, line: 871, baseType: !56, size: 8, offset: 1376)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !243, file: !105, line: 872, baseType: !280, size: 160, offset: 1384)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 20)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !195, file: !105, line: 900, baseType: !103, size: 64, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !195, file: !105, line: 901, baseType: !285, size: 64, offset: 448)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !105, line: 663, size: 640, elements: !287)
!287 = !{!288, !296, !309, !318, !327, !340, !354, !366, !378}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !286, file: !105, line: 664, baseType: !289, size: 128)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !105, line: 567, size: 128, elements: !290)
!290 = !{!291, !292, !293, !294, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !105, line: 568, baseType: !27, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !289, file: !105, line: 568, baseType: !56, size: 8, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !105, line: 568, baseType: !56, size: 8, offset: 72)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !289, file: !105, line: 568, baseType: !61, size: 16, offset: 80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !289, file: !105, line: 568, baseType: !61, size: 16, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !286, file: !105, line: 665, baseType: !297, size: 384)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !105, line: 593, size: 384, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !105, line: 594, baseType: !27, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !297, file: !105, line: 594, baseType: !56, size: 8, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !105, line: 594, baseType: !56, size: 8, offset: 72)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !297, file: !105, line: 594, baseType: !61, size: 16, offset: 80)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !297, file: !105, line: 594, baseType: !61, size: 16, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !297, file: !105, line: 594, baseType: !61, size: 16, offset: 112)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !297, file: !105, line: 595, baseType: !203, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !297, file: !105, line: 596, baseType: !98, size: 64, offset: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !297, file: !105, line: 597, baseType: !98, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !297, file: !105, line: 598, baseType: !24, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !286, file: !105, line: 666, baseType: !310, size: 192)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !105, line: 573, size: 192, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !105, line: 574, baseType: !27, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !310, file: !105, line: 574, baseType: !56, size: 8, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !105, line: 574, baseType: !56, size: 8, offset: 72)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !310, file: !105, line: 574, baseType: !61, size: 16, offset: 80)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !105, line: 574, baseType: !61, size: 16, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !310, file: !105, line: 574, baseType: !47, size: 64, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !286, file: !105, line: 667, baseType: !319, size: 192)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !105, line: 604, size: 192, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !105, line: 605, baseType: !27, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !319, file: !105, line: 605, baseType: !56, size: 8, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !105, line: 605, baseType: !56, size: 8, offset: 72)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !319, file: !105, line: 605, baseType: !61, size: 16, offset: 80)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !319, file: !105, line: 605, baseType: !61, size: 16, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !319, file: !105, line: 605, baseType: !103, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !286, file: !105, line: 668, baseType: !328, size: 448)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !105, line: 608, size: 448, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !105, line: 609, baseType: !27, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !328, file: !105, line: 609, baseType: !56, size: 8, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !328, file: !105, line: 609, baseType: !56, size: 8, offset: 72)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !328, file: !105, line: 609, baseType: !61, size: 16, offset: 80)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !105, line: 609, baseType: !61, size: 16, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !328, file: !105, line: 609, baseType: !16, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !328, file: !105, line: 610, baseType: !203, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !328, file: !105, line: 611, baseType: !98, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !328, file: !105, line: 612, baseType: !98, size: 64, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !328, file: !105, line: 613, baseType: !16, size: 32, offset: 384)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !286, file: !105, line: 669, baseType: !341, size: 512)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !105, line: 580, size: 512, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !105, line: 581, baseType: !27, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !341, file: !105, line: 581, baseType: !56, size: 8, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !341, file: !105, line: 581, baseType: !56, size: 8, offset: 72)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !341, file: !105, line: 581, baseType: !61, size: 16, offset: 80)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !341, file: !105, line: 581, baseType: !61, size: 16, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !341, file: !105, line: 581, baseType: !16, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !341, file: !105, line: 582, baseType: !47, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !341, file: !105, line: 583, baseType: !47, size: 64, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !341, file: !105, line: 584, baseType: !169, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !341, file: !105, line: 585, baseType: !27, size: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !341, file: !105, line: 586, baseType: !16, size: 32, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !286, file: !105, line: 670, baseType: !355, size: 320)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !105, line: 620, size: 320, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !105, line: 621, baseType: !27, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !355, file: !105, line: 621, baseType: !56, size: 8, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !105, line: 621, baseType: !56, size: 8, offset: 72)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !355, file: !105, line: 621, baseType: !61, size: 16, offset: 80)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !105, line: 621, baseType: !61, size: 16, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !355, file: !105, line: 621, baseType: !56, size: 8, offset: 112)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !355, file: !105, line: 622, baseType: !169, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !355, file: !105, line: 623, baseType: !47, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !355, file: !105, line: 624, baseType: !24, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !286, file: !105, line: 671, baseType: !367, size: 640)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !105, line: 631, size: 640, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !105, line: 632, baseType: !27, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !367, file: !105, line: 632, baseType: !56, size: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !367, file: !105, line: 632, baseType: !56, size: 8, offset: 72)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !367, file: !105, line: 632, baseType: !61, size: 16, offset: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !105, line: 632, baseType: !61, size: 16, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !367, file: !105, line: 633, baseType: !375, size: 512, offset: 128)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 8)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !286, file: !105, line: 672, baseType: !379, size: 320)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !105, line: 654, size: 320, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !105, line: 655, baseType: !27, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !379, file: !105, line: 655, baseType: !56, size: 8, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !105, line: 655, baseType: !56, size: 8, offset: 72)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !379, file: !105, line: 655, baseType: !61, size: 16, offset: 80)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !379, file: !105, line: 655, baseType: !61, size: 16, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !379, file: !105, line: 655, baseType: !56, size: 8, offset: 112)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !379, file: !105, line: 656, baseType: !103, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !379, file: !105, line: 657, baseType: !47, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !379, file: !105, line: 658, baseType: !390, size: 64, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !105, line: 645, size: 128, elements: !392)
!392 = !{!393, !399}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !391, file: !105, line: 646, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398, !16, !27}
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !27)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !391, file: !105, line: 647, baseType: !27, size: 64, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !195, file: !105, line: 902, baseType: !203, size: 64, offset: 512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !195, file: !105, line: 903, baseType: !16, size: 32, offset: 576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !170, file: !171, line: 61, baseType: !16, size: 32, offset: 1088)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !170, file: !171, line: 62, baseType: !16, size: 32, offset: 1120)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !170, file: !171, line: 63, baseType: !61, size: 16, offset: 1152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !170, file: !171, line: 64, baseType: !56, size: 8, offset: 1168)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !170, file: !171, line: 66, baseType: !407, size: 2688, offset: 1216)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2688, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 7)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !170, file: !171, line: 67, baseType: !411, size: 3072, offset: 3904)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 3072, elements: !376)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !170, file: !171, line: 68, baseType: !413, size: 576, offset: 6976)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 576, elements: !35)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !170, file: !171, line: 69, baseType: !46, size: 64, offset: 7552)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !170, file: !171, line: 71, baseType: !98, size: 64, offset: 7616)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !170, file: !171, line: 72, baseType: !46, size: 64, offset: 7680)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !170, file: !171, line: 73, baseType: !285, size: 64, offset: 7744)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !170, file: !171, line: 74, baseType: !103, size: 64, offset: 7808)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !170, file: !171, line: 75, baseType: !47, size: 64, offset: 7872)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !170, file: !171, line: 76, baseType: !103, size: 64, offset: 7936)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !170, file: !171, line: 77, baseType: !203, size: 64, offset: 8000)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !170, file: !171, line: 78, baseType: !47, size: 64, offset: 8064)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !170, file: !171, line: 79, baseType: !103, size: 64, offset: 8128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !170, file: !171, line: 80, baseType: !87, size: 64, offset: 8192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !170, file: !171, line: 81, baseType: !203, size: 64, offset: 8256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !170, file: !171, line: 82, baseType: !427, size: 64, offset: 8320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !105, line: 702, size: 128, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !429, file: !105, line: 706, baseType: !16, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !429, file: !105, line: 707, baseType: !16, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !429, file: !105, line: 708, baseType: !61, size: 16, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !429, file: !105, line: 709, baseType: !56, size: 8, offset: 80)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !429, file: !105, line: 710, baseType: !56, size: 8, offset: 88)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !105, line: 711, baseType: !56, size: 8, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !170, file: !171, line: 83, baseType: !203, size: 64, offset: 8384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !170, file: !171, line: 84, baseType: !47, size: 64, offset: 8448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !170, file: !171, line: 85, baseType: !285, size: 64, offset: 8512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !170, file: !171, line: 86, baseType: !47, size: 64, offset: 8576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !170, file: !171, line: 87, baseType: !285, size: 64, offset: 8640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !170, file: !171, line: 88, baseType: !203, size: 64, offset: 8704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !170, file: !171, line: 89, baseType: !203, size: 64, offset: 8768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !170, file: !171, line: 90, baseType: !445, size: 64, offset: 8832)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !170, file: !171, line: 91, baseType: !447, size: 64, offset: 8896)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !105, line: 637, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!14, !169, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !170, file: !171, line: 92, baseType: !453, size: 64, offset: 8960)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !105, line: 641, baseType: !166)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !162, file: !49, line: 152, baseType: !47, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !148, file: !49, line: 155, baseType: !16, size: 32, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !148, file: !49, line: 156, baseType: !124, size: 16, offset: 416)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !148, file: !49, line: 157, baseType: !56, size: 8, offset: 432)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !48, file: !49, line: 375, baseType: !459, size: 576)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !49, line: 122, size: 576, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !459, file: !49, line: 123, baseType: !47, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !459, file: !49, line: 123, baseType: !56, size: 8, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !459, file: !49, line: 123, baseType: !56, size: 8, offset: 72)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !459, file: !49, line: 123, baseType: !61, size: 16, offset: 80)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !459, file: !49, line: 123, baseType: !56, size: 8, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !459, file: !49, line: 123, baseType: !56, size: 8, offset: 104)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !459, file: !49, line: 124, baseType: !61, size: 16, offset: 112)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !459, file: !49, line: 125, baseType: !27, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !459, file: !49, line: 126, baseType: !24, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !459, file: !49, line: 127, baseType: !445, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !49, line: 128, baseType: !47, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !49, line: 129, baseType: !47, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !459, file: !49, line: 130, baseType: !103, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !459, file: !49, line: 131, baseType: !56, size: 8, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !48, file: !49, line: 376, baseType: !476, size: 448)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !49, line: 134, size: 448, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !489}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !476, file: !49, line: 135, baseType: !47, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !476, file: !49, line: 135, baseType: !56, size: 8, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !49, line: 135, baseType: !56, size: 8, offset: 72)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !476, file: !49, line: 135, baseType: !61, size: 16, offset: 80)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !49, line: 135, baseType: !56, size: 8, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !476, file: !49, line: 135, baseType: !56, size: 8, offset: 104)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !476, file: !49, line: 136, baseType: !103, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !476, file: !49, line: 137, baseType: !47, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !49, line: 138, baseType: !47, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !476, file: !49, line: 139, baseType: !488, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !24)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !476, file: !49, line: 140, baseType: !16, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !48, file: !49, line: 377, baseType: !491, size: 320)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !49, line: 184, size: 320, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !502}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !491, file: !49, line: 185, baseType: !47, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !491, file: !49, line: 185, baseType: !56, size: 8, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !49, line: 185, baseType: !56, size: 8, offset: 72)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !491, file: !49, line: 185, baseType: !61, size: 16, offset: 80)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !491, file: !49, line: 185, baseType: !56, size: 8, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !491, file: !49, line: 185, baseType: !499, size: 128, offset: 128)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 128, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !491, file: !49, line: 185, baseType: !47, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !48, file: !49, line: 378, baseType: !504, size: 384)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !49, line: 187, size: 384, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !504, file: !49, line: 188, baseType: !47, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !504, file: !49, line: 188, baseType: !56, size: 8, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !49, line: 188, baseType: !56, size: 8, offset: 72)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !504, file: !49, line: 188, baseType: !61, size: 16, offset: 80)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !49, line: 188, baseType: !56, size: 8, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !504, file: !49, line: 189, baseType: !499, size: 128, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !504, file: !49, line: 189, baseType: !47, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !504, file: !49, line: 189, baseType: !514, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !105, line: 480, size: 576, elements: !516)
!516 = !{!517, !518, !519, !520, !528, !543, !575, !576, !577, !578, !579, !580}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !515, file: !105, line: 481, baseType: !103, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !515, file: !105, line: 482, baseType: !514, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !515, file: !105, line: 483, baseType: !514, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !515, file: !105, line: 484, baseType: !521, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !105, line: 497, size: 256, elements: !523)
!523 = !{!524, !525, !526, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !522, file: !105, line: 498, baseType: !521, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !522, file: !105, line: 499, baseType: !521, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !522, file: !105, line: 500, baseType: !514, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !522, file: !105, line: 501, baseType: !16, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !515, file: !105, line: 485, baseType: !529, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !105, line: 466, size: 320, elements: !531)
!531 = !{!532, !537, !538, !539, !540, !541, !542}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !530, file: !105, line: 467, baseType: !533, size: 128)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !105, line: 459, size: 128, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !533, file: !105, line: 460, baseType: !56, size: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !533, file: !105, line: 461, baseType: !24, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !530, file: !105, line: 468, baseType: !533, size: 128, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !530, file: !105, line: 469, baseType: !61, size: 16, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !530, file: !105, line: 470, baseType: !56, size: 8, offset: 272)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !530, file: !105, line: 471, baseType: !56, size: 8, offset: 280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !530, file: !105, line: 472, baseType: !56, size: 8, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !530, file: !105, line: 473, baseType: !56, size: 8, offset: 296)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !515, file: !105, line: 486, baseType: !544, size: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !105, line: 448, size: 192, elements: !546)
!546 = !{!547, !570, !571, !572, !573, !574}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !545, file: !105, line: 449, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !105, line: 438, size: 64, elements: !549)
!549 = !{!550, !551, !564}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !548, file: !105, line: 439, baseType: !103, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !548, file: !105, line: 440, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !105, line: 419, size: 256, elements: !554)
!554 = !{!555, !560, !561, !562, !563}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !553, file: !105, line: 420, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!16, !398, !16, !27}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !553, file: !105, line: 421, baseType: !27, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !553, file: !105, line: 422, baseType: !103, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !553, file: !105, line: 423, baseType: !56, size: 8, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !553, file: !105, line: 424, baseType: !56, size: 8, offset: 200)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !548, file: !105, line: 441, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !105, line: 429, size: 128, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !566, file: !105, line: 430, baseType: !103, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !105, line: 431, baseType: !565, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !545, file: !105, line: 450, baseType: !529, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !105, line: 451, baseType: !56, size: 8, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !545, file: !105, line: 452, baseType: !56, size: 8, offset: 136)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !545, file: !105, line: 453, baseType: !56, size: 8, offset: 144)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !545, file: !105, line: 454, baseType: !56, size: 8, offset: 152)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !515, file: !105, line: 487, baseType: !24, size: 64, offset: 384)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !515, file: !105, line: 488, baseType: !16, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !515, file: !105, line: 489, baseType: !61, size: 16, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !515, file: !105, line: 490, baseType: !61, size: 16, offset: 496)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !515, file: !105, line: 491, baseType: !56, size: 8, offset: 512)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !515, file: !105, line: 492, baseType: !56, size: 8, offset: 520)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !48, file: !49, line: 379, baseType: !582, size: 384)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !49, line: 192, size: 384, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !582, file: !49, line: 193, baseType: !47, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !582, file: !49, line: 193, baseType: !56, size: 8, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !582, file: !49, line: 193, baseType: !56, size: 8, offset: 72)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !582, file: !49, line: 193, baseType: !61, size: 16, offset: 80)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !582, file: !49, line: 193, baseType: !56, size: 8, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !582, file: !49, line: 193, baseType: !499, size: 128, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !582, file: !49, line: 193, baseType: !47, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !582, file: !49, line: 193, baseType: !16, size: 32, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !582, file: !49, line: 194, baseType: !16, size: 32, offset: 352)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !48, file: !49, line: 380, baseType: !594, size: 384)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !49, line: 197, size: 384, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !594, file: !49, line: 198, baseType: !47, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !594, file: !49, line: 198, baseType: !56, size: 8, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !594, file: !49, line: 198, baseType: !56, size: 8, offset: 72)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !594, file: !49, line: 198, baseType: !61, size: 16, offset: 80)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !594, file: !49, line: 198, baseType: !56, size: 8, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !594, file: !49, line: 200, baseType: !56, size: 8, offset: 104)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !594, file: !49, line: 201, baseType: !56, size: 8, offset: 112)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !594, file: !49, line: 202, baseType: !499, size: 128, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !594, file: !49, line: 202, baseType: !47, size: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !594, file: !49, line: 202, baseType: !606, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !24)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !48, file: !49, line: 381, baseType: !608, size: 320)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !49, line: 205, size: 320, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !608, file: !49, line: 206, baseType: !47, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !608, file: !49, line: 206, baseType: !56, size: 8, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !49, line: 206, baseType: !56, size: 8, offset: 72)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !608, file: !49, line: 206, baseType: !61, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !49, line: 206, baseType: !56, size: 8, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !608, file: !49, line: 206, baseType: !499, size: 128, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !608, file: !49, line: 206, baseType: !47, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !48, file: !49, line: 382, baseType: !618, size: 384)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !49, line: 233, size: 384, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !618, file: !49, line: 234, baseType: !47, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 72)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !618, file: !49, line: 234, baseType: !61, size: 16, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 104)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 112)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 120)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !618, file: !49, line: 234, baseType: !103, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !618, file: !49, line: 234, baseType: !16, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !618, file: !49, line: 234, baseType: !16, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !618, file: !49, line: 234, baseType: !16, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !618, file: !49, line: 234, baseType: !56, size: 8, offset: 296)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !618, file: !49, line: 234, baseType: !47, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !48, file: !49, line: 383, baseType: !636, size: 576)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !49, line: 237, size: 576, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !636, file: !49, line: 238, baseType: !47, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 72)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !636, file: !49, line: 238, baseType: !61, size: 16, offset: 80)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 104)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 112)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 120)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !636, file: !49, line: 238, baseType: !103, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !636, file: !49, line: 238, baseType: !16, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !636, file: !49, line: 238, baseType: !16, size: 32, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !636, file: !49, line: 238, baseType: !16, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !636, file: !49, line: 238, baseType: !56, size: 8, offset: 296)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !636, file: !49, line: 238, baseType: !61, size: 16, offset: 304)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !636, file: !49, line: 239, baseType: !47, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !636, file: !49, line: 240, baseType: !98, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !636, file: !49, line: 241, baseType: !61, size: 16, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !636, file: !49, line: 242, baseType: !98, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !48, file: !49, line: 384, baseType: !658, size: 384)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !49, line: 262, size: 384, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !658, file: !49, line: 263, baseType: !47, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 72)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !658, file: !49, line: 263, baseType: !61, size: 16, offset: 80)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 104)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 112)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 120)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !658, file: !49, line: 263, baseType: !103, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !658, file: !49, line: 263, baseType: !16, size: 32, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !658, file: !49, line: 263, baseType: !16, size: 32, offset: 224)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !658, file: !49, line: 263, baseType: !16, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 288)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 296)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !658, file: !49, line: 263, baseType: !56, size: 8, offset: 304)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !658, file: !49, line: 264, baseType: !47, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !48, file: !49, line: 385, baseType: !677, size: 448)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !49, line: 245, size: 448, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !677, file: !49, line: 246, baseType: !47, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 72)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !677, file: !49, line: 246, baseType: !61, size: 16, offset: 80)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 104)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 112)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 120)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !677, file: !49, line: 246, baseType: !103, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !677, file: !49, line: 246, baseType: !16, size: 32, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !677, file: !49, line: 246, baseType: !16, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !677, file: !49, line: 246, baseType: !16, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !677, file: !49, line: 246, baseType: !56, size: 8, offset: 296)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !677, file: !49, line: 246, baseType: !47, size: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !677, file: !49, line: 247, baseType: !47, size: 64, offset: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !48, file: !49, line: 386, baseType: !696, size: 448)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !49, line: 250, size: 448, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !696, file: !49, line: 251, baseType: !47, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 72)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !696, file: !49, line: 251, baseType: !61, size: 16, offset: 80)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 104)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !49, line: 251, baseType: !103, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !696, file: !49, line: 251, baseType: !16, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !696, file: !49, line: 251, baseType: !16, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !696, file: !49, line: 251, baseType: !16, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !696, file: !49, line: 251, baseType: !56, size: 8, offset: 296)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !696, file: !49, line: 256, baseType: !47, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !696, file: !49, line: 257, baseType: !47, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !48, file: !49, line: 387, baseType: !715, size: 512)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !49, line: 273, size: 512, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !715, file: !49, line: 274, baseType: !47, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !49, line: 274, baseType: !56, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !49, line: 274, baseType: !56, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !715, file: !49, line: 274, baseType: !61, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !49, line: 274, baseType: !56, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !49, line: 274, baseType: !103, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !715, file: !49, line: 275, baseType: !16, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !715, file: !49, line: 276, baseType: !394, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !715, file: !49, line: 277, baseType: !27, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !49, line: 278, baseType: !499, size: 128, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !48, file: !49, line: 388, baseType: !728, size: 512)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !49, line: 281, size: 512, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !743, !744, !745, !751, !752}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !728, file: !49, line: 282, baseType: !47, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !728, file: !49, line: 282, baseType: !56, size: 8, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !728, file: !49, line: 282, baseType: !56, size: 8, offset: 72)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !728, file: !49, line: 282, baseType: !61, size: 16, offset: 80)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !728, file: !49, line: 282, baseType: !56, size: 8, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !728, file: !49, line: 282, baseType: !56, size: 8, offset: 104)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !728, file: !49, line: 283, baseType: !56, size: 8, offset: 112)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !728, file: !49, line: 284, baseType: !738, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!14, !16, !488, !16, !742, !27, !27}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !728, file: !49, line: 285, baseType: !103, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !728, file: !49, line: 286, baseType: !27, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !728, file: !49, line: 287, baseType: !746, size: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!14, !398, !16, !27, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !728, file: !49, line: 288, baseType: !47, size: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !728, file: !49, line: 289, baseType: !47, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !48, file: !49, line: 389, baseType: !754, size: 512)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !49, line: 307, size: 512, elements: !755)
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !754, file: !49, line: 308, baseType: !47, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !754, file: !49, line: 308, baseType: !56, size: 8, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !754, file: !49, line: 308, baseType: !56, size: 8, offset: 72)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !754, file: !49, line: 308, baseType: !61, size: 16, offset: 80)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !754, file: !49, line: 308, baseType: !56, size: 8, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !754, file: !49, line: 308, baseType: !56, size: 8, offset: 104)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !754, file: !49, line: 309, baseType: !56, size: 8, offset: 112)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !754, file: !49, line: 310, baseType: !56, size: 8, offset: 120)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !754, file: !49, line: 311, baseType: !27, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !754, file: !49, line: 312, baseType: !103, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !754, file: !49, line: 313, baseType: !46, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !754, file: !49, line: 314, baseType: !98, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !754, file: !49, line: 315, baseType: !98, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !754, file: !49, line: 316, baseType: !16, size: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !48, file: !49, line: 390, baseType: !771, size: 448)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !49, line: 340, size: 448, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !771, file: !49, line: 341, baseType: !47, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !771, file: !49, line: 341, baseType: !56, size: 8, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !49, line: 341, baseType: !56, size: 8, offset: 72)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !771, file: !49, line: 341, baseType: !61, size: 16, offset: 80)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !771, file: !49, line: 341, baseType: !56, size: 8, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !771, file: !49, line: 341, baseType: !103, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !771, file: !49, line: 342, baseType: !103, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !771, file: !49, line: 343, baseType: !27, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !771, file: !49, line: 344, baseType: !98, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !771, file: !49, line: 345, baseType: !16, size: 32, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !48, file: !49, line: 391, baseType: !784, size: 256)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !49, line: 350, size: 256, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !796}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !784, file: !49, line: 351, baseType: !47, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !784, file: !49, line: 351, baseType: !56, size: 8, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !784, file: !49, line: 351, baseType: !56, size: 8, offset: 72)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !784, file: !49, line: 351, baseType: !61, size: 16, offset: 80)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !784, file: !49, line: 351, baseType: !56, size: 8, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !784, file: !49, line: 351, baseType: !792, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !398, !27}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !784, file: !49, line: 352, baseType: !27, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !48, file: !49, line: 392, baseType: !798, size: 192)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !49, line: 357, size: 192, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !798, file: !49, line: 358, baseType: !47, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !798, file: !49, line: 358, baseType: !56, size: 8, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !798, file: !49, line: 358, baseType: !56, size: 8, offset: 72)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !798, file: !49, line: 358, baseType: !61, size: 16, offset: 80)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !798, file: !49, line: 358, baseType: !56, size: 8, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !49, line: 358, baseType: !47, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !48, file: !49, line: 399, baseType: !104, size: 384)
!807 = !{}
!808 = !DILocalVariable(name: "object", arg: 1, scope: !43, file: !3, line: 38, type: !46)
!809 = !DILocation(line: 38, column: 48, scope: !43)
!810 = !DILocalVariable(name: "walk_state", arg: 2, scope: !43, file: !3, line: 39, type: !169)
!811 = !DILocation(line: 39, column: 30, scope: !43)
!812 = !DILocalVariable(name: "index", scope: !43, file: !3, line: 41, type: !16)
!813 = !DILocation(line: 41, column: 6, scope: !43)
!814 = !DILocalVariable(name: "state", scope: !43, file: !3, line: 42, type: !285)
!815 = !DILocation(line: 42, column: 28, scope: !43)
!816 = !DILocalVariable(name: "status", scope: !43, file: !3, line: 43, type: !14)
!817 = !DILocation(line: 43, column: 14, scope: !43)
!818 = !DILocation(line: 47, column: 10, scope: !43)
!819 = !DILocation(line: 47, column: 22, scope: !43)
!820 = !DILocation(line: 47, column: 8, scope: !43)
!821 = !DILocation(line: 51, column: 6, scope: !822)
!822 = distinct !DILexicalBlock(scope: !43, file: !3, line: 51, column: 6)
!823 = !DILocation(line: 51, column: 12, scope: !822)
!824 = !DILocation(line: 51, column: 16, scope: !822)
!825 = !DILocation(line: 51, column: 28, scope: !822)
!826 = !DILocation(line: 51, column: 6, scope: !43)
!827 = !DILocation(line: 52, column: 3, scope: !828)
!828 = distinct !DILexicalBlock(scope: !822, file: !3, line: 51, column: 42)
!829 = !DILocation(line: 53, column: 3, scope: !828)
!830 = !DILocation(line: 56, column: 7, scope: !831)
!831 = distinct !DILexicalBlock(scope: !43, file: !3, line: 56, column: 6)
!832 = !DILocation(line: 56, column: 13, scope: !831)
!833 = !DILocation(line: 56, column: 16, scope: !831)
!834 = !DILocation(line: 56, column: 28, scope: !831)
!835 = !DILocation(line: 56, column: 6, scope: !43)
!836 = !DILocation(line: 57, column: 3, scope: !837)
!837 = distinct !DILexicalBlock(scope: !831, file: !3, line: 56, column: 42)
!838 = !DILocation(line: 58, column: 3, scope: !837)
!839 = !DILocation(line: 63, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !43, file: !3, line: 63, column: 6)
!841 = !DILocation(line: 63, column: 6, scope: !43)
!842 = !DILocation(line: 64, column: 3, scope: !843)
!843 = distinct !DILexicalBlock(scope: !840, file: !3, line: 63, column: 14)
!844 = !DILocation(line: 66, column: 3, scope: !843)
!845 = !DILocation(line: 71, column: 2, scope: !43)
!846 = !DILocation(line: 71, column: 14, scope: !43)
!847 = !DILocation(line: 71, column: 26, scope: !43)
!848 = !DILocation(line: 72, column: 15, scope: !43)
!849 = !DILocation(line: 72, column: 27, scope: !43)
!850 = !DILocation(line: 72, column: 10, scope: !43)
!851 = !DILocation(line: 72, column: 40, scope: !43)
!852 = !DILocation(line: 72, column: 8, scope: !43)
!853 = !DILocation(line: 74, column: 12, scope: !43)
!854 = !DILocation(line: 74, column: 19, scope: !43)
