; ModuleID = '../bcout/drivers/acpi/acpica/evgpeutil.llvm.bc'
source_filename = "drivers/acpi/acpica/evgpeutil.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.acpi_gpe_xrupt_info = type { %struct.acpi_gpe_xrupt_info*, %struct.acpi_gpe_xrupt_info*, %struct.acpi_gpe_block_info*, i32 }
%struct.acpi_gpe_block_info = type { %struct.acpi_namespace_node*, %struct.acpi_gpe_block_info*, %struct.acpi_gpe_block_info*, %struct.acpi_gpe_xrupt_info*, %struct.acpi_gpe_register_info*, %struct.acpi_gpe_event_info*, i64, i32, i16, i16, i8, i8 }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !32, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !31, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/evgpeutil.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !20, !24, !27, !29, !30}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !26)
!26 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !28, line: 148, baseType: !7)
!28 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !{!0}
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 80, elements: !35)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !{!36}
!36 = !DISubrange(count: 10)
!37 = !{!"rsp"}
!38 = !{i32 7, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 2}
!41 = !{i32 1, !"Code Model", i32 2}
!42 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!43 = distinct !DISubprogram(name: "acpi_ev_walk_gpe_list", scope: !3, file: !3, line: 31, type: !44, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !810)
!44 = !DISubroutineType(types: !45)
!45 = !{!14, !46, !29}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_callback", file: !47, line: 519, baseType: !48)
!47 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!14, !51, !57, !29}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !47, line: 497, size: 256, elements: !53)
!53 = !{!54, !55, !56, !809}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !52, file: !47, line: 498, baseType: !51, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !47, line: 499, baseType: !51, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !52, file: !47, line: 500, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !47, line: 480, size: 576, elements: !59)
!59 = !{!60, !753, !754, !755, !756, !771, !803, !804, !805, !806, !807, !808}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !58, file: !47, line: 481, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !47, line: 133, size: 384, elements: !63)
!63 = !{!64, !740, !741, !742, !743, !749, !750, !751, !752}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !62, file: !47, line: 134, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !67, line: 367, size: 576, elements: !68)
!67 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !80, !93, !104, !118, !132, !141, !458, !475, !490, !503, !514, !526, !540, !550, !568, !590, !609, !628, !647, !660, !686, !703, !716, !730, !739}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !66, file: !67, line: 368, baseType: !70, size: 128)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !67, line: 73, size: 128, elements: !71)
!71 = !{!72, !73, !74, !75, !79}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !70, file: !67, line: 74, baseType: !65, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !70, file: !67, line: 74, baseType: !24, size: 8, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !67, line: 74, baseType: !24, size: 8, offset: 72)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !70, file: !67, line: 74, baseType: !76, size: 16, offset: 80)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !78)
!78 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !67, line: 74, baseType: !24, size: 8, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !66, file: !67, line: 369, baseType: !81, size: 192)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !67, line: 76, size: 192, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !92}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !81, file: !67, line: 77, baseType: !65, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !81, file: !67, line: 77, baseType: !24, size: 8, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !67, line: 77, baseType: !24, size: 8, offset: 72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !81, file: !67, line: 77, baseType: !76, size: 16, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !67, line: 77, baseType: !24, size: 8, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !81, file: !67, line: 77, baseType: !89, size: 24, offset: 104)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 3)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !81, file: !67, line: 78, baseType: !21, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !66, file: !67, line: 370, baseType: !94, size: 256)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !67, line: 93, size: 256, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !103}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !94, file: !67, line: 94, baseType: !65, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !94, file: !67, line: 94, baseType: !24, size: 8, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !67, line: 94, baseType: !24, size: 8, offset: 72)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !94, file: !67, line: 94, baseType: !76, size: 16, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !67, line: 94, baseType: !24, size: 8, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !94, file: !67, line: 94, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !94, file: !67, line: 94, baseType: !16, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !66, file: !67, line: 371, baseType: !105, size: 384)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !67, line: 97, size: 384, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !114, !115, !116, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !105, file: !67, line: 98, baseType: !65, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !105, file: !67, line: 98, baseType: !24, size: 8, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !67, line: 98, baseType: !24, size: 8, offset: 72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !105, file: !67, line: 98, baseType: !76, size: 16, offset: 80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !67, line: 98, baseType: !24, size: 8, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !105, file: !67, line: 98, baseType: !113, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !105, file: !67, line: 98, baseType: !16, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !105, file: !67, line: 99, baseType: !16, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !105, file: !67, line: 100, baseType: !113, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !105, file: !67, line: 101, baseType: !61, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !66, file: !67, line: 372, baseType: !119, size: 384)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !67, line: 104, size: 384, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !129, !130, !131}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !119, file: !67, line: 105, baseType: !65, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !119, file: !67, line: 105, baseType: !24, size: 8, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !67, line: 105, baseType: !24, size: 8, offset: 72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !119, file: !67, line: 105, baseType: !76, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !67, line: 105, baseType: !24, size: 8, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !119, file: !67, line: 105, baseType: !61, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !119, file: !67, line: 106, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !119, file: !67, line: 107, baseType: !113, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !119, file: !67, line: 108, baseType: !16, size: 32, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !119, file: !67, line: 109, baseType: !16, size: 32, offset: 352)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !66, file: !67, line: 373, baseType: !133, size: 192)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !67, line: 118, size: 192, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !133, file: !67, line: 119, baseType: !65, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !133, file: !67, line: 119, baseType: !24, size: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !67, line: 119, baseType: !24, size: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !133, file: !67, line: 119, baseType: !76, size: 16, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !67, line: 119, baseType: !24, size: 8, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !133, file: !67, line: 119, baseType: !29, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !66, file: !67, line: 374, baseType: !142, size: 448)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !67, line: 143, size: 448, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !455, !456, !457}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !142, file: !67, line: 144, baseType: !65, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !142, file: !67, line: 144, baseType: !24, size: 8, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !67, line: 144, baseType: !24, size: 8, offset: 72)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !142, file: !67, line: 144, baseType: !76, size: 16, offset: 80)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !67, line: 144, baseType: !24, size: 8, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !142, file: !67, line: 144, baseType: !24, size: 8, offset: 104)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !142, file: !67, line: 145, baseType: !24, size: 8, offset: 112)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !142, file: !67, line: 146, baseType: !24, size: 8, offset: 120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !142, file: !67, line: 147, baseType: !65, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !142, file: !67, line: 148, baseType: !65, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !142, file: !67, line: 149, baseType: !113, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !142, file: !67, line: 153, baseType: !156, size: 64, offset: 320)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !67, line: 150, size: 64, elements: !157)
!157 = !{!158, !454}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !156, file: !67, line: 151, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !47, line: 248, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!14, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !165, line: 37, size: 9024, elements: !166)
!165 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !400, !401, !402, !403, !404, !408, !410, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !437, !438, !439, !440, !441, !442, !443, !444, !446, !452}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !165, line: 38, baseType: !163, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !164, file: !165, line: 39, baseType: !24, size: 8, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !164, file: !165, line: 40, baseType: !24, size: 8, offset: 72)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !164, file: !165, line: 41, baseType: !76, size: 16, offset: 80)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !164, file: !165, line: 42, baseType: !24, size: 8, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !164, file: !165, line: 43, baseType: !24, size: 8, offset: 104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !164, file: !165, line: 44, baseType: !24, size: 8, offset: 112)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !164, file: !165, line: 45, baseType: !175, size: 16, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !76)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !164, file: !165, line: 46, baseType: !24, size: 8, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !164, file: !165, line: 47, baseType: !24, size: 8, offset: 152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !164, file: !165, line: 48, baseType: !24, size: 8, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !164, file: !165, line: 49, baseType: !24, size: 8, offset: 168)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !164, file: !165, line: 50, baseType: !24, size: 8, offset: 176)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !164, file: !165, line: 51, baseType: !24, size: 8, offset: 184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !164, file: !165, line: 52, baseType: !24, size: 8, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !164, file: !165, line: 53, baseType: !24, size: 8, offset: 200)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !164, file: !165, line: 54, baseType: !113, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !164, file: !165, line: 55, baseType: !16, size: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !164, file: !165, line: 56, baseType: !16, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !164, file: !165, line: 57, baseType: !16, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !164, file: !165, line: 58, baseType: !16, size: 32, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !164, file: !165, line: 60, baseType: !190, size: 640, offset: 448)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !47, line: 893, size: 640, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !281, !282, !398, !399}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !190, file: !47, line: 894, baseType: !113, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !190, file: !47, line: 895, baseType: !113, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !190, file: !47, line: 896, baseType: !113, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !190, file: !47, line: 897, baseType: !113, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !190, file: !47, line: 898, baseType: !113, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !190, file: !47, line: 899, baseType: !198, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !47, line: 875, size: 1600, elements: !200)
!200 = !{!201, !221, !237}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !199, file: !47, line: 876, baseType: !202, size: 448)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !47, line: 828, size: 448, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !220}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !202, file: !47, line: 829, baseType: !198, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !202, file: !47, line: 829, baseType: !24, size: 8, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !202, file: !47, line: 829, baseType: !24, size: 8, offset: 72)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !202, file: !47, line: 829, baseType: !76, size: 16, offset: 80)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !202, file: !47, line: 829, baseType: !113, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !47, line: 829, baseType: !198, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !47, line: 829, baseType: !61, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !202, file: !47, line: 829, baseType: !212, size: 64, offset: 320)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !47, line: 716, size: 64, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !212, file: !47, line: 717, baseType: !21, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !212, file: !47, line: 718, baseType: !16, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !212, file: !47, line: 719, baseType: !102, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !47, line: 720, baseType: !113, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !47, line: 721, baseType: !102, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !212, file: !47, line: 722, baseType: !198, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !202, file: !47, line: 829, baseType: !24, size: 8, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !199, file: !47, line: 877, baseType: !222, size: 640)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !47, line: 835, size: 640, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !222, file: !47, line: 836, baseType: !198, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !222, file: !47, line: 836, baseType: !24, size: 8, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !47, line: 836, baseType: !24, size: 8, offset: 72)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !222, file: !47, line: 836, baseType: !76, size: 16, offset: 80)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !222, file: !47, line: 836, baseType: !113, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !47, line: 836, baseType: !198, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !222, file: !47, line: 836, baseType: !61, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !222, file: !47, line: 836, baseType: !212, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !222, file: !47, line: 836, baseType: !24, size: 8, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !222, file: !47, line: 836, baseType: !102, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !47, line: 837, baseType: !113, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !222, file: !47, line: 838, baseType: !16, size: 32, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !47, line: 839, baseType: !16, size: 32, offset: 608)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !199, file: !47, line: 878, baseType: !238, size: 1600)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !47, line: 846, size: 1600, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !238, file: !47, line: 847, baseType: !198, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !238, file: !47, line: 847, baseType: !24, size: 8, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !47, line: 847, baseType: !24, size: 8, offset: 72)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !238, file: !47, line: 847, baseType: !76, size: 16, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !238, file: !47, line: 847, baseType: !113, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !47, line: 847, baseType: !198, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !238, file: !47, line: 847, baseType: !61, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !47, line: 847, baseType: !212, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !238, file: !47, line: 847, baseType: !24, size: 8, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !238, file: !47, line: 847, baseType: !198, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !238, file: !47, line: 848, baseType: !198, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !238, file: !47, line: 849, baseType: !102, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !238, file: !47, line: 850, baseType: !24, size: 8, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !238, file: !47, line: 851, baseType: !102, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !238, file: !47, line: 852, baseType: !102, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !238, file: !47, line: 853, baseType: !102, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !238, file: !47, line: 854, baseType: !257, size: 32, offset: 896)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 4)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !238, file: !47, line: 855, baseType: !16, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !238, file: !47, line: 856, baseType: !16, size: 32, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !238, file: !47, line: 857, baseType: !16, size: 32, offset: 992)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !238, file: !47, line: 858, baseType: !16, size: 32, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !238, file: !47, line: 859, baseType: !16, size: 32, offset: 1056)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !238, file: !47, line: 860, baseType: !16, size: 32, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !238, file: !47, line: 861, baseType: !16, size: 32, offset: 1120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !238, file: !47, line: 862, baseType: !16, size: 32, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !238, file: !47, line: 863, baseType: !16, size: 32, offset: 1184)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !238, file: !47, line: 864, baseType: !16, size: 32, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !238, file: !47, line: 865, baseType: !16, size: 32, offset: 1248)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !238, file: !47, line: 866, baseType: !16, size: 32, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !238, file: !47, line: 867, baseType: !16, size: 32, offset: 1312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !238, file: !47, line: 868, baseType: !76, size: 16, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !238, file: !47, line: 869, baseType: !24, size: 8, offset: 1360)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !238, file: !47, line: 870, baseType: !24, size: 8, offset: 1368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !238, file: !47, line: 871, baseType: !24, size: 8, offset: 1376)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !238, file: !47, line: 872, baseType: !278, size: 160, offset: 1384)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 20)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !190, file: !47, line: 900, baseType: !61, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !190, file: !47, line: 901, baseType: !283, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !47, line: 663, size: 640, elements: !285)
!285 = !{!286, !294, !307, !316, !325, !338, !352, !364, !376}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !284, file: !47, line: 664, baseType: !287, size: 128)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !47, line: 567, size: 128, elements: !288)
!288 = !{!289, !290, !291, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !47, line: 568, baseType: !29, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !47, line: 568, baseType: !24, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !47, line: 568, baseType: !24, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !47, line: 568, baseType: !76, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !47, line: 568, baseType: !76, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !284, file: !47, line: 665, baseType: !295, size: 384)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !47, line: 593, size: 384, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !47, line: 594, baseType: !29, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !295, file: !47, line: 594, baseType: !24, size: 8, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !47, line: 594, baseType: !24, size: 8, offset: 72)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !47, line: 594, baseType: !76, size: 16, offset: 80)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !295, file: !47, line: 594, baseType: !76, size: 16, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !295, file: !47, line: 594, baseType: !76, size: 16, offset: 112)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !295, file: !47, line: 595, baseType: !198, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !295, file: !47, line: 596, baseType: !113, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !295, file: !47, line: 597, baseType: !113, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !295, file: !47, line: 598, baseType: !21, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !284, file: !47, line: 666, baseType: !308, size: 192)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !47, line: 573, size: 192, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !47, line: 574, baseType: !29, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !308, file: !47, line: 574, baseType: !24, size: 8, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !47, line: 574, baseType: !24, size: 8, offset: 72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !308, file: !47, line: 574, baseType: !76, size: 16, offset: 80)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !47, line: 574, baseType: !76, size: 16, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !308, file: !47, line: 574, baseType: !65, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !284, file: !47, line: 667, baseType: !317, size: 192)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !47, line: 604, size: 192, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !47, line: 605, baseType: !29, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !317, file: !47, line: 605, baseType: !24, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !47, line: 605, baseType: !24, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !317, file: !47, line: 605, baseType: !76, size: 16, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !47, line: 605, baseType: !76, size: 16, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !47, line: 605, baseType: !61, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !284, file: !47, line: 668, baseType: !326, size: 448)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !47, line: 608, size: 448, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !47, line: 609, baseType: !29, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !326, file: !47, line: 609, baseType: !24, size: 8, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !47, line: 609, baseType: !24, size: 8, offset: 72)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !326, file: !47, line: 609, baseType: !76, size: 16, offset: 80)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !326, file: !47, line: 609, baseType: !76, size: 16, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !326, file: !47, line: 609, baseType: !16, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !326, file: !47, line: 610, baseType: !198, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !326, file: !47, line: 611, baseType: !113, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !326, file: !47, line: 612, baseType: !113, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !326, file: !47, line: 613, baseType: !16, size: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !284, file: !47, line: 669, baseType: !339, size: 512)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !47, line: 580, size: 512, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !47, line: 581, baseType: !29, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !339, file: !47, line: 581, baseType: !24, size: 8, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !47, line: 581, baseType: !24, size: 8, offset: 72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !339, file: !47, line: 581, baseType: !76, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !47, line: 581, baseType: !76, size: 16, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !339, file: !47, line: 581, baseType: !16, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !339, file: !47, line: 582, baseType: !65, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !339, file: !47, line: 583, baseType: !65, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !339, file: !47, line: 584, baseType: !163, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !339, file: !47, line: 585, baseType: !29, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !339, file: !47, line: 586, baseType: !16, size: 32, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !284, file: !47, line: 670, baseType: !353, size: 320)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !47, line: 620, size: 320, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !47, line: 621, baseType: !29, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !353, file: !47, line: 621, baseType: !24, size: 8, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !353, file: !47, line: 621, baseType: !24, size: 8, offset: 72)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !353, file: !47, line: 621, baseType: !76, size: 16, offset: 80)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !47, line: 621, baseType: !76, size: 16, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !353, file: !47, line: 621, baseType: !24, size: 8, offset: 112)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !353, file: !47, line: 622, baseType: !163, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !353, file: !47, line: 623, baseType: !65, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !353, file: !47, line: 624, baseType: !21, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !284, file: !47, line: 671, baseType: !365, size: 640)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !47, line: 631, size: 640, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !47, line: 632, baseType: !29, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !365, file: !47, line: 632, baseType: !24, size: 8, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !365, file: !47, line: 632, baseType: !24, size: 8, offset: 72)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !365, file: !47, line: 632, baseType: !76, size: 16, offset: 80)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !365, file: !47, line: 632, baseType: !76, size: 16, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !365, file: !47, line: 633, baseType: !373, size: 512, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !284, file: !47, line: 672, baseType: !377, size: 320)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !47, line: 654, size: 320, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !47, line: 655, baseType: !29, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !377, file: !47, line: 655, baseType: !24, size: 8, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !47, line: 655, baseType: !24, size: 8, offset: 72)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !377, file: !47, line: 655, baseType: !76, size: 16, offset: 80)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !47, line: 655, baseType: !76, size: 16, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !377, file: !47, line: 655, baseType: !24, size: 8, offset: 112)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !377, file: !47, line: 656, baseType: !61, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !377, file: !47, line: 657, baseType: !65, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !377, file: !47, line: 658, baseType: !388, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !47, line: 645, size: 128, elements: !390)
!390 = !{!391, !397}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !389, file: !47, line: 646, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !396, !16, !29}
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !29)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !389, file: !47, line: 647, baseType: !29, size: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !190, file: !47, line: 902, baseType: !198, size: 64, offset: 512)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !190, file: !47, line: 903, baseType: !16, size: 32, offset: 576)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !164, file: !165, line: 61, baseType: !16, size: 32, offset: 1088)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !164, file: !165, line: 62, baseType: !16, size: 32, offset: 1120)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !164, file: !165, line: 63, baseType: !76, size: 16, offset: 1152)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !164, file: !165, line: 64, baseType: !24, size: 8, offset: 1168)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !164, file: !165, line: 66, baseType: !405, size: 2688, offset: 1216)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 2688, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 7)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !164, file: !165, line: 67, baseType: !409, size: 3072, offset: 3904)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 3072, elements: !374)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !164, file: !165, line: 68, baseType: !411, size: 576, offset: 6976)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 576, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 9)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !164, file: !165, line: 69, baseType: !128, size: 64, offset: 7552)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !164, file: !165, line: 71, baseType: !113, size: 64, offset: 7616)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !164, file: !165, line: 72, baseType: !128, size: 64, offset: 7680)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !164, file: !165, line: 73, baseType: !283, size: 64, offset: 7744)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !164, file: !165, line: 74, baseType: !61, size: 64, offset: 7808)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !164, file: !165, line: 75, baseType: !65, size: 64, offset: 7872)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !164, file: !165, line: 76, baseType: !61, size: 64, offset: 7936)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !164, file: !165, line: 77, baseType: !198, size: 64, offset: 8000)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !164, file: !165, line: 78, baseType: !65, size: 64, offset: 8064)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !164, file: !165, line: 79, baseType: !61, size: 64, offset: 8128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !164, file: !165, line: 80, baseType: !102, size: 64, offset: 8192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !164, file: !165, line: 81, baseType: !198, size: 64, offset: 8256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !164, file: !165, line: 82, baseType: !427, size: 64, offset: 8320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !47, line: 702, size: 128, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !429, file: !47, line: 706, baseType: !16, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !429, file: !47, line: 707, baseType: !16, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !429, file: !47, line: 708, baseType: !76, size: 16, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !429, file: !47, line: 709, baseType: !24, size: 8, offset: 80)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !429, file: !47, line: 710, baseType: !24, size: 8, offset: 88)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !429, file: !47, line: 711, baseType: !24, size: 8, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !164, file: !165, line: 83, baseType: !198, size: 64, offset: 8384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !164, file: !165, line: 84, baseType: !65, size: 64, offset: 8448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !164, file: !165, line: 85, baseType: !283, size: 64, offset: 8512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !164, file: !165, line: 86, baseType: !65, size: 64, offset: 8576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !164, file: !165, line: 87, baseType: !283, size: 64, offset: 8640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !164, file: !165, line: 88, baseType: !198, size: 64, offset: 8704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !164, file: !165, line: 89, baseType: !198, size: 64, offset: 8768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !164, file: !165, line: 90, baseType: !445, size: 64, offset: 8832)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !164, file: !165, line: 91, baseType: !447, size: 64, offset: 8896)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !47, line: 637, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DISubroutineType(types: !450)
!450 = !{!14, !163, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !164, file: !165, line: 92, baseType: !453, size: 64, offset: 8960)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !47, line: 641, baseType: !160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !156, file: !67, line: 152, baseType: !65, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !142, file: !67, line: 155, baseType: !16, size: 32, offset: 384)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !142, file: !67, line: 156, baseType: !175, size: 16, offset: 416)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !142, file: !67, line: 157, baseType: !24, size: 8, offset: 432)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !66, file: !67, line: 375, baseType: !459, size: 576)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !67, line: 122, size: 576, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !459, file: !67, line: 123, baseType: !65, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !459, file: !67, line: 123, baseType: !24, size: 8, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !459, file: !67, line: 123, baseType: !24, size: 8, offset: 72)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !459, file: !67, line: 123, baseType: !76, size: 16, offset: 80)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !459, file: !67, line: 123, baseType: !24, size: 8, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !459, file: !67, line: 123, baseType: !24, size: 8, offset: 104)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !459, file: !67, line: 124, baseType: !76, size: 16, offset: 112)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !459, file: !67, line: 125, baseType: !29, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !459, file: !67, line: 126, baseType: !21, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !459, file: !67, line: 127, baseType: !445, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !67, line: 128, baseType: !65, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !67, line: 129, baseType: !65, size: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !459, file: !67, line: 130, baseType: !61, size: 64, offset: 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !459, file: !67, line: 131, baseType: !24, size: 8, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !66, file: !67, line: 376, baseType: !476, size: 448)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !67, line: 134, size: 448, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !489}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !476, file: !67, line: 135, baseType: !65, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !476, file: !67, line: 135, baseType: !24, size: 8, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !67, line: 135, baseType: !24, size: 8, offset: 72)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !476, file: !67, line: 135, baseType: !76, size: 16, offset: 80)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !67, line: 135, baseType: !24, size: 8, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !476, file: !67, line: 135, baseType: !24, size: 8, offset: 104)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !476, file: !67, line: 136, baseType: !61, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !476, file: !67, line: 137, baseType: !65, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !67, line: 138, baseType: !65, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !476, file: !67, line: 139, baseType: !488, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !21)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !476, file: !67, line: 140, baseType: !16, size: 32, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !66, file: !67, line: 377, baseType: !491, size: 320)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !67, line: 184, size: 320, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !502}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !491, file: !67, line: 185, baseType: !65, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !491, file: !67, line: 185, baseType: !24, size: 8, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !67, line: 185, baseType: !24, size: 8, offset: 72)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !491, file: !67, line: 185, baseType: !76, size: 16, offset: 80)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !491, file: !67, line: 185, baseType: !24, size: 8, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !491, file: !67, line: 185, baseType: !499, size: 128, offset: 128)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 128, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !491, file: !67, line: 185, baseType: !65, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !66, file: !67, line: 378, baseType: !504, size: 384)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !67, line: 187, size: 384, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !504, file: !67, line: 188, baseType: !65, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !504, file: !67, line: 188, baseType: !24, size: 8, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !67, line: 188, baseType: !24, size: 8, offset: 72)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !504, file: !67, line: 188, baseType: !76, size: 16, offset: 80)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !67, line: 188, baseType: !24, size: 8, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !504, file: !67, line: 189, baseType: !499, size: 128, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !504, file: !67, line: 189, baseType: !65, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !504, file: !67, line: 189, baseType: !57, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !66, file: !67, line: 379, baseType: !515, size: 384)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !67, line: 192, size: 384, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !515, file: !67, line: 193, baseType: !65, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !515, file: !67, line: 193, baseType: !24, size: 8, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !515, file: !67, line: 193, baseType: !24, size: 8, offset: 72)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !515, file: !67, line: 193, baseType: !76, size: 16, offset: 80)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !515, file: !67, line: 193, baseType: !24, size: 8, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !515, file: !67, line: 193, baseType: !499, size: 128, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !515, file: !67, line: 193, baseType: !65, size: 64, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !515, file: !67, line: 193, baseType: !16, size: 32, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !515, file: !67, line: 194, baseType: !16, size: 32, offset: 352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !66, file: !67, line: 380, baseType: !527, size: 384)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !67, line: 197, size: 384, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !527, file: !67, line: 198, baseType: !65, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !527, file: !67, line: 198, baseType: !24, size: 8, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !67, line: 198, baseType: !24, size: 8, offset: 72)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !527, file: !67, line: 198, baseType: !76, size: 16, offset: 80)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !527, file: !67, line: 198, baseType: !24, size: 8, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !527, file: !67, line: 200, baseType: !24, size: 8, offset: 104)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !527, file: !67, line: 201, baseType: !24, size: 8, offset: 112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !527, file: !67, line: 202, baseType: !499, size: 128, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !527, file: !67, line: 202, baseType: !65, size: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !527, file: !67, line: 202, baseType: !539, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !21)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !66, file: !67, line: 381, baseType: !541, size: 320)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !67, line: 205, size: 320, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !541, file: !67, line: 206, baseType: !65, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !541, file: !67, line: 206, baseType: !24, size: 8, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !541, file: !67, line: 206, baseType: !24, size: 8, offset: 72)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !541, file: !67, line: 206, baseType: !76, size: 16, offset: 80)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !541, file: !67, line: 206, baseType: !24, size: 8, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !541, file: !67, line: 206, baseType: !499, size: 128, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !541, file: !67, line: 206, baseType: !65, size: 64, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !66, file: !67, line: 382, baseType: !551, size: 384)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !67, line: 233, size: 384, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !551, file: !67, line: 234, baseType: !65, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 72)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !551, file: !67, line: 234, baseType: !76, size: 16, offset: 80)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 104)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 120)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !551, file: !67, line: 234, baseType: !61, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !551, file: !67, line: 234, baseType: !16, size: 32, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !551, file: !67, line: 234, baseType: !16, size: 32, offset: 224)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !551, file: !67, line: 234, baseType: !16, size: 32, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 288)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !551, file: !67, line: 234, baseType: !24, size: 8, offset: 296)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !551, file: !67, line: 234, baseType: !65, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !66, file: !67, line: 383, baseType: !569, size: 576)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !67, line: 237, size: 576, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !569, file: !67, line: 238, baseType: !65, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 72)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !569, file: !67, line: 238, baseType: !76, size: 16, offset: 80)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 104)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 112)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 120)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !569, file: !67, line: 238, baseType: !61, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !569, file: !67, line: 238, baseType: !16, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !569, file: !67, line: 238, baseType: !16, size: 32, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !569, file: !67, line: 238, baseType: !16, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 288)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !569, file: !67, line: 238, baseType: !24, size: 8, offset: 296)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !569, file: !67, line: 238, baseType: !76, size: 16, offset: 304)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !569, file: !67, line: 239, baseType: !65, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !569, file: !67, line: 240, baseType: !113, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !569, file: !67, line: 241, baseType: !76, size: 16, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !569, file: !67, line: 242, baseType: !113, size: 64, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !66, file: !67, line: 384, baseType: !591, size: 384)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !67, line: 262, size: 384, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !591, file: !67, line: 263, baseType: !65, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 72)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !591, file: !67, line: 263, baseType: !76, size: 16, offset: 80)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 104)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 112)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 120)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !591, file: !67, line: 263, baseType: !61, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !591, file: !67, line: 263, baseType: !16, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !591, file: !67, line: 263, baseType: !16, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !591, file: !67, line: 263, baseType: !16, size: 32, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 288)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 296)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !591, file: !67, line: 263, baseType: !24, size: 8, offset: 304)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !591, file: !67, line: 264, baseType: !65, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !66, file: !67, line: 385, baseType: !610, size: 448)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !67, line: 245, size: 448, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !610, file: !67, line: 246, baseType: !65, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 72)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !610, file: !67, line: 246, baseType: !76, size: 16, offset: 80)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 104)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 112)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 120)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !610, file: !67, line: 246, baseType: !61, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !610, file: !67, line: 246, baseType: !16, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !610, file: !67, line: 246, baseType: !16, size: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !610, file: !67, line: 246, baseType: !16, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 288)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !610, file: !67, line: 246, baseType: !24, size: 8, offset: 296)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !610, file: !67, line: 246, baseType: !65, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !610, file: !67, line: 247, baseType: !65, size: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !66, file: !67, line: 386, baseType: !629, size: 448)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !67, line: 250, size: 448, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !629, file: !67, line: 251, baseType: !65, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 72)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !629, file: !67, line: 251, baseType: !76, size: 16, offset: 80)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 104)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 112)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 120)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !629, file: !67, line: 251, baseType: !61, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !629, file: !67, line: 251, baseType: !16, size: 32, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !629, file: !67, line: 251, baseType: !16, size: 32, offset: 224)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !629, file: !67, line: 251, baseType: !16, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !629, file: !67, line: 251, baseType: !24, size: 8, offset: 296)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !629, file: !67, line: 256, baseType: !65, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !629, file: !67, line: 257, baseType: !65, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !66, file: !67, line: 387, baseType: !648, size: 512)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !67, line: 273, size: 512, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !648, file: !67, line: 274, baseType: !65, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !648, file: !67, line: 274, baseType: !24, size: 8, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !648, file: !67, line: 274, baseType: !24, size: 8, offset: 72)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !648, file: !67, line: 274, baseType: !76, size: 16, offset: 80)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !67, line: 274, baseType: !24, size: 8, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !648, file: !67, line: 274, baseType: !61, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !648, file: !67, line: 275, baseType: !16, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !648, file: !67, line: 276, baseType: !392, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !648, file: !67, line: 277, baseType: !29, size: 64, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !67, line: 278, baseType: !499, size: 128, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !66, file: !67, line: 388, baseType: !661, size: 512)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !67, line: 281, size: 512, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !676, !677, !678, !684, !685}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !661, file: !67, line: 282, baseType: !65, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !661, file: !67, line: 282, baseType: !24, size: 8, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !67, line: 282, baseType: !24, size: 8, offset: 72)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !661, file: !67, line: 282, baseType: !76, size: 16, offset: 80)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !67, line: 282, baseType: !24, size: 8, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !661, file: !67, line: 282, baseType: !24, size: 8, offset: 104)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !661, file: !67, line: 283, baseType: !24, size: 8, offset: 112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !661, file: !67, line: 284, baseType: !671, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!14, !16, !488, !16, !675, !29, !29}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !661, file: !67, line: 285, baseType: !61, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !661, file: !67, line: 286, baseType: !29, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !661, file: !67, line: 287, baseType: !679, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!14, !396, !16, !29, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !661, file: !67, line: 288, baseType: !65, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !661, file: !67, line: 289, baseType: !65, size: 64, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !66, file: !67, line: 389, baseType: !687, size: 512)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !67, line: 307, size: 512, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !687, file: !67, line: 308, baseType: !65, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !687, file: !67, line: 308, baseType: !24, size: 8, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !67, line: 308, baseType: !24, size: 8, offset: 72)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !687, file: !67, line: 308, baseType: !76, size: 16, offset: 80)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !687, file: !67, line: 308, baseType: !24, size: 8, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !687, file: !67, line: 308, baseType: !24, size: 8, offset: 104)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !687, file: !67, line: 309, baseType: !24, size: 8, offset: 112)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !687, file: !67, line: 310, baseType: !24, size: 8, offset: 120)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !687, file: !67, line: 311, baseType: !29, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !687, file: !67, line: 312, baseType: !61, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !687, file: !67, line: 313, baseType: !128, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !687, file: !67, line: 314, baseType: !113, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !687, file: !67, line: 315, baseType: !113, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !687, file: !67, line: 316, baseType: !16, size: 32, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !66, file: !67, line: 390, baseType: !704, size: 448)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !67, line: 340, size: 448, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !704, file: !67, line: 341, baseType: !65, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !704, file: !67, line: 341, baseType: !24, size: 8, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !704, file: !67, line: 341, baseType: !24, size: 8, offset: 72)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !704, file: !67, line: 341, baseType: !76, size: 16, offset: 80)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !704, file: !67, line: 341, baseType: !24, size: 8, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !704, file: !67, line: 341, baseType: !61, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !704, file: !67, line: 342, baseType: !61, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !704, file: !67, line: 343, baseType: !29, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !704, file: !67, line: 344, baseType: !113, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !704, file: !67, line: 345, baseType: !16, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !66, file: !67, line: 391, baseType: !717, size: 256)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !67, line: 350, size: 256, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !717, file: !67, line: 351, baseType: !65, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !717, file: !67, line: 351, baseType: !24, size: 8, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !67, line: 351, baseType: !24, size: 8, offset: 72)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !717, file: !67, line: 351, baseType: !76, size: 16, offset: 80)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !717, file: !67, line: 351, baseType: !24, size: 8, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !717, file: !67, line: 351, baseType: !725, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !396, !29}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !717, file: !67, line: 352, baseType: !29, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !66, file: !67, line: 392, baseType: !731, size: 192)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !67, line: 357, size: 192, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !731, file: !67, line: 358, baseType: !65, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !731, file: !67, line: 358, baseType: !24, size: 8, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !731, file: !67, line: 358, baseType: !24, size: 8, offset: 72)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !731, file: !67, line: 358, baseType: !76, size: 16, offset: 80)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !731, file: !67, line: 358, baseType: !24, size: 8, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !67, line: 358, baseType: !65, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !66, file: !67, line: 399, baseType: !62, size: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !62, file: !47, line: 135, baseType: !24, size: 8, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !47, line: 136, baseType: !24, size: 8, offset: 72)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !62, file: !47, line: 137, baseType: !76, size: 16, offset: 80)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !62, file: !47, line: 138, baseType: !744, size: 32, offset: 96)
!744 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !745, line: 327, size: 32, elements: !746)
!745 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !744, file: !745, line: 328, baseType: !16, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !744, file: !745, line: 329, baseType: !257, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !62, file: !47, line: 139, baseType: !61, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !62, file: !47, line: 140, baseType: !61, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !62, file: !47, line: 141, baseType: !61, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !62, file: !47, line: 142, baseType: !175, size: 16, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !58, file: !47, line: 482, baseType: !57, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !47, line: 483, baseType: !57, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !58, file: !47, line: 484, baseType: !51, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !58, file: !47, line: 485, baseType: !757, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !47, line: 466, size: 320, elements: !759)
!759 = !{!760, !765, !766, !767, !768, !769, !770}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !758, file: !47, line: 467, baseType: !761, size: 128)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !47, line: 459, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !761, file: !47, line: 460, baseType: !24, size: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !761, file: !47, line: 461, baseType: !21, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !758, file: !47, line: 468, baseType: !761, size: 128, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !758, file: !47, line: 469, baseType: !76, size: 16, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !758, file: !47, line: 470, baseType: !24, size: 8, offset: 272)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !758, file: !47, line: 471, baseType: !24, size: 8, offset: 280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !758, file: !47, line: 472, baseType: !24, size: 8, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !758, file: !47, line: 473, baseType: !24, size: 8, offset: 296)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !58, file: !47, line: 486, baseType: !772, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !47, line: 448, size: 192, elements: !774)
!774 = !{!775, !798, !799, !800, !801, !802}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !773, file: !47, line: 449, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !47, line: 438, size: 64, elements: !777)
!777 = !{!778, !779, !792}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !776, file: !47, line: 439, baseType: !61, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !776, file: !47, line: 440, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !47, line: 419, size: 256, elements: !782)
!782 = !{!783, !788, !789, !790, !791}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !781, file: !47, line: 420, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!16, !396, !16, !29}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !781, file: !47, line: 421, baseType: !29, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !781, file: !47, line: 422, baseType: !61, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !781, file: !47, line: 423, baseType: !24, size: 8, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !781, file: !47, line: 424, baseType: !24, size: 8, offset: 200)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !776, file: !47, line: 441, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !47, line: 429, size: 128, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !794, file: !47, line: 430, baseType: !61, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !794, file: !47, line: 431, baseType: !793, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !773, file: !47, line: 450, baseType: !757, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !47, line: 451, baseType: !24, size: 8, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !773, file: !47, line: 452, baseType: !24, size: 8, offset: 136)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !773, file: !47, line: 453, baseType: !24, size: 8, offset: 144)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !773, file: !47, line: 454, baseType: !24, size: 8, offset: 152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !58, file: !47, line: 487, baseType: !21, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !58, file: !47, line: 488, baseType: !16, size: 32, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !58, file: !47, line: 489, baseType: !76, size: 16, offset: 480)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !58, file: !47, line: 490, baseType: !76, size: 16, offset: 496)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !58, file: !47, line: 491, baseType: !24, size: 8, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !58, file: !47, line: 492, baseType: !24, size: 8, offset: 520)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !52, file: !47, line: 501, baseType: !16, size: 32, offset: 192)
!810 = !{}
!811 = !DILocalVariable(name: "gpe_walk_callback", arg: 1, scope: !43, file: !3, line: 31, type: !46)
!812 = !DILocation(line: 31, column: 41, scope: !43)
!813 = !DILocalVariable(name: "context", arg: 2, scope: !43, file: !3, line: 31, type: !29)
!814 = !DILocation(line: 31, column: 66, scope: !43)
!815 = !DILocalVariable(name: "gpe_block", scope: !43, file: !3, line: 33, type: !57)
!816 = !DILocation(line: 33, column: 30, scope: !43)
!817 = !DILocalVariable(name: "gpe_xrupt_info", scope: !43, file: !3, line: 34, type: !51)
!818 = !DILocation(line: 34, column: 30, scope: !43)
!819 = !DILocalVariable(name: "status", scope: !43, file: !3, line: 35, type: !14)
!820 = !DILocation(line: 35, column: 14, scope: !43)
!821 = !DILocalVariable(name: "flags", scope: !43, file: !3, line: 36, type: !30)
!822 = !DILocation(line: 36, column: 17, scope: !43)
!823 = !DILocation(line: 40, column: 31, scope: !43)
!824 = !DILocation(line: 40, column: 10, scope: !43)
!825 = !DILocation(line: 40, column: 8, scope: !43)
!826 = !DILocation(line: 44, column: 19, scope: !43)
!827 = !DILocation(line: 44, column: 17, scope: !43)
!828 = !DILocation(line: 45, column: 2, scope: !43)
!829 = !DILocation(line: 45, column: 9, scope: !43)
!830 = !DILocation(line: 49, column: 15, scope: !831)
!831 = distinct !DILexicalBlock(scope: !43, file: !3, line: 45, column: 25)
!832 = !DILocation(line: 49, column: 31, scope: !831)
!833 = !DILocation(line: 49, column: 13, scope: !831)
!834 = !DILocation(line: 50, column: 3, scope: !831)
!835 = !DILocation(line: 50, column: 10, scope: !831)
!836 = !DILocation(line: 55, column: 8, scope: !837)
!837 = distinct !DILexicalBlock(scope: !831, file: !3, line: 50, column: 21)
!838 = !DILocation(line: 55, column: 26, scope: !837)
!839 = !DILocation(line: 55, column: 42, scope: !837)
!840 = !DILocation(line: 56, column: 12, scope: !837)
!841 = !DILocation(line: 54, column: 11, scope: !837)
!842 = !DILocation(line: 57, column: 8, scope: !843)
!843 = distinct !DILexicalBlock(scope: !837, file: !3, line: 57, column: 8)
!844 = !DILocation(line: 57, column: 8, scope: !837)
!845 = !DILocation(line: 58, column: 9, scope: !846)
!846 = distinct !DILexicalBlock(scope: !847, file: !3, line: 58, column: 9)
!847 = distinct !DILexicalBlock(scope: !843, file: !3, line: 57, column: 30)
!848 = !DILocation(line: 58, column: 16, scope: !846)
!849 = !DILocation(line: 58, column: 9, scope: !847)
!850 = !DILocation(line: 59, column: 13, scope: !851)
!851 = distinct !DILexicalBlock(scope: !846, file: !3, line: 58, column: 32)
!852 = !DILocation(line: 60, column: 5, scope: !851)
!853 = !DILocation(line: 61, column: 5, scope: !847)
!854 = !DILocation(line: 64, column: 16, scope: !837)
!855 = !DILocation(line: 64, column: 27, scope: !837)
!856 = !DILocation(line: 64, column: 14, scope: !837)
!857 = distinct !{!857, !834, !858}
!858 = !DILocation(line: 65, column: 3, scope: !831)
!859 = !DILocation(line: 67, column: 20, scope: !831)
!860 = !DILocation(line: 67, column: 36, scope: !831)
!861 = !DILocation(line: 67, column: 18, scope: !831)
!862 = distinct !{!862, !828, !863}
