; ModuleID = '../bcout/drivers/acpi/acpica/evgpeblk.llvm.bc'
source_filename = "drivers/acpi/acpica/evgpeblk.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 16, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !35, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/evgpeblk.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !15, !21, !25, !29, !17, !22, !32, !34}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !16, line: 421, baseType: !17)
!16 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !18, line: 21, baseType: !19)
!18 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !7)
!20 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !16, line: 805, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !18, line: 17, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !16, line: 127, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !18, line: 23, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !28)
!28 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !18, line: 19, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !20, line: 24, baseType: !31)
!31 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !33, line: 148, baseType: !7)
!33 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !{!0}
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 72, elements: !39)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!39 = !{!40}
!40 = !DISubrange(count: 9)
!41 = !{!"rsp"}
!42 = !{i32 7, !"Dwarf Version", i32 4}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 2}
!45 = !{i32 1, !"Code Model", i32 2}
!46 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!47 = distinct !DISubprogram(name: "acpi_ev_delete_gpe_block", scope: !3, file: !3, line: 97, type: !48, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !805)
!48 = !DISubroutineType(types: !49)
!49 = !{!15, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !52, line: 480, size: 576, elements: !53)
!52 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!53 = !{!54, !742, !743, !744, !752, !767, !799, !800, !801, !802, !803, !804}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !51, file: !52, line: 481, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !52, line: 133, size: 384, elements: !57)
!57 = !{!58, !729, !730, !731, !732, !738, !739, !740, !741}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !56, file: !52, line: 134, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !61, line: 367, size: 576, elements: !62)
!61 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!62 = !{!63, !71, !84, !95, !109, !123, !132, !447, !464, !479, !492, !503, !515, !529, !539, !557, !579, !598, !617, !636, !649, !675, !692, !705, !719, !728}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !60, file: !61, line: 368, baseType: !64, size: 128)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !61, line: 73, size: 128, elements: !65)
!65 = !{!66, !67, !68, !69, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !64, file: !61, line: 74, baseType: !59, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !64, file: !61, line: 74, baseType: !22, size: 8, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !61, line: 74, baseType: !22, size: 8, offset: 72)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !64, file: !61, line: 74, baseType: !29, size: 16, offset: 80)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !61, line: 74, baseType: !22, size: 8, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !60, file: !61, line: 369, baseType: !72, size: 192)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !61, line: 76, size: 192, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !83}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !72, file: !61, line: 77, baseType: !59, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !72, file: !61, line: 77, baseType: !22, size: 8, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !61, line: 77, baseType: !22, size: 8, offset: 72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !72, file: !61, line: 77, baseType: !29, size: 16, offset: 80)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !72, file: !61, line: 77, baseType: !22, size: 8, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !72, file: !61, line: 77, baseType: !80, size: 24, offset: 104)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 24, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !72, file: !61, line: 78, baseType: !26, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !60, file: !61, line: 370, baseType: !85, size: 256)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !61, line: 93, size: 256, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !94}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !85, file: !61, line: 94, baseType: !59, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !85, file: !61, line: 94, baseType: !22, size: 8, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !61, line: 94, baseType: !22, size: 8, offset: 72)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !85, file: !61, line: 94, baseType: !29, size: 16, offset: 80)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !85, file: !61, line: 94, baseType: !22, size: 8, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !85, file: !61, line: 94, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !61, line: 94, baseType: !17, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !60, file: !61, line: 371, baseType: !96, size: 384)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !61, line: 97, size: 384, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !105, !106, !107, !108}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !96, file: !61, line: 98, baseType: !59, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !96, file: !61, line: 98, baseType: !22, size: 8, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !61, line: 98, baseType: !22, size: 8, offset: 72)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !96, file: !61, line: 98, baseType: !29, size: 16, offset: 80)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !61, line: 98, baseType: !22, size: 8, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !96, file: !61, line: 98, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !96, file: !61, line: 98, baseType: !17, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !96, file: !61, line: 99, baseType: !17, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !96, file: !61, line: 100, baseType: !104, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !96, file: !61, line: 101, baseType: !55, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !60, file: !61, line: 372, baseType: !110, size: 384)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !61, line: 104, size: 384, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118, !120, !121, !122}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !110, file: !61, line: 105, baseType: !59, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !110, file: !61, line: 105, baseType: !22, size: 8, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !61, line: 105, baseType: !22, size: 8, offset: 72)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !110, file: !61, line: 105, baseType: !29, size: 16, offset: 80)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !61, line: 105, baseType: !22, size: 8, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !110, file: !61, line: 105, baseType: !55, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !110, file: !61, line: 106, baseType: !119, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !110, file: !61, line: 107, baseType: !104, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !110, file: !61, line: 108, baseType: !17, size: 32, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !110, file: !61, line: 109, baseType: !17, size: 32, offset: 352)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !60, file: !61, line: 373, baseType: !124, size: 192)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !61, line: 118, size: 192, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !124, file: !61, line: 119, baseType: !59, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !124, file: !61, line: 119, baseType: !22, size: 8, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !61, line: 119, baseType: !22, size: 8, offset: 72)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !124, file: !61, line: 119, baseType: !29, size: 16, offset: 80)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !124, file: !61, line: 119, baseType: !22, size: 8, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !124, file: !61, line: 119, baseType: !14, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !60, file: !61, line: 374, baseType: !133, size: 448)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !61, line: 143, size: 448, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !444, !445, !446}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !133, file: !61, line: 144, baseType: !59, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !133, file: !61, line: 144, baseType: !22, size: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !61, line: 144, baseType: !22, size: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !133, file: !61, line: 144, baseType: !29, size: 16, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !61, line: 144, baseType: !22, size: 8, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !133, file: !61, line: 144, baseType: !22, size: 8, offset: 104)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !133, file: !61, line: 145, baseType: !22, size: 8, offset: 112)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !133, file: !61, line: 146, baseType: !22, size: 8, offset: 120)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !133, file: !61, line: 147, baseType: !59, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !133, file: !61, line: 148, baseType: !59, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !133, file: !61, line: 149, baseType: !104, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !133, file: !61, line: 153, baseType: !147, size: 64, offset: 320)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !133, file: !61, line: 150, size: 64, elements: !148)
!148 = !{!149, !443}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !147, file: !61, line: 151, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !52, line: 248, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!15, !154}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !156, line: 37, size: 9024, elements: !157)
!156 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !391, !392, !393, !394, !395, !399, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !426, !427, !428, !429, !430, !431, !432, !433, !435, !441}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !156, line: 38, baseType: !154, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !155, file: !156, line: 39, baseType: !22, size: 8, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !155, file: !156, line: 40, baseType: !22, size: 8, offset: 72)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !155, file: !156, line: 41, baseType: !29, size: 16, offset: 80)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !155, file: !156, line: 42, baseType: !22, size: 8, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !155, file: !156, line: 43, baseType: !22, size: 8, offset: 104)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !155, file: !156, line: 44, baseType: !22, size: 8, offset: 112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !155, file: !156, line: 45, baseType: !166, size: 16, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !16, line: 445, baseType: !29)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !155, file: !156, line: 46, baseType: !22, size: 8, offset: 144)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !155, file: !156, line: 47, baseType: !22, size: 8, offset: 152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !155, file: !156, line: 48, baseType: !22, size: 8, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !155, file: !156, line: 49, baseType: !22, size: 8, offset: 168)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !155, file: !156, line: 50, baseType: !22, size: 8, offset: 176)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !155, file: !156, line: 51, baseType: !22, size: 8, offset: 184)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !155, file: !156, line: 52, baseType: !22, size: 8, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !155, file: !156, line: 53, baseType: !22, size: 8, offset: 200)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !155, file: !156, line: 54, baseType: !104, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !155, file: !156, line: 55, baseType: !17, size: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !155, file: !156, line: 56, baseType: !17, size: 32, offset: 352)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !155, file: !156, line: 57, baseType: !17, size: 32, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !155, file: !156, line: 58, baseType: !17, size: 32, offset: 416)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !155, file: !156, line: 60, baseType: !181, size: 640, offset: 448)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !52, line: 893, size: 640, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !272, !273, !389, !390}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !181, file: !52, line: 894, baseType: !104, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !181, file: !52, line: 895, baseType: !104, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !181, file: !52, line: 896, baseType: !104, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !181, file: !52, line: 897, baseType: !104, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !181, file: !52, line: 898, baseType: !104, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !181, file: !52, line: 899, baseType: !189, size: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !52, line: 875, size: 1600, elements: !191)
!191 = !{!192, !212, !228}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !190, file: !52, line: 876, baseType: !193, size: 448)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !52, line: 828, size: 448, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !211}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !193, file: !52, line: 829, baseType: !189, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !193, file: !52, line: 829, baseType: !22, size: 8, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !193, file: !52, line: 829, baseType: !22, size: 8, offset: 72)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !193, file: !52, line: 829, baseType: !29, size: 16, offset: 80)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !193, file: !52, line: 829, baseType: !104, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !52, line: 829, baseType: !189, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !193, file: !52, line: 829, baseType: !55, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !193, file: !52, line: 829, baseType: !203, size: 64, offset: 320)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !52, line: 716, size: 64, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !203, file: !52, line: 717, baseType: !26, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !203, file: !52, line: 718, baseType: !17, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !203, file: !52, line: 719, baseType: !93, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !203, file: !52, line: 720, baseType: !104, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !52, line: 721, baseType: !93, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !203, file: !52, line: 722, baseType: !189, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !193, file: !52, line: 829, baseType: !22, size: 8, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !190, file: !52, line: 877, baseType: !213, size: 640)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !52, line: 835, size: 640, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !52, line: 836, baseType: !189, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !213, file: !52, line: 836, baseType: !22, size: 8, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !213, file: !52, line: 836, baseType: !22, size: 8, offset: 72)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !213, file: !52, line: 836, baseType: !29, size: 16, offset: 80)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !213, file: !52, line: 836, baseType: !104, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !52, line: 836, baseType: !189, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !213, file: !52, line: 836, baseType: !55, size: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !52, line: 836, baseType: !203, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !213, file: !52, line: 836, baseType: !22, size: 8, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !213, file: !52, line: 836, baseType: !93, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !52, line: 837, baseType: !104, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !213, file: !52, line: 838, baseType: !17, size: 32, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !52, line: 839, baseType: !17, size: 32, offset: 608)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !190, file: !52, line: 878, baseType: !229, size: 1600)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !52, line: 846, size: 1600, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !229, file: !52, line: 847, baseType: !189, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !229, file: !52, line: 847, baseType: !22, size: 8, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !229, file: !52, line: 847, baseType: !22, size: 8, offset: 72)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !229, file: !52, line: 847, baseType: !29, size: 16, offset: 80)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !229, file: !52, line: 847, baseType: !104, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !52, line: 847, baseType: !189, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !229, file: !52, line: 847, baseType: !55, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !229, file: !52, line: 847, baseType: !203, size: 64, offset: 320)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !229, file: !52, line: 847, baseType: !22, size: 8, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !229, file: !52, line: 847, baseType: !189, size: 64, offset: 448)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !229, file: !52, line: 848, baseType: !189, size: 64, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !229, file: !52, line: 849, baseType: !93, size: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !229, file: !52, line: 850, baseType: !22, size: 8, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !229, file: !52, line: 851, baseType: !93, size: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !229, file: !52, line: 852, baseType: !93, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !229, file: !52, line: 853, baseType: !93, size: 64, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !229, file: !52, line: 854, baseType: !248, size: 32, offset: 896)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 32, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 4)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !229, file: !52, line: 855, baseType: !17, size: 32, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !229, file: !52, line: 856, baseType: !17, size: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !229, file: !52, line: 857, baseType: !17, size: 32, offset: 992)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !229, file: !52, line: 858, baseType: !17, size: 32, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !229, file: !52, line: 859, baseType: !17, size: 32, offset: 1056)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !229, file: !52, line: 860, baseType: !17, size: 32, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !229, file: !52, line: 861, baseType: !17, size: 32, offset: 1120)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !229, file: !52, line: 862, baseType: !17, size: 32, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !229, file: !52, line: 863, baseType: !17, size: 32, offset: 1184)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !229, file: !52, line: 864, baseType: !17, size: 32, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !229, file: !52, line: 865, baseType: !17, size: 32, offset: 1248)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !229, file: !52, line: 866, baseType: !17, size: 32, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !229, file: !52, line: 867, baseType: !17, size: 32, offset: 1312)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !229, file: !52, line: 868, baseType: !29, size: 16, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !229, file: !52, line: 869, baseType: !22, size: 8, offset: 1360)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !229, file: !52, line: 870, baseType: !22, size: 8, offset: 1368)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !229, file: !52, line: 871, baseType: !22, size: 8, offset: 1376)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !229, file: !52, line: 872, baseType: !269, size: 160, offset: 1384)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 160, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 20)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !181, file: !52, line: 900, baseType: !55, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !181, file: !52, line: 901, baseType: !274, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !52, line: 663, size: 640, elements: !276)
!276 = !{!277, !285, !298, !307, !316, !329, !343, !355, !367}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !275, file: !52, line: 664, baseType: !278, size: 128)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !52, line: 567, size: 128, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !52, line: 568, baseType: !14, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !278, file: !52, line: 568, baseType: !22, size: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !278, file: !52, line: 568, baseType: !22, size: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !278, file: !52, line: 568, baseType: !29, size: 16, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !278, file: !52, line: 568, baseType: !29, size: 16, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !275, file: !52, line: 665, baseType: !286, size: 384)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !52, line: 593, size: 384, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !52, line: 594, baseType: !14, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !286, file: !52, line: 594, baseType: !22, size: 8, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !52, line: 594, baseType: !22, size: 8, offset: 72)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !286, file: !52, line: 594, baseType: !29, size: 16, offset: 80)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !286, file: !52, line: 594, baseType: !29, size: 16, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !286, file: !52, line: 594, baseType: !29, size: 16, offset: 112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !286, file: !52, line: 595, baseType: !189, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !286, file: !52, line: 596, baseType: !104, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !286, file: !52, line: 597, baseType: !104, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !286, file: !52, line: 598, baseType: !26, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !275, file: !52, line: 666, baseType: !299, size: 192)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !52, line: 573, size: 192, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !52, line: 574, baseType: !14, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !299, file: !52, line: 574, baseType: !22, size: 8, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !52, line: 574, baseType: !22, size: 8, offset: 72)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !299, file: !52, line: 574, baseType: !29, size: 16, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !52, line: 574, baseType: !29, size: 16, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !299, file: !52, line: 574, baseType: !59, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !275, file: !52, line: 667, baseType: !308, size: 192)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !52, line: 604, size: 192, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !52, line: 605, baseType: !14, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !308, file: !52, line: 605, baseType: !22, size: 8, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !52, line: 605, baseType: !22, size: 8, offset: 72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !308, file: !52, line: 605, baseType: !29, size: 16, offset: 80)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !52, line: 605, baseType: !29, size: 16, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !308, file: !52, line: 605, baseType: !55, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !275, file: !52, line: 668, baseType: !317, size: 448)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !52, line: 608, size: 448, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !52, line: 609, baseType: !14, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !317, file: !52, line: 609, baseType: !22, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !52, line: 609, baseType: !22, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !317, file: !52, line: 609, baseType: !29, size: 16, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !52, line: 609, baseType: !29, size: 16, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !317, file: !52, line: 609, baseType: !17, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !317, file: !52, line: 610, baseType: !189, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !317, file: !52, line: 611, baseType: !104, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !317, file: !52, line: 612, baseType: !104, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !317, file: !52, line: 613, baseType: !17, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !275, file: !52, line: 669, baseType: !330, size: 512)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !52, line: 580, size: 512, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !52, line: 581, baseType: !14, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !330, file: !52, line: 581, baseType: !22, size: 8, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !52, line: 581, baseType: !22, size: 8, offset: 72)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !330, file: !52, line: 581, baseType: !29, size: 16, offset: 80)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !330, file: !52, line: 581, baseType: !29, size: 16, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !330, file: !52, line: 581, baseType: !17, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !330, file: !52, line: 582, baseType: !59, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !330, file: !52, line: 583, baseType: !59, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !330, file: !52, line: 584, baseType: !154, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !330, file: !52, line: 585, baseType: !14, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !330, file: !52, line: 586, baseType: !17, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !275, file: !52, line: 670, baseType: !344, size: 320)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !52, line: 620, size: 320, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !52, line: 621, baseType: !14, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !344, file: !52, line: 621, baseType: !22, size: 8, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !52, line: 621, baseType: !22, size: 8, offset: 72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !344, file: !52, line: 621, baseType: !29, size: 16, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !52, line: 621, baseType: !29, size: 16, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !344, file: !52, line: 621, baseType: !22, size: 8, offset: 112)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !344, file: !52, line: 622, baseType: !154, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !344, file: !52, line: 623, baseType: !59, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !344, file: !52, line: 624, baseType: !26, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !275, file: !52, line: 671, baseType: !356, size: 640)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !52, line: 631, size: 640, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !52, line: 632, baseType: !14, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !356, file: !52, line: 632, baseType: !22, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !52, line: 632, baseType: !22, size: 8, offset: 72)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !356, file: !52, line: 632, baseType: !29, size: 16, offset: 80)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !52, line: 632, baseType: !29, size: 16, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !356, file: !52, line: 633, baseType: !364, size: 512, offset: 128)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 512, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !275, file: !52, line: 672, baseType: !368, size: 320)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !52, line: 654, size: 320, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !52, line: 655, baseType: !14, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !368, file: !52, line: 655, baseType: !22, size: 8, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !368, file: !52, line: 655, baseType: !22, size: 8, offset: 72)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !368, file: !52, line: 655, baseType: !29, size: 16, offset: 80)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !368, file: !52, line: 655, baseType: !29, size: 16, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !368, file: !52, line: 655, baseType: !22, size: 8, offset: 112)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !368, file: !52, line: 656, baseType: !55, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !368, file: !52, line: 657, baseType: !59, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !368, file: !52, line: 658, baseType: !379, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !52, line: 645, size: 128, elements: !381)
!381 = !{!382, !388}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !380, file: !52, line: 646, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !16, line: 1052, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387, !17, !14}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !16, line: 424, baseType: !14)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !380, file: !52, line: 647, baseType: !14, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !181, file: !52, line: 902, baseType: !189, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !181, file: !52, line: 903, baseType: !17, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !155, file: !156, line: 61, baseType: !17, size: 32, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !155, file: !156, line: 62, baseType: !17, size: 32, offset: 1120)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !155, file: !156, line: 63, baseType: !29, size: 16, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !155, file: !156, line: 64, baseType: !22, size: 8, offset: 1168)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !155, file: !156, line: 66, baseType: !396, size: 2688, offset: 1216)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 2688, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 7)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !155, file: !156, line: 67, baseType: !400, size: 3072, offset: 3904)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 3072, elements: !365)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !155, file: !156, line: 68, baseType: !402, size: 576, offset: 6976)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 576, elements: !39)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !155, file: !156, line: 69, baseType: !119, size: 64, offset: 7552)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !155, file: !156, line: 71, baseType: !104, size: 64, offset: 7616)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !155, file: !156, line: 72, baseType: !119, size: 64, offset: 7680)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !155, file: !156, line: 73, baseType: !274, size: 64, offset: 7744)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !155, file: !156, line: 74, baseType: !55, size: 64, offset: 7808)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !155, file: !156, line: 75, baseType: !59, size: 64, offset: 7872)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !155, file: !156, line: 76, baseType: !55, size: 64, offset: 7936)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !155, file: !156, line: 77, baseType: !189, size: 64, offset: 8000)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !155, file: !156, line: 78, baseType: !59, size: 64, offset: 8064)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !155, file: !156, line: 79, baseType: !55, size: 64, offset: 8128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !155, file: !156, line: 80, baseType: !93, size: 64, offset: 8192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !155, file: !156, line: 81, baseType: !189, size: 64, offset: 8256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !155, file: !156, line: 82, baseType: !416, size: 64, offset: 8320)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !52, line: 702, size: 128, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !418, file: !52, line: 706, baseType: !17, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !418, file: !52, line: 707, baseType: !17, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !418, file: !52, line: 708, baseType: !29, size: 16, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !418, file: !52, line: 709, baseType: !22, size: 8, offset: 80)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !418, file: !52, line: 710, baseType: !22, size: 8, offset: 88)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !52, line: 711, baseType: !22, size: 8, offset: 96)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !155, file: !156, line: 83, baseType: !189, size: 64, offset: 8384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !155, file: !156, line: 84, baseType: !59, size: 64, offset: 8448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !155, file: !156, line: 85, baseType: !274, size: 64, offset: 8512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !155, file: !156, line: 86, baseType: !59, size: 64, offset: 8576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !155, file: !156, line: 87, baseType: !274, size: 64, offset: 8640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !155, file: !156, line: 88, baseType: !189, size: 64, offset: 8704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !155, file: !156, line: 89, baseType: !189, size: 64, offset: 8768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !155, file: !156, line: 90, baseType: !434, size: 64, offset: 8832)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !155, file: !156, line: 91, baseType: !436, size: 64, offset: 8896)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !52, line: 637, baseType: !437)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{!15, !154, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !155, file: !156, line: 92, baseType: !442, size: 64, offset: 8960)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !52, line: 641, baseType: !151)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !147, file: !61, line: 152, baseType: !59, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !133, file: !61, line: 155, baseType: !17, size: 32, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !133, file: !61, line: 156, baseType: !166, size: 16, offset: 416)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !133, file: !61, line: 157, baseType: !22, size: 8, offset: 432)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !60, file: !61, line: 375, baseType: !448, size: 576)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !61, line: 122, size: 576, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !448, file: !61, line: 123, baseType: !59, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !448, file: !61, line: 123, baseType: !22, size: 8, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !61, line: 123, baseType: !22, size: 8, offset: 72)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !448, file: !61, line: 123, baseType: !29, size: 16, offset: 80)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !448, file: !61, line: 123, baseType: !22, size: 8, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !448, file: !61, line: 123, baseType: !22, size: 8, offset: 104)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !448, file: !61, line: 124, baseType: !29, size: 16, offset: 112)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !448, file: !61, line: 125, baseType: !14, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !448, file: !61, line: 126, baseType: !26, size: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !448, file: !61, line: 127, baseType: !434, size: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !448, file: !61, line: 128, baseType: !59, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !61, line: 129, baseType: !59, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !448, file: !61, line: 130, baseType: !55, size: 64, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !448, file: !61, line: 131, baseType: !22, size: 8, offset: 512)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !60, file: !61, line: 376, baseType: !465, size: 448)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !61, line: 134, size: 448, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !478}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !465, file: !61, line: 135, baseType: !59, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !465, file: !61, line: 135, baseType: !22, size: 8, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !61, line: 135, baseType: !22, size: 8, offset: 72)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !465, file: !61, line: 135, baseType: !29, size: 16, offset: 80)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !61, line: 135, baseType: !22, size: 8, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !465, file: !61, line: 135, baseType: !22, size: 8, offset: 104)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !465, file: !61, line: 136, baseType: !55, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !465, file: !61, line: 137, baseType: !59, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !465, file: !61, line: 138, baseType: !59, size: 64, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !465, file: !61, line: 139, baseType: !477, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !16, line: 129, baseType: !26)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !465, file: !61, line: 140, baseType: !17, size: 32, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !60, file: !61, line: 377, baseType: !480, size: 320)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !61, line: 184, size: 320, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !491}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !480, file: !61, line: 185, baseType: !59, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !480, file: !61, line: 185, baseType: !22, size: 8, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !61, line: 185, baseType: !22, size: 8, offset: 72)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !480, file: !61, line: 185, baseType: !29, size: 16, offset: 80)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !480, file: !61, line: 185, baseType: !22, size: 8, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !480, file: !61, line: 185, baseType: !488, size: 128, offset: 128)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 128, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !480, file: !61, line: 185, baseType: !59, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !60, file: !61, line: 378, baseType: !493, size: 384)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !61, line: 187, size: 384, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !493, file: !61, line: 188, baseType: !59, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !493, file: !61, line: 188, baseType: !22, size: 8, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !61, line: 188, baseType: !22, size: 8, offset: 72)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !493, file: !61, line: 188, baseType: !29, size: 16, offset: 80)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !61, line: 188, baseType: !22, size: 8, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !493, file: !61, line: 189, baseType: !488, size: 128, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !493, file: !61, line: 189, baseType: !59, size: 64, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !493, file: !61, line: 189, baseType: !50, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !60, file: !61, line: 379, baseType: !504, size: 384)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !61, line: 192, size: 384, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !504, file: !61, line: 193, baseType: !59, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !504, file: !61, line: 193, baseType: !22, size: 8, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !504, file: !61, line: 193, baseType: !22, size: 8, offset: 72)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !504, file: !61, line: 193, baseType: !29, size: 16, offset: 80)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !61, line: 193, baseType: !22, size: 8, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !504, file: !61, line: 193, baseType: !488, size: 128, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !504, file: !61, line: 193, baseType: !59, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !504, file: !61, line: 193, baseType: !17, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !504, file: !61, line: 194, baseType: !17, size: 32, offset: 352)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !60, file: !61, line: 380, baseType: !516, size: 384)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !61, line: 197, size: 384, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !516, file: !61, line: 198, baseType: !59, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !516, file: !61, line: 198, baseType: !22, size: 8, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !61, line: 198, baseType: !22, size: 8, offset: 72)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !516, file: !61, line: 198, baseType: !29, size: 16, offset: 80)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !516, file: !61, line: 198, baseType: !22, size: 8, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !516, file: !61, line: 200, baseType: !22, size: 8, offset: 104)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !516, file: !61, line: 201, baseType: !22, size: 8, offset: 112)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !516, file: !61, line: 202, baseType: !488, size: 128, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !516, file: !61, line: 202, baseType: !59, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !516, file: !61, line: 202, baseType: !528, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !16, line: 128, baseType: !26)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !60, file: !61, line: 381, baseType: !530, size: 320)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !61, line: 205, size: 320, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !538}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !530, file: !61, line: 206, baseType: !59, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !530, file: !61, line: 206, baseType: !22, size: 8, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !61, line: 206, baseType: !22, size: 8, offset: 72)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !530, file: !61, line: 206, baseType: !29, size: 16, offset: 80)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !61, line: 206, baseType: !22, size: 8, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !530, file: !61, line: 206, baseType: !488, size: 128, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !530, file: !61, line: 206, baseType: !59, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !60, file: !61, line: 382, baseType: !540, size: 384)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !61, line: 233, size: 384, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !540, file: !61, line: 234, baseType: !59, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 72)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !540, file: !61, line: 234, baseType: !29, size: 16, offset: 80)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 120)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !540, file: !61, line: 234, baseType: !55, size: 64, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !540, file: !61, line: 234, baseType: !17, size: 32, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !540, file: !61, line: 234, baseType: !17, size: 32, offset: 224)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !540, file: !61, line: 234, baseType: !17, size: 32, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !540, file: !61, line: 234, baseType: !22, size: 8, offset: 296)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !540, file: !61, line: 234, baseType: !59, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !60, file: !61, line: 383, baseType: !558, size: 576)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !61, line: 237, size: 576, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !558, file: !61, line: 238, baseType: !59, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 72)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !558, file: !61, line: 238, baseType: !29, size: 16, offset: 80)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 104)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 112)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 120)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !558, file: !61, line: 238, baseType: !55, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !558, file: !61, line: 238, baseType: !17, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !558, file: !61, line: 238, baseType: !17, size: 32, offset: 224)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !558, file: !61, line: 238, baseType: !17, size: 32, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 288)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !558, file: !61, line: 238, baseType: !22, size: 8, offset: 296)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !558, file: !61, line: 238, baseType: !29, size: 16, offset: 304)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !558, file: !61, line: 239, baseType: !59, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !558, file: !61, line: 240, baseType: !104, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !558, file: !61, line: 241, baseType: !29, size: 16, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !558, file: !61, line: 242, baseType: !104, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !60, file: !61, line: 384, baseType: !580, size: 384)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !61, line: 262, size: 384, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !580, file: !61, line: 263, baseType: !59, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 72)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !580, file: !61, line: 263, baseType: !29, size: 16, offset: 80)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 104)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 112)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 120)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !580, file: !61, line: 263, baseType: !55, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !580, file: !61, line: 263, baseType: !17, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !580, file: !61, line: 263, baseType: !17, size: 32, offset: 224)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !580, file: !61, line: 263, baseType: !17, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 296)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !580, file: !61, line: 263, baseType: !22, size: 8, offset: 304)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !580, file: !61, line: 264, baseType: !59, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !60, file: !61, line: 385, baseType: !599, size: 448)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !61, line: 245, size: 448, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !599, file: !61, line: 246, baseType: !59, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 72)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !599, file: !61, line: 246, baseType: !29, size: 16, offset: 80)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 104)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 112)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 120)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !599, file: !61, line: 246, baseType: !55, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !599, file: !61, line: 246, baseType: !17, size: 32, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !599, file: !61, line: 246, baseType: !17, size: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !599, file: !61, line: 246, baseType: !17, size: 32, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 288)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !599, file: !61, line: 246, baseType: !22, size: 8, offset: 296)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !599, file: !61, line: 246, baseType: !59, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !599, file: !61, line: 247, baseType: !59, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !60, file: !61, line: 386, baseType: !618, size: 448)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !61, line: 250, size: 448, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !618, file: !61, line: 251, baseType: !59, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 72)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !618, file: !61, line: 251, baseType: !29, size: 16, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 104)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 112)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 120)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !618, file: !61, line: 251, baseType: !55, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !618, file: !61, line: 251, baseType: !17, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !618, file: !61, line: 251, baseType: !17, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !618, file: !61, line: 251, baseType: !17, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !618, file: !61, line: 251, baseType: !22, size: 8, offset: 296)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !618, file: !61, line: 256, baseType: !59, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !618, file: !61, line: 257, baseType: !59, size: 64, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !60, file: !61, line: 387, baseType: !637, size: 512)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !61, line: 273, size: 512, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !637, file: !61, line: 274, baseType: !59, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !637, file: !61, line: 274, baseType: !22, size: 8, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !61, line: 274, baseType: !22, size: 8, offset: 72)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !637, file: !61, line: 274, baseType: !29, size: 16, offset: 80)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !637, file: !61, line: 274, baseType: !22, size: 8, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !637, file: !61, line: 274, baseType: !55, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !637, file: !61, line: 275, baseType: !17, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !637, file: !61, line: 276, baseType: !383, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !637, file: !61, line: 277, baseType: !14, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !61, line: 278, baseType: !488, size: 128, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !60, file: !61, line: 388, baseType: !650, size: 512)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !61, line: 281, size: 512, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !665, !666, !667, !673, !674}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !650, file: !61, line: 282, baseType: !59, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !650, file: !61, line: 282, baseType: !22, size: 8, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !650, file: !61, line: 282, baseType: !22, size: 8, offset: 72)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !650, file: !61, line: 282, baseType: !29, size: 16, offset: 80)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !650, file: !61, line: 282, baseType: !22, size: 8, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !650, file: !61, line: 282, baseType: !22, size: 8, offset: 104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !650, file: !61, line: 283, baseType: !22, size: 8, offset: 112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !650, file: !61, line: 284, baseType: !660, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !16, line: 1084, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!15, !17, !477, !17, !664, !14, !14}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !650, file: !61, line: 285, baseType: !55, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !650, file: !61, line: 286, baseType: !14, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !650, file: !61, line: 287, baseType: !668, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !16, line: 1102, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!15, !387, !17, !14, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !650, file: !61, line: 288, baseType: !59, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !61, line: 289, baseType: !59, size: 64, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !60, file: !61, line: 389, baseType: !676, size: 512)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !61, line: 307, size: 512, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !676, file: !61, line: 308, baseType: !59, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !676, file: !61, line: 308, baseType: !22, size: 8, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !61, line: 308, baseType: !22, size: 8, offset: 72)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !676, file: !61, line: 308, baseType: !29, size: 16, offset: 80)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !61, line: 308, baseType: !22, size: 8, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !676, file: !61, line: 308, baseType: !22, size: 8, offset: 104)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !676, file: !61, line: 309, baseType: !22, size: 8, offset: 112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !676, file: !61, line: 310, baseType: !22, size: 8, offset: 120)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !676, file: !61, line: 311, baseType: !14, size: 64, offset: 128)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !676, file: !61, line: 312, baseType: !55, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !676, file: !61, line: 313, baseType: !119, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !676, file: !61, line: 314, baseType: !104, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !676, file: !61, line: 315, baseType: !104, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !676, file: !61, line: 316, baseType: !17, size: 32, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !60, file: !61, line: 390, baseType: !693, size: 448)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !61, line: 340, size: 448, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !693, file: !61, line: 341, baseType: !59, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !693, file: !61, line: 341, baseType: !22, size: 8, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !693, file: !61, line: 341, baseType: !22, size: 8, offset: 72)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !693, file: !61, line: 341, baseType: !29, size: 16, offset: 80)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !61, line: 341, baseType: !22, size: 8, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !693, file: !61, line: 341, baseType: !55, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !693, file: !61, line: 342, baseType: !55, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !693, file: !61, line: 343, baseType: !14, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !693, file: !61, line: 344, baseType: !104, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !693, file: !61, line: 345, baseType: !17, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !61, line: 391, baseType: !706, size: 256)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !61, line: 350, size: 256, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !718}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !706, file: !61, line: 351, baseType: !59, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !706, file: !61, line: 351, baseType: !22, size: 8, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !61, line: 351, baseType: !22, size: 8, offset: 72)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !706, file: !61, line: 351, baseType: !29, size: 16, offset: 80)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !706, file: !61, line: 351, baseType: !22, size: 8, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !706, file: !61, line: 351, baseType: !714, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !16, line: 1055, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !387, !14}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !706, file: !61, line: 352, baseType: !14, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !60, file: !61, line: 392, baseType: !720, size: 192)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !61, line: 357, size: 192, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !720, file: !61, line: 358, baseType: !59, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !720, file: !61, line: 358, baseType: !22, size: 8, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !61, line: 358, baseType: !22, size: 8, offset: 72)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !720, file: !61, line: 358, baseType: !29, size: 16, offset: 80)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !61, line: 358, baseType: !22, size: 8, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !61, line: 358, baseType: !59, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !60, file: !61, line: 399, baseType: !56, size: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !56, file: !52, line: 135, baseType: !22, size: 8, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !52, line: 136, baseType: !22, size: 8, offset: 72)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !56, file: !52, line: 137, baseType: !29, size: 16, offset: 80)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !56, file: !52, line: 138, baseType: !733, size: 32, offset: 96)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !734, line: 327, size: 32, elements: !735)
!734 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !733, file: !734, line: 328, baseType: !17, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !733, file: !734, line: 329, baseType: !248, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !56, file: !52, line: 139, baseType: !55, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !56, file: !52, line: 140, baseType: !55, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !56, file: !52, line: 141, baseType: !55, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !56, file: !52, line: 142, baseType: !166, size: 16, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !51, file: !52, line: 482, baseType: !50, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !52, line: 483, baseType: !50, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !51, file: !52, line: 484, baseType: !745, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !52, line: 497, size: 256, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !746, file: !52, line: 498, baseType: !745, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !746, file: !52, line: 499, baseType: !745, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !746, file: !52, line: 500, baseType: !50, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !746, file: !52, line: 501, baseType: !17, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !51, file: !52, line: 485, baseType: !753, size: 64, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !52, line: 466, size: 320, elements: !755)
!755 = !{!756, !761, !762, !763, !764, !765, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !754, file: !52, line: 467, baseType: !757, size: 128)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !52, line: 459, size: 128, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !757, file: !52, line: 460, baseType: !22, size: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !757, file: !52, line: 461, baseType: !26, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !754, file: !52, line: 468, baseType: !757, size: 128, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !754, file: !52, line: 469, baseType: !29, size: 16, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !754, file: !52, line: 470, baseType: !22, size: 8, offset: 272)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !754, file: !52, line: 471, baseType: !22, size: 8, offset: 280)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !754, file: !52, line: 472, baseType: !22, size: 8, offset: 288)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !754, file: !52, line: 473, baseType: !22, size: 8, offset: 296)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !51, file: !52, line: 486, baseType: !768, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !52, line: 448, size: 192, elements: !770)
!770 = !{!771, !794, !795, !796, !797, !798}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !769, file: !52, line: 449, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !52, line: 438, size: 64, elements: !773)
!773 = !{!774, !775, !788}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !772, file: !52, line: 439, baseType: !55, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !772, file: !52, line: 440, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !52, line: 419, size: 256, elements: !778)
!778 = !{!779, !784, !785, !786, !787}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !777, file: !52, line: 420, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !16, line: 1049, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!17, !387, !17, !14}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !777, file: !52, line: 421, baseType: !14, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !777, file: !52, line: 422, baseType: !55, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !777, file: !52, line: 423, baseType: !22, size: 8, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !777, file: !52, line: 424, baseType: !22, size: 8, offset: 200)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !772, file: !52, line: 441, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !52, line: 429, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !790, file: !52, line: 430, baseType: !55, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !52, line: 431, baseType: !789, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !769, file: !52, line: 450, baseType: !753, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !52, line: 451, baseType: !22, size: 8, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !769, file: !52, line: 452, baseType: !22, size: 8, offset: 136)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !769, file: !52, line: 453, baseType: !22, size: 8, offset: 144)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !769, file: !52, line: 454, baseType: !22, size: 8, offset: 152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !51, file: !52, line: 487, baseType: !26, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !51, file: !52, line: 488, baseType: !17, size: 32, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !51, file: !52, line: 489, baseType: !29, size: 16, offset: 480)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !51, file: !52, line: 490, baseType: !29, size: 16, offset: 496)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !51, file: !52, line: 491, baseType: !22, size: 8, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !51, file: !52, line: 492, baseType: !22, size: 8, offset: 520)
!805 = !{}
!806 = !DILocalVariable(name: "gpe_block", arg: 1, scope: !47, file: !3, line: 97, type: !50)
!807 = !DILocation(line: 97, column: 66, scope: !47)
!808 = !DILocalVariable(name: "status", scope: !47, file: !3, line: 99, type: !15)
!809 = !DILocation(line: 99, column: 14, scope: !47)
!810 = !DILocalVariable(name: "flags", scope: !47, file: !3, line: 100, type: !34)
!811 = !DILocation(line: 100, column: 17, scope: !47)
!812 = !DILocation(line: 104, column: 11, scope: !47)
!813 = !DILocation(line: 104, column: 9, scope: !47)
!814 = !DILocation(line: 105, column: 6, scope: !815)
!815 = distinct !DILexicalBlock(scope: !47, file: !3, line: 105, column: 6)
!816 = !DILocation(line: 105, column: 6, scope: !47)
!817 = !DILocation(line: 106, column: 3, scope: !818)
!818 = distinct !DILexicalBlock(scope: !815, file: !3, line: 105, column: 28)
!819 = !DILocation(line: 112, column: 32, scope: !47)
!820 = !DILocation(line: 112, column: 43, scope: !47)
!821 = !DILocation(line: 112, column: 56, scope: !47)
!822 = !DILocation(line: 112, column: 6, scope: !47)
!823 = !DILocation(line: 111, column: 9, scope: !47)
!824 = !DILocation(line: 113, column: 6, scope: !825)
!825 = distinct !DILexicalBlock(scope: !47, file: !3, line: 113, column: 6)
!826 = !DILocation(line: 113, column: 6, scope: !47)
!827 = !DILocation(line: 114, column: 3, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !3, line: 113, column: 28)
!829 = !DILocation(line: 117, column: 7, scope: !830)
!830 = distinct !DILexicalBlock(scope: !47, file: !3, line: 117, column: 6)
!831 = !DILocation(line: 117, column: 18, scope: !830)
!832 = !DILocation(line: 117, column: 27, scope: !830)
!833 = !DILocation(line: 117, column: 31, scope: !830)
!834 = !DILocation(line: 117, column: 42, scope: !830)
!835 = !DILocation(line: 117, column: 6, scope: !47)
!836 = !DILocation(line: 121, column: 37, scope: !837)
!837 = distinct !DILexicalBlock(scope: !830, file: !3, line: 117, column: 48)
!838 = !DILocation(line: 121, column: 48, scope: !837)
!839 = !DILocation(line: 121, column: 12, scope: !837)
!840 = !DILocation(line: 121, column: 10, scope: !837)
!841 = !DILocation(line: 122, column: 7, scope: !842)
!842 = distinct !DILexicalBlock(scope: !837, file: !3, line: 122, column: 7)
!843 = !DILocation(line: 122, column: 7, scope: !837)
!844 = !DILocation(line: 123, column: 4, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !3, line: 122, column: 29)
!846 = !DILocation(line: 125, column: 2, scope: !837)
!847 = !DILocation(line: 128, column: 32, scope: !848)
!848 = distinct !DILexicalBlock(scope: !830, file: !3, line: 125, column: 9)
!849 = !DILocation(line: 128, column: 11, scope: !848)
!850 = !DILocation(line: 128, column: 9, scope: !848)
!851 = !DILocation(line: 129, column: 7, scope: !852)
!852 = distinct !DILexicalBlock(scope: !848, file: !3, line: 129, column: 7)
!853 = !DILocation(line: 129, column: 18, scope: !852)
!854 = !DILocation(line: 129, column: 7, scope: !848)
!855 = !DILocation(line: 130, column: 32, scope: !856)
!856 = distinct !DILexicalBlock(scope: !852, file: !3, line: 129, column: 28)
!857 = !DILocation(line: 130, column: 43, scope: !856)
!858 = !DILocation(line: 130, column: 4, scope: !856)
