; ModuleID = '../bcout/drivers/acpi/acpica/evregion.llvm.bc'
source_filename = "drivers/acpi/acpica/evregion.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !42, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !41, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/evregion.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !15, !21, !25, !27, !28, !17, !31, !33, !34}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !16, line: 421, baseType: !17)
!16 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !18, line: 21, baseType: !19)
!18 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !7)
!20 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !16, line: 805, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !18, line: 17, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_name", file: !16, line: 422, baseType: !17)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !16, line: 127, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !18, line: 23, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !30)
!30 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !32, line: 148, baseType: !7)
!32 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_reg_walk_info", file: !36, line: 397, size: 96, elements: !37)
!36 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !35, file: !36, line: 398, baseType: !17, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reg_run_count", scope: !35, file: !36, line: 399, baseType: !17, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !35, file: !36, line: 400, baseType: !21, size: 8, offset: 64)
!41 = !{!0}
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 72, elements: !45)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !{!46}
!46 = !DISubrange(count: 9)
!47 = !{!"rsp"}
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 2}
!51 = !{i32 1, !"Code Model", i32 2}
!52 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!53 = distinct !DISubprogram(name: "acpi_ev_initialize_op_regions", scope: !3, file: !3, line: 43, type: !54, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !56)
!54 = !DISubroutineType(types: !55)
!55 = !{!15}
!56 = !{}
!57 = !DILocalVariable(name: "status", scope: !53, file: !3, line: 45, type: !15)
!58 = !DILocation(line: 45, column: 14, scope: !53)
!59 = !DILocalVariable(name: "i", scope: !53, file: !3, line: 46, type: !17)
!60 = !DILocation(line: 46, column: 6, scope: !53)
!61 = !DILocation(line: 50, column: 11, scope: !53)
!62 = !DILocation(line: 50, column: 9, scope: !53)
!63 = !DILocation(line: 51, column: 6, scope: !64)
!64 = distinct !DILexicalBlock(scope: !53, file: !3, line: 51, column: 6)
!65 = !DILocation(line: 51, column: 6, scope: !53)
!66 = !DILocation(line: 52, column: 3, scope: !67)
!67 = distinct !DILexicalBlock(scope: !64, file: !3, line: 51, column: 28)
!68 = !DILocation(line: 57, column: 9, scope: !69)
!69 = distinct !DILexicalBlock(scope: !53, file: !3, line: 57, column: 2)
!70 = !DILocation(line: 57, column: 7, scope: !69)
!71 = !DILocation(line: 57, column: 14, scope: !72)
!72 = distinct !DILexicalBlock(scope: !69, file: !3, line: 57, column: 2)
!73 = !DILocation(line: 57, column: 16, scope: !72)
!74 = !DILocation(line: 57, column: 2, scope: !69)
!75 = !DILocation(line: 63, column: 35, scope: !76)
!76 = distinct !DILexicalBlock(scope: !77, file: !3, line: 63, column: 7)
!77 = distinct !DILexicalBlock(scope: !72, file: !3, line: 57, column: 48)
!78 = !DILocation(line: 65, column: 8, scope: !76)
!79 = !DILocation(line: 64, column: 7, scope: !76)
!80 = !DILocation(line: 63, column: 7, scope: !76)
!81 = !DILocation(line: 63, column: 7, scope: !77)
!82 = !DILocation(line: 66, column: 32, scope: !83)
!83 = distinct !DILexicalBlock(scope: !76, file: !3, line: 65, column: 13)
!84 = !DILocation(line: 68, column: 12, scope: !83)
!85 = !DILocation(line: 67, column: 11, scope: !83)
!86 = !DILocation(line: 66, column: 4, scope: !83)
!87 = !DILocation(line: 69, column: 3, scope: !83)
!88 = !DILocation(line: 70, column: 2, scope: !77)
!89 = !DILocation(line: 57, column: 44, scope: !72)
!90 = !DILocation(line: 57, column: 2, scope: !72)
!91 = distinct !{!91, !74, !92}
!92 = !DILocation(line: 70, column: 2, scope: !69)
!93 = !DILocation(line: 72, column: 8, scope: !53)
!94 = !DILocation(line: 73, column: 2, scope: !53)
!95 = !DILocation(line: 74, column: 1, scope: !53)
!96 = distinct !DISubprogram(name: "acpi_ev_execute_reg_methods", scope: !3, file: !3, line: 649, type: !97, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !56)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !99, !21, !17}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !36, line: 133, size: 384, elements: !101)
!101 = !{!102, !843, !844, !845, !846, !852, !853, !854, !855}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !100, file: !36, line: 134, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !105, line: 367, size: 576, elements: !106)
!105 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!106 = !{!107, !118, !131, !142, !156, !170, !179, !494, !511, !526, !539, !617, !629, !643, !653, !671, !693, !712, !731, !750, !763, !789, !806, !819, !833, !842}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !104, file: !105, line: 368, baseType: !108, size: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !105, line: 73, size: 128, elements: !109)
!109 = !{!110, !111, !112, !113, !117}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !108, file: !105, line: 74, baseType: !103, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !108, file: !105, line: 74, baseType: !22, size: 8, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !105, line: 74, baseType: !22, size: 8, offset: 72)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !108, file: !105, line: 74, baseType: !114, size: 16, offset: 80)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !18, line: 19, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !20, line: 24, baseType: !116)
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !105, line: 74, baseType: !22, size: 8, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !104, file: !105, line: 369, baseType: !119, size: 192)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !105, line: 76, size: 192, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !130}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !119, file: !105, line: 77, baseType: !103, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !119, file: !105, line: 77, baseType: !22, size: 8, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !105, line: 77, baseType: !22, size: 8, offset: 72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !119, file: !105, line: 77, baseType: !114, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !105, line: 77, baseType: !22, size: 8, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !119, file: !105, line: 77, baseType: !127, size: 24, offset: 104)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 24, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 3)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !119, file: !105, line: 78, baseType: !28, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !104, file: !105, line: 370, baseType: !132, size: 256)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !105, line: 93, size: 256, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !141}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !132, file: !105, line: 94, baseType: !103, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !132, file: !105, line: 94, baseType: !22, size: 8, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !105, line: 94, baseType: !22, size: 8, offset: 72)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !132, file: !105, line: 94, baseType: !114, size: 16, offset: 80)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !132, file: !105, line: 94, baseType: !22, size: 8, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !132, file: !105, line: 94, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !132, file: !105, line: 94, baseType: !17, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !104, file: !105, line: 371, baseType: !143, size: 384)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !105, line: 97, size: 384, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !152, !153, !154, !155}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !143, file: !105, line: 98, baseType: !103, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !143, file: !105, line: 98, baseType: !22, size: 8, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !105, line: 98, baseType: !22, size: 8, offset: 72)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !143, file: !105, line: 98, baseType: !114, size: 16, offset: 80)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !105, line: 98, baseType: !22, size: 8, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !143, file: !105, line: 98, baseType: !151, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !143, file: !105, line: 98, baseType: !17, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !143, file: !105, line: 99, baseType: !17, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !143, file: !105, line: 100, baseType: !151, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !143, file: !105, line: 101, baseType: !99, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !104, file: !105, line: 372, baseType: !157, size: 384)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !105, line: 104, size: 384, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !167, !168, !169}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !157, file: !105, line: 105, baseType: !103, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !157, file: !105, line: 105, baseType: !22, size: 8, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !157, file: !105, line: 105, baseType: !22, size: 8, offset: 72)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !157, file: !105, line: 105, baseType: !114, size: 16, offset: 80)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !105, line: 105, baseType: !22, size: 8, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !157, file: !105, line: 105, baseType: !99, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !157, file: !105, line: 106, baseType: !166, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !157, file: !105, line: 107, baseType: !151, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !157, file: !105, line: 108, baseType: !17, size: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !157, file: !105, line: 109, baseType: !17, size: 32, offset: 352)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !104, file: !105, line: 373, baseType: !171, size: 192)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !105, line: 118, size: 192, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !171, file: !105, line: 119, baseType: !103, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !171, file: !105, line: 119, baseType: !22, size: 8, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !171, file: !105, line: 119, baseType: !22, size: 8, offset: 72)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !171, file: !105, line: 119, baseType: !114, size: 16, offset: 80)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !171, file: !105, line: 119, baseType: !22, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !171, file: !105, line: 119, baseType: !14, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !104, file: !105, line: 374, baseType: !180, size: 448)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !105, line: 143, size: 448, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !491, !492, !493}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !180, file: !105, line: 144, baseType: !103, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !180, file: !105, line: 144, baseType: !22, size: 8, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !105, line: 144, baseType: !22, size: 8, offset: 72)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !180, file: !105, line: 144, baseType: !114, size: 16, offset: 80)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !180, file: !105, line: 144, baseType: !22, size: 8, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !180, file: !105, line: 144, baseType: !22, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !180, file: !105, line: 145, baseType: !22, size: 8, offset: 112)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !180, file: !105, line: 146, baseType: !22, size: 8, offset: 120)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !180, file: !105, line: 147, baseType: !103, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !180, file: !105, line: 148, baseType: !103, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !180, file: !105, line: 149, baseType: !151, size: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !180, file: !105, line: 153, baseType: !194, size: 64, offset: 320)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !180, file: !105, line: 150, size: 64, elements: !195)
!195 = !{!196, !490}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !194, file: !105, line: 151, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !36, line: 248, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!15, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !203, line: 37, size: 9024, elements: !204)
!203 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !438, !439, !440, !441, !442, !446, !448, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !473, !474, !475, !476, !477, !478, !479, !480, !482, !488}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !203, line: 38, baseType: !201, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !202, file: !203, line: 39, baseType: !22, size: 8, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !202, file: !203, line: 40, baseType: !22, size: 8, offset: 72)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !202, file: !203, line: 41, baseType: !114, size: 16, offset: 80)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !202, file: !203, line: 42, baseType: !22, size: 8, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !202, file: !203, line: 43, baseType: !22, size: 8, offset: 104)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !202, file: !203, line: 44, baseType: !22, size: 8, offset: 112)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !202, file: !203, line: 45, baseType: !213, size: 16, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !16, line: 445, baseType: !114)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !202, file: !203, line: 46, baseType: !22, size: 8, offset: 144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !202, file: !203, line: 47, baseType: !22, size: 8, offset: 152)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !202, file: !203, line: 48, baseType: !22, size: 8, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !202, file: !203, line: 49, baseType: !22, size: 8, offset: 168)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !202, file: !203, line: 50, baseType: !22, size: 8, offset: 176)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !202, file: !203, line: 51, baseType: !22, size: 8, offset: 184)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !202, file: !203, line: 52, baseType: !22, size: 8, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !202, file: !203, line: 53, baseType: !22, size: 8, offset: 200)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !202, file: !203, line: 54, baseType: !151, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !202, file: !203, line: 55, baseType: !17, size: 32, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !202, file: !203, line: 56, baseType: !17, size: 32, offset: 352)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !202, file: !203, line: 57, baseType: !17, size: 32, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !202, file: !203, line: 58, baseType: !17, size: 32, offset: 416)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !202, file: !203, line: 60, baseType: !228, size: 640, offset: 448)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !36, line: 893, size: 640, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !319, !320, !436, !437}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !228, file: !36, line: 894, baseType: !151, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !228, file: !36, line: 895, baseType: !151, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !228, file: !36, line: 896, baseType: !151, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !228, file: !36, line: 897, baseType: !151, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !228, file: !36, line: 898, baseType: !151, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !228, file: !36, line: 899, baseType: !236, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !36, line: 875, size: 1600, elements: !238)
!238 = !{!239, !259, !275}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !237, file: !36, line: 876, baseType: !240, size: 448)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !36, line: 828, size: 448, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !258}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !240, file: !36, line: 829, baseType: !236, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !240, file: !36, line: 829, baseType: !22, size: 8, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !240, file: !36, line: 829, baseType: !22, size: 8, offset: 72)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !240, file: !36, line: 829, baseType: !114, size: 16, offset: 80)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !240, file: !36, line: 829, baseType: !151, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !240, file: !36, line: 829, baseType: !236, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !240, file: !36, line: 829, baseType: !99, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !240, file: !36, line: 829, baseType: !250, size: 64, offset: 320)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !36, line: 716, size: 64, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !250, file: !36, line: 717, baseType: !28, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !250, file: !36, line: 718, baseType: !17, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !250, file: !36, line: 719, baseType: !140, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !250, file: !36, line: 720, baseType: !151, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !250, file: !36, line: 721, baseType: !140, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !250, file: !36, line: 722, baseType: !236, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !240, file: !36, line: 829, baseType: !22, size: 8, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !237, file: !36, line: 877, baseType: !260, size: 640)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !36, line: 835, size: 640, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !260, file: !36, line: 836, baseType: !236, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !260, file: !36, line: 836, baseType: !22, size: 8, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !260, file: !36, line: 836, baseType: !22, size: 8, offset: 72)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !260, file: !36, line: 836, baseType: !114, size: 16, offset: 80)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !260, file: !36, line: 836, baseType: !151, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !36, line: 836, baseType: !236, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !260, file: !36, line: 836, baseType: !99, size: 64, offset: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !36, line: 836, baseType: !250, size: 64, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !260, file: !36, line: 836, baseType: !22, size: 8, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !260, file: !36, line: 836, baseType: !140, size: 64, offset: 448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !260, file: !36, line: 837, baseType: !151, size: 64, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !260, file: !36, line: 838, baseType: !17, size: 32, offset: 576)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !36, line: 839, baseType: !17, size: 32, offset: 608)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !237, file: !36, line: 878, baseType: !276, size: 1600)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !36, line: 846, size: 1600, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !276, file: !36, line: 847, baseType: !236, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !276, file: !36, line: 847, baseType: !22, size: 8, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !36, line: 847, baseType: !22, size: 8, offset: 72)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !276, file: !36, line: 847, baseType: !114, size: 16, offset: 80)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !276, file: !36, line: 847, baseType: !151, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !276, file: !36, line: 847, baseType: !236, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !276, file: !36, line: 847, baseType: !99, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !276, file: !36, line: 847, baseType: !250, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !276, file: !36, line: 847, baseType: !22, size: 8, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !276, file: !36, line: 847, baseType: !236, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !276, file: !36, line: 848, baseType: !236, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !276, file: !36, line: 849, baseType: !140, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !276, file: !36, line: 850, baseType: !22, size: 8, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !276, file: !36, line: 851, baseType: !140, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !276, file: !36, line: 852, baseType: !140, size: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !276, file: !36, line: 853, baseType: !140, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !276, file: !36, line: 854, baseType: !295, size: 32, offset: 896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 32, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 4)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !276, file: !36, line: 855, baseType: !17, size: 32, offset: 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !276, file: !36, line: 856, baseType: !17, size: 32, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !276, file: !36, line: 857, baseType: !17, size: 32, offset: 992)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !276, file: !36, line: 858, baseType: !17, size: 32, offset: 1024)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !276, file: !36, line: 859, baseType: !17, size: 32, offset: 1056)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !276, file: !36, line: 860, baseType: !17, size: 32, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !276, file: !36, line: 861, baseType: !17, size: 32, offset: 1120)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !276, file: !36, line: 862, baseType: !17, size: 32, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !276, file: !36, line: 863, baseType: !17, size: 32, offset: 1184)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !276, file: !36, line: 864, baseType: !17, size: 32, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !276, file: !36, line: 865, baseType: !17, size: 32, offset: 1248)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !276, file: !36, line: 866, baseType: !17, size: 32, offset: 1280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !276, file: !36, line: 867, baseType: !17, size: 32, offset: 1312)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !276, file: !36, line: 868, baseType: !114, size: 16, offset: 1344)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !276, file: !36, line: 869, baseType: !22, size: 8, offset: 1360)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !276, file: !36, line: 870, baseType: !22, size: 8, offset: 1368)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !276, file: !36, line: 871, baseType: !22, size: 8, offset: 1376)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !276, file: !36, line: 872, baseType: !316, size: 160, offset: 1384)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 160, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 20)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !228, file: !36, line: 900, baseType: !99, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !228, file: !36, line: 901, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !36, line: 663, size: 640, elements: !323)
!323 = !{!324, !332, !345, !354, !363, !376, !390, !402, !414}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !322, file: !36, line: 664, baseType: !325, size: 128)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !36, line: 567, size: 128, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !36, line: 568, baseType: !14, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !325, file: !36, line: 568, baseType: !22, size: 8, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !36, line: 568, baseType: !22, size: 8, offset: 72)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !36, line: 568, baseType: !114, size: 16, offset: 80)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !325, file: !36, line: 568, baseType: !114, size: 16, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !322, file: !36, line: 665, baseType: !333, size: 384)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !36, line: 593, size: 384, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !36, line: 594, baseType: !14, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !333, file: !36, line: 594, baseType: !22, size: 8, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !333, file: !36, line: 594, baseType: !22, size: 8, offset: 72)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !333, file: !36, line: 594, baseType: !114, size: 16, offset: 80)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !36, line: 594, baseType: !114, size: 16, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !333, file: !36, line: 594, baseType: !114, size: 16, offset: 112)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !333, file: !36, line: 595, baseType: !236, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !333, file: !36, line: 596, baseType: !151, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !333, file: !36, line: 597, baseType: !151, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !333, file: !36, line: 598, baseType: !28, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !322, file: !36, line: 666, baseType: !346, size: 192)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !36, line: 573, size: 192, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !36, line: 574, baseType: !14, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !346, file: !36, line: 574, baseType: !22, size: 8, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !346, file: !36, line: 574, baseType: !22, size: 8, offset: 72)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !346, file: !36, line: 574, baseType: !114, size: 16, offset: 80)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !346, file: !36, line: 574, baseType: !114, size: 16, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !346, file: !36, line: 574, baseType: !103, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !322, file: !36, line: 667, baseType: !355, size: 192)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !36, line: 604, size: 192, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !36, line: 605, baseType: !14, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !355, file: !36, line: 605, baseType: !22, size: 8, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !36, line: 605, baseType: !22, size: 8, offset: 72)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !355, file: !36, line: 605, baseType: !114, size: 16, offset: 80)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !36, line: 605, baseType: !114, size: 16, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !355, file: !36, line: 605, baseType: !99, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !322, file: !36, line: 668, baseType: !364, size: 448)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !36, line: 608, size: 448, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !364, file: !36, line: 609, baseType: !14, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !364, file: !36, line: 609, baseType: !22, size: 8, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !364, file: !36, line: 609, baseType: !22, size: 8, offset: 72)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !364, file: !36, line: 609, baseType: !114, size: 16, offset: 80)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !364, file: !36, line: 609, baseType: !114, size: 16, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !364, file: !36, line: 609, baseType: !17, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !364, file: !36, line: 610, baseType: !236, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !364, file: !36, line: 611, baseType: !151, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !364, file: !36, line: 612, baseType: !151, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !364, file: !36, line: 613, baseType: !17, size: 32, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !322, file: !36, line: 669, baseType: !377, size: 512)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !36, line: 580, size: 512, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !36, line: 581, baseType: !14, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !377, file: !36, line: 581, baseType: !22, size: 8, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !36, line: 581, baseType: !22, size: 8, offset: 72)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !377, file: !36, line: 581, baseType: !114, size: 16, offset: 80)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !36, line: 581, baseType: !114, size: 16, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !377, file: !36, line: 581, baseType: !17, size: 32, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !377, file: !36, line: 582, baseType: !103, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !377, file: !36, line: 583, baseType: !103, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !377, file: !36, line: 584, baseType: !201, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !377, file: !36, line: 585, baseType: !14, size: 64, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !377, file: !36, line: 586, baseType: !17, size: 32, offset: 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !322, file: !36, line: 670, baseType: !391, size: 320)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !36, line: 620, size: 320, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !36, line: 621, baseType: !14, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !391, file: !36, line: 621, baseType: !22, size: 8, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !36, line: 621, baseType: !22, size: 8, offset: 72)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !391, file: !36, line: 621, baseType: !114, size: 16, offset: 80)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !391, file: !36, line: 621, baseType: !114, size: 16, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !391, file: !36, line: 621, baseType: !22, size: 8, offset: 112)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !391, file: !36, line: 622, baseType: !201, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !391, file: !36, line: 623, baseType: !103, size: 64, offset: 192)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !391, file: !36, line: 624, baseType: !28, size: 64, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !322, file: !36, line: 671, baseType: !403, size: 640)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !36, line: 631, size: 640, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !36, line: 632, baseType: !14, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !403, file: !36, line: 632, baseType: !22, size: 8, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !403, file: !36, line: 632, baseType: !22, size: 8, offset: 72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !403, file: !36, line: 632, baseType: !114, size: 16, offset: 80)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !403, file: !36, line: 632, baseType: !114, size: 16, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !403, file: !36, line: 633, baseType: !411, size: 512, offset: 128)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !322, file: !36, line: 672, baseType: !415, size: 320)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !36, line: 654, size: 320, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !415, file: !36, line: 655, baseType: !14, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !415, file: !36, line: 655, baseType: !22, size: 8, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !415, file: !36, line: 655, baseType: !22, size: 8, offset: 72)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !415, file: !36, line: 655, baseType: !114, size: 16, offset: 80)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !415, file: !36, line: 655, baseType: !114, size: 16, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !415, file: !36, line: 655, baseType: !22, size: 8, offset: 112)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !415, file: !36, line: 656, baseType: !99, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !415, file: !36, line: 657, baseType: !103, size: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !415, file: !36, line: 658, baseType: !426, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !36, line: 645, size: 128, elements: !428)
!428 = !{!429, !435}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !427, file: !36, line: 646, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !16, line: 1052, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !434, !17, !14}
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !16, line: 424, baseType: !14)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !427, file: !36, line: 647, baseType: !14, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !228, file: !36, line: 902, baseType: !236, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !228, file: !36, line: 903, baseType: !17, size: 32, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !202, file: !203, line: 61, baseType: !17, size: 32, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !202, file: !203, line: 62, baseType: !17, size: 32, offset: 1120)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !202, file: !203, line: 63, baseType: !114, size: 16, offset: 1152)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !202, file: !203, line: 64, baseType: !22, size: 8, offset: 1168)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !202, file: !203, line: 66, baseType: !443, size: 2688, offset: 1216)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2688, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 7)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !202, file: !203, line: 67, baseType: !447, size: 3072, offset: 3904)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 3072, elements: !412)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !202, file: !203, line: 68, baseType: !449, size: 576, offset: 6976)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 576, elements: !45)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !202, file: !203, line: 69, baseType: !166, size: 64, offset: 7552)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !202, file: !203, line: 71, baseType: !151, size: 64, offset: 7616)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !202, file: !203, line: 72, baseType: !166, size: 64, offset: 7680)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !202, file: !203, line: 73, baseType: !321, size: 64, offset: 7744)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !202, file: !203, line: 74, baseType: !99, size: 64, offset: 7808)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !202, file: !203, line: 75, baseType: !103, size: 64, offset: 7872)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !202, file: !203, line: 76, baseType: !99, size: 64, offset: 7936)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !202, file: !203, line: 77, baseType: !236, size: 64, offset: 8000)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !202, file: !203, line: 78, baseType: !103, size: 64, offset: 8064)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !202, file: !203, line: 79, baseType: !99, size: 64, offset: 8128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !202, file: !203, line: 80, baseType: !140, size: 64, offset: 8192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !202, file: !203, line: 81, baseType: !236, size: 64, offset: 8256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !202, file: !203, line: 82, baseType: !463, size: 64, offset: 8320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !36, line: 702, size: 128, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !465, file: !36, line: 706, baseType: !17, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !465, file: !36, line: 707, baseType: !17, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !36, line: 708, baseType: !114, size: 16, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !465, file: !36, line: 709, baseType: !22, size: 8, offset: 80)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !465, file: !36, line: 710, baseType: !22, size: 8, offset: 88)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !36, line: 711, baseType: !22, size: 8, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !202, file: !203, line: 83, baseType: !236, size: 64, offset: 8384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !202, file: !203, line: 84, baseType: !103, size: 64, offset: 8448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !202, file: !203, line: 85, baseType: !321, size: 64, offset: 8512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !202, file: !203, line: 86, baseType: !103, size: 64, offset: 8576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !202, file: !203, line: 87, baseType: !321, size: 64, offset: 8640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !202, file: !203, line: 88, baseType: !236, size: 64, offset: 8704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !202, file: !203, line: 89, baseType: !236, size: 64, offset: 8768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !202, file: !203, line: 90, baseType: !481, size: 64, offset: 8832)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !202, file: !203, line: 91, baseType: !483, size: 64, offset: 8896)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !36, line: 637, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DISubroutineType(types: !486)
!486 = !{!15, !201, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !202, file: !203, line: 92, baseType: !489, size: 64, offset: 8960)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !36, line: 641, baseType: !198)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !194, file: !105, line: 152, baseType: !103, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !180, file: !105, line: 155, baseType: !17, size: 32, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !180, file: !105, line: 156, baseType: !213, size: 16, offset: 416)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !180, file: !105, line: 157, baseType: !22, size: 8, offset: 432)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !104, file: !105, line: 375, baseType: !495, size: 576)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !105, line: 122, size: 576, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !495, file: !105, line: 123, baseType: !103, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !495, file: !105, line: 123, baseType: !22, size: 8, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !105, line: 123, baseType: !22, size: 8, offset: 72)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !495, file: !105, line: 123, baseType: !114, size: 16, offset: 80)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !105, line: 123, baseType: !22, size: 8, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !495, file: !105, line: 123, baseType: !22, size: 8, offset: 104)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !495, file: !105, line: 124, baseType: !114, size: 16, offset: 112)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !495, file: !105, line: 125, baseType: !14, size: 64, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !495, file: !105, line: 126, baseType: !28, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !495, file: !105, line: 127, baseType: !481, size: 64, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !495, file: !105, line: 128, baseType: !103, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !105, line: 129, baseType: !103, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !495, file: !105, line: 130, baseType: !99, size: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !495, file: !105, line: 131, baseType: !22, size: 8, offset: 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !104, file: !105, line: 376, baseType: !512, size: 448)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !105, line: 134, size: 448, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !525}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !512, file: !105, line: 135, baseType: !103, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !512, file: !105, line: 135, baseType: !22, size: 8, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !105, line: 135, baseType: !22, size: 8, offset: 72)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !512, file: !105, line: 135, baseType: !114, size: 16, offset: 80)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !512, file: !105, line: 135, baseType: !22, size: 8, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !512, file: !105, line: 135, baseType: !22, size: 8, offset: 104)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !512, file: !105, line: 136, baseType: !99, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !512, file: !105, line: 137, baseType: !103, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !105, line: 138, baseType: !103, size: 64, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !512, file: !105, line: 139, baseType: !524, size: 64, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !16, line: 129, baseType: !28)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !512, file: !105, line: 140, baseType: !17, size: 32, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !104, file: !105, line: 377, baseType: !527, size: 320)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !105, line: 184, size: 320, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !538}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !527, file: !105, line: 185, baseType: !103, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !527, file: !105, line: 185, baseType: !22, size: 8, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !105, line: 185, baseType: !22, size: 8, offset: 72)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !527, file: !105, line: 185, baseType: !114, size: 16, offset: 80)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !527, file: !105, line: 185, baseType: !22, size: 8, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !527, file: !105, line: 185, baseType: !535, size: 128, offset: 128)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 2)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !527, file: !105, line: 185, baseType: !103, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !104, file: !105, line: 378, baseType: !540, size: 384)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !105, line: 187, size: 384, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !540, file: !105, line: 188, baseType: !103, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !540, file: !105, line: 188, baseType: !22, size: 8, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !105, line: 188, baseType: !22, size: 8, offset: 72)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !540, file: !105, line: 188, baseType: !114, size: 16, offset: 80)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !105, line: 188, baseType: !22, size: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !540, file: !105, line: 189, baseType: !535, size: 128, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !540, file: !105, line: 189, baseType: !103, size: 64, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !540, file: !105, line: 189, baseType: !550, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !36, line: 480, size: 576, elements: !552)
!552 = !{!553, !554, !555, !556, !564, !579, !611, !612, !613, !614, !615, !616}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !551, file: !36, line: 481, baseType: !99, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !551, file: !36, line: 482, baseType: !550, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !551, file: !36, line: 483, baseType: !550, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !551, file: !36, line: 484, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !36, line: 497, size: 256, elements: !559)
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !558, file: !36, line: 498, baseType: !557, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !36, line: 499, baseType: !557, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !558, file: !36, line: 500, baseType: !550, size: 64, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !558, file: !36, line: 501, baseType: !17, size: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !551, file: !36, line: 485, baseType: !565, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !36, line: 466, size: 320, elements: !567)
!567 = !{!568, !573, !574, !575, !576, !577, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !566, file: !36, line: 467, baseType: !569, size: 128)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !36, line: 459, size: 128, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !569, file: !36, line: 460, baseType: !22, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !569, file: !36, line: 461, baseType: !28, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !566, file: !36, line: 468, baseType: !569, size: 128, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !566, file: !36, line: 469, baseType: !114, size: 16, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !566, file: !36, line: 470, baseType: !22, size: 8, offset: 272)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !566, file: !36, line: 471, baseType: !22, size: 8, offset: 280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !566, file: !36, line: 472, baseType: !22, size: 8, offset: 288)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !566, file: !36, line: 473, baseType: !22, size: 8, offset: 296)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !551, file: !36, line: 486, baseType: !580, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !36, line: 448, size: 192, elements: !582)
!582 = !{!583, !606, !607, !608, !609, !610}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !581, file: !36, line: 449, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !36, line: 438, size: 64, elements: !585)
!585 = !{!586, !587, !600}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !584, file: !36, line: 439, baseType: !99, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !584, file: !36, line: 440, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !36, line: 419, size: 256, elements: !590)
!590 = !{!591, !596, !597, !598, !599}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !589, file: !36, line: 420, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !16, line: 1049, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!17, !434, !17, !14}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !589, file: !36, line: 421, baseType: !14, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !589, file: !36, line: 422, baseType: !99, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !589, file: !36, line: 423, baseType: !22, size: 8, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !589, file: !36, line: 424, baseType: !22, size: 8, offset: 200)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !584, file: !36, line: 441, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !36, line: 429, size: 128, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !602, file: !36, line: 430, baseType: !99, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !36, line: 431, baseType: !601, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !581, file: !36, line: 450, baseType: !565, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !581, file: !36, line: 451, baseType: !22, size: 8, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !581, file: !36, line: 452, baseType: !22, size: 8, offset: 136)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !581, file: !36, line: 453, baseType: !22, size: 8, offset: 144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !581, file: !36, line: 454, baseType: !22, size: 8, offset: 152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !551, file: !36, line: 487, baseType: !28, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !551, file: !36, line: 488, baseType: !17, size: 32, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !551, file: !36, line: 489, baseType: !114, size: 16, offset: 480)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !551, file: !36, line: 490, baseType: !114, size: 16, offset: 496)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !551, file: !36, line: 491, baseType: !22, size: 8, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !551, file: !36, line: 492, baseType: !22, size: 8, offset: 520)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !104, file: !105, line: 379, baseType: !618, size: 384)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !105, line: 192, size: 384, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !618, file: !105, line: 193, baseType: !103, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !618, file: !105, line: 193, baseType: !22, size: 8, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !618, file: !105, line: 193, baseType: !22, size: 8, offset: 72)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !618, file: !105, line: 193, baseType: !114, size: 16, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !105, line: 193, baseType: !22, size: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !618, file: !105, line: 193, baseType: !535, size: 128, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !618, file: !105, line: 193, baseType: !103, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !618, file: !105, line: 193, baseType: !17, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !618, file: !105, line: 194, baseType: !17, size: 32, offset: 352)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !104, file: !105, line: 380, baseType: !630, size: 384)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !105, line: 197, size: 384, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !630, file: !105, line: 198, baseType: !103, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !630, file: !105, line: 198, baseType: !22, size: 8, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !105, line: 198, baseType: !22, size: 8, offset: 72)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !630, file: !105, line: 198, baseType: !114, size: 16, offset: 80)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !105, line: 198, baseType: !22, size: 8, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !630, file: !105, line: 200, baseType: !22, size: 8, offset: 104)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !630, file: !105, line: 201, baseType: !22, size: 8, offset: 112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !630, file: !105, line: 202, baseType: !535, size: 128, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !630, file: !105, line: 202, baseType: !103, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !630, file: !105, line: 202, baseType: !642, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !16, line: 128, baseType: !28)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !104, file: !105, line: 381, baseType: !644, size: 320)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !105, line: 205, size: 320, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !644, file: !105, line: 206, baseType: !103, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !644, file: !105, line: 206, baseType: !22, size: 8, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !105, line: 206, baseType: !22, size: 8, offset: 72)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !644, file: !105, line: 206, baseType: !114, size: 16, offset: 80)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !644, file: !105, line: 206, baseType: !22, size: 8, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !644, file: !105, line: 206, baseType: !535, size: 128, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !644, file: !105, line: 206, baseType: !103, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !104, file: !105, line: 382, baseType: !654, size: 384)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !105, line: 233, size: 384, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !654, file: !105, line: 234, baseType: !103, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 72)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !654, file: !105, line: 234, baseType: !114, size: 16, offset: 80)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 104)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 112)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 120)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !654, file: !105, line: 234, baseType: !99, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !654, file: !105, line: 234, baseType: !17, size: 32, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !654, file: !105, line: 234, baseType: !17, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !654, file: !105, line: 234, baseType: !17, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !654, file: !105, line: 234, baseType: !22, size: 8, offset: 296)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !654, file: !105, line: 234, baseType: !103, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !104, file: !105, line: 383, baseType: !672, size: 576)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !105, line: 237, size: 576, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !672, file: !105, line: 238, baseType: !103, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 72)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !672, file: !105, line: 238, baseType: !114, size: 16, offset: 80)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 104)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 112)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 120)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !672, file: !105, line: 238, baseType: !99, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !672, file: !105, line: 238, baseType: !17, size: 32, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !672, file: !105, line: 238, baseType: !17, size: 32, offset: 224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !672, file: !105, line: 238, baseType: !17, size: 32, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !672, file: !105, line: 238, baseType: !22, size: 8, offset: 296)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !672, file: !105, line: 238, baseType: !114, size: 16, offset: 304)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !672, file: !105, line: 239, baseType: !103, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !672, file: !105, line: 240, baseType: !151, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !672, file: !105, line: 241, baseType: !114, size: 16, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !672, file: !105, line: 242, baseType: !151, size: 64, offset: 512)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !104, file: !105, line: 384, baseType: !694, size: 384)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !105, line: 262, size: 384, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !694, file: !105, line: 263, baseType: !103, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 72)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !694, file: !105, line: 263, baseType: !114, size: 16, offset: 80)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 104)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 120)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !694, file: !105, line: 263, baseType: !99, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !694, file: !105, line: 263, baseType: !17, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !694, file: !105, line: 263, baseType: !17, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !694, file: !105, line: 263, baseType: !17, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 296)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !694, file: !105, line: 263, baseType: !22, size: 8, offset: 304)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !694, file: !105, line: 264, baseType: !103, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !104, file: !105, line: 385, baseType: !713, size: 448)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !105, line: 245, size: 448, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !713, file: !105, line: 246, baseType: !103, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 72)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !713, file: !105, line: 246, baseType: !114, size: 16, offset: 80)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 104)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 120)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !713, file: !105, line: 246, baseType: !99, size: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !713, file: !105, line: 246, baseType: !17, size: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !713, file: !105, line: 246, baseType: !17, size: 32, offset: 224)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !713, file: !105, line: 246, baseType: !17, size: 32, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 288)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !713, file: !105, line: 246, baseType: !22, size: 8, offset: 296)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !713, file: !105, line: 246, baseType: !103, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !713, file: !105, line: 247, baseType: !103, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !104, file: !105, line: 386, baseType: !732, size: 448)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !105, line: 250, size: 448, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !732, file: !105, line: 251, baseType: !103, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 72)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !732, file: !105, line: 251, baseType: !114, size: 16, offset: 80)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 104)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 112)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 120)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !732, file: !105, line: 251, baseType: !99, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !732, file: !105, line: 251, baseType: !17, size: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !732, file: !105, line: 251, baseType: !17, size: 32, offset: 224)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !732, file: !105, line: 251, baseType: !17, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !732, file: !105, line: 251, baseType: !22, size: 8, offset: 296)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !732, file: !105, line: 256, baseType: !103, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !732, file: !105, line: 257, baseType: !103, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !104, file: !105, line: 387, baseType: !751, size: 512)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !105, line: 273, size: 512, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !751, file: !105, line: 274, baseType: !103, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !751, file: !105, line: 274, baseType: !22, size: 8, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !105, line: 274, baseType: !22, size: 8, offset: 72)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !751, file: !105, line: 274, baseType: !114, size: 16, offset: 80)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !751, file: !105, line: 274, baseType: !22, size: 8, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !751, file: !105, line: 274, baseType: !99, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !751, file: !105, line: 275, baseType: !17, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !751, file: !105, line: 276, baseType: !430, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !751, file: !105, line: 277, baseType: !14, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !751, file: !105, line: 278, baseType: !535, size: 128, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !104, file: !105, line: 388, baseType: !764, size: 512)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !105, line: 281, size: 512, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !779, !780, !781, !787, !788}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !764, file: !105, line: 282, baseType: !103, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !764, file: !105, line: 282, baseType: !22, size: 8, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !105, line: 282, baseType: !22, size: 8, offset: 72)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !764, file: !105, line: 282, baseType: !114, size: 16, offset: 80)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !105, line: 282, baseType: !22, size: 8, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !764, file: !105, line: 282, baseType: !22, size: 8, offset: 104)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !764, file: !105, line: 283, baseType: !22, size: 8, offset: 112)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !764, file: !105, line: 284, baseType: !774, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !16, line: 1084, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DISubroutineType(types: !777)
!777 = !{!15, !17, !524, !17, !778, !14, !14}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !764, file: !105, line: 285, baseType: !99, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !764, file: !105, line: 286, baseType: !14, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !764, file: !105, line: 287, baseType: !782, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !16, line: 1102, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!15, !434, !17, !14, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !764, file: !105, line: 288, baseType: !103, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !105, line: 289, baseType: !103, size: 64, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !104, file: !105, line: 389, baseType: !790, size: 512)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !105, line: 307, size: 512, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !790, file: !105, line: 308, baseType: !103, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !790, file: !105, line: 308, baseType: !22, size: 8, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !790, file: !105, line: 308, baseType: !22, size: 8, offset: 72)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !790, file: !105, line: 308, baseType: !114, size: 16, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !105, line: 308, baseType: !22, size: 8, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !790, file: !105, line: 308, baseType: !22, size: 8, offset: 104)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !790, file: !105, line: 309, baseType: !22, size: 8, offset: 112)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !790, file: !105, line: 310, baseType: !22, size: 8, offset: 120)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !790, file: !105, line: 311, baseType: !14, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !790, file: !105, line: 312, baseType: !99, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !790, file: !105, line: 313, baseType: !166, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !790, file: !105, line: 314, baseType: !151, size: 64, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !790, file: !105, line: 315, baseType: !151, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !790, file: !105, line: 316, baseType: !17, size: 32, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !104, file: !105, line: 390, baseType: !807, size: 448)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !105, line: 340, size: 448, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !807, file: !105, line: 341, baseType: !103, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !807, file: !105, line: 341, baseType: !22, size: 8, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !105, line: 341, baseType: !22, size: 8, offset: 72)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !807, file: !105, line: 341, baseType: !114, size: 16, offset: 80)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !105, line: 341, baseType: !22, size: 8, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !807, file: !105, line: 341, baseType: !99, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !807, file: !105, line: 342, baseType: !99, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !807, file: !105, line: 343, baseType: !14, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !807, file: !105, line: 344, baseType: !151, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !807, file: !105, line: 345, baseType: !17, size: 32, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !105, line: 391, baseType: !820, size: 256)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !105, line: 350, size: 256, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !832}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !820, file: !105, line: 351, baseType: !103, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !820, file: !105, line: 351, baseType: !22, size: 8, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !820, file: !105, line: 351, baseType: !22, size: 8, offset: 72)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !820, file: !105, line: 351, baseType: !114, size: 16, offset: 80)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !820, file: !105, line: 351, baseType: !22, size: 8, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !820, file: !105, line: 351, baseType: !828, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !16, line: 1055, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !434, !14}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !820, file: !105, line: 352, baseType: !14, size: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !104, file: !105, line: 392, baseType: !834, size: 192)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !105, line: 357, size: 192, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !834, file: !105, line: 358, baseType: !103, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !834, file: !105, line: 358, baseType: !22, size: 8, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !834, file: !105, line: 358, baseType: !22, size: 8, offset: 72)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !834, file: !105, line: 358, baseType: !114, size: 16, offset: 80)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !834, file: !105, line: 358, baseType: !22, size: 8, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !105, line: 358, baseType: !103, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !104, file: !105, line: 399, baseType: !100, size: 384)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !100, file: !36, line: 135, baseType: !22, size: 8, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !36, line: 136, baseType: !22, size: 8, offset: 72)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !36, line: 137, baseType: !114, size: 16, offset: 80)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !36, line: 138, baseType: !847, size: 32, offset: 96)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !848, line: 327, size: 32, elements: !849)
!848 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !847, file: !848, line: 328, baseType: !17, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !847, file: !848, line: 329, baseType: !295, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !100, file: !36, line: 139, baseType: !99, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !100, file: !36, line: 140, baseType: !99, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !100, file: !36, line: 141, baseType: !99, size: 64, offset: 256)
