; ModuleID = '../bcout/drivers/acpi/acpica/evxface.llvm.bc'
source_filename = "drivers/acpi/acpica/evxface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_global_notify_handler = type { void (i8*, i32, i8*)*, i8* }
%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.acpi_sci_handler_info = type { %struct.acpi_sci_handler_info*, i32 (i8*)*, i8* }
%struct.acpi_fixed_event_handler = type { i32 (i8*)*, i8* }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 19, type: !1923, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !1922, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/evxface.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13, !18}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !14, line: 65, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "./include/linux/hrtimer.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17}
!16 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !19, line: 16, baseType: !7, size: 32, elements: !20)
!19 = !DIFile(filename: "./include/linux/restart_block.h", directory: "/home/lizy2001/genbc/linux")
!20 = !{!21, !22, !23}
!21 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!24 = !{!25, !117, !140, !375, !799, !63, !39, !800, !802, !78, !803, !804}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !27, line: 133, size: 384, elements: !28)
!27 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!28 = !{!29, !786, !787, !788, !789, !795, !796, !797, !798}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !26, file: !27, line: 134, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !32, line: 367, size: 576, elements: !33)
!32 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!33 = !{!34, !50, !66, !80, !94, !108, !118, !437, !454, !469, !482, !560, !572, !586, !596, !614, !636, !655, !674, !693, !706, !732, !749, !762, !776, !785}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !31, file: !32, line: 368, baseType: !35, size: 128)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !32, line: 73, size: 128, elements: !36)
!36 = !{!37, !38, !44, !45, !49}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !35, file: !32, line: 74, baseType: !30, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !35, file: !32, line: 74, baseType: !39, size: 8, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !40, line: 17, baseType: !41)
!40 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !42, line: 21, baseType: !43)
!42 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, file: !32, line: 74, baseType: !39, size: 8, offset: 72)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !35, file: !32, line: 74, baseType: !46, size: 16, offset: 80)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !40, line: 19, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !42, line: 24, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !35, file: !32, line: 74, baseType: !39, size: 8, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !31, file: !32, line: 369, baseType: !51, size: 192)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !32, line: 76, size: 192, elements: !52)
!52 = !{!53, !54, !55, !56, !57, !58, !62}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !51, file: !32, line: 77, baseType: !30, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !51, file: !32, line: 77, baseType: !39, size: 8, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !32, line: 77, baseType: !39, size: 8, offset: 72)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !51, file: !32, line: 77, baseType: !46, size: 16, offset: 80)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !32, line: 77, baseType: !39, size: 8, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !51, file: !32, line: 77, baseType: !59, size: 24, offset: 104)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !51, file: !32, line: 78, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !40, line: 23, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !42, line: 31, baseType: !65)
!65 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !31, file: !32, line: 370, baseType: !67, size: 256)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !32, line: 93, size: 256, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !77}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !67, file: !32, line: 94, baseType: !30, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !67, file: !32, line: 94, baseType: !39, size: 8, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !32, line: 94, baseType: !39, size: 8, offset: 72)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !67, file: !32, line: 94, baseType: !46, size: 16, offset: 80)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !32, line: 94, baseType: !39, size: 8, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !67, file: !32, line: 94, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !67, file: !32, line: 94, baseType: !78, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !40, line: 21, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !42, line: 27, baseType: !7)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !31, file: !32, line: 371, baseType: !81, size: 384)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !32, line: 97, size: 384, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !90, !91, !92, !93}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !81, file: !32, line: 98, baseType: !30, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !81, file: !32, line: 98, baseType: !39, size: 8, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !32, line: 98, baseType: !39, size: 8, offset: 72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !81, file: !32, line: 98, baseType: !46, size: 16, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !32, line: 98, baseType: !39, size: 8, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !81, file: !32, line: 98, baseType: !89, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !81, file: !32, line: 98, baseType: !78, size: 32, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !81, file: !32, line: 99, baseType: !78, size: 32, offset: 224)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !81, file: !32, line: 100, baseType: !89, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !81, file: !32, line: 101, baseType: !25, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !31, file: !32, line: 372, baseType: !95, size: 384)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !32, line: 104, size: 384, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !105, !106, !107}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !95, file: !32, line: 105, baseType: !30, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !95, file: !32, line: 105, baseType: !39, size: 8, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !95, file: !32, line: 105, baseType: !39, size: 8, offset: 72)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !95, file: !32, line: 105, baseType: !46, size: 16, offset: 80)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !95, file: !32, line: 105, baseType: !39, size: 8, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !95, file: !32, line: 105, baseType: !25, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !95, file: !32, line: 106, baseType: !104, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !95, file: !32, line: 107, baseType: !89, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !95, file: !32, line: 108, baseType: !78, size: 32, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !95, file: !32, line: 109, baseType: !78, size: 32, offset: 352)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !31, file: !32, line: 373, baseType: !109, size: 192)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !32, line: 118, size: 192, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !109, file: !32, line: 119, baseType: !30, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !109, file: !32, line: 119, baseType: !39, size: 8, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !32, line: 119, baseType: !39, size: 8, offset: 72)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !109, file: !32, line: 119, baseType: !46, size: 16, offset: 80)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !32, line: 119, baseType: !39, size: 8, offset: 96)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !109, file: !32, line: 119, baseType: !117, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !31, file: !32, line: 374, baseType: !119, size: 448)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !32, line: 143, size: 448, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !434, !435, !436}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !119, file: !32, line: 144, baseType: !30, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !119, file: !32, line: 144, baseType: !39, size: 8, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !32, line: 144, baseType: !39, size: 8, offset: 72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !119, file: !32, line: 144, baseType: !46, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !32, line: 144, baseType: !39, size: 8, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !119, file: !32, line: 144, baseType: !39, size: 8, offset: 104)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !119, file: !32, line: 145, baseType: !39, size: 8, offset: 112)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !119, file: !32, line: 146, baseType: !39, size: 8, offset: 120)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !119, file: !32, line: 147, baseType: !30, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !119, file: !32, line: 148, baseType: !30, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !119, file: !32, line: 149, baseType: !89, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !119, file: !32, line: 153, baseType: !133, size: 64, offset: 320)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !119, file: !32, line: 150, size: 64, elements: !134)
!134 = !{!135, !433}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !133, file: !32, line: 151, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !27, line: 248, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !142}
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !141, line: 421, baseType: !78)
!141 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !144, line: 37, size: 9024, elements: !145)
!144 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !379, !380, !381, !382, !383, !387, !389, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !416, !417, !418, !419, !420, !421, !422, !423, !425, !431}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !143, file: !144, line: 38, baseType: !142, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !143, file: !144, line: 39, baseType: !39, size: 8, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !143, file: !144, line: 40, baseType: !39, size: 8, offset: 72)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !143, file: !144, line: 41, baseType: !46, size: 16, offset: 80)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !143, file: !144, line: 42, baseType: !39, size: 8, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !143, file: !144, line: 43, baseType: !39, size: 8, offset: 104)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !143, file: !144, line: 44, baseType: !39, size: 8, offset: 112)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !143, file: !144, line: 45, baseType: !154, size: 16, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !141, line: 445, baseType: !46)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !143, file: !144, line: 46, baseType: !39, size: 8, offset: 144)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !143, file: !144, line: 47, baseType: !39, size: 8, offset: 152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !143, file: !144, line: 48, baseType: !39, size: 8, offset: 160)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !143, file: !144, line: 49, baseType: !39, size: 8, offset: 168)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !143, file: !144, line: 50, baseType: !39, size: 8, offset: 176)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !143, file: !144, line: 51, baseType: !39, size: 8, offset: 184)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !143, file: !144, line: 52, baseType: !39, size: 8, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !143, file: !144, line: 53, baseType: !39, size: 8, offset: 200)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !143, file: !144, line: 54, baseType: !89, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !143, file: !144, line: 55, baseType: !78, size: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !143, file: !144, line: 56, baseType: !78, size: 32, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !143, file: !144, line: 57, baseType: !78, size: 32, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !143, file: !144, line: 58, baseType: !78, size: 32, offset: 416)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !143, file: !144, line: 60, baseType: !169, size: 640, offset: 448)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !27, line: 893, size: 640, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !260, !261, !377, !378}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !169, file: !27, line: 894, baseType: !89, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !169, file: !27, line: 895, baseType: !89, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !169, file: !27, line: 896, baseType: !89, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !169, file: !27, line: 897, baseType: !89, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !169, file: !27, line: 898, baseType: !89, size: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !169, file: !27, line: 899, baseType: !177, size: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !27, line: 875, size: 1600, elements: !179)
!179 = !{!180, !200, !216}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !178, file: !27, line: 876, baseType: !181, size: 448)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !27, line: 828, size: 448, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !199}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !181, file: !27, line: 829, baseType: !177, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !181, file: !27, line: 829, baseType: !39, size: 8, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !181, file: !27, line: 829, baseType: !39, size: 8, offset: 72)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !181, file: !27, line: 829, baseType: !46, size: 16, offset: 80)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !181, file: !27, line: 829, baseType: !89, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !27, line: 829, baseType: !177, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !181, file: !27, line: 829, baseType: !25, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !181, file: !27, line: 829, baseType: !191, size: 64, offset: 320)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !27, line: 716, size: 64, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !191, file: !27, line: 717, baseType: !63, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !191, file: !27, line: 718, baseType: !78, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !191, file: !27, line: 719, baseType: !75, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !191, file: !27, line: 720, baseType: !89, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !191, file: !27, line: 721, baseType: !75, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !191, file: !27, line: 722, baseType: !177, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !181, file: !27, line: 829, baseType: !39, size: 8, offset: 384)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !178, file: !27, line: 877, baseType: !201, size: 640)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !27, line: 835, size: 640, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !201, file: !27, line: 836, baseType: !177, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !201, file: !27, line: 836, baseType: !39, size: 8, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !201, file: !27, line: 836, baseType: !39, size: 8, offset: 72)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !201, file: !27, line: 836, baseType: !46, size: 16, offset: 80)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !201, file: !27, line: 836, baseType: !89, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !27, line: 836, baseType: !177, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !201, file: !27, line: 836, baseType: !25, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !201, file: !27, line: 836, baseType: !191, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !201, file: !27, line: 836, baseType: !39, size: 8, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !201, file: !27, line: 836, baseType: !75, size: 64, offset: 448)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !201, file: !27, line: 837, baseType: !89, size: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !201, file: !27, line: 838, baseType: !78, size: 32, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !201, file: !27, line: 839, baseType: !78, size: 32, offset: 608)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !178, file: !27, line: 878, baseType: !217, size: 1600)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !27, line: 846, size: 1600, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !217, file: !27, line: 847, baseType: !177, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !217, file: !27, line: 847, baseType: !39, size: 8, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !217, file: !27, line: 847, baseType: !39, size: 8, offset: 72)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !217, file: !27, line: 847, baseType: !46, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !217, file: !27, line: 847, baseType: !89, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !27, line: 847, baseType: !177, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !217, file: !27, line: 847, baseType: !25, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !27, line: 847, baseType: !191, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !217, file: !27, line: 847, baseType: !39, size: 8, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !217, file: !27, line: 847, baseType: !177, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !217, file: !27, line: 848, baseType: !177, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !217, file: !27, line: 849, baseType: !75, size: 64, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !217, file: !27, line: 850, baseType: !39, size: 8, offset: 640)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !217, file: !27, line: 851, baseType: !75, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !217, file: !27, line: 852, baseType: !75, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !217, file: !27, line: 853, baseType: !75, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !217, file: !27, line: 854, baseType: !236, size: 32, offset: 896)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 4)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !217, file: !27, line: 855, baseType: !78, size: 32, offset: 928)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !217, file: !27, line: 856, baseType: !78, size: 32, offset: 960)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !217, file: !27, line: 857, baseType: !78, size: 32, offset: 992)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !217, file: !27, line: 858, baseType: !78, size: 32, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !217, file: !27, line: 859, baseType: !78, size: 32, offset: 1056)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !217, file: !27, line: 860, baseType: !78, size: 32, offset: 1088)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !217, file: !27, line: 861, baseType: !78, size: 32, offset: 1120)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !217, file: !27, line: 862, baseType: !78, size: 32, offset: 1152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !217, file: !27, line: 863, baseType: !78, size: 32, offset: 1184)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !217, file: !27, line: 864, baseType: !78, size: 32, offset: 1216)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !217, file: !27, line: 865, baseType: !78, size: 32, offset: 1248)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !217, file: !27, line: 866, baseType: !78, size: 32, offset: 1280)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !217, file: !27, line: 867, baseType: !78, size: 32, offset: 1312)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !217, file: !27, line: 868, baseType: !46, size: 16, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !217, file: !27, line: 869, baseType: !39, size: 8, offset: 1360)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !217, file: !27, line: 870, baseType: !39, size: 8, offset: 1368)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !217, file: !27, line: 871, baseType: !39, size: 8, offset: 1376)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !217, file: !27, line: 872, baseType: !257, size: 160, offset: 1384)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 20)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !169, file: !27, line: 900, baseType: !25, size: 64, offset: 384)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !169, file: !27, line: 901, baseType: !262, size: 64, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !27, line: 663, size: 640, elements: !264)
!264 = !{!265, !273, !286, !295, !304, !317, !331, !343, !355}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !263, file: !27, line: 664, baseType: !266, size: 128)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !27, line: 567, size: 128, elements: !267)
!267 = !{!268, !269, !270, !271, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !27, line: 568, baseType: !117, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !266, file: !27, line: 568, baseType: !39, size: 8, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !27, line: 568, baseType: !39, size: 8, offset: 72)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !266, file: !27, line: 568, baseType: !46, size: 16, offset: 80)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !27, line: 568, baseType: !46, size: 16, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !263, file: !27, line: 665, baseType: !274, size: 384)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !27, line: 593, size: 384, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !27, line: 594, baseType: !117, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !274, file: !27, line: 594, baseType: !39, size: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !27, line: 594, baseType: !39, size: 8, offset: 72)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !274, file: !27, line: 594, baseType: !46, size: 16, offset: 80)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !27, line: 594, baseType: !46, size: 16, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !274, file: !27, line: 594, baseType: !46, size: 16, offset: 112)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !274, file: !27, line: 595, baseType: !177, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !274, file: !27, line: 596, baseType: !89, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !274, file: !27, line: 597, baseType: !89, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !274, file: !27, line: 598, baseType: !63, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !263, file: !27, line: 666, baseType: !287, size: 192)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !27, line: 573, size: 192, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !27, line: 574, baseType: !117, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !27, line: 574, baseType: !39, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !27, line: 574, baseType: !39, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !27, line: 574, baseType: !46, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !27, line: 574, baseType: !46, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !287, file: !27, line: 574, baseType: !30, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !263, file: !27, line: 667, baseType: !296, size: 192)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !27, line: 604, size: 192, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !27, line: 605, baseType: !117, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !296, file: !27, line: 605, baseType: !39, size: 8, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !27, line: 605, baseType: !39, size: 8, offset: 72)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !27, line: 605, baseType: !46, size: 16, offset: 80)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !27, line: 605, baseType: !46, size: 16, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !296, file: !27, line: 605, baseType: !25, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !263, file: !27, line: 668, baseType: !305, size: 448)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !27, line: 608, size: 448, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !27, line: 609, baseType: !117, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !305, file: !27, line: 609, baseType: !39, size: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !27, line: 609, baseType: !39, size: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !27, line: 609, baseType: !46, size: 16, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !305, file: !27, line: 609, baseType: !46, size: 16, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !305, file: !27, line: 609, baseType: !78, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !305, file: !27, line: 610, baseType: !177, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !305, file: !27, line: 611, baseType: !89, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !305, file: !27, line: 612, baseType: !89, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !305, file: !27, line: 613, baseType: !78, size: 32, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !263, file: !27, line: 669, baseType: !318, size: 512)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !27, line: 580, size: 512, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !27, line: 581, baseType: !117, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !318, file: !27, line: 581, baseType: !39, size: 8, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !27, line: 581, baseType: !39, size: 8, offset: 72)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !27, line: 581, baseType: !46, size: 16, offset: 80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !27, line: 581, baseType: !46, size: 16, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !318, file: !27, line: 581, baseType: !78, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !318, file: !27, line: 582, baseType: !30, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !318, file: !27, line: 583, baseType: !30, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !318, file: !27, line: 584, baseType: !142, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !318, file: !27, line: 585, baseType: !117, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !318, file: !27, line: 586, baseType: !78, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !263, file: !27, line: 670, baseType: !332, size: 320)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !27, line: 620, size: 320, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !27, line: 621, baseType: !117, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !332, file: !27, line: 621, baseType: !39, size: 8, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !332, file: !27, line: 621, baseType: !39, size: 8, offset: 72)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !27, line: 621, baseType: !46, size: 16, offset: 80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !27, line: 621, baseType: !46, size: 16, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !332, file: !27, line: 621, baseType: !39, size: 8, offset: 112)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !332, file: !27, line: 622, baseType: !142, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !332, file: !27, line: 623, baseType: !30, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !332, file: !27, line: 624, baseType: !63, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !263, file: !27, line: 671, baseType: !344, size: 640)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !27, line: 631, size: 640, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !27, line: 632, baseType: !117, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !344, file: !27, line: 632, baseType: !39, size: 8, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !27, line: 632, baseType: !39, size: 8, offset: 72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !344, file: !27, line: 632, baseType: !46, size: 16, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !27, line: 632, baseType: !46, size: 16, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !344, file: !27, line: 633, baseType: !352, size: 512, offset: 128)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !263, file: !27, line: 672, baseType: !356, size: 320)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !27, line: 654, size: 320, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !27, line: 655, baseType: !117, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !356, file: !27, line: 655, baseType: !39, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !27, line: 655, baseType: !39, size: 8, offset: 72)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !356, file: !27, line: 655, baseType: !46, size: 16, offset: 80)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !27, line: 655, baseType: !46, size: 16, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !356, file: !27, line: 655, baseType: !39, size: 8, offset: 112)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !356, file: !27, line: 656, baseType: !25, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !356, file: !27, line: 657, baseType: !30, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !356, file: !27, line: 658, baseType: !367, size: 64, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !27, line: 645, size: 128, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !368, file: !27, line: 646, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !141, line: 1052, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375, !78, !117}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !141, line: 424, baseType: !117)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !368, file: !27, line: 647, baseType: !117, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !169, file: !27, line: 902, baseType: !177, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !169, file: !27, line: 903, baseType: !78, size: 32, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !143, file: !144, line: 61, baseType: !78, size: 32, offset: 1088)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !143, file: !144, line: 62, baseType: !78, size: 32, offset: 1120)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !143, file: !144, line: 63, baseType: !46, size: 16, offset: 1152)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !143, file: !144, line: 64, baseType: !39, size: 8, offset: 1168)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !143, file: !144, line: 66, baseType: !384, size: 2688, offset: 1216)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2688, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 7)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !143, file: !144, line: 67, baseType: !388, size: 3072, offset: 3904)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 3072, elements: !353)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !143, file: !144, line: 68, baseType: !390, size: 576, offset: 6976)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 576, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 9)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !143, file: !144, line: 69, baseType: !104, size: 64, offset: 7552)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !143, file: !144, line: 71, baseType: !89, size: 64, offset: 7616)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !143, file: !144, line: 72, baseType: !104, size: 64, offset: 7680)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !143, file: !144, line: 73, baseType: !262, size: 64, offset: 7744)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !143, file: !144, line: 74, baseType: !25, size: 64, offset: 7808)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !143, file: !144, line: 75, baseType: !30, size: 64, offset: 7872)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !143, file: !144, line: 76, baseType: !25, size: 64, offset: 7936)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !143, file: !144, line: 77, baseType: !177, size: 64, offset: 8000)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !143, file: !144, line: 78, baseType: !30, size: 64, offset: 8064)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !143, file: !144, line: 79, baseType: !25, size: 64, offset: 8128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !143, file: !144, line: 80, baseType: !75, size: 64, offset: 8192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !143, file: !144, line: 81, baseType: !177, size: 64, offset: 8256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !143, file: !144, line: 82, baseType: !406, size: 64, offset: 8320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !27, line: 702, size: 128, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !408, file: !27, line: 706, baseType: !78, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !408, file: !27, line: 707, baseType: !78, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !408, file: !27, line: 708, baseType: !46, size: 16, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !408, file: !27, line: 709, baseType: !39, size: 8, offset: 80)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !408, file: !27, line: 710, baseType: !39, size: 8, offset: 88)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !27, line: 711, baseType: !39, size: 8, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !143, file: !144, line: 83, baseType: !177, size: 64, offset: 8384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !143, file: !144, line: 84, baseType: !30, size: 64, offset: 8448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !143, file: !144, line: 85, baseType: !262, size: 64, offset: 8512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !143, file: !144, line: 86, baseType: !30, size: 64, offset: 8576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !143, file: !144, line: 87, baseType: !262, size: 64, offset: 8640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !143, file: !144, line: 88, baseType: !177, size: 64, offset: 8704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !143, file: !144, line: 89, baseType: !177, size: 64, offset: 8768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !143, file: !144, line: 90, baseType: !424, size: 64, offset: 8832)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !143, file: !144, line: 91, baseType: !426, size: 64, offset: 8896)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !27, line: 637, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!140, !142, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !143, file: !144, line: 92, baseType: !432, size: 64, offset: 8960)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !27, line: 641, baseType: !137)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !133, file: !32, line: 152, baseType: !30, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !119, file: !32, line: 155, baseType: !78, size: 32, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !119, file: !32, line: 156, baseType: !154, size: 16, offset: 416)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !119, file: !32, line: 157, baseType: !39, size: 8, offset: 432)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !31, file: !32, line: 375, baseType: !438, size: 576)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !32, line: 122, size: 576, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !438, file: !32, line: 123, baseType: !30, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !438, file: !32, line: 123, baseType: !39, size: 8, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !438, file: !32, line: 123, baseType: !39, size: 8, offset: 72)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !438, file: !32, line: 123, baseType: !46, size: 16, offset: 80)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !438, file: !32, line: 123, baseType: !39, size: 8, offset: 96)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !438, file: !32, line: 123, baseType: !39, size: 8, offset: 104)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !438, file: !32, line: 124, baseType: !46, size: 16, offset: 112)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !438, file: !32, line: 125, baseType: !117, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !438, file: !32, line: 126, baseType: !63, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !438, file: !32, line: 127, baseType: !424, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !32, line: 128, baseType: !30, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !32, line: 129, baseType: !30, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !438, file: !32, line: 130, baseType: !25, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !438, file: !32, line: 131, baseType: !39, size: 8, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !31, file: !32, line: 376, baseType: !455, size: 448)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !32, line: 134, size: 448, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !468}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !455, file: !32, line: 135, baseType: !30, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !455, file: !32, line: 135, baseType: !39, size: 8, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !455, file: !32, line: 135, baseType: !39, size: 8, offset: 72)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !455, file: !32, line: 135, baseType: !46, size: 16, offset: 80)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !455, file: !32, line: 135, baseType: !39, size: 8, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !455, file: !32, line: 135, baseType: !39, size: 8, offset: 104)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !455, file: !32, line: 136, baseType: !25, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !455, file: !32, line: 137, baseType: !30, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !455, file: !32, line: 138, baseType: !30, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !455, file: !32, line: 139, baseType: !467, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !141, line: 129, baseType: !63)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !455, file: !32, line: 140, baseType: !78, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !31, file: !32, line: 377, baseType: !470, size: 320)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !32, line: 184, size: 320, elements: !471)
!471 = !{!472, !473, !474, !475, !476, !477, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !470, file: !32, line: 185, baseType: !30, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !470, file: !32, line: 185, baseType: !39, size: 8, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !470, file: !32, line: 185, baseType: !39, size: 8, offset: 72)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !470, file: !32, line: 185, baseType: !46, size: 16, offset: 80)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !470, file: !32, line: 185, baseType: !39, size: 8, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !470, file: !32, line: 185, baseType: !478, size: 128, offset: 128)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 2)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !470, file: !32, line: 185, baseType: !30, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !31, file: !32, line: 378, baseType: !483, size: 384)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !32, line: 187, size: 384, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491, !492}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !483, file: !32, line: 188, baseType: !30, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !483, file: !32, line: 188, baseType: !39, size: 8, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !32, line: 188, baseType: !39, size: 8, offset: 72)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !483, file: !32, line: 188, baseType: !46, size: 16, offset: 80)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !32, line: 188, baseType: !39, size: 8, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !483, file: !32, line: 189, baseType: !478, size: 128, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !483, file: !32, line: 189, baseType: !30, size: 64, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !483, file: !32, line: 189, baseType: !493, size: 64, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !27, line: 480, size: 576, elements: !495)
!495 = !{!496, !497, !498, !499, !507, !522, !554, !555, !556, !557, !558, !559}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !494, file: !27, line: 481, baseType: !25, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !494, file: !27, line: 482, baseType: !493, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !27, line: 483, baseType: !493, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !494, file: !27, line: 484, baseType: !500, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !27, line: 497, size: 256, elements: !502)
!502 = !{!503, !504, !505, !506}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !501, file: !27, line: 498, baseType: !500, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !501, file: !27, line: 499, baseType: !500, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !501, file: !27, line: 500, baseType: !493, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !501, file: !27, line: 501, baseType: !78, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !494, file: !27, line: 485, baseType: !508, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !27, line: 466, size: 320, elements: !510)
!510 = !{!511, !516, !517, !518, !519, !520, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !509, file: !27, line: 467, baseType: !512, size: 128)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !27, line: 459, size: 128, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !512, file: !27, line: 460, baseType: !39, size: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !512, file: !27, line: 461, baseType: !63, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !509, file: !27, line: 468, baseType: !512, size: 128, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !509, file: !27, line: 469, baseType: !46, size: 16, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !509, file: !27, line: 470, baseType: !39, size: 8, offset: 272)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !509, file: !27, line: 471, baseType: !39, size: 8, offset: 280)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !509, file: !27, line: 472, baseType: !39, size: 8, offset: 288)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !509, file: !27, line: 473, baseType: !39, size: 8, offset: 296)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !494, file: !27, line: 486, baseType: !523, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !27, line: 448, size: 192, elements: !525)
!525 = !{!526, !549, !550, !551, !552, !553}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !524, file: !27, line: 449, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !27, line: 438, size: 64, elements: !528)
!528 = !{!529, !530, !543}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !527, file: !27, line: 439, baseType: !25, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !527, file: !27, line: 440, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !27, line: 419, size: 256, elements: !533)
!533 = !{!534, !539, !540, !541, !542}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !532, file: !27, line: 420, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !141, line: 1049, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!78, !375, !78, !117}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !532, file: !27, line: 421, baseType: !117, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !532, file: !27, line: 422, baseType: !25, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !532, file: !27, line: 423, baseType: !39, size: 8, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !532, file: !27, line: 424, baseType: !39, size: 8, offset: 200)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !527, file: !27, line: 441, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !27, line: 429, size: 128, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !545, file: !27, line: 430, baseType: !25, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !27, line: 431, baseType: !544, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !524, file: !27, line: 450, baseType: !508, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !524, file: !27, line: 451, baseType: !39, size: 8, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !524, file: !27, line: 452, baseType: !39, size: 8, offset: 136)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !524, file: !27, line: 453, baseType: !39, size: 8, offset: 144)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !524, file: !27, line: 454, baseType: !39, size: 8, offset: 152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !494, file: !27, line: 487, baseType: !63, size: 64, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !494, file: !27, line: 488, baseType: !78, size: 32, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !494, file: !27, line: 489, baseType: !46, size: 16, offset: 480)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !494, file: !27, line: 490, baseType: !46, size: 16, offset: 496)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !494, file: !27, line: 491, baseType: !39, size: 8, offset: 512)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !494, file: !27, line: 492, baseType: !39, size: 8, offset: 520)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !31, file: !32, line: 379, baseType: !561, size: 384)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !32, line: 192, size: 384, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !561, file: !32, line: 193, baseType: !30, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !561, file: !32, line: 193, baseType: !39, size: 8, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !561, file: !32, line: 193, baseType: !39, size: 8, offset: 72)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !561, file: !32, line: 193, baseType: !46, size: 16, offset: 80)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !32, line: 193, baseType: !39, size: 8, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !561, file: !32, line: 193, baseType: !478, size: 128, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !561, file: !32, line: 193, baseType: !30, size: 64, offset: 256)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !561, file: !32, line: 193, baseType: !78, size: 32, offset: 320)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !561, file: !32, line: 194, baseType: !78, size: 32, offset: 352)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !31, file: !32, line: 380, baseType: !573, size: 384)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !32, line: 197, size: 384, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !573, file: !32, line: 198, baseType: !30, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !573, file: !32, line: 198, baseType: !39, size: 8, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !32, line: 198, baseType: !39, size: 8, offset: 72)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !573, file: !32, line: 198, baseType: !46, size: 16, offset: 80)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !573, file: !32, line: 198, baseType: !39, size: 8, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !573, file: !32, line: 200, baseType: !39, size: 8, offset: 104)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !573, file: !32, line: 201, baseType: !39, size: 8, offset: 112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !573, file: !32, line: 202, baseType: !478, size: 128, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !573, file: !32, line: 202, baseType: !30, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !573, file: !32, line: 202, baseType: !585, size: 64, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !141, line: 128, baseType: !63)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !31, file: !32, line: 381, baseType: !587, size: 320)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !32, line: 205, size: 320, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !587, file: !32, line: 206, baseType: !30, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !587, file: !32, line: 206, baseType: !39, size: 8, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !32, line: 206, baseType: !39, size: 8, offset: 72)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !587, file: !32, line: 206, baseType: !46, size: 16, offset: 80)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !32, line: 206, baseType: !39, size: 8, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !587, file: !32, line: 206, baseType: !478, size: 128, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !587, file: !32, line: 206, baseType: !30, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !31, file: !32, line: 382, baseType: !597, size: 384)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !32, line: 233, size: 384, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !597, file: !32, line: 234, baseType: !30, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 72)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !597, file: !32, line: 234, baseType: !46, size: 16, offset: 80)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 104)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 112)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 120)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !597, file: !32, line: 234, baseType: !25, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !597, file: !32, line: 234, baseType: !78, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !597, file: !32, line: 234, baseType: !78, size: 32, offset: 224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !597, file: !32, line: 234, baseType: !78, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !597, file: !32, line: 234, baseType: !39, size: 8, offset: 296)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !597, file: !32, line: 234, baseType: !30, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !31, file: !32, line: 383, baseType: !615, size: 576)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !32, line: 237, size: 576, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !615, file: !32, line: 238, baseType: !30, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 72)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !615, file: !32, line: 238, baseType: !46, size: 16, offset: 80)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 104)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 112)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 120)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !615, file: !32, line: 238, baseType: !25, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !615, file: !32, line: 238, baseType: !78, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !615, file: !32, line: 238, baseType: !78, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !615, file: !32, line: 238, baseType: !78, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !615, file: !32, line: 238, baseType: !39, size: 8, offset: 296)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !615, file: !32, line: 238, baseType: !46, size: 16, offset: 304)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !615, file: !32, line: 239, baseType: !30, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !615, file: !32, line: 240, baseType: !89, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !615, file: !32, line: 241, baseType: !46, size: 16, offset: 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !615, file: !32, line: 242, baseType: !89, size: 64, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !31, file: !32, line: 384, baseType: !637, size: 384)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !32, line: 262, size: 384, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !637, file: !32, line: 263, baseType: !30, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 72)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !637, file: !32, line: 263, baseType: !46, size: 16, offset: 80)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 104)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 120)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !637, file: !32, line: 263, baseType: !25, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !637, file: !32, line: 263, baseType: !78, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !637, file: !32, line: 263, baseType: !78, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !637, file: !32, line: 263, baseType: !78, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 296)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !637, file: !32, line: 263, baseType: !39, size: 8, offset: 304)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !637, file: !32, line: 264, baseType: !30, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !31, file: !32, line: 385, baseType: !656, size: 448)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !32, line: 245, size: 448, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !656, file: !32, line: 246, baseType: !30, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 72)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !656, file: !32, line: 246, baseType: !46, size: 16, offset: 80)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 104)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 120)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !656, file: !32, line: 246, baseType: !25, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !656, file: !32, line: 246, baseType: !78, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !656, file: !32, line: 246, baseType: !78, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !32, line: 246, baseType: !78, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !656, file: !32, line: 246, baseType: !39, size: 8, offset: 296)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !656, file: !32, line: 246, baseType: !30, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !656, file: !32, line: 247, baseType: !30, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !31, file: !32, line: 386, baseType: !675, size: 448)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !32, line: 250, size: 448, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !675, file: !32, line: 251, baseType: !30, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 72)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !675, file: !32, line: 251, baseType: !46, size: 16, offset: 80)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 104)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 120)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !675, file: !32, line: 251, baseType: !25, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !675, file: !32, line: 251, baseType: !78, size: 32, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !675, file: !32, line: 251, baseType: !78, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !675, file: !32, line: 251, baseType: !78, size: 32, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !675, file: !32, line: 251, baseType: !39, size: 8, offset: 296)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !675, file: !32, line: 256, baseType: !30, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !675, file: !32, line: 257, baseType: !30, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !31, file: !32, line: 387, baseType: !694, size: 512)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !32, line: 273, size: 512, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !694, file: !32, line: 274, baseType: !30, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !694, file: !32, line: 274, baseType: !39, size: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !32, line: 274, baseType: !39, size: 8, offset: 72)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !694, file: !32, line: 274, baseType: !46, size: 16, offset: 80)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !32, line: 274, baseType: !39, size: 8, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !694, file: !32, line: 274, baseType: !25, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !694, file: !32, line: 275, baseType: !78, size: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !694, file: !32, line: 276, baseType: !371, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !694, file: !32, line: 277, baseType: !117, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !32, line: 278, baseType: !478, size: 128, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !31, file: !32, line: 388, baseType: !707, size: 512)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !32, line: 281, size: 512, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !722, !723, !724, !730, !731}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !707, file: !32, line: 282, baseType: !30, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !707, file: !32, line: 282, baseType: !39, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !32, line: 282, baseType: !39, size: 8, offset: 72)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !707, file: !32, line: 282, baseType: !46, size: 16, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !32, line: 282, baseType: !39, size: 8, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !707, file: !32, line: 282, baseType: !39, size: 8, offset: 104)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !707, file: !32, line: 283, baseType: !39, size: 8, offset: 112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !707, file: !32, line: 284, baseType: !717, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !141, line: 1084, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!140, !78, !467, !78, !721, !117, !117}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !32, line: 285, baseType: !25, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !707, file: !32, line: 286, baseType: !117, size: 64, offset: 256)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !707, file: !32, line: 287, baseType: !725, size: 64, offset: 320)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !141, line: 1102, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!140, !375, !78, !117, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !707, file: !32, line: 288, baseType: !30, size: 64, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !32, line: 289, baseType: !30, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !31, file: !32, line: 389, baseType: !733, size: 512)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !32, line: 307, size: 512, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !733, file: !32, line: 308, baseType: !30, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !733, file: !32, line: 308, baseType: !39, size: 8, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !733, file: !32, line: 308, baseType: !39, size: 8, offset: 72)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !733, file: !32, line: 308, baseType: !46, size: 16, offset: 80)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !32, line: 308, baseType: !39, size: 8, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !733, file: !32, line: 308, baseType: !39, size: 8, offset: 104)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !733, file: !32, line: 309, baseType: !39, size: 8, offset: 112)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !733, file: !32, line: 310, baseType: !39, size: 8, offset: 120)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !733, file: !32, line: 311, baseType: !117, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !733, file: !32, line: 312, baseType: !25, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !733, file: !32, line: 313, baseType: !104, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !733, file: !32, line: 314, baseType: !89, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !733, file: !32, line: 315, baseType: !89, size: 64, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !733, file: !32, line: 316, baseType: !78, size: 32, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !31, file: !32, line: 390, baseType: !750, size: 448)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !32, line: 340, size: 448, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !750, file: !32, line: 341, baseType: !30, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !750, file: !32, line: 341, baseType: !39, size: 8, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !750, file: !32, line: 341, baseType: !39, size: 8, offset: 72)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !750, file: !32, line: 341, baseType: !46, size: 16, offset: 80)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !750, file: !32, line: 341, baseType: !39, size: 8, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !750, file: !32, line: 341, baseType: !25, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !750, file: !32, line: 342, baseType: !25, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !750, file: !32, line: 343, baseType: !117, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !750, file: !32, line: 344, baseType: !89, size: 64, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !750, file: !32, line: 345, baseType: !78, size: 32, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !31, file: !32, line: 391, baseType: !763, size: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !32, line: 350, size: 256, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !763, file: !32, line: 351, baseType: !30, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !763, file: !32, line: 351, baseType: !39, size: 8, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !32, line: 351, baseType: !39, size: 8, offset: 72)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !763, file: !32, line: 351, baseType: !46, size: 16, offset: 80)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !32, line: 351, baseType: !39, size: 8, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !763, file: !32, line: 351, baseType: !771, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !141, line: 1055, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !375, !117}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !763, file: !32, line: 352, baseType: !117, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !31, file: !32, line: 392, baseType: !777, size: 192)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !32, line: 357, size: 192, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !777, file: !32, line: 358, baseType: !30, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !777, file: !32, line: 358, baseType: !39, size: 8, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !32, line: 358, baseType: !39, size: 8, offset: 72)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !777, file: !32, line: 358, baseType: !46, size: 16, offset: 80)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !777, file: !32, line: 358, baseType: !39, size: 8, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !32, line: 358, baseType: !30, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !31, file: !32, line: 399, baseType: !26, size: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !26, file: !27, line: 135, baseType: !39, size: 8, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !27, line: 136, baseType: !39, size: 8, offset: 72)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !27, line: 137, baseType: !46, size: 16, offset: 80)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !26, file: !27, line: 138, baseType: !790, size: 32, offset: 96)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !791, line: 327, size: 32, elements: !792)
!791 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !790, file: !791, line: 328, baseType: !78, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !790, file: !791, line: 329, baseType: !236, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !26, file: !27, line: 139, baseType: !25, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !26, file: !27, line: 140, baseType: !25, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !26, file: !27, line: 141, baseType: !25, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !26, file: !27, line: 142, baseType: !154, size: 16, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !141, line: 127, baseType: !63)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !801, line: 148, baseType: !7)
!801 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!802 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !806, line: 640, size: 48640, elements: !807)
!806 = !DIFile(filename: "./include/linux/sched.h", directory: "/home/lizy2001/genbc/linux")
!807 = !{!808, !814, !817, !818, !829, !830, !831, !832, !833, !834, !835, !836, !840, !871, !882, !987, !988, !989, !1000, !1001, !1003, !1004, !1222, !1223, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1302, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1358, !1360, !1361, !1362, !1364, !1366, !1367, !1368, !1369, !1370, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1394, !1399, !1403, !1404, !1405, !1408, !1412, !1415, !1418, !1421, !1424, !1427, !1430, !1433, !1439, !1440, !1441, !1447, !1448, !1452, !1453, !1454, !1463, !1464, !1465, !1466, !1467, !1472, !1473, !1474, !1477, !1478, !1481, !1484, !1487, !1490, !1493, !1496, !1497, !1578, !1581, !1584, !1585, !1588, !1589, !1590, !1594, !1595, !1596, !1609, !1610, !1611, !1621, !1626, !1629, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !805, file: !806, line: 646, baseType: !809, size: 128)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !810, line: 56, size: 128, elements: !811)
!810 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/home/lizy2001/genbc/linux")
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !809, file: !810, line: 57, baseType: !802, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !809, file: !810, line: 58, baseType: !78, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !805, file: !806, line: 649, baseType: !815, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !816)
!816 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !805, file: !806, line: 657, baseType: !117, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !805, file: !806, line: 658, baseType: !819, size: 32, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !820, line: 113, baseType: !821)
!820 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !820, line: 111, size: 32, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !821, file: !820, line: 112, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !801, line: 168, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !801, line: 166, size: 32, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !825, file: !801, line: 167, baseType: !828, size: 32)
!828 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !805, file: !806, line: 660, baseType: !7, size: 32, offset: 288)
