; ModuleID = '../bcout/drivers/acpi/acpica/exfldio.llvm.bc'
source_filename = "drivers/acpi/acpica/exfldio.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 18, type: !35, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !34, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/exfldio.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !18, !20, !23, !25, !26, !27, !31, !33}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !15, line: 21, baseType: !16)
!15 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !7)
!17 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !19, line: 421, baseType: !14)
!19 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !15, line: 23, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !22)
!22 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !19, line: 127, baseType: !20)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !19, line: 805, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !15, line: 17, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !32, line: 148, baseType: !7)
!32 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !{!0}
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 64, elements: !37)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!37 = !{!38}
!38 = !DISubrange(count: 8)
!39 = !{!"rsp"}
!40 = !{i32 7, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 2}
!43 = !{i32 1, !"Code Model", i32 2}
!44 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!45 = distinct !DISubprogram(name: "acpi_ex_access_region", scope: !3, file: !3, line: 198, type: !46, scopeLine: 200, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !805)
!46 = !DISubroutineType(types: !47)
!47 = !{!18, !48, !14, !740, !14}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !50, line: 367, size: 576, elements: !51)
!50 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!51 = !{!52, !63, !76, !86, !122, !136, !145, !456, !473, !488, !501, !579, !591, !605, !615, !633, !655, !674, !693, !712, !725, !751, !768, !781, !795, !804}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !49, file: !50, line: 368, baseType: !53, size: 128)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !50, line: 73, size: 128, elements: !54)
!54 = !{!55, !56, !57, !58, !62}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !53, file: !50, line: 74, baseType: !48, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !53, file: !50, line: 74, baseType: !28, size: 8, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !50, line: 74, baseType: !28, size: 8, offset: 72)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !53, file: !50, line: 74, baseType: !59, size: 16, offset: 80)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !15, line: 19, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !53, file: !50, line: 74, baseType: !28, size: 8, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !49, file: !50, line: 369, baseType: !64, size: 192)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !50, line: 76, size: 192, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71, !75}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !64, file: !50, line: 77, baseType: !48, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !64, file: !50, line: 77, baseType: !28, size: 8, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !50, line: 77, baseType: !28, size: 8, offset: 72)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !64, file: !50, line: 77, baseType: !59, size: 16, offset: 80)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !64, file: !50, line: 77, baseType: !28, size: 8, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !64, file: !50, line: 77, baseType: !72, size: 24, offset: 104)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 24, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 3)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !64, file: !50, line: 78, baseType: !20, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !49, file: !50, line: 370, baseType: !77, size: 256)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !50, line: 93, size: 256, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !77, file: !50, line: 94, baseType: !48, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !77, file: !50, line: 94, baseType: !28, size: 8, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !50, line: 94, baseType: !28, size: 8, offset: 72)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !77, file: !50, line: 94, baseType: !59, size: 16, offset: 80)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !50, line: 94, baseType: !28, size: 8, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !77, file: !50, line: 94, baseType: !23, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !77, file: !50, line: 94, baseType: !14, size: 32, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !49, file: !50, line: 371, baseType: !87, size: 384)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !50, line: 97, size: 384, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !96, !97, !98, !99}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !87, file: !50, line: 98, baseType: !48, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !87, file: !50, line: 98, baseType: !28, size: 8, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !50, line: 98, baseType: !28, size: 8, offset: 72)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !87, file: !50, line: 98, baseType: !59, size: 16, offset: 80)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !87, file: !50, line: 98, baseType: !28, size: 8, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !87, file: !50, line: 98, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !87, file: !50, line: 98, baseType: !14, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !87, file: !50, line: 99, baseType: !14, size: 32, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !87, file: !50, line: 100, baseType: !95, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !87, file: !50, line: 101, baseType: !100, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !102, line: 133, size: 384, elements: !103)
!102 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!103 = !{!104, !105, !106, !107, !108, !117, !118, !119, !120}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !101, file: !102, line: 134, baseType: !48, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !101, file: !102, line: 135, baseType: !28, size: 8, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !102, line: 136, baseType: !28, size: 8, offset: 72)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !102, line: 137, baseType: !59, size: 16, offset: 80)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !102, line: 138, baseType: !109, size: 32, offset: 96)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !110, line: 327, size: 32, elements: !111)
!110 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !109, file: !110, line: 328, baseType: !14, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !109, file: !110, line: 329, baseType: !114, size: 32)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 4)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !101, file: !102, line: 139, baseType: !100, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !101, file: !102, line: 140, baseType: !100, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !101, file: !102, line: 141, baseType: !100, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !101, file: !102, line: 142, baseType: !121, size: 16, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !19, line: 445, baseType: !59)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !49, file: !50, line: 372, baseType: !123, size: 384)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !50, line: 104, size: 384, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !133, !134, !135}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !123, file: !50, line: 105, baseType: !48, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !123, file: !50, line: 105, baseType: !28, size: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !50, line: 105, baseType: !28, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !123, file: !50, line: 105, baseType: !59, size: 16, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !50, line: 105, baseType: !28, size: 8, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !123, file: !50, line: 105, baseType: !100, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !123, file: !50, line: 106, baseType: !132, size: 64, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !123, file: !50, line: 107, baseType: !95, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !123, file: !50, line: 108, baseType: !14, size: 32, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !123, file: !50, line: 109, baseType: !14, size: 32, offset: 352)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !49, file: !50, line: 373, baseType: !137, size: 192)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !50, line: 118, size: 192, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !137, file: !50, line: 119, baseType: !48, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !137, file: !50, line: 119, baseType: !28, size: 8, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !50, line: 119, baseType: !28, size: 8, offset: 72)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !137, file: !50, line: 119, baseType: !59, size: 16, offset: 80)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !50, line: 119, baseType: !28, size: 8, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !137, file: !50, line: 119, baseType: !25, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !49, file: !50, line: 374, baseType: !146, size: 448)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !50, line: 143, size: 448, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !453, !454, !455}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !146, file: !50, line: 144, baseType: !48, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !146, file: !50, line: 144, baseType: !28, size: 8, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !50, line: 144, baseType: !28, size: 8, offset: 72)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !146, file: !50, line: 144, baseType: !59, size: 16, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !50, line: 144, baseType: !28, size: 8, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !146, file: !50, line: 144, baseType: !28, size: 8, offset: 104)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !146, file: !50, line: 145, baseType: !28, size: 8, offset: 112)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !146, file: !50, line: 146, baseType: !28, size: 8, offset: 120)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !146, file: !50, line: 147, baseType: !48, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !146, file: !50, line: 148, baseType: !48, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !146, file: !50, line: 149, baseType: !95, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !146, file: !50, line: 153, baseType: !160, size: 64, offset: 320)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !146, file: !50, line: 150, size: 64, elements: !161)
!161 = !{!162, !452}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !160, file: !50, line: 151, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !102, line: 248, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!18, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !169, line: 37, size: 9024, elements: !170)
!169 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !398, !399, !400, !401, !402, !406, !408, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !435, !436, !437, !438, !439, !440, !441, !442, !444, !450}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !168, file: !169, line: 38, baseType: !167, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !168, file: !169, line: 39, baseType: !28, size: 8, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !168, file: !169, line: 40, baseType: !28, size: 8, offset: 72)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !168, file: !169, line: 41, baseType: !59, size: 16, offset: 80)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !168, file: !169, line: 42, baseType: !28, size: 8, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !168, file: !169, line: 43, baseType: !28, size: 8, offset: 104)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !168, file: !169, line: 44, baseType: !28, size: 8, offset: 112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !168, file: !169, line: 45, baseType: !121, size: 16, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !168, file: !169, line: 46, baseType: !28, size: 8, offset: 144)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !168, file: !169, line: 47, baseType: !28, size: 8, offset: 152)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !168, file: !169, line: 48, baseType: !28, size: 8, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !168, file: !169, line: 49, baseType: !28, size: 8, offset: 168)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !168, file: !169, line: 50, baseType: !28, size: 8, offset: 176)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !168, file: !169, line: 51, baseType: !28, size: 8, offset: 184)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !168, file: !169, line: 52, baseType: !28, size: 8, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !168, file: !169, line: 53, baseType: !28, size: 8, offset: 200)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !168, file: !169, line: 54, baseType: !95, size: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !168, file: !169, line: 55, baseType: !14, size: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !168, file: !169, line: 56, baseType: !14, size: 32, offset: 352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !168, file: !169, line: 57, baseType: !14, size: 32, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !168, file: !169, line: 58, baseType: !14, size: 32, offset: 416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !168, file: !169, line: 60, baseType: !193, size: 640, offset: 448)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !102, line: 893, size: 640, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !281, !282, !396, !397}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !193, file: !102, line: 894, baseType: !95, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !193, file: !102, line: 895, baseType: !95, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !193, file: !102, line: 896, baseType: !95, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !193, file: !102, line: 897, baseType: !95, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !193, file: !102, line: 898, baseType: !95, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !193, file: !102, line: 899, baseType: !201, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !102, line: 875, size: 1600, elements: !203)
!203 = !{!204, !224, !240}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !202, file: !102, line: 876, baseType: !205, size: 448)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !102, line: 828, size: 448, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212, !213, !214, !223}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !205, file: !102, line: 829, baseType: !201, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !205, file: !102, line: 829, baseType: !28, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !102, line: 829, baseType: !28, size: 8, offset: 72)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !205, file: !102, line: 829, baseType: !59, size: 16, offset: 80)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !205, file: !102, line: 829, baseType: !95, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !102, line: 829, baseType: !201, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !102, line: 829, baseType: !100, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !205, file: !102, line: 829, baseType: !215, size: 64, offset: 320)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !102, line: 716, size: 64, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !215, file: !102, line: 717, baseType: !20, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !102, line: 718, baseType: !14, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !215, file: !102, line: 719, baseType: !23, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !215, file: !102, line: 720, baseType: !95, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !102, line: 721, baseType: !23, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !215, file: !102, line: 722, baseType: !201, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !205, file: !102, line: 829, baseType: !28, size: 8, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !202, file: !102, line: 877, baseType: !225, size: 640)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !102, line: 835, size: 640, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !225, file: !102, line: 836, baseType: !201, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !225, file: !102, line: 836, baseType: !28, size: 8, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !102, line: 836, baseType: !28, size: 8, offset: 72)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !225, file: !102, line: 836, baseType: !59, size: 16, offset: 80)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !225, file: !102, line: 836, baseType: !95, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !102, line: 836, baseType: !201, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !225, file: !102, line: 836, baseType: !100, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !225, file: !102, line: 836, baseType: !215, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !225, file: !102, line: 836, baseType: !28, size: 8, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !225, file: !102, line: 836, baseType: !23, size: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !102, line: 837, baseType: !95, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !225, file: !102, line: 838, baseType: !14, size: 32, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !225, file: !102, line: 839, baseType: !14, size: 32, offset: 608)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !202, file: !102, line: 878, baseType: !241, size: 1600)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !102, line: 846, size: 1600, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !241, file: !102, line: 847, baseType: !201, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !241, file: !102, line: 847, baseType: !28, size: 8, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !241, file: !102, line: 847, baseType: !28, size: 8, offset: 72)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !241, file: !102, line: 847, baseType: !59, size: 16, offset: 80)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !241, file: !102, line: 847, baseType: !95, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !102, line: 847, baseType: !201, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !241, file: !102, line: 847, baseType: !100, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !241, file: !102, line: 847, baseType: !215, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !241, file: !102, line: 847, baseType: !28, size: 8, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !241, file: !102, line: 847, baseType: !201, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !241, file: !102, line: 848, baseType: !201, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !241, file: !102, line: 849, baseType: !23, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !241, file: !102, line: 850, baseType: !28, size: 8, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !241, file: !102, line: 851, baseType: !23, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !241, file: !102, line: 852, baseType: !23, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !241, file: !102, line: 853, baseType: !23, size: 64, offset: 832)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !241, file: !102, line: 854, baseType: !114, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !241, file: !102, line: 855, baseType: !14, size: 32, offset: 928)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !241, file: !102, line: 856, baseType: !14, size: 32, offset: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !241, file: !102, line: 857, baseType: !14, size: 32, offset: 992)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !241, file: !102, line: 858, baseType: !14, size: 32, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !241, file: !102, line: 859, baseType: !14, size: 32, offset: 1056)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !241, file: !102, line: 860, baseType: !14, size: 32, offset: 1088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !241, file: !102, line: 861, baseType: !14, size: 32, offset: 1120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !241, file: !102, line: 862, baseType: !14, size: 32, offset: 1152)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !241, file: !102, line: 863, baseType: !14, size: 32, offset: 1184)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !241, file: !102, line: 864, baseType: !14, size: 32, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !241, file: !102, line: 865, baseType: !14, size: 32, offset: 1248)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !241, file: !102, line: 866, baseType: !14, size: 32, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !241, file: !102, line: 867, baseType: !14, size: 32, offset: 1312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !241, file: !102, line: 868, baseType: !59, size: 16, offset: 1344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !241, file: !102, line: 869, baseType: !28, size: 8, offset: 1360)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !241, file: !102, line: 870, baseType: !28, size: 8, offset: 1368)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !241, file: !102, line: 871, baseType: !28, size: 8, offset: 1376)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !241, file: !102, line: 872, baseType: !278, size: 160, offset: 1384)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !279)
!279 = !{!280}
!280 = !DISubrange(count: 20)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !193, file: !102, line: 900, baseType: !100, size: 64, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !193, file: !102, line: 901, baseType: !283, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !102, line: 663, size: 640, elements: !285)
!285 = !{!286, !294, !307, !316, !325, !338, !352, !364, !374}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !284, file: !102, line: 664, baseType: !287, size: 128)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !102, line: 567, size: 128, elements: !288)
!288 = !{!289, !290, !291, !292, !293}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !102, line: 568, baseType: !25, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !102, line: 568, baseType: !28, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !102, line: 568, baseType: !28, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !102, line: 568, baseType: !59, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !102, line: 568, baseType: !59, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !284, file: !102, line: 665, baseType: !295, size: 384)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !102, line: 593, size: 384, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !102, line: 594, baseType: !25, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !295, file: !102, line: 594, baseType: !28, size: 8, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !102, line: 594, baseType: !28, size: 8, offset: 72)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !102, line: 594, baseType: !59, size: 16, offset: 80)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !295, file: !102, line: 594, baseType: !59, size: 16, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !295, file: !102, line: 594, baseType: !59, size: 16, offset: 112)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !295, file: !102, line: 595, baseType: !201, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !295, file: !102, line: 596, baseType: !95, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !295, file: !102, line: 597, baseType: !95, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !295, file: !102, line: 598, baseType: !20, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !284, file: !102, line: 666, baseType: !308, size: 192)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !102, line: 573, size: 192, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !102, line: 574, baseType: !25, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !308, file: !102, line: 574, baseType: !28, size: 8, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !102, line: 574, baseType: !28, size: 8, offset: 72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !308, file: !102, line: 574, baseType: !59, size: 16, offset: 80)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !102, line: 574, baseType: !59, size: 16, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !308, file: !102, line: 574, baseType: !48, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !284, file: !102, line: 667, baseType: !317, size: 192)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !102, line: 604, size: 192, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !102, line: 605, baseType: !25, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !317, file: !102, line: 605, baseType: !28, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !102, line: 605, baseType: !28, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !317, file: !102, line: 605, baseType: !59, size: 16, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !102, line: 605, baseType: !59, size: 16, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !102, line: 605, baseType: !100, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !284, file: !102, line: 668, baseType: !326, size: 448)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !102, line: 608, size: 448, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !102, line: 609, baseType: !25, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !326, file: !102, line: 609, baseType: !28, size: 8, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !102, line: 609, baseType: !28, size: 8, offset: 72)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !326, file: !102, line: 609, baseType: !59, size: 16, offset: 80)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !326, file: !102, line: 609, baseType: !59, size: 16, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !326, file: !102, line: 609, baseType: !14, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !326, file: !102, line: 610, baseType: !201, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !326, file: !102, line: 611, baseType: !95, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !326, file: !102, line: 612, baseType: !95, size: 64, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !326, file: !102, line: 613, baseType: !14, size: 32, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !284, file: !102, line: 669, baseType: !339, size: 512)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !102, line: 580, size: 512, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !102, line: 581, baseType: !25, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !339, file: !102, line: 581, baseType: !28, size: 8, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !102, line: 581, baseType: !28, size: 8, offset: 72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !339, file: !102, line: 581, baseType: !59, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !102, line: 581, baseType: !59, size: 16, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !339, file: !102, line: 581, baseType: !14, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !339, file: !102, line: 582, baseType: !48, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !339, file: !102, line: 583, baseType: !48, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !339, file: !102, line: 584, baseType: !167, size: 64, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !339, file: !102, line: 585, baseType: !25, size: 64, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !339, file: !102, line: 586, baseType: !14, size: 32, offset: 448)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !284, file: !102, line: 670, baseType: !353, size: 320)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !102, line: 620, size: 320, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361, !362, !363}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !102, line: 621, baseType: !25, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !353, file: !102, line: 621, baseType: !28, size: 8, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !353, file: !102, line: 621, baseType: !28, size: 8, offset: 72)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !353, file: !102, line: 621, baseType: !59, size: 16, offset: 80)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !102, line: 621, baseType: !59, size: 16, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !353, file: !102, line: 621, baseType: !28, size: 8, offset: 112)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !353, file: !102, line: 622, baseType: !167, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !353, file: !102, line: 623, baseType: !48, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !353, file: !102, line: 624, baseType: !20, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !284, file: !102, line: 671, baseType: !365, size: 640)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !102, line: 631, size: 640, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !102, line: 632, baseType: !25, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !365, file: !102, line: 632, baseType: !28, size: 8, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !365, file: !102, line: 632, baseType: !28, size: 8, offset: 72)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !365, file: !102, line: 632, baseType: !59, size: 16, offset: 80)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !365, file: !102, line: 632, baseType: !59, size: 16, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !365, file: !102, line: 633, baseType: !373, size: 512, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, elements: !37)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !284, file: !102, line: 672, baseType: !375, size: 320)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !102, line: 654, size: 320, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !102, line: 655, baseType: !25, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !375, file: !102, line: 655, baseType: !28, size: 8, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !375, file: !102, line: 655, baseType: !28, size: 8, offset: 72)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !375, file: !102, line: 655, baseType: !59, size: 16, offset: 80)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !375, file: !102, line: 655, baseType: !59, size: 16, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !375, file: !102, line: 655, baseType: !28, size: 8, offset: 112)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !375, file: !102, line: 656, baseType: !100, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !375, file: !102, line: 657, baseType: !48, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !375, file: !102, line: 658, baseType: !386, size: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !102, line: 645, size: 128, elements: !388)
!388 = !{!389, !395}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !387, file: !102, line: 646, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !19, line: 1052, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394, !14, !25}
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !19, line: 424, baseType: !25)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !387, file: !102, line: 647, baseType: !25, size: 64, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !193, file: !102, line: 902, baseType: !201, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !193, file: !102, line: 903, baseType: !14, size: 32, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !168, file: !169, line: 61, baseType: !14, size: 32, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !168, file: !169, line: 62, baseType: !14, size: 32, offset: 1120)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !168, file: !169, line: 63, baseType: !59, size: 16, offset: 1152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !168, file: !169, line: 64, baseType: !28, size: 8, offset: 1168)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !168, file: !169, line: 66, baseType: !403, size: 2688, offset: 1216)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 2688, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 7)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !168, file: !169, line: 67, baseType: !407, size: 3072, offset: 3904)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 3072, elements: !37)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !168, file: !169, line: 68, baseType: !409, size: 576, offset: 6976)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 576, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 9)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !168, file: !169, line: 69, baseType: !132, size: 64, offset: 7552)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !168, file: !169, line: 71, baseType: !95, size: 64, offset: 7616)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !168, file: !169, line: 72, baseType: !132, size: 64, offset: 7680)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !168, file: !169, line: 73, baseType: !283, size: 64, offset: 7744)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !168, file: !169, line: 74, baseType: !100, size: 64, offset: 7808)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !168, file: !169, line: 75, baseType: !48, size: 64, offset: 7872)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !168, file: !169, line: 76, baseType: !100, size: 64, offset: 7936)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !168, file: !169, line: 77, baseType: !201, size: 64, offset: 8000)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !168, file: !169, line: 78, baseType: !48, size: 64, offset: 8064)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !168, file: !169, line: 79, baseType: !100, size: 64, offset: 8128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !168, file: !169, line: 80, baseType: !23, size: 64, offset: 8192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !168, file: !169, line: 81, baseType: !201, size: 64, offset: 8256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !168, file: !169, line: 82, baseType: !425, size: 64, offset: 8320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !102, line: 702, size: 128, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !427, file: !102, line: 706, baseType: !14, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !427, file: !102, line: 707, baseType: !14, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !427, file: !102, line: 708, baseType: !59, size: 16, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !427, file: !102, line: 709, baseType: !28, size: 8, offset: 80)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !427, file: !102, line: 710, baseType: !28, size: 8, offset: 88)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !427, file: !102, line: 711, baseType: !28, size: 8, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !168, file: !169, line: 83, baseType: !201, size: 64, offset: 8384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !168, file: !169, line: 84, baseType: !48, size: 64, offset: 8448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !168, file: !169, line: 85, baseType: !283, size: 64, offset: 8512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !168, file: !169, line: 86, baseType: !48, size: 64, offset: 8576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !168, file: !169, line: 87, baseType: !283, size: 64, offset: 8640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !168, file: !169, line: 88, baseType: !201, size: 64, offset: 8704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !168, file: !169, line: 89, baseType: !201, size: 64, offset: 8768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !168, file: !169, line: 90, baseType: !443, size: 64, offset: 8832)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !168, file: !169, line: 91, baseType: !445, size: 64, offset: 8896)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !102, line: 637, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!18, !167, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !168, file: !169, line: 92, baseType: !451, size: 64, offset: 8960)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !102, line: 641, baseType: !164)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !160, file: !50, line: 152, baseType: !48, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !146, file: !50, line: 155, baseType: !14, size: 32, offset: 384)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !146, file: !50, line: 156, baseType: !121, size: 16, offset: 416)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !146, file: !50, line: 157, baseType: !28, size: 8, offset: 432)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !49, file: !50, line: 375, baseType: !457, size: 576)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !50, line: 122, size: 576, elements: !458)
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !457, file: !50, line: 123, baseType: !48, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !457, file: !50, line: 123, baseType: !28, size: 8, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !50, line: 123, baseType: !28, size: 8, offset: 72)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !457, file: !50, line: 123, baseType: !59, size: 16, offset: 80)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !457, file: !50, line: 123, baseType: !28, size: 8, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !457, file: !50, line: 123, baseType: !28, size: 8, offset: 104)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !457, file: !50, line: 124, baseType: !59, size: 16, offset: 112)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !457, file: !50, line: 125, baseType: !25, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !457, file: !50, line: 126, baseType: !20, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !457, file: !50, line: 127, baseType: !443, size: 64, offset: 256)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !50, line: 128, baseType: !48, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !50, line: 129, baseType: !48, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !457, file: !50, line: 130, baseType: !100, size: 64, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !457, file: !50, line: 131, baseType: !28, size: 8, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !49, file: !50, line: 376, baseType: !474, size: 448)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !50, line: 134, size: 448, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !487}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !474, file: !50, line: 135, baseType: !48, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !474, file: !50, line: 135, baseType: !28, size: 8, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !50, line: 135, baseType: !28, size: 8, offset: 72)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !474, file: !50, line: 135, baseType: !59, size: 16, offset: 80)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !50, line: 135, baseType: !28, size: 8, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !474, file: !50, line: 135, baseType: !28, size: 8, offset: 104)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !50, line: 136, baseType: !100, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !474, file: !50, line: 137, baseType: !48, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !50, line: 138, baseType: !48, size: 64, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !474, file: !50, line: 139, baseType: !486, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !19, line: 129, baseType: !20)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !474, file: !50, line: 140, baseType: !14, size: 32, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !49, file: !50, line: 377, baseType: !489, size: 320)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !50, line: 184, size: 320, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !500}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !489, file: !50, line: 185, baseType: !48, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !489, file: !50, line: 185, baseType: !28, size: 8, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !489, file: !50, line: 185, baseType: !28, size: 8, offset: 72)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !489, file: !50, line: 185, baseType: !59, size: 16, offset: 80)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !489, file: !50, line: 185, baseType: !28, size: 8, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !489, file: !50, line: 185, baseType: !497, size: 128, offset: 128)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 2)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !489, file: !50, line: 185, baseType: !48, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !49, file: !50, line: 378, baseType: !502, size: 384)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !50, line: 187, size: 384, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !502, file: !50, line: 188, baseType: !48, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !502, file: !50, line: 188, baseType: !28, size: 8, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !50, line: 188, baseType: !28, size: 8, offset: 72)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !502, file: !50, line: 188, baseType: !59, size: 16, offset: 80)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !50, line: 188, baseType: !28, size: 8, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !502, file: !50, line: 189, baseType: !497, size: 128, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !502, file: !50, line: 189, baseType: !48, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !502, file: !50, line: 189, baseType: !512, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !102, line: 480, size: 576, elements: !514)
!514 = !{!515, !516, !517, !518, !526, !541, !573, !574, !575, !576, !577, !578}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !513, file: !102, line: 481, baseType: !100, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !513, file: !102, line: 482, baseType: !512, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !513, file: !102, line: 483, baseType: !512, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !513, file: !102, line: 484, baseType: !519, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !102, line: 497, size: 256, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !520, file: !102, line: 498, baseType: !519, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !102, line: 499, baseType: !519, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !520, file: !102, line: 500, baseType: !512, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !520, file: !102, line: 501, baseType: !14, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !513, file: !102, line: 485, baseType: !527, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !102, line: 466, size: 320, elements: !529)
!529 = !{!530, !535, !536, !537, !538, !539, !540}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !528, file: !102, line: 467, baseType: !531, size: 128)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !102, line: 459, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !531, file: !102, line: 460, baseType: !28, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !531, file: !102, line: 461, baseType: !20, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !528, file: !102, line: 468, baseType: !531, size: 128, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !528, file: !102, line: 469, baseType: !59, size: 16, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !528, file: !102, line: 470, baseType: !28, size: 8, offset: 272)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !528, file: !102, line: 471, baseType: !28, size: 8, offset: 280)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !528, file: !102, line: 472, baseType: !28, size: 8, offset: 288)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !528, file: !102, line: 473, baseType: !28, size: 8, offset: 296)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !513, file: !102, line: 486, baseType: !542, size: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !102, line: 448, size: 192, elements: !544)
!544 = !{!545, !568, !569, !570, !571, !572}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !543, file: !102, line: 449, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !102, line: 438, size: 64, elements: !547)
!547 = !{!548, !549, !562}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !546, file: !102, line: 439, baseType: !100, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !546, file: !102, line: 440, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !102, line: 419, size: 256, elements: !552)
!552 = !{!553, !558, !559, !560, !561}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !551, file: !102, line: 420, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !19, line: 1049, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!14, !394, !14, !25}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !551, file: !102, line: 421, baseType: !25, size: 64, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !551, file: !102, line: 422, baseType: !100, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !551, file: !102, line: 423, baseType: !28, size: 8, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !551, file: !102, line: 424, baseType: !28, size: 8, offset: 200)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !546, file: !102, line: 441, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !102, line: 429, size: 128, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !564, file: !102, line: 430, baseType: !100, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !102, line: 431, baseType: !563, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !543, file: !102, line: 450, baseType: !527, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !543, file: !102, line: 451, baseType: !28, size: 8, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !543, file: !102, line: 452, baseType: !28, size: 8, offset: 136)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !543, file: !102, line: 453, baseType: !28, size: 8, offset: 144)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !543, file: !102, line: 454, baseType: !28, size: 8, offset: 152)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !513, file: !102, line: 487, baseType: !20, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !513, file: !102, line: 488, baseType: !14, size: 32, offset: 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !513, file: !102, line: 489, baseType: !59, size: 16, offset: 480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !513, file: !102, line: 490, baseType: !59, size: 16, offset: 496)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !513, file: !102, line: 491, baseType: !28, size: 8, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !513, file: !102, line: 492, baseType: !28, size: 8, offset: 520)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !49, file: !50, line: 379, baseType: !580, size: 384)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !50, line: 192, size: 384, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !580, file: !50, line: 193, baseType: !48, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !580, file: !50, line: 193, baseType: !28, size: 8, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !50, line: 193, baseType: !28, size: 8, offset: 72)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !580, file: !50, line: 193, baseType: !59, size: 16, offset: 80)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !50, line: 193, baseType: !28, size: 8, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !580, file: !50, line: 193, baseType: !497, size: 128, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !580, file: !50, line: 193, baseType: !48, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !580, file: !50, line: 193, baseType: !14, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !580, file: !50, line: 194, baseType: !14, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !49, file: !50, line: 380, baseType: !592, size: 384)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !50, line: 197, size: 384, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !592, file: !50, line: 198, baseType: !48, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !592, file: !50, line: 198, baseType: !28, size: 8, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !50, line: 198, baseType: !28, size: 8, offset: 72)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !592, file: !50, line: 198, baseType: !59, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !50, line: 198, baseType: !28, size: 8, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !592, file: !50, line: 200, baseType: !28, size: 8, offset: 104)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !592, file: !50, line: 201, baseType: !28, size: 8, offset: 112)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !592, file: !50, line: 202, baseType: !497, size: 128, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !592, file: !50, line: 202, baseType: !48, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !592, file: !50, line: 202, baseType: !604, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !19, line: 128, baseType: !20)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !49, file: !50, line: 381, baseType: !606, size: 320)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !50, line: 205, size: 320, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !606, file: !50, line: 206, baseType: !48, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !606, file: !50, line: 206, baseType: !28, size: 8, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !606, file: !50, line: 206, baseType: !28, size: 8, offset: 72)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !606, file: !50, line: 206, baseType: !59, size: 16, offset: 80)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !606, file: !50, line: 206, baseType: !28, size: 8, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !606, file: !50, line: 206, baseType: !497, size: 128, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !606, file: !50, line: 206, baseType: !48, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !49, file: !50, line: 382, baseType: !616, size: 384)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !50, line: 233, size: 384, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !616, file: !50, line: 234, baseType: !48, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 72)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !616, file: !50, line: 234, baseType: !59, size: 16, offset: 80)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 104)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 112)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 120)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !616, file: !50, line: 234, baseType: !100, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !616, file: !50, line: 234, baseType: !14, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !616, file: !50, line: 234, baseType: !14, size: 32, offset: 224)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !616, file: !50, line: 234, baseType: !14, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 288)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !616, file: !50, line: 234, baseType: !28, size: 8, offset: 296)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !616, file: !50, line: 234, baseType: !48, size: 64, offset: 320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !49, file: !50, line: 383, baseType: !634, size: 576)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !50, line: 237, size: 576, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !634, file: !50, line: 238, baseType: !48, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 72)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !634, file: !50, line: 238, baseType: !59, size: 16, offset: 80)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 104)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 112)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 120)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !634, file: !50, line: 238, baseType: !100, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !634, file: !50, line: 238, baseType: !14, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !634, file: !50, line: 238, baseType: !14, size: 32, offset: 224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !634, file: !50, line: 238, baseType: !14, size: 32, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !634, file: !50, line: 238, baseType: !28, size: 8, offset: 296)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !634, file: !50, line: 238, baseType: !59, size: 16, offset: 304)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !634, file: !50, line: 239, baseType: !48, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !634, file: !50, line: 240, baseType: !95, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !634, file: !50, line: 241, baseType: !59, size: 16, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !634, file: !50, line: 242, baseType: !95, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !49, file: !50, line: 384, baseType: !656, size: 384)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !50, line: 262, size: 384, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !656, file: !50, line: 263, baseType: !48, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 72)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !656, file: !50, line: 263, baseType: !59, size: 16, offset: 80)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 104)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 120)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !656, file: !50, line: 263, baseType: !100, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !656, file: !50, line: 263, baseType: !14, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !656, file: !50, line: 263, baseType: !14, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !50, line: 263, baseType: !14, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 296)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !656, file: !50, line: 263, baseType: !28, size: 8, offset: 304)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !656, file: !50, line: 264, baseType: !48, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !49, file: !50, line: 385, baseType: !675, size: 448)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !50, line: 245, size: 448, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !675, file: !50, line: 246, baseType: !48, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 72)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !675, file: !50, line: 246, baseType: !59, size: 16, offset: 80)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 104)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 120)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !675, file: !50, line: 246, baseType: !100, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !675, file: !50, line: 246, baseType: !14, size: 32, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !675, file: !50, line: 246, baseType: !14, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !675, file: !50, line: 246, baseType: !14, size: 32, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !675, file: !50, line: 246, baseType: !28, size: 8, offset: 296)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !675, file: !50, line: 246, baseType: !48, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !675, file: !50, line: 247, baseType: !48, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !49, file: !50, line: 386, baseType: !694, size: 448)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !50, line: 250, size: 448, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !694, file: !50, line: 251, baseType: !48, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 72)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !694, file: !50, line: 251, baseType: !59, size: 16, offset: 80)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 104)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 112)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 120)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !694, file: !50, line: 251, baseType: !100, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !694, file: !50, line: 251, baseType: !14, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !694, file: !50, line: 251, baseType: !14, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !694, file: !50, line: 251, baseType: !14, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !694, file: !50, line: 251, baseType: !28, size: 8, offset: 296)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !694, file: !50, line: 256, baseType: !48, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !694, file: !50, line: 257, baseType: !48, size: 64, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !49, file: !50, line: 387, baseType: !713, size: 512)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !50, line: 273, size: 512, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !713, file: !50, line: 274, baseType: !48, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !713, file: !50, line: 274, baseType: !28, size: 8, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !50, line: 274, baseType: !28, size: 8, offset: 72)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !713, file: !50, line: 274, baseType: !59, size: 16, offset: 80)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !713, file: !50, line: 274, baseType: !28, size: 8, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !713, file: !50, line: 274, baseType: !100, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !713, file: !50, line: 275, baseType: !14, size: 32, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !713, file: !50, line: 276, baseType: !390, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !713, file: !50, line: 277, baseType: !25, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !50, line: 278, baseType: !497, size: 128, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !49, file: !50, line: 388, baseType: !726, size: 512)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !50, line: 281, size: 512, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !741, !742, !743, !749, !750}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !726, file: !50, line: 282, baseType: !48, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !726, file: !50, line: 282, baseType: !28, size: 8, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !726, file: !50, line: 282, baseType: !28, size: 8, offset: 72)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !726, file: !50, line: 282, baseType: !59, size: 16, offset: 80)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !726, file: !50, line: 282, baseType: !28, size: 8, offset: 96)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !726, file: !50, line: 282, baseType: !28, size: 8, offset: 104)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !726, file: !50, line: 283, baseType: !28, size: 8, offset: 112)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !726, file: !50, line: 284, baseType: !736, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !19, line: 1084, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!18, !14, !486, !14, !740, !25, !25}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !726, file: !50, line: 285, baseType: !100, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !726, file: !50, line: 286, baseType: !25, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !726, file: !50, line: 287, baseType: !744, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !19, line: 1102, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!18, !394, !14, !25, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !726, file: !50, line: 288, baseType: !48, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !50, line: 289, baseType: !48, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !49, file: !50, line: 389, baseType: !752, size: 512)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !50, line: 307, size: 512, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !752, file: !50, line: 308, baseType: !48, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !752, file: !50, line: 308, baseType: !28, size: 8, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !752, file: !50, line: 308, baseType: !28, size: 8, offset: 72)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !752, file: !50, line: 308, baseType: !59, size: 16, offset: 80)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !50, line: 308, baseType: !28, size: 8, offset: 96)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !752, file: !50, line: 308, baseType: !28, size: 8, offset: 104)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !752, file: !50, line: 309, baseType: !28, size: 8, offset: 112)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !752, file: !50, line: 310, baseType: !28, size: 8, offset: 120)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !752, file: !50, line: 311, baseType: !25, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !752, file: !50, line: 312, baseType: !100, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !752, file: !50, line: 313, baseType: !132, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !752, file: !50, line: 314, baseType: !95, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !752, file: !50, line: 315, baseType: !95, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !752, file: !50, line: 316, baseType: !14, size: 32, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !49, file: !50, line: 390, baseType: !769, size: 448)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !50, line: 340, size: 448, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !769, file: !50, line: 341, baseType: !48, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !769, file: !50, line: 341, baseType: !28, size: 8, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !769, file: !50, line: 341, baseType: !28, size: 8, offset: 72)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !769, file: !50, line: 341, baseType: !59, size: 16, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !50, line: 341, baseType: !28, size: 8, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !769, file: !50, line: 341, baseType: !100, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !769, file: !50, line: 342, baseType: !100, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !769, file: !50, line: 343, baseType: !25, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !769, file: !50, line: 344, baseType: !95, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !769, file: !50, line: 345, baseType: !14, size: 32, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !50, line: 391, baseType: !782, size: 256)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !50, line: 350, size: 256, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !794}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !782, file: !50, line: 351, baseType: !48, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !782, file: !50, line: 351, baseType: !28, size: 8, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !50, line: 351, baseType: !28, size: 8, offset: 72)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !782, file: !50, line: 351, baseType: !59, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !50, line: 351, baseType: !28, size: 8, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !782, file: !50, line: 351, baseType: !790, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !19, line: 1055, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !394, !25}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !782, file: !50, line: 352, baseType: !25, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !49, file: !50, line: 392, baseType: !796, size: 192)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !50, line: 357, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !796, file: !50, line: 358, baseType: !48, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !796, file: !50, line: 358, baseType: !28, size: 8, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !796, file: !50, line: 358, baseType: !28, size: 8, offset: 72)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !796, file: !50, line: 358, baseType: !59, size: 16, offset: 80)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !50, line: 358, baseType: !28, size: 8, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !50, line: 358, baseType: !48, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !49, file: !50, line: 399, baseType: !101, size: 384)
!805 = !{}
!806 = !DILocalVariable(name: "obj_desc", arg: 1, scope: !45, file: !3, line: 198, type: !48)
!807 = !DILocation(line: 198, column: 50, scope: !45)
!808 = !DILocalVariable(name: "field_datum_byte_offset", arg: 2, scope: !45, file: !3, line: 199, type: !14)
!809 = !DILocation(line: 199, column: 13, scope: !45)
!810 = !DILocalVariable(name: "value", arg: 3, scope: !45, file: !3, line: 199, type: !740)
!811 = !DILocation(line: 199, column: 43, scope: !45)
!812 = !DILocalVariable(name: "function", arg: 4, scope: !45, file: !3, line: 199, type: !14)
!813 = !DILocation(line: 199, column: 54, scope: !45)
!814 = !DILocalVariable(name: "status", scope: !45, file: !3, line: 201, type: !18)
!815 = !DILocation(line: 201, column: 14, scope: !45)
!816 = !DILocalVariable(name: "rgn_desc", scope: !45, file: !3, line: 202, type: !48)
!817 = !DILocation(line: 202, column: 29, scope: !45)
!818 = !DILocalVariable(name: "region_offset", scope: !45, file: !3, line: 203, type: !14)
!819 = !DILocation(line: 203, column: 6, scope: !45)
!820 = !DILocation(line: 211, column: 32, scope: !45)
!821 = !DILocation(line: 211, column: 42, scope: !45)
!822 = !DILocation(line: 211, column: 11, scope: !45)
!823 = !DILocation(line: 211, column: 9, scope: !45)
!824 = !DILocation(line: 212, column: 6, scope: !825)
!825 = distinct !DILexicalBlock(scope: !45, file: !3, line: 212, column: 6)
!826 = !DILocation(line: 212, column: 6, scope: !45)
!827 = !DILocation(line: 213, column: 3, scope: !828)
!828 = distinct !DILexicalBlock(scope: !825, file: !3, line: 212, column: 28)
!829 = !DILocation(line: 223, column: 13, scope: !45)
!830 = !DILocation(line: 223, column: 23, scope: !45)
!831 = !DILocation(line: 223, column: 36, scope: !45)
!832 = !DILocation(line: 223, column: 11, scope: !45)
!833 = !DILocation(line: 225, column: 6, scope: !45)
!834 = !DILocation(line: 225, column: 16, scope: !45)
!835 = !DILocation(line: 225, column: 29, scope: !45)
!836 = !DILocation(line: 225, column: 48, scope: !45)
!837 = !DILocation(line: 225, column: 46, scope: !45)
!838 = !DILocation(line: 224, column: 16, scope: !45)
!839 = !DILocation(line: 227, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !45, file: !3, line: 227, column: 6)
!841 = !DILocation(line: 227, column: 16, scope: !840)
!842 = !DILocation(line: 227, column: 32, scope: !840)
!843 = !DILocation(line: 227, column: 6, scope: !45)
!844 = !DILocation(line: 229, column: 2, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !3, line: 227, column: 46)
!846 = !DILocation(line: 246, column: 42, scope: !45)
!847 = !DILocation(line: 246, column: 52, scope: !45)
!848 = !DILocation(line: 247, column: 7, scope: !45)
!849 = !DILocation(line: 247, column: 17, scope: !45)
!850 = !DILocation(line: 248, column: 7, scope: !45)
!851 = !DILocation(line: 251, column: 7, scope: !45)
!852 = !DILocation(line: 246, column: 11, scope: !45)
