; ModuleID = '../bcout/drivers/acpi/acpica/exoparg3.llvm.bc'
source_filename = "drivers/acpi/acpica/exoparg3.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !29, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/exoparg3.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !20, !16, !24, !26, !27}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !25, line: 148, baseType: !7)
!25 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !{!0}
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 72, elements: !32)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = !{!33}
!33 = !DISubrange(count: 9)
!34 = !{!"rsp"}
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 2}
!38 = !{i32 1, !"Code Model", i32 2}
!39 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!40 = distinct !DISubprogram(name: "acpi_ex_opcode_3A_0T_0R", scope: !3, file: !3, line: 51, type: !41, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !802)
!41 = !DISubroutineType(types: !42)
!42 = !{!14, !43}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !45, line: 37, size: 9024, elements: !46)
!45 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !48, !52, !53, !57, !58, !59, !60, !62, !63, !64, !65, !66, !67, !68, !69, !70, !72, !73, !74, !75, !76, !751, !752, !753, !754, !755, !759, !761, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !786, !787, !788, !789, !790, !791, !792, !793, !794, !800}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !44, file: !45, line: 38, baseType: !43, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !44, file: !45, line: 39, baseType: !49, size: 8, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !44, file: !45, line: 40, baseType: !49, size: 8, offset: 72)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !44, file: !45, line: 41, baseType: !54, size: 16, offset: 80)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !56)
!56 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !44, file: !45, line: 42, baseType: !49, size: 8, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !44, file: !45, line: 43, baseType: !49, size: 8, offset: 104)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !44, file: !45, line: 44, baseType: !49, size: 8, offset: 112)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !44, file: !45, line: 45, baseType: !61, size: 16, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !54)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !44, file: !45, line: 46, baseType: !49, size: 8, offset: 144)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !44, file: !45, line: 47, baseType: !49, size: 8, offset: 152)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !44, file: !45, line: 48, baseType: !49, size: 8, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !44, file: !45, line: 49, baseType: !49, size: 8, offset: 168)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !44, file: !45, line: 50, baseType: !49, size: 8, offset: 176)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !44, file: !45, line: 51, baseType: !49, size: 8, offset: 184)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !44, file: !45, line: 52, baseType: !49, size: 8, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !44, file: !45, line: 53, baseType: !49, size: 8, offset: 200)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !44, file: !45, line: 54, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !44, file: !45, line: 55, baseType: !16, size: 32, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !44, file: !45, line: 56, baseType: !16, size: 32, offset: 352)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !44, file: !45, line: 57, baseType: !16, size: 32, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !44, file: !45, line: 58, baseType: !16, size: 32, offset: 416)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !44, file: !45, line: 60, baseType: !77, size: 640, offset: 448)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !78, line: 893, size: 640, elements: !79)
!78 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!79 = !{!80, !81, !82, !83, !84, !85, !648, !649, !749, !750}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !77, file: !78, line: 894, baseType: !71, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !77, file: !78, line: 895, baseType: !71, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !77, file: !78, line: 896, baseType: !71, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !77, file: !78, line: 897, baseType: !71, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !77, file: !78, line: 898, baseType: !71, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !77, file: !78, line: 899, baseType: !86, size: 64, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !78, line: 875, size: 1600, elements: !88)
!88 = !{!89, !591, !607}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !87, file: !78, line: 876, baseType: !90, size: 448)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !78, line: 828, size: 448, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !581, !590}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !78, line: 829, baseType: !86, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !90, file: !78, line: 829, baseType: !49, size: 8, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !78, line: 829, baseType: !49, size: 8, offset: 72)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !90, file: !78, line: 829, baseType: !54, size: 16, offset: 80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !90, file: !78, line: 829, baseType: !71, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !78, line: 829, baseType: !86, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !90, file: !78, line: 829, baseType: !99, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !78, line: 133, size: 384, elements: !101)
!101 = !{!102, !565, !566, !567, !568, !577, !578, !579, !580}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !100, file: !78, line: 134, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !105, line: 367, size: 576, elements: !106)
!105 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!106 = !{!107, !115, !128, !139, !152, !166, !175, !199, !228, !243, !256, !335, !347, !361, !371, !389, !411, !430, !449, !468, !485, !511, !528, !541, !555, !564}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !104, file: !105, line: 368, baseType: !108, size: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !105, line: 73, size: 128, elements: !109)
!109 = !{!110, !111, !112, !113, !114}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !108, file: !105, line: 74, baseType: !103, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !108, file: !105, line: 74, baseType: !49, size: 8, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !105, line: 74, baseType: !49, size: 8, offset: 72)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !108, file: !105, line: 74, baseType: !54, size: 16, offset: 80)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !108, file: !105, line: 74, baseType: !49, size: 8, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !104, file: !105, line: 369, baseType: !116, size: 192)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !105, line: 76, size: 192, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !127}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !116, file: !105, line: 77, baseType: !103, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !116, file: !105, line: 77, baseType: !49, size: 8, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !116, file: !105, line: 77, baseType: !49, size: 8, offset: 72)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !116, file: !105, line: 77, baseType: !54, size: 16, offset: 80)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !116, file: !105, line: 77, baseType: !49, size: 8, offset: 96)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !116, file: !105, line: 77, baseType: !124, size: 24, offset: 104)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 24, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 3)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !116, file: !105, line: 78, baseType: !21, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !104, file: !105, line: 370, baseType: !129, size: 256)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !105, line: 93, size: 256, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !138}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !129, file: !105, line: 94, baseType: !103, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !129, file: !105, line: 94, baseType: !49, size: 8, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !105, line: 94, baseType: !49, size: 8, offset: 72)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !129, file: !105, line: 94, baseType: !54, size: 16, offset: 80)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !105, line: 94, baseType: !49, size: 8, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !129, file: !105, line: 94, baseType: !137, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !129, file: !105, line: 94, baseType: !16, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !104, file: !105, line: 371, baseType: !140, size: 384)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !105, line: 97, size: 384, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !140, file: !105, line: 98, baseType: !103, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !140, file: !105, line: 98, baseType: !49, size: 8, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !140, file: !105, line: 98, baseType: !49, size: 8, offset: 72)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !140, file: !105, line: 98, baseType: !54, size: 16, offset: 80)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !105, line: 98, baseType: !49, size: 8, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !140, file: !105, line: 98, baseType: !71, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !140, file: !105, line: 98, baseType: !16, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !140, file: !105, line: 99, baseType: !16, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !140, file: !105, line: 100, baseType: !71, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !140, file: !105, line: 101, baseType: !99, size: 64, offset: 320)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !104, file: !105, line: 372, baseType: !153, size: 384)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !105, line: 104, size: 384, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !163, !164, !165}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !153, file: !105, line: 105, baseType: !103, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !153, file: !105, line: 105, baseType: !49, size: 8, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !153, file: !105, line: 105, baseType: !49, size: 8, offset: 72)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !153, file: !105, line: 105, baseType: !54, size: 16, offset: 80)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !153, file: !105, line: 105, baseType: !49, size: 8, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !153, file: !105, line: 105, baseType: !99, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !153, file: !105, line: 106, baseType: !162, size: 64, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !153, file: !105, line: 107, baseType: !71, size: 64, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !153, file: !105, line: 108, baseType: !16, size: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !153, file: !105, line: 109, baseType: !16, size: 32, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !104, file: !105, line: 373, baseType: !167, size: 192)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !105, line: 118, size: 192, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !167, file: !105, line: 119, baseType: !103, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !167, file: !105, line: 119, baseType: !49, size: 8, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !167, file: !105, line: 119, baseType: !49, size: 8, offset: 72)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !167, file: !105, line: 119, baseType: !54, size: 16, offset: 80)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !167, file: !105, line: 119, baseType: !49, size: 8, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !167, file: !105, line: 119, baseType: !26, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !104, file: !105, line: 374, baseType: !176, size: 448)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !105, line: 143, size: 448, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !196, !197, !198}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !176, file: !105, line: 144, baseType: !103, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !176, file: !105, line: 144, baseType: !49, size: 8, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !105, line: 144, baseType: !49, size: 8, offset: 72)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !176, file: !105, line: 144, baseType: !54, size: 16, offset: 80)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !105, line: 144, baseType: !49, size: 8, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !176, file: !105, line: 144, baseType: !49, size: 8, offset: 104)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !176, file: !105, line: 145, baseType: !49, size: 8, offset: 112)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !176, file: !105, line: 146, baseType: !49, size: 8, offset: 120)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !176, file: !105, line: 147, baseType: !103, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !176, file: !105, line: 148, baseType: !103, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !176, file: !105, line: 149, baseType: !71, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !176, file: !105, line: 153, baseType: !190, size: 64, offset: 320)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !176, file: !105, line: 150, size: 64, elements: !191)
!191 = !{!192, !195}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !190, file: !105, line: 151, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !78, line: 248, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !190, file: !105, line: 152, baseType: !103, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !176, file: !105, line: 155, baseType: !16, size: 32, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !176, file: !105, line: 156, baseType: !61, size: 16, offset: 416)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !176, file: !105, line: 157, baseType: !49, size: 8, offset: 432)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !104, file: !105, line: 375, baseType: !200, size: 576)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !105, line: 122, size: 576, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !224, !225, !226, !227}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !200, file: !105, line: 123, baseType: !103, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !200, file: !105, line: 123, baseType: !49, size: 8, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !105, line: 123, baseType: !49, size: 8, offset: 72)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !200, file: !105, line: 123, baseType: !54, size: 16, offset: 80)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !200, file: !105, line: 123, baseType: !49, size: 8, offset: 96)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !200, file: !105, line: 123, baseType: !49, size: 8, offset: 104)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !200, file: !105, line: 124, baseType: !54, size: 16, offset: 112)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !200, file: !105, line: 125, baseType: !26, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !200, file: !105, line: 126, baseType: !21, size: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !200, file: !105, line: 127, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !78, line: 620, size: 320, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !78, line: 621, baseType: !26, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !213, file: !78, line: 621, baseType: !49, size: 8, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !213, file: !78, line: 621, baseType: !49, size: 8, offset: 72)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !78, line: 621, baseType: !54, size: 16, offset: 80)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !213, file: !78, line: 621, baseType: !54, size: 16, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !213, file: !78, line: 621, baseType: !49, size: 8, offset: 112)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !213, file: !78, line: 622, baseType: !43, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !213, file: !78, line: 623, baseType: !103, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !213, file: !78, line: 624, baseType: !21, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !105, line: 128, baseType: !103, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !105, line: 129, baseType: !103, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !105, line: 130, baseType: !99, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !200, file: !105, line: 131, baseType: !49, size: 8, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !104, file: !105, line: 376, baseType: !229, size: 448)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !105, line: 134, size: 448, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !242}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !229, file: !105, line: 135, baseType: !103, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !229, file: !105, line: 135, baseType: !49, size: 8, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !229, file: !105, line: 135, baseType: !49, size: 8, offset: 72)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !229, file: !105, line: 135, baseType: !54, size: 16, offset: 80)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !229, file: !105, line: 135, baseType: !49, size: 8, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !229, file: !105, line: 135, baseType: !49, size: 8, offset: 104)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !229, file: !105, line: 136, baseType: !99, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !229, file: !105, line: 137, baseType: !103, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !105, line: 138, baseType: !103, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !229, file: !105, line: 139, baseType: !241, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !21)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !229, file: !105, line: 140, baseType: !16, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !104, file: !105, line: 377, baseType: !244, size: 320)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !105, line: 184, size: 320, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !255}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !244, file: !105, line: 185, baseType: !103, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !244, file: !105, line: 185, baseType: !49, size: 8, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !105, line: 185, baseType: !49, size: 8, offset: 72)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !244, file: !105, line: 185, baseType: !54, size: 16, offset: 80)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !105, line: 185, baseType: !49, size: 8, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !244, file: !105, line: 185, baseType: !252, size: 128, offset: 128)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 2)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !244, file: !105, line: 185, baseType: !103, size: 64, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !104, file: !105, line: 378, baseType: !257, size: 384)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !105, line: 187, size: 384, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !257, file: !105, line: 188, baseType: !103, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !257, file: !105, line: 188, baseType: !49, size: 8, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !105, line: 188, baseType: !49, size: 8, offset: 72)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !257, file: !105, line: 188, baseType: !54, size: 16, offset: 80)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !105, line: 188, baseType: !49, size: 8, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !257, file: !105, line: 189, baseType: !252, size: 128, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !257, file: !105, line: 189, baseType: !103, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !257, file: !105, line: 189, baseType: !267, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !78, line: 480, size: 576, elements: !269)
!269 = !{!270, !271, !272, !273, !281, !296, !329, !330, !331, !332, !333, !334}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !268, file: !78, line: 481, baseType: !99, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !268, file: !78, line: 482, baseType: !267, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !78, line: 483, baseType: !267, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !268, file: !78, line: 484, baseType: !274, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !78, line: 497, size: 256, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !275, file: !78, line: 498, baseType: !274, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !78, line: 499, baseType: !274, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !275, file: !78, line: 500, baseType: !267, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !275, file: !78, line: 501, baseType: !16, size: 32, offset: 192)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !268, file: !78, line: 485, baseType: !282, size: 64, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !78, line: 466, size: 320, elements: !284)
!284 = !{!285, !290, !291, !292, !293, !294, !295}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !283, file: !78, line: 467, baseType: !286, size: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !78, line: 459, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !286, file: !78, line: 460, baseType: !49, size: 8)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !286, file: !78, line: 461, baseType: !21, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !283, file: !78, line: 468, baseType: !286, size: 128, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !283, file: !78, line: 469, baseType: !54, size: 16, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !283, file: !78, line: 470, baseType: !49, size: 8, offset: 272)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !283, file: !78, line: 471, baseType: !49, size: 8, offset: 280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !283, file: !78, line: 472, baseType: !49, size: 8, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !283, file: !78, line: 473, baseType: !49, size: 8, offset: 296)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !268, file: !78, line: 486, baseType: !297, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !78, line: 448, size: 192, elements: !299)
!299 = !{!300, !324, !325, !326, !327, !328}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !298, file: !78, line: 449, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !78, line: 438, size: 64, elements: !302)
!302 = !{!303, !304, !318}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !301, file: !78, line: 439, baseType: !99, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !301, file: !78, line: 440, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !78, line: 419, size: 256, elements: !307)
!307 = !{!308, !314, !315, !316, !317}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !306, file: !78, line: 420, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!16, !313, !16, !26}
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !26)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !306, file: !78, line: 421, baseType: !26, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !306, file: !78, line: 422, baseType: !99, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !306, file: !78, line: 423, baseType: !49, size: 8, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !306, file: !78, line: 424, baseType: !49, size: 8, offset: 200)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !301, file: !78, line: 441, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !78, line: 429, size: 128, elements: !321)
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !320, file: !78, line: 430, baseType: !99, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !78, line: 431, baseType: !319, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !298, file: !78, line: 450, baseType: !282, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !78, line: 451, baseType: !49, size: 8, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !298, file: !78, line: 452, baseType: !49, size: 8, offset: 136)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !298, file: !78, line: 453, baseType: !49, size: 8, offset: 144)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !298, file: !78, line: 454, baseType: !49, size: 8, offset: 152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !268, file: !78, line: 487, baseType: !21, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !268, file: !78, line: 488, baseType: !16, size: 32, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !268, file: !78, line: 489, baseType: !54, size: 16, offset: 480)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !268, file: !78, line: 490, baseType: !54, size: 16, offset: 496)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !268, file: !78, line: 491, baseType: !49, size: 8, offset: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !268, file: !78, line: 492, baseType: !49, size: 8, offset: 520)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !104, file: !105, line: 379, baseType: !336, size: 384)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !105, line: 192, size: 384, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !336, file: !105, line: 193, baseType: !103, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !336, file: !105, line: 193, baseType: !49, size: 8, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !105, line: 193, baseType: !49, size: 8, offset: 72)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !336, file: !105, line: 193, baseType: !54, size: 16, offset: 80)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !336, file: !105, line: 193, baseType: !49, size: 8, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !336, file: !105, line: 193, baseType: !252, size: 128, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !336, file: !105, line: 193, baseType: !103, size: 64, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !336, file: !105, line: 193, baseType: !16, size: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !336, file: !105, line: 194, baseType: !16, size: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !104, file: !105, line: 380, baseType: !348, size: 384)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !105, line: 197, size: 384, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !348, file: !105, line: 198, baseType: !103, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !348, file: !105, line: 198, baseType: !49, size: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !105, line: 198, baseType: !49, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !348, file: !105, line: 198, baseType: !54, size: 16, offset: 80)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !348, file: !105, line: 198, baseType: !49, size: 8, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !348, file: !105, line: 200, baseType: !49, size: 8, offset: 104)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !348, file: !105, line: 201, baseType: !49, size: 8, offset: 112)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !348, file: !105, line: 202, baseType: !252, size: 128, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !348, file: !105, line: 202, baseType: !103, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !348, file: !105, line: 202, baseType: !360, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !21)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !104, file: !105, line: 381, baseType: !362, size: 320)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !105, line: 205, size: 320, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !362, file: !105, line: 206, baseType: !103, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !362, file: !105, line: 206, baseType: !49, size: 8, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !362, file: !105, line: 206, baseType: !49, size: 8, offset: 72)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !362, file: !105, line: 206, baseType: !54, size: 16, offset: 80)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !105, line: 206, baseType: !49, size: 8, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !362, file: !105, line: 206, baseType: !252, size: 128, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !362, file: !105, line: 206, baseType: !103, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !104, file: !105, line: 382, baseType: !372, size: 384)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !105, line: 233, size: 384, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !372, file: !105, line: 234, baseType: !103, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 72)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !372, file: !105, line: 234, baseType: !54, size: 16, offset: 80)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 104)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 112)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !105, line: 234, baseType: !99, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !372, file: !105, line: 234, baseType: !16, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !372, file: !105, line: 234, baseType: !16, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !372, file: !105, line: 234, baseType: !16, size: 32, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !372, file: !105, line: 234, baseType: !49, size: 8, offset: 296)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !372, file: !105, line: 234, baseType: !103, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !104, file: !105, line: 383, baseType: !390, size: 576)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !105, line: 237, size: 576, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !390, file: !105, line: 238, baseType: !103, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !390, file: !105, line: 238, baseType: !54, size: 16, offset: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 104)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 112)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 120)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !390, file: !105, line: 238, baseType: !99, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !390, file: !105, line: 238, baseType: !16, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !390, file: !105, line: 238, baseType: !16, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !390, file: !105, line: 238, baseType: !16, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !390, file: !105, line: 238, baseType: !49, size: 8, offset: 296)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !390, file: !105, line: 238, baseType: !54, size: 16, offset: 304)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !390, file: !105, line: 239, baseType: !103, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !390, file: !105, line: 240, baseType: !71, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !390, file: !105, line: 241, baseType: !54, size: 16, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !390, file: !105, line: 242, baseType: !71, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !104, file: !105, line: 384, baseType: !412, size: 384)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !105, line: 262, size: 384, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !412, file: !105, line: 263, baseType: !103, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 72)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !412, file: !105, line: 263, baseType: !54, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 104)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 112)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 120)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !412, file: !105, line: 263, baseType: !99, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !412, file: !105, line: 263, baseType: !16, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !412, file: !105, line: 263, baseType: !16, size: 32, offset: 224)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !412, file: !105, line: 263, baseType: !16, size: 32, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 296)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !412, file: !105, line: 263, baseType: !49, size: 8, offset: 304)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !412, file: !105, line: 264, baseType: !103, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !104, file: !105, line: 385, baseType: !431, size: 448)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !105, line: 245, size: 448, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !431, file: !105, line: 246, baseType: !103, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 72)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !431, file: !105, line: 246, baseType: !54, size: 16, offset: 80)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 96)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 104)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 112)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 120)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !431, file: !105, line: 246, baseType: !99, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !431, file: !105, line: 246, baseType: !16, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !431, file: !105, line: 246, baseType: !16, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !431, file: !105, line: 246, baseType: !16, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !431, file: !105, line: 246, baseType: !49, size: 8, offset: 296)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !431, file: !105, line: 246, baseType: !103, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !431, file: !105, line: 247, baseType: !103, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !104, file: !105, line: 386, baseType: !450, size: 448)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !105, line: 250, size: 448, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !450, file: !105, line: 251, baseType: !103, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 72)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !450, file: !105, line: 251, baseType: !54, size: 16, offset: 80)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 104)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 120)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !450, file: !105, line: 251, baseType: !99, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !450, file: !105, line: 251, baseType: !16, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !450, file: !105, line: 251, baseType: !16, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !450, file: !105, line: 251, baseType: !16, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !450, file: !105, line: 251, baseType: !49, size: 8, offset: 296)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !450, file: !105, line: 256, baseType: !103, size: 64, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !450, file: !105, line: 257, baseType: !103, size: 64, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !104, file: !105, line: 387, baseType: !469, size: 512)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !105, line: 273, size: 512, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !478, !483, !484}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !469, file: !105, line: 274, baseType: !103, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !469, file: !105, line: 274, baseType: !49, size: 8, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !105, line: 274, baseType: !49, size: 8, offset: 72)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !469, file: !105, line: 274, baseType: !54, size: 16, offset: 80)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !469, file: !105, line: 274, baseType: !49, size: 8, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !469, file: !105, line: 274, baseType: !99, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !469, file: !105, line: 275, baseType: !16, size: 32, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !469, file: !105, line: 276, baseType: !479, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !313, !16, !26}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !469, file: !105, line: 277, baseType: !26, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !105, line: 278, baseType: !252, size: 128, offset: 384)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !104, file: !105, line: 388, baseType: !486, size: 512)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !105, line: 281, size: 512, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !501, !502, !503, !509, !510}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !486, file: !105, line: 282, baseType: !103, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !486, file: !105, line: 282, baseType: !49, size: 8, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !105, line: 282, baseType: !49, size: 8, offset: 72)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !486, file: !105, line: 282, baseType: !54, size: 16, offset: 80)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !486, file: !105, line: 282, baseType: !49, size: 8, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !486, file: !105, line: 282, baseType: !49, size: 8, offset: 104)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !486, file: !105, line: 283, baseType: !49, size: 8, offset: 112)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !486, file: !105, line: 284, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!14, !16, !241, !16, !500, !26, !26}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !486, file: !105, line: 285, baseType: !99, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !486, file: !105, line: 286, baseType: !26, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !486, file: !105, line: 287, baseType: !504, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DISubroutineType(types: !507)
!507 = !{!14, !313, !16, !26, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !486, file: !105, line: 288, baseType: !103, size: 64, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !486, file: !105, line: 289, baseType: !103, size: 64, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !104, file: !105, line: 389, baseType: !512, size: 512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !105, line: 307, size: 512, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !512, file: !105, line: 308, baseType: !103, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !512, file: !105, line: 308, baseType: !49, size: 8, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !105, line: 308, baseType: !49, size: 8, offset: 72)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !512, file: !105, line: 308, baseType: !54, size: 16, offset: 80)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !512, file: !105, line: 308, baseType: !49, size: 8, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !512, file: !105, line: 308, baseType: !49, size: 8, offset: 104)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !512, file: !105, line: 309, baseType: !49, size: 8, offset: 112)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !512, file: !105, line: 310, baseType: !49, size: 8, offset: 120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !512, file: !105, line: 311, baseType: !26, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !512, file: !105, line: 312, baseType: !99, size: 64, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !512, file: !105, line: 313, baseType: !162, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !512, file: !105, line: 314, baseType: !71, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !512, file: !105, line: 315, baseType: !71, size: 64, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !512, file: !105, line: 316, baseType: !16, size: 32, offset: 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !104, file: !105, line: 390, baseType: !529, size: 448)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !105, line: 340, size: 448, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !529, file: !105, line: 341, baseType: !103, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !529, file: !105, line: 341, baseType: !49, size: 8, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !529, file: !105, line: 341, baseType: !49, size: 8, offset: 72)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !529, file: !105, line: 341, baseType: !54, size: 16, offset: 80)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !105, line: 341, baseType: !49, size: 8, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !529, file: !105, line: 341, baseType: !99, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !529, file: !105, line: 342, baseType: !99, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !529, file: !105, line: 343, baseType: !26, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !529, file: !105, line: 344, baseType: !71, size: 64, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !529, file: !105, line: 345, baseType: !16, size: 32, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !105, line: 391, baseType: !542, size: 256)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !105, line: 350, size: 256, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !554}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !542, file: !105, line: 351, baseType: !103, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !542, file: !105, line: 351, baseType: !49, size: 8, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !105, line: 351, baseType: !49, size: 8, offset: 72)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !542, file: !105, line: 351, baseType: !54, size: 16, offset: 80)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !542, file: !105, line: 351, baseType: !49, size: 8, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !542, file: !105, line: 351, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !313, !26}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !542, file: !105, line: 352, baseType: !26, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !104, file: !105, line: 392, baseType: !556, size: 192)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !105, line: 357, size: 192, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !556, file: !105, line: 358, baseType: !103, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !556, file: !105, line: 358, baseType: !49, size: 8, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !105, line: 358, baseType: !49, size: 8, offset: 72)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !556, file: !105, line: 358, baseType: !54, size: 16, offset: 80)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !556, file: !105, line: 358, baseType: !49, size: 8, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !105, line: 358, baseType: !103, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !104, file: !105, line: 399, baseType: !100, size: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !100, file: !78, line: 135, baseType: !49, size: 8, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !78, line: 136, baseType: !49, size: 8, offset: 72)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !100, file: !78, line: 137, baseType: !54, size: 16, offset: 80)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !100, file: !78, line: 138, baseType: !569, size: 32, offset: 96)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !570, line: 327, size: 32, elements: !571)
!570 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !569, file: !570, line: 328, baseType: !16, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !569, file: !570, line: 329, baseType: !574, size: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 32, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 4)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !100, file: !78, line: 139, baseType: !99, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !100, file: !78, line: 140, baseType: !99, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !100, file: !78, line: 141, baseType: !99, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !100, file: !78, line: 142, baseType: !61, size: 16, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !90, file: !78, line: 829, baseType: !582, size: 64, offset: 320)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !78, line: 716, size: 64, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !582, file: !78, line: 717, baseType: !21, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !582, file: !78, line: 718, baseType: !16, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !582, file: !78, line: 719, baseType: !137, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !582, file: !78, line: 720, baseType: !71, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !78, line: 721, baseType: !137, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !582, file: !78, line: 722, baseType: !86, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !90, file: !78, line: 829, baseType: !49, size: 8, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !87, file: !78, line: 877, baseType: !592, size: 640)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !78, line: 835, size: 640, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !592, file: !78, line: 836, baseType: !86, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !592, file: !78, line: 836, baseType: !49, size: 8, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !78, line: 836, baseType: !49, size: 8, offset: 72)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !592, file: !78, line: 836, baseType: !54, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !592, file: !78, line: 836, baseType: !71, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !592, file: !78, line: 836, baseType: !86, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !592, file: !78, line: 836, baseType: !99, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !592, file: !78, line: 836, baseType: !582, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !592, file: !78, line: 836, baseType: !49, size: 8, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !592, file: !78, line: 836, baseType: !137, size: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !592, file: !78, line: 837, baseType: !71, size: 64, offset: 512)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !592, file: !78, line: 838, baseType: !16, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !592, file: !78, line: 839, baseType: !16, size: 32, offset: 608)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !87, file: !78, line: 878, baseType: !608, size: 1600)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !78, line: 846, size: 1600, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !608, file: !78, line: 847, baseType: !86, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !608, file: !78, line: 847, baseType: !49, size: 8, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !78, line: 847, baseType: !49, size: 8, offset: 72)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !608, file: !78, line: 847, baseType: !54, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !608, file: !78, line: 847, baseType: !71, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !608, file: !78, line: 847, baseType: !86, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !608, file: !78, line: 847, baseType: !99, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !608, file: !78, line: 847, baseType: !582, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !608, file: !78, line: 847, baseType: !49, size: 8, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !608, file: !78, line: 847, baseType: !86, size: 64, offset: 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !608, file: !78, line: 848, baseType: !86, size: 64, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !608, file: !78, line: 849, baseType: !137, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !608, file: !78, line: 850, baseType: !49, size: 8, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !608, file: !78, line: 851, baseType: !137, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !608, file: !78, line: 852, baseType: !137, size: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !608, file: !78, line: 853, baseType: !137, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !608, file: !78, line: 854, baseType: !574, size: 32, offset: 896)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !608, file: !78, line: 855, baseType: !16, size: 32, offset: 928)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !608, file: !78, line: 856, baseType: !16, size: 32, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !608, file: !78, line: 857, baseType: !16, size: 32, offset: 992)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !608, file: !78, line: 858, baseType: !16, size: 32, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !608, file: !78, line: 859, baseType: !16, size: 32, offset: 1056)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !608, file: !78, line: 860, baseType: !16, size: 32, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !608, file: !78, line: 861, baseType: !16, size: 32, offset: 1120)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !608, file: !78, line: 862, baseType: !16, size: 32, offset: 1152)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !608, file: !78, line: 863, baseType: !16, size: 32, offset: 1184)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !608, file: !78, line: 864, baseType: !16, size: 32, offset: 1216)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !608, file: !78, line: 865, baseType: !16, size: 32, offset: 1248)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !608, file: !78, line: 866, baseType: !16, size: 32, offset: 1280)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !608, file: !78, line: 867, baseType: !16, size: 32, offset: 1312)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !608, file: !78, line: 868, baseType: !54, size: 16, offset: 1344)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !608, file: !78, line: 869, baseType: !49, size: 8, offset: 1360)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !608, file: !78, line: 870, baseType: !49, size: 8, offset: 1368)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !608, file: !78, line: 871, baseType: !49, size: 8, offset: 1376)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !608, file: !78, line: 872, baseType: !645, size: 160, offset: 1384)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 160, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 20)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !77, file: !78, line: 900, baseType: !99, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !77, file: !78, line: 901, baseType: !650, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !78, line: 663, size: 640, elements: !652)
!652 = !{!653, !661, !674, !683, !692, !705, !719, !720, !732}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !651, file: !78, line: 664, baseType: !654, size: 128)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !78, line: 567, size: 128, elements: !655)
!655 = !{!656, !657, !658, !659, !660}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !78, line: 568, baseType: !26, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !654, file: !78, line: 568, baseType: !49, size: 8, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !78, line: 568, baseType: !49, size: 8, offset: 72)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !654, file: !78, line: 568, baseType: !54, size: 16, offset: 80)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !654, file: !78, line: 568, baseType: !54, size: 16, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !651, file: !78, line: 665, baseType: !662, size: 384)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !78, line: 593, size: 384, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !662, file: !78, line: 594, baseType: !26, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !662, file: !78, line: 594, baseType: !49, size: 8, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !662, file: !78, line: 594, baseType: !49, size: 8, offset: 72)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !78, line: 594, baseType: !54, size: 16, offset: 80)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !662, file: !78, line: 594, baseType: !54, size: 16, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !662, file: !78, line: 594, baseType: !54, size: 16, offset: 112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !662, file: !78, line: 595, baseType: !86, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !662, file: !78, line: 596, baseType: !71, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !662, file: !78, line: 597, baseType: !71, size: 64, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !662, file: !78, line: 598, baseType: !21, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !651, file: !78, line: 666, baseType: !675, size: 192)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !78, line: 573, size: 192, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !78, line: 574, baseType: !26, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !675, file: !78, line: 574, baseType: !49, size: 8, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !78, line: 574, baseType: !49, size: 8, offset: 72)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !675, file: !78, line: 574, baseType: !54, size: 16, offset: 80)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !675, file: !78, line: 574, baseType: !54, size: 16, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !675, file: !78, line: 574, baseType: !103, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !651, file: !78, line: 667, baseType: !684, size: 192)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !78, line: 604, size: 192, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !78, line: 605, baseType: !26, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !684, file: !78, line: 605, baseType: !49, size: 8, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !684, file: !78, line: 605, baseType: !49, size: 8, offset: 72)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !684, file: !78, line: 605, baseType: !54, size: 16, offset: 80)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !684, file: !78, line: 605, baseType: !54, size: 16, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !684, file: !78, line: 605, baseType: !99, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !651, file: !78, line: 668, baseType: !693, size: 448)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !78, line: 608, size: 448, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !78, line: 609, baseType: !26, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !693, file: !78, line: 609, baseType: !49, size: 8, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !78, line: 609, baseType: !49, size: 8, offset: 72)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !693, file: !78, line: 609, baseType: !54, size: 16, offset: 80)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !693, file: !78, line: 609, baseType: !54, size: 16, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !693, file: !78, line: 609, baseType: !16, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !693, file: !78, line: 610, baseType: !86, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !693, file: !78, line: 611, baseType: !71, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !693, file: !78, line: 612, baseType: !71, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !693, file: !78, line: 613, baseType: !16, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !651, file: !78, line: 669, baseType: !706, size: 512)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !78, line: 580, size: 512, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !78, line: 581, baseType: !26, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !706, file: !78, line: 581, baseType: !49, size: 8, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !706, file: !78, line: 581, baseType: !49, size: 8, offset: 72)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !706, file: !78, line: 581, baseType: !54, size: 16, offset: 80)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !706, file: !78, line: 581, baseType: !54, size: 16, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !706, file: !78, line: 581, baseType: !16, size: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !706, file: !78, line: 582, baseType: !103, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !706, file: !78, line: 583, baseType: !103, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !706, file: !78, line: 584, baseType: !43, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !706, file: !78, line: 585, baseType: !26, size: 64, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !706, file: !78, line: 586, baseType: !16, size: 32, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !651, file: !78, line: 670, baseType: !213, size: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !651, file: !78, line: 671, baseType: !721, size: 640)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !78, line: 631, size: 640, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !721, file: !78, line: 632, baseType: !26, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !721, file: !78, line: 632, baseType: !49, size: 8, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !721, file: !78, line: 632, baseType: !49, size: 8, offset: 72)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !721, file: !78, line: 632, baseType: !54, size: 16, offset: 80)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !721, file: !78, line: 632, baseType: !54, size: 16, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !721, file: !78, line: 633, baseType: !729, size: 512, offset: 128)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 8)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !651, file: !78, line: 672, baseType: !733, size: 320)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !78, line: 654, size: 320, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740, !741, !742, !743}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !733, file: !78, line: 655, baseType: !26, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !733, file: !78, line: 655, baseType: !49, size: 8, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !78, line: 655, baseType: !49, size: 8, offset: 72)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !733, file: !78, line: 655, baseType: !54, size: 16, offset: 80)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !733, file: !78, line: 655, baseType: !54, size: 16, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !733, file: !78, line: 655, baseType: !49, size: 8, offset: 112)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !733, file: !78, line: 656, baseType: !99, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !733, file: !78, line: 657, baseType: !103, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !733, file: !78, line: 658, baseType: !744, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !78, line: 645, size: 128, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !745, file: !78, line: 646, baseType: !479, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !745, file: !78, line: 647, baseType: !26, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !77, file: !78, line: 902, baseType: !86, size: 64, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !77, file: !78, line: 903, baseType: !16, size: 32, offset: 576)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !44, file: !45, line: 61, baseType: !16, size: 32, offset: 1088)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !44, file: !45, line: 62, baseType: !16, size: 32, offset: 1120)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !44, file: !45, line: 63, baseType: !54, size: 16, offset: 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !44, file: !45, line: 64, baseType: !49, size: 8, offset: 1168)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !44, file: !45, line: 66, baseType: !756, size: 2688, offset: 1216)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2688, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 7)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !44, file: !45, line: 67, baseType: !760, size: 3072, offset: 3904)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 3072, elements: !730)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !44, file: !45, line: 68, baseType: !762, size: 576, offset: 6976)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 576, elements: !32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !44, file: !45, line: 69, baseType: !162, size: 64, offset: 7552)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !44, file: !45, line: 71, baseType: !71, size: 64, offset: 7616)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !44, file: !45, line: 72, baseType: !162, size: 64, offset: 7680)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !44, file: !45, line: 73, baseType: !650, size: 64, offset: 7744)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !44, file: !45, line: 74, baseType: !99, size: 64, offset: 7808)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !44, file: !45, line: 75, baseType: !103, size: 64, offset: 7872)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !44, file: !45, line: 76, baseType: !99, size: 64, offset: 7936)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !44, file: !45, line: 77, baseType: !86, size: 64, offset: 8000)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !44, file: !45, line: 78, baseType: !103, size: 64, offset: 8064)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !44, file: !45, line: 79, baseType: !99, size: 64, offset: 8128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !44, file: !45, line: 80, baseType: !137, size: 64, offset: 8192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !44, file: !45, line: 81, baseType: !86, size: 64, offset: 8256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !44, file: !45, line: 82, baseType: !776, size: 64, offset: 8320)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !78, line: 702, size: 128, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !778, file: !78, line: 706, baseType: !16, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !778, file: !78, line: 707, baseType: !16, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !778, file: !78, line: 708, baseType: !54, size: 16, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !778, file: !78, line: 709, baseType: !49, size: 8, offset: 80)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !778, file: !78, line: 710, baseType: !49, size: 8, offset: 88)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !778, file: !78, line: 711, baseType: !49, size: 8, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !44, file: !45, line: 83, baseType: !86, size: 64, offset: 8384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !44, file: !45, line: 84, baseType: !103, size: 64, offset: 8448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !44, file: !45, line: 85, baseType: !650, size: 64, offset: 8512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !44, file: !45, line: 86, baseType: !103, size: 64, offset: 8576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !44, file: !45, line: 87, baseType: !650, size: 64, offset: 8640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !44, file: !45, line: 88, baseType: !86, size: 64, offset: 8704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !44, file: !45, line: 89, baseType: !86, size: 64, offset: 8768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !44, file: !45, line: 90, baseType: !212, size: 64, offset: 8832)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !44, file: !45, line: 91, baseType: !795, size: 64, offset: 8896)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !78, line: 637, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!14, !43, !799}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !44, file: !45, line: 92, baseType: !801, size: 64, offset: 8960)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !78, line: 641, baseType: !194)
!802 = !{}
!803 = !DILocalVariable(name: "walk_state", arg: 1, scope: !40, file: !3, line: 51, type: !43)
!804 = !DILocation(line: 51, column: 61, scope: !40)
!805 = !DILocalVariable(name: "operand", scope: !40, file: !3, line: 53, type: !162)
!806 = !DILocation(line: 53, column: 30, scope: !40)
!807 = !DILocation(line: 53, column: 41, scope: !40)
!808 = !DILocation(line: 53, column: 53, scope: !40)
!809 = !DILocalVariable(name: "fatal", scope: !40, file: !3, line: 54, type: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_signal_fatal_info", file: !812, line: 38, size: 96, elements: !813)
!812 = !DIFile(filename: "./include/acpi/acpiosxf.h", directory: "/home/lizy2001/genbc/linux")
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !811, file: !812, line: 39, baseType: !16, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !811, file: !812, line: 40, baseType: !16, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "argument", scope: !811, file: !812, line: 41, baseType: !16, size: 32, offset: 64)
!817 = !DILocation(line: 54, column: 33, scope: !40)
!818 = !DILocalVariable(name: "status", scope: !40, file: !3, line: 55, type: !14)
!819 = !DILocation(line: 55, column: 14, scope: !40)
!820 = !DILocation(line: 60, column: 10, scope: !40)
!821 = !DILocation(line: 60, column: 22, scope: !40)
!822 = !DILocation(line: 60, column: 2, scope: !40)
!823 = !DILocation(line: 70, column: 11, scope: !824)
!824 = distinct !DILexicalBlock(scope: !40, file: !3, line: 60, column: 30)
!825 = !DILocation(line: 70, column: 9, scope: !824)
!826 = !DILocation(line: 71, column: 7, scope: !827)
!827 = distinct !DILexicalBlock(scope: !824, file: !3, line: 71, column: 7)
!828 = !DILocation(line: 71, column: 7, scope: !824)
!829 = !DILocation(line: 72, column: 24, scope: !830)
!830 = distinct !DILexicalBlock(scope: !827, file: !3, line: 71, column: 14)
!831 = !DILocation(line: 72, column: 36, scope: !830)
!832 = !DILocation(line: 72, column: 44, scope: !830)
!833 = !DILocation(line: 72, column: 18, scope: !830)
!834 = !DILocation(line: 72, column: 4, scope: !830)
!835 = !DILocation(line: 72, column: 11, scope: !830)
!836 = !DILocation(line: 72, column: 16, scope: !830)
!837 = !DILocation(line: 73, column: 24, scope: !830)
!838 = !DILocation(line: 73, column: 36, scope: !830)
!839 = !DILocation(line: 73, column: 44, scope: !830)
!840 = !DILocation(line: 73, column: 18, scope: !830)
!841 = !DILocation(line: 73, column: 4, scope: !830)
!842 = !DILocation(line: 73, column: 11, scope: !830)
!843 = !DILocation(line: 73, column: 16, scope: !830)
!844 = !DILocation(line: 74, column: 28, scope: !830)
!845 = !DILocation(line: 74, column: 40, scope: !830)
!846 = !DILocation(line: 74, column: 48, scope: !830)
!847 = !DILocation(line: 74, column: 22, scope: !830)
!848 = !DILocation(line: 74, column: 4, scope: !830)
!849 = !DILocation(line: 74, column: 11, scope: !830)
!850 = !DILocation(line: 74, column: 20, scope: !830)
