; ModuleID = '../bcout/drivers/acpi/acpica/exoparg2.llvm.bc'
source_filename = "drivers/acpi/acpica/exoparg2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_walk_state = type { %struct.acpi_walk_state*, i8, i8, i16, i8, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8*, i32, i32, i32, i32, %struct.acpi_parse_state, i32, i32, i16, i8, [7 x %struct.acpi_namespace_node], [8 x %struct.acpi_namespace_node], [9 x %union.acpi_operand_object*], %union.acpi_operand_object**, i8*, %union.acpi_operand_object**, %union.acpi_generic_state*, %struct.acpi_namespace_node*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, %union.acpi_parse_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8*, %union.acpi_parse_object*, %struct.acpi_opcode_info*, %union.acpi_parse_object*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_parse_object*, %union.acpi_parse_object*, %struct.acpi_thread_state*, i32 (%struct.acpi_walk_state*, %union.acpi_parse_object**)*, {}* }
%struct.acpi_parse_state = type { i8*, i8*, i8*, i8*, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_generic_state*, %union.acpi_parse_object*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 18, type: !792, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !17, globals: !791, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/exoparg2.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 321, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "ACPI_REFCLASS_LOCAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_REFCLASS_ARG", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_REFCLASS_REFOF", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "ACPI_REFCLASS_INDEX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "ACPI_REFCLASS_TABLE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "ACPI_REFCLASS_NAME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "ACPI_REFCLASS_DEBUG", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "ACPI_REFCLASS_MAX", value: 6, isUnsigned: true)
!17 = !{!18, !24, !20, !59}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !19, line: 421, baseType: !20)
!19 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !21, line: 21, baseType: !22)
!21 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !23, line: 27, baseType: !7)
!23 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !26, line: 133, size: 384, elements: !27)
!26 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!27 = !{!28, !778, !779, !780, !781, !787, !788, !789, !790}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !25, file: !26, line: 134, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !6, line: 367, size: 576, elements: !31)
!31 = !{!32, !46, !62, !74, !88, !102, !112, !429, !446, !461, !474, !552, !564, !578, !588, !606, !628, !647, !666, !685, !698, !724, !741, !754, !768, !777}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !30, file: !6, line: 368, baseType: !33, size: 128)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !6, line: 73, size: 128, elements: !34)
!34 = !{!35, !36, !40, !41, !45}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !33, file: !6, line: 74, baseType: !29, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !33, file: !6, line: 74, baseType: !37, size: 8, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !21, line: 17, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !23, line: 21, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !6, line: 74, baseType: !37, size: 8, offset: 72)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !33, file: !6, line: 74, baseType: !42, size: 16, offset: 80)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !21, line: 19, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !23, line: 24, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !6, line: 74, baseType: !37, size: 8, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !30, file: !6, line: 369, baseType: !47, size: 192)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !6, line: 76, size: 192, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !58}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !47, file: !6, line: 77, baseType: !29, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !47, file: !6, line: 77, baseType: !37, size: 8, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !47, file: !6, line: 77, baseType: !37, size: 8, offset: 72)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !47, file: !6, line: 77, baseType: !42, size: 16, offset: 80)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !47, file: !6, line: 77, baseType: !37, size: 8, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !47, file: !6, line: 77, baseType: !55, size: 24, offset: 104)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 24, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 3)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !47, file: !6, line: 78, baseType: !59, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !21, line: 23, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !23, line: 31, baseType: !61)
!61 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !30, file: !6, line: 370, baseType: !63, size: 256)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !6, line: 93, size: 256, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !63, file: !6, line: 94, baseType: !29, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !63, file: !6, line: 94, baseType: !37, size: 8, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !6, line: 94, baseType: !37, size: 8, offset: 72)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !63, file: !6, line: 94, baseType: !42, size: 16, offset: 80)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !6, line: 94, baseType: !37, size: 8, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !63, file: !6, line: 94, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !63, file: !6, line: 94, baseType: !20, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !30, file: !6, line: 371, baseType: !75, size: 384)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !6, line: 97, size: 384, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !84, !85, !86, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !75, file: !6, line: 98, baseType: !29, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !75, file: !6, line: 98, baseType: !37, size: 8, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !6, line: 98, baseType: !37, size: 8, offset: 72)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !75, file: !6, line: 98, baseType: !42, size: 16, offset: 80)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !6, line: 98, baseType: !37, size: 8, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !75, file: !6, line: 98, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !75, file: !6, line: 98, baseType: !20, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !75, file: !6, line: 99, baseType: !20, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !75, file: !6, line: 100, baseType: !83, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !75, file: !6, line: 101, baseType: !24, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !30, file: !6, line: 372, baseType: !89, size: 384)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !6, line: 104, size: 384, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !99, !100, !101}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !89, file: !6, line: 105, baseType: !29, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !89, file: !6, line: 105, baseType: !37, size: 8, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !6, line: 105, baseType: !37, size: 8, offset: 72)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !89, file: !6, line: 105, baseType: !42, size: 16, offset: 80)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !6, line: 105, baseType: !37, size: 8, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !89, file: !6, line: 105, baseType: !24, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !89, file: !6, line: 106, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !89, file: !6, line: 107, baseType: !83, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !89, file: !6, line: 108, baseType: !20, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !89, file: !6, line: 109, baseType: !20, size: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !30, file: !6, line: 373, baseType: !103, size: 192)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !6, line: 118, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !103, file: !6, line: 119, baseType: !29, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !103, file: !6, line: 119, baseType: !37, size: 8, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !6, line: 119, baseType: !37, size: 8, offset: 72)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !103, file: !6, line: 119, baseType: !42, size: 16, offset: 80)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !103, file: !6, line: 119, baseType: !37, size: 8, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !103, file: !6, line: 119, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !30, file: !6, line: 374, baseType: !113, size: 448)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !6, line: 143, size: 448, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !426, !427, !428}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !113, file: !6, line: 144, baseType: !29, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !113, file: !6, line: 144, baseType: !37, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !6, line: 144, baseType: !37, size: 8, offset: 72)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !113, file: !6, line: 144, baseType: !42, size: 16, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !6, line: 144, baseType: !37, size: 8, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !113, file: !6, line: 144, baseType: !37, size: 8, offset: 104)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !113, file: !6, line: 145, baseType: !37, size: 8, offset: 112)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !113, file: !6, line: 146, baseType: !37, size: 8, offset: 120)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !113, file: !6, line: 147, baseType: !29, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !113, file: !6, line: 148, baseType: !29, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !113, file: !6, line: 149, baseType: !83, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !113, file: !6, line: 153, baseType: !127, size: 64, offset: 320)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !113, file: !6, line: 150, size: 64, elements: !128)
!128 = !{!129, !425}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !127, file: !6, line: 151, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !26, line: 248, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!18, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !136, line: 37, size: 9024, elements: !137)
!136 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !371, !372, !373, !374, !375, !379, !381, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !408, !409, !410, !411, !412, !413, !414, !415, !417, !423}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !136, line: 38, baseType: !134, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !135, file: !136, line: 39, baseType: !37, size: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !135, file: !136, line: 40, baseType: !37, size: 8, offset: 72)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !135, file: !136, line: 41, baseType: !42, size: 16, offset: 80)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !135, file: !136, line: 42, baseType: !37, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !135, file: !136, line: 43, baseType: !37, size: 8, offset: 104)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !135, file: !136, line: 44, baseType: !37, size: 8, offset: 112)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !135, file: !136, line: 45, baseType: !146, size: 16, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !19, line: 445, baseType: !42)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !135, file: !136, line: 46, baseType: !37, size: 8, offset: 144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !135, file: !136, line: 47, baseType: !37, size: 8, offset: 152)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !135, file: !136, line: 48, baseType: !37, size: 8, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !135, file: !136, line: 49, baseType: !37, size: 8, offset: 168)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !135, file: !136, line: 50, baseType: !37, size: 8, offset: 176)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !135, file: !136, line: 51, baseType: !37, size: 8, offset: 184)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !135, file: !136, line: 52, baseType: !37, size: 8, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !135, file: !136, line: 53, baseType: !37, size: 8, offset: 200)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !135, file: !136, line: 54, baseType: !83, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !135, file: !136, line: 55, baseType: !20, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !135, file: !136, line: 56, baseType: !20, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !135, file: !136, line: 57, baseType: !20, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !135, file: !136, line: 58, baseType: !20, size: 32, offset: 416)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !135, file: !136, line: 60, baseType: !161, size: 640, offset: 448)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !26, line: 893, size: 640, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !252, !253, !369, !370}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !161, file: !26, line: 894, baseType: !83, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !161, file: !26, line: 895, baseType: !83, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !161, file: !26, line: 896, baseType: !83, size: 64, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !161, file: !26, line: 897, baseType: !83, size: 64, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !161, file: !26, line: 898, baseType: !83, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !161, file: !26, line: 899, baseType: !169, size: 64, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !26, line: 875, size: 1600, elements: !171)
!171 = !{!172, !192, !208}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !170, file: !26, line: 876, baseType: !173, size: 448)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !26, line: 828, size: 448, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !191}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !173, file: !26, line: 829, baseType: !169, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !173, file: !26, line: 829, baseType: !37, size: 8, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !173, file: !26, line: 829, baseType: !37, size: 8, offset: 72)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !173, file: !26, line: 829, baseType: !42, size: 16, offset: 80)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !173, file: !26, line: 829, baseType: !83, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !26, line: 829, baseType: !169, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !173, file: !26, line: 829, baseType: !24, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !173, file: !26, line: 829, baseType: !183, size: 64, offset: 320)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !26, line: 716, size: 64, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !183, file: !26, line: 717, baseType: !59, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !26, line: 718, baseType: !20, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !183, file: !26, line: 719, baseType: !71, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !183, file: !26, line: 720, baseType: !83, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !183, file: !26, line: 721, baseType: !71, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !183, file: !26, line: 722, baseType: !169, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !173, file: !26, line: 829, baseType: !37, size: 8, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !170, file: !26, line: 877, baseType: !193, size: 640)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !26, line: 835, size: 640, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !193, file: !26, line: 836, baseType: !169, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !193, file: !26, line: 836, baseType: !37, size: 8, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !193, file: !26, line: 836, baseType: !37, size: 8, offset: 72)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !193, file: !26, line: 836, baseType: !42, size: 16, offset: 80)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !193, file: !26, line: 836, baseType: !83, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !26, line: 836, baseType: !169, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !193, file: !26, line: 836, baseType: !24, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !193, file: !26, line: 836, baseType: !183, size: 64, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !193, file: !26, line: 836, baseType: !37, size: 8, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !193, file: !26, line: 836, baseType: !71, size: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !193, file: !26, line: 837, baseType: !83, size: 64, offset: 512)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !193, file: !26, line: 838, baseType: !20, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !193, file: !26, line: 839, baseType: !20, size: 32, offset: 608)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !170, file: !26, line: 878, baseType: !209, size: 1600)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !26, line: 846, size: 1600, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !209, file: !26, line: 847, baseType: !169, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !209, file: !26, line: 847, baseType: !37, size: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !209, file: !26, line: 847, baseType: !37, size: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !209, file: !26, line: 847, baseType: !42, size: 16, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !209, file: !26, line: 847, baseType: !83, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !26, line: 847, baseType: !169, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !209, file: !26, line: 847, baseType: !24, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !209, file: !26, line: 847, baseType: !183, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !209, file: !26, line: 847, baseType: !37, size: 8, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !209, file: !26, line: 847, baseType: !169, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !209, file: !26, line: 848, baseType: !169, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !209, file: !26, line: 849, baseType: !71, size: 64, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !209, file: !26, line: 850, baseType: !37, size: 8, offset: 640)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !209, file: !26, line: 851, baseType: !71, size: 64, offset: 704)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !209, file: !26, line: 852, baseType: !71, size: 64, offset: 768)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !209, file: !26, line: 853, baseType: !71, size: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !209, file: !26, line: 854, baseType: !228, size: 32, offset: 896)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 4)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !209, file: !26, line: 855, baseType: !20, size: 32, offset: 928)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !209, file: !26, line: 856, baseType: !20, size: 32, offset: 960)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !209, file: !26, line: 857, baseType: !20, size: 32, offset: 992)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !209, file: !26, line: 858, baseType: !20, size: 32, offset: 1024)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !209, file: !26, line: 859, baseType: !20, size: 32, offset: 1056)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !209, file: !26, line: 860, baseType: !20, size: 32, offset: 1088)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !209, file: !26, line: 861, baseType: !20, size: 32, offset: 1120)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !209, file: !26, line: 862, baseType: !20, size: 32, offset: 1152)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !209, file: !26, line: 863, baseType: !20, size: 32, offset: 1184)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !209, file: !26, line: 864, baseType: !20, size: 32, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !209, file: !26, line: 865, baseType: !20, size: 32, offset: 1248)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !209, file: !26, line: 866, baseType: !20, size: 32, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !209, file: !26, line: 867, baseType: !20, size: 32, offset: 1312)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !209, file: !26, line: 868, baseType: !42, size: 16, offset: 1344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !209, file: !26, line: 869, baseType: !37, size: 8, offset: 1360)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !209, file: !26, line: 870, baseType: !37, size: 8, offset: 1368)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !209, file: !26, line: 871, baseType: !37, size: 8, offset: 1376)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !209, file: !26, line: 872, baseType: !249, size: 160, offset: 1384)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 20)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !161, file: !26, line: 900, baseType: !24, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !161, file: !26, line: 901, baseType: !254, size: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !26, line: 663, size: 640, elements: !256)
!256 = !{!257, !265, !278, !287, !296, !309, !323, !335, !347}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !255, file: !26, line: 664, baseType: !258, size: 128)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !26, line: 567, size: 128, elements: !259)
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !258, file: !26, line: 568, baseType: !111, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !258, file: !26, line: 568, baseType: !37, size: 8, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !26, line: 568, baseType: !37, size: 8, offset: 72)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !258, file: !26, line: 568, baseType: !42, size: 16, offset: 80)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !258, file: !26, line: 568, baseType: !42, size: 16, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !255, file: !26, line: 665, baseType: !266, size: 384)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !26, line: 593, size: 384, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !26, line: 594, baseType: !111, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !266, file: !26, line: 594, baseType: !37, size: 8, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !266, file: !26, line: 594, baseType: !37, size: 8, offset: 72)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !266, file: !26, line: 594, baseType: !42, size: 16, offset: 80)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !26, line: 594, baseType: !42, size: 16, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !266, file: !26, line: 594, baseType: !42, size: 16, offset: 112)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !266, file: !26, line: 595, baseType: !169, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !266, file: !26, line: 596, baseType: !83, size: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !266, file: !26, line: 597, baseType: !83, size: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !266, file: !26, line: 598, baseType: !59, size: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !255, file: !26, line: 666, baseType: !279, size: 192)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !26, line: 573, size: 192, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !26, line: 574, baseType: !111, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !279, file: !26, line: 574, baseType: !37, size: 8, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !26, line: 574, baseType: !37, size: 8, offset: 72)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !279, file: !26, line: 574, baseType: !42, size: 16, offset: 80)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !279, file: !26, line: 574, baseType: !42, size: 16, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !279, file: !26, line: 574, baseType: !29, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !255, file: !26, line: 667, baseType: !288, size: 192)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !26, line: 604, size: 192, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !26, line: 605, baseType: !111, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !288, file: !26, line: 605, baseType: !37, size: 8, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !288, file: !26, line: 605, baseType: !37, size: 8, offset: 72)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !288, file: !26, line: 605, baseType: !42, size: 16, offset: 80)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !288, file: !26, line: 605, baseType: !42, size: 16, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !288, file: !26, line: 605, baseType: !24, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !255, file: !26, line: 668, baseType: !297, size: 448)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !26, line: 608, size: 448, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !26, line: 609, baseType: !111, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !297, file: !26, line: 609, baseType: !37, size: 8, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !297, file: !26, line: 609, baseType: !37, size: 8, offset: 72)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !297, file: !26, line: 609, baseType: !42, size: 16, offset: 80)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !297, file: !26, line: 609, baseType: !42, size: 16, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !297, file: !26, line: 609, baseType: !20, size: 32, offset: 128)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !297, file: !26, line: 610, baseType: !169, size: 64, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !297, file: !26, line: 611, baseType: !83, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !297, file: !26, line: 612, baseType: !83, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !297, file: !26, line: 613, baseType: !20, size: 32, offset: 384)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !255, file: !26, line: 669, baseType: !310, size: 512)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !26, line: 580, size: 512, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !26, line: 581, baseType: !111, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !310, file: !26, line: 581, baseType: !37, size: 8, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !26, line: 581, baseType: !37, size: 8, offset: 72)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !310, file: !26, line: 581, baseType: !42, size: 16, offset: 80)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !26, line: 581, baseType: !42, size: 16, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !310, file: !26, line: 581, baseType: !20, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !310, file: !26, line: 582, baseType: !29, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !310, file: !26, line: 583, baseType: !29, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !310, file: !26, line: 584, baseType: !134, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !310, file: !26, line: 585, baseType: !111, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !310, file: !26, line: 586, baseType: !20, size: 32, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !255, file: !26, line: 670, baseType: !324, size: 320)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !26, line: 620, size: 320, elements: !325)
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !26, line: 621, baseType: !111, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !324, file: !26, line: 621, baseType: !37, size: 8, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !324, file: !26, line: 621, baseType: !37, size: 8, offset: 72)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !324, file: !26, line: 621, baseType: !42, size: 16, offset: 80)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !324, file: !26, line: 621, baseType: !42, size: 16, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !324, file: !26, line: 621, baseType: !37, size: 8, offset: 112)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !324, file: !26, line: 622, baseType: !134, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !324, file: !26, line: 623, baseType: !29, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !324, file: !26, line: 624, baseType: !59, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !255, file: !26, line: 671, baseType: !336, size: 640)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !26, line: 631, size: 640, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !26, line: 632, baseType: !111, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !336, file: !26, line: 632, baseType: !37, size: 8, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !336, file: !26, line: 632, baseType: !37, size: 8, offset: 72)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !336, file: !26, line: 632, baseType: !42, size: 16, offset: 80)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !336, file: !26, line: 632, baseType: !42, size: 16, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !336, file: !26, line: 633, baseType: !344, size: 512, offset: 128)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 512, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !255, file: !26, line: 672, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !26, line: 654, size: 320, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355, !356, !357, !358}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !26, line: 655, baseType: !111, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !348, file: !26, line: 655, baseType: !37, size: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !348, file: !26, line: 655, baseType: !37, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !348, file: !26, line: 655, baseType: !42, size: 16, offset: 80)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !26, line: 655, baseType: !42, size: 16, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !348, file: !26, line: 655, baseType: !37, size: 8, offset: 112)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !348, file: !26, line: 656, baseType: !24, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !348, file: !26, line: 657, baseType: !29, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !348, file: !26, line: 658, baseType: !359, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !26, line: 645, size: 128, elements: !361)
!361 = !{!362, !368}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !360, file: !26, line: 646, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !19, line: 1052, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367, !20, !111}
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !19, line: 424, baseType: !111)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !360, file: !26, line: 647, baseType: !111, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !161, file: !26, line: 902, baseType: !169, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !161, file: !26, line: 903, baseType: !20, size: 32, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !135, file: !136, line: 61, baseType: !20, size: 32, offset: 1088)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !135, file: !136, line: 62, baseType: !20, size: 32, offset: 1120)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !135, file: !136, line: 63, baseType: !42, size: 16, offset: 1152)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !135, file: !136, line: 64, baseType: !37, size: 8, offset: 1168)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !135, file: !136, line: 66, baseType: !376, size: 2688, offset: 1216)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 2688, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 7)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !135, file: !136, line: 67, baseType: !380, size: 3072, offset: 3904)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 3072, elements: !345)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !135, file: !136, line: 68, baseType: !382, size: 576, offset: 6976)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 576, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 9)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !135, file: !136, line: 69, baseType: !98, size: 64, offset: 7552)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !135, file: !136, line: 71, baseType: !83, size: 64, offset: 7616)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !135, file: !136, line: 72, baseType: !98, size: 64, offset: 7680)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !135, file: !136, line: 73, baseType: !254, size: 64, offset: 7744)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !135, file: !136, line: 74, baseType: !24, size: 64, offset: 7808)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !135, file: !136, line: 75, baseType: !29, size: 64, offset: 7872)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !135, file: !136, line: 76, baseType: !24, size: 64, offset: 7936)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !135, file: !136, line: 77, baseType: !169, size: 64, offset: 8000)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !135, file: !136, line: 78, baseType: !29, size: 64, offset: 8064)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !135, file: !136, line: 79, baseType: !24, size: 64, offset: 8128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !135, file: !136, line: 80, baseType: !71, size: 64, offset: 8192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !135, file: !136, line: 81, baseType: !169, size: 64, offset: 8256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !135, file: !136, line: 82, baseType: !398, size: 64, offset: 8320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !26, line: 702, size: 128, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !400, file: !26, line: 706, baseType: !20, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !400, file: !26, line: 707, baseType: !20, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !400, file: !26, line: 708, baseType: !42, size: 16, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !400, file: !26, line: 709, baseType: !37, size: 8, offset: 80)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !400, file: !26, line: 710, baseType: !37, size: 8, offset: 88)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !26, line: 711, baseType: !37, size: 8, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !135, file: !136, line: 83, baseType: !169, size: 64, offset: 8384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !135, file: !136, line: 84, baseType: !29, size: 64, offset: 8448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !135, file: !136, line: 85, baseType: !254, size: 64, offset: 8512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !135, file: !136, line: 86, baseType: !29, size: 64, offset: 8576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !135, file: !136, line: 87, baseType: !254, size: 64, offset: 8640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !135, file: !136, line: 88, baseType: !169, size: 64, offset: 8704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !135, file: !136, line: 89, baseType: !169, size: 64, offset: 8768)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !135, file: !136, line: 90, baseType: !416, size: 64, offset: 8832)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !135, file: !136, line: 91, baseType: !418, size: 64, offset: 8896)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !26, line: 637, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!18, !134, !422}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !135, file: !136, line: 92, baseType: !424, size: 64, offset: 8960)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !26, line: 641, baseType: !131)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !127, file: !6, line: 152, baseType: !29, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !113, file: !6, line: 155, baseType: !20, size: 32, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !113, file: !6, line: 156, baseType: !146, size: 16, offset: 416)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !113, file: !6, line: 157, baseType: !37, size: 8, offset: 432)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !30, file: !6, line: 375, baseType: !430, size: 576)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !6, line: 122, size: 576, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !430, file: !6, line: 123, baseType: !29, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !430, file: !6, line: 123, baseType: !37, size: 8, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !430, file: !6, line: 123, baseType: !37, size: 8, offset: 72)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !430, file: !6, line: 123, baseType: !42, size: 16, offset: 80)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !430, file: !6, line: 123, baseType: !37, size: 8, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !430, file: !6, line: 123, baseType: !37, size: 8, offset: 104)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !430, file: !6, line: 124, baseType: !42, size: 16, offset: 112)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !430, file: !6, line: 125, baseType: !111, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !430, file: !6, line: 126, baseType: !59, size: 64, offset: 192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !430, file: !6, line: 127, baseType: !416, size: 64, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !6, line: 128, baseType: !29, size: 64, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !6, line: 129, baseType: !29, size: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !430, file: !6, line: 130, baseType: !24, size: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !430, file: !6, line: 131, baseType: !37, size: 8, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !30, file: !6, line: 376, baseType: !447, size: 448)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !6, line: 134, size: 448, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !460}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !447, file: !6, line: 135, baseType: !29, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !447, file: !6, line: 135, baseType: !37, size: 8, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !6, line: 135, baseType: !37, size: 8, offset: 72)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !447, file: !6, line: 135, baseType: !42, size: 16, offset: 80)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !447, file: !6, line: 135, baseType: !37, size: 8, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !447, file: !6, line: 135, baseType: !37, size: 8, offset: 104)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !447, file: !6, line: 136, baseType: !24, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !447, file: !6, line: 137, baseType: !29, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !6, line: 138, baseType: !29, size: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !447, file: !6, line: 139, baseType: !459, size: 64, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !19, line: 129, baseType: !59)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !447, file: !6, line: 140, baseType: !20, size: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !30, file: !6, line: 377, baseType: !462, size: 320)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !6, line: 184, size: 320, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !473}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !462, file: !6, line: 185, baseType: !29, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !462, file: !6, line: 185, baseType: !37, size: 8, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !6, line: 185, baseType: !37, size: 8, offset: 72)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !462, file: !6, line: 185, baseType: !42, size: 16, offset: 80)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !462, file: !6, line: 185, baseType: !37, size: 8, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !462, file: !6, line: 185, baseType: !470, size: 128, offset: 128)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 2)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !462, file: !6, line: 185, baseType: !29, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !30, file: !6, line: 378, baseType: !475, size: 384)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !6, line: 187, size: 384, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !475, file: !6, line: 188, baseType: !29, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !475, file: !6, line: 188, baseType: !37, size: 8, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !6, line: 188, baseType: !37, size: 8, offset: 72)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !475, file: !6, line: 188, baseType: !42, size: 16, offset: 80)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !475, file: !6, line: 188, baseType: !37, size: 8, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !475, file: !6, line: 189, baseType: !470, size: 128, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !475, file: !6, line: 189, baseType: !29, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !475, file: !6, line: 189, baseType: !485, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !26, line: 480, size: 576, elements: !487)
!487 = !{!488, !489, !490, !491, !499, !514, !546, !547, !548, !549, !550, !551}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !486, file: !26, line: 481, baseType: !24, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !486, file: !26, line: 482, baseType: !485, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !486, file: !26, line: 483, baseType: !485, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !486, file: !26, line: 484, baseType: !492, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !26, line: 497, size: 256, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !493, file: !26, line: 498, baseType: !492, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !26, line: 499, baseType: !492, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !493, file: !26, line: 500, baseType: !485, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !493, file: !26, line: 501, baseType: !20, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !486, file: !26, line: 485, baseType: !500, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !26, line: 466, size: 320, elements: !502)
!502 = !{!503, !508, !509, !510, !511, !512, !513}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !501, file: !26, line: 467, baseType: !504, size: 128)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !26, line: 459, size: 128, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !504, file: !26, line: 460, baseType: !37, size: 8)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !504, file: !26, line: 461, baseType: !59, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !501, file: !26, line: 468, baseType: !504, size: 128, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !501, file: !26, line: 469, baseType: !42, size: 16, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !501, file: !26, line: 470, baseType: !37, size: 8, offset: 272)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !501, file: !26, line: 471, baseType: !37, size: 8, offset: 280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !501, file: !26, line: 472, baseType: !37, size: 8, offset: 288)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !501, file: !26, line: 473, baseType: !37, size: 8, offset: 296)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !486, file: !26, line: 486, baseType: !515, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !26, line: 448, size: 192, elements: !517)
!517 = !{!518, !541, !542, !543, !544, !545}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !516, file: !26, line: 449, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !26, line: 438, size: 64, elements: !520)
!520 = !{!521, !522, !535}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !519, file: !26, line: 439, baseType: !24, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !519, file: !26, line: 440, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !26, line: 419, size: 256, elements: !525)
!525 = !{!526, !531, !532, !533, !534}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !524, file: !26, line: 420, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !19, line: 1049, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!20, !367, !20, !111}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !524, file: !26, line: 421, baseType: !111, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !524, file: !26, line: 422, baseType: !24, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !524, file: !26, line: 423, baseType: !37, size: 8, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !524, file: !26, line: 424, baseType: !37, size: 8, offset: 200)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !519, file: !26, line: 441, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !26, line: 429, size: 128, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !537, file: !26, line: 430, baseType: !24, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !537, file: !26, line: 431, baseType: !536, size: 64, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !516, file: !26, line: 450, baseType: !500, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !516, file: !26, line: 451, baseType: !37, size: 8, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !516, file: !26, line: 452, baseType: !37, size: 8, offset: 136)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !516, file: !26, line: 453, baseType: !37, size: 8, offset: 144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !516, file: !26, line: 454, baseType: !37, size: 8, offset: 152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !486, file: !26, line: 487, baseType: !59, size: 64, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !486, file: !26, line: 488, baseType: !20, size: 32, offset: 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !486, file: !26, line: 489, baseType: !42, size: 16, offset: 480)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !486, file: !26, line: 490, baseType: !42, size: 16, offset: 496)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !486, file: !26, line: 491, baseType: !37, size: 8, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !486, file: !26, line: 492, baseType: !37, size: 8, offset: 520)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !30, file: !6, line: 379, baseType: !553, size: 384)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !6, line: 192, size: 384, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !553, file: !6, line: 193, baseType: !29, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !553, file: !6, line: 193, baseType: !37, size: 8, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !6, line: 193, baseType: !37, size: 8, offset: 72)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !553, file: !6, line: 193, baseType: !42, size: 16, offset: 80)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !553, file: !6, line: 193, baseType: !37, size: 8, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !553, file: !6, line: 193, baseType: !470, size: 128, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !553, file: !6, line: 193, baseType: !29, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !553, file: !6, line: 193, baseType: !20, size: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !553, file: !6, line: 194, baseType: !20, size: 32, offset: 352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !30, file: !6, line: 380, baseType: !565, size: 384)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !6, line: 197, size: 384, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !565, file: !6, line: 198, baseType: !29, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !565, file: !6, line: 198, baseType: !37, size: 8, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !6, line: 198, baseType: !37, size: 8, offset: 72)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !565, file: !6, line: 198, baseType: !42, size: 16, offset: 80)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !565, file: !6, line: 198, baseType: !37, size: 8, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !565, file: !6, line: 200, baseType: !37, size: 8, offset: 104)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !565, file: !6, line: 201, baseType: !37, size: 8, offset: 112)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !565, file: !6, line: 202, baseType: !470, size: 128, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !565, file: !6, line: 202, baseType: !29, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !565, file: !6, line: 202, baseType: !577, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !19, line: 128, baseType: !59)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !30, file: !6, line: 381, baseType: !579, size: 320)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !6, line: 205, size: 320, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !579, file: !6, line: 206, baseType: !29, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !579, file: !6, line: 206, baseType: !37, size: 8, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !6, line: 206, baseType: !37, size: 8, offset: 72)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !579, file: !6, line: 206, baseType: !42, size: 16, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !6, line: 206, baseType: !37, size: 8, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !579, file: !6, line: 206, baseType: !470, size: 128, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !579, file: !6, line: 206, baseType: !29, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !30, file: !6, line: 382, baseType: !589, size: 384)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !6, line: 233, size: 384, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !589, file: !6, line: 234, baseType: !29, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 72)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !589, file: !6, line: 234, baseType: !42, size: 16, offset: 80)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 104)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 112)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 120)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !589, file: !6, line: 234, baseType: !24, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !589, file: !6, line: 234, baseType: !20, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !589, file: !6, line: 234, baseType: !20, size: 32, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !589, file: !6, line: 234, baseType: !20, size: 32, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 288)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !589, file: !6, line: 234, baseType: !37, size: 8, offset: 296)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !589, file: !6, line: 234, baseType: !29, size: 64, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !30, file: !6, line: 383, baseType: !607, size: 576)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !6, line: 237, size: 576, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !607, file: !6, line: 238, baseType: !29, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 72)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !607, file: !6, line: 238, baseType: !42, size: 16, offset: 80)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 96)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 104)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 120)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !607, file: !6, line: 238, baseType: !24, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !607, file: !6, line: 238, baseType: !20, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !607, file: !6, line: 238, baseType: !20, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !607, file: !6, line: 238, baseType: !20, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 288)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !607, file: !6, line: 238, baseType: !37, size: 8, offset: 296)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !607, file: !6, line: 238, baseType: !42, size: 16, offset: 304)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !607, file: !6, line: 239, baseType: !29, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !607, file: !6, line: 240, baseType: !83, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !607, file: !6, line: 241, baseType: !42, size: 16, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !607, file: !6, line: 242, baseType: !83, size: 64, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !30, file: !6, line: 384, baseType: !629, size: 384)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !6, line: 262, size: 384, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !629, file: !6, line: 263, baseType: !29, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 72)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !629, file: !6, line: 263, baseType: !42, size: 16, offset: 80)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 104)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 112)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 120)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !629, file: !6, line: 263, baseType: !24, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !629, file: !6, line: 263, baseType: !20, size: 32, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !629, file: !6, line: 263, baseType: !20, size: 32, offset: 224)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !629, file: !6, line: 263, baseType: !20, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 296)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !629, file: !6, line: 263, baseType: !37, size: 8, offset: 304)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !629, file: !6, line: 264, baseType: !29, size: 64, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !30, file: !6, line: 385, baseType: !648, size: 448)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !6, line: 245, size: 448, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !648, file: !6, line: 246, baseType: !29, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 72)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !648, file: !6, line: 246, baseType: !42, size: 16, offset: 80)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 104)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 112)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 120)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !648, file: !6, line: 246, baseType: !24, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !648, file: !6, line: 246, baseType: !20, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !648, file: !6, line: 246, baseType: !20, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !648, file: !6, line: 246, baseType: !20, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !648, file: !6, line: 246, baseType: !37, size: 8, offset: 296)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !648, file: !6, line: 246, baseType: !29, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !648, file: !6, line: 247, baseType: !29, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !30, file: !6, line: 386, baseType: !667, size: 448)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !6, line: 250, size: 448, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !667, file: !6, line: 251, baseType: !29, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 72)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !667, file: !6, line: 251, baseType: !42, size: 16, offset: 80)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 104)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 120)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !667, file: !6, line: 251, baseType: !24, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !667, file: !6, line: 251, baseType: !20, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !667, file: !6, line: 251, baseType: !20, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !667, file: !6, line: 251, baseType: !20, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !667, file: !6, line: 251, baseType: !37, size: 8, offset: 296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !667, file: !6, line: 256, baseType: !29, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !667, file: !6, line: 257, baseType: !29, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !30, file: !6, line: 387, baseType: !686, size: 512)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !6, line: 273, size: 512, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !686, file: !6, line: 274, baseType: !29, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !686, file: !6, line: 274, baseType: !37, size: 8, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !686, file: !6, line: 274, baseType: !37, size: 8, offset: 72)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !686, file: !6, line: 274, baseType: !42, size: 16, offset: 80)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !686, file: !6, line: 274, baseType: !37, size: 8, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !686, file: !6, line: 274, baseType: !24, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !686, file: !6, line: 275, baseType: !20, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !686, file: !6, line: 276, baseType: !363, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !686, file: !6, line: 277, baseType: !111, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !6, line: 278, baseType: !470, size: 128, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !30, file: !6, line: 388, baseType: !699, size: 512)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !6, line: 281, size: 512, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !714, !715, !716, !722, !723}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !699, file: !6, line: 282, baseType: !29, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !699, file: !6, line: 282, baseType: !37, size: 8, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !6, line: 282, baseType: !37, size: 8, offset: 72)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !699, file: !6, line: 282, baseType: !42, size: 16, offset: 80)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !699, file: !6, line: 282, baseType: !37, size: 8, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !699, file: !6, line: 282, baseType: !37, size: 8, offset: 104)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !699, file: !6, line: 283, baseType: !37, size: 8, offset: 112)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !699, file: !6, line: 284, baseType: !709, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !19, line: 1084, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!18, !20, !459, !20, !713, !111, !111}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !699, file: !6, line: 285, baseType: !24, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !699, file: !6, line: 286, baseType: !111, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !699, file: !6, line: 287, baseType: !717, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !19, line: 1102, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!18, !367, !20, !111, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !699, file: !6, line: 288, baseType: !29, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !6, line: 289, baseType: !29, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !30, file: !6, line: 389, baseType: !725, size: 512)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !6, line: 307, size: 512, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !725, file: !6, line: 308, baseType: !29, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !725, file: !6, line: 308, baseType: !37, size: 8, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !6, line: 308, baseType: !37, size: 8, offset: 72)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !725, file: !6, line: 308, baseType: !42, size: 16, offset: 80)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !6, line: 308, baseType: !37, size: 8, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !725, file: !6, line: 308, baseType: !37, size: 8, offset: 104)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !725, file: !6, line: 309, baseType: !37, size: 8, offset: 112)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !725, file: !6, line: 310, baseType: !37, size: 8, offset: 120)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !725, file: !6, line: 311, baseType: !111, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !725, file: !6, line: 312, baseType: !24, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !725, file: !6, line: 313, baseType: !98, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !725, file: !6, line: 314, baseType: !83, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !725, file: !6, line: 315, baseType: !83, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !725, file: !6, line: 316, baseType: !20, size: 32, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !30, file: !6, line: 390, baseType: !742, size: 448)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !6, line: 340, size: 448, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !742, file: !6, line: 341, baseType: !29, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !742, file: !6, line: 341, baseType: !37, size: 8, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !742, file: !6, line: 341, baseType: !37, size: 8, offset: 72)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !742, file: !6, line: 341, baseType: !42, size: 16, offset: 80)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !742, file: !6, line: 341, baseType: !37, size: 8, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !742, file: !6, line: 341, baseType: !24, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !742, file: !6, line: 342, baseType: !24, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !742, file: !6, line: 343, baseType: !111, size: 64, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !742, file: !6, line: 344, baseType: !83, size: 64, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !742, file: !6, line: 345, baseType: !20, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !6, line: 391, baseType: !755, size: 256)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !6, line: 350, size: 256, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !767}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !755, file: !6, line: 351, baseType: !29, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !755, file: !6, line: 351, baseType: !37, size: 8, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !6, line: 351, baseType: !37, size: 8, offset: 72)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !755, file: !6, line: 351, baseType: !42, size: 16, offset: 80)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !6, line: 351, baseType: !37, size: 8, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !755, file: !6, line: 351, baseType: !763, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !19, line: 1055, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !367, !111}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !755, file: !6, line: 352, baseType: !111, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !30, file: !6, line: 392, baseType: !769, size: 192)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !6, line: 357, size: 192, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !769, file: !6, line: 358, baseType: !29, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !769, file: !6, line: 358, baseType: !37, size: 8, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !769, file: !6, line: 358, baseType: !37, size: 8, offset: 72)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !769, file: !6, line: 358, baseType: !42, size: 16, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !6, line: 358, baseType: !37, size: 8, offset: 96)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !6, line: 358, baseType: !29, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !30, file: !6, line: 399, baseType: !25, size: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !25, file: !26, line: 135, baseType: !37, size: 8, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !26, line: 136, baseType: !37, size: 8, offset: 72)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !25, file: !26, line: 137, baseType: !42, size: 16, offset: 80)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !25, file: !26, line: 138, baseType: !782, size: 32, offset: 96)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !783, line: 327, size: 32, elements: !784)
!783 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !782, file: !783, line: 328, baseType: !20, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !782, file: !783, line: 329, baseType: !228, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !25, file: !26, line: 139, baseType: !24, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !25, file: !26, line: 140, baseType: !24, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !25, file: !26, line: 141, baseType: !24, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !25, file: !26, line: 142, baseType: !146, size: 16, offset: 320)
!791 = !{!0}
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 72, elements: !383)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!794 = !{i32 7, !"Dwarf Version", i32 4}
!795 = !{i32 2, !"Debug Info Version", i32 3}
!796 = !{i32 1, !"wchar_size", i32 2}
!797 = !{i32 1, !"Code Model", i32 2}
!798 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!799 = distinct !DISubprogram(name: "acpi_ex_opcode_2A_0T_0R", scope: !3, file: !3, line: 55, type: !132, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !800)
!800 = !{}
!801 = !DILocalVariable(name: "walk_state", arg: 1, scope: !799, file: !3, line: 55, type: !134)
!802 = !DILocation(line: 55, column: 61, scope: !799)
!803 = !DILocalVariable(name: "operand", scope: !799, file: !3, line: 57, type: !98)
!804 = !DILocation(line: 57, column: 30, scope: !799)
!805 = !DILocation(line: 57, column: 41, scope: !799)
!806 = !DILocation(line: 57, column: 53, scope: !799)
!807 = !DILocalVariable(name: "node", scope: !799, file: !3, line: 58, type: !24)
!808 = !DILocation(line: 58, column: 30, scope: !799)
!809 = !DILocalVariable(name: "value", scope: !799, file: !3, line: 59, type: !20)
!810 = !DILocation(line: 59, column: 6, scope: !799)
!811 = !DILocalVariable(name: "status", scope: !799, file: !3, line: 60, type: !18)
!812 = !DILocation(line: 60, column: 14, scope: !799)
!813 = !DILocation(line: 67, column: 10, scope: !799)
!814 = !DILocation(line: 67, column: 22, scope: !799)
!815 = !DILocation(line: 67, column: 2, scope: !799)
!816 = !DILocation(line: 72, column: 40, scope: !817)
!817 = distinct !DILexicalBlock(scope: !799, file: !3, line: 67, column: 30)
!818 = !DILocation(line: 72, column: 10, scope: !817)
!819 = !DILocation(line: 72, column: 8, scope: !817)
!820 = !DILocation(line: 76, column: 17, scope: !817)
!821 = !DILocation(line: 76, column: 29, scope: !817)
!822 = !DILocation(line: 76, column: 37, scope: !817)
!823 = !DILocation(line: 76, column: 11, scope: !817)
!824 = !DILocation(line: 76, column: 9, scope: !817)
!825 = !DILocation(line: 80, column: 33, scope: !826)
!826 = distinct !DILexicalBlock(scope: !817, file: !3, line: 80, column: 7)
!827 = !DILocation(line: 80, column: 8, scope: !826)
!828 = !DILocation(line: 80, column: 7, scope: !817)
!829 = !DILocation(line: 81, column: 4, scope: !830)
!830 = distinct !DILexicalBlock(scope: !826, file: !3, line: 80, column: 40)
!831 = !DILocation(line: 85, column: 11, scope: !830)
!832 = !DILocation(line: 86, column: 4, scope: !830)
!833 = !DILocation(line: 96, column: 41, scope: !817)
!834 = !DILocation(line: 96, column: 47, scope: !817)
!835 = !DILocation(line: 96, column: 12, scope: !817)
!836 = !DILocation(line: 96, column: 10, scope: !817)
!837 = !DILocation(line: 97, column: 3, scope: !817)
!838 = !DILocation(line: 101, column: 3, scope: !817)
!839 = !DILocation(line: 103, column: 10, scope: !817)
!840 = !DILocation(line: 104, column: 2, scope: !817)
!841 = !DILocation(line: 106, column: 2, scope: !799)
!842 = distinct !DISubprogram(name: "acpi_ex_opcode_2A_2T_1R", scope: !3, file: !3, line: 122, type: !132, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !800)
!843 = !DILocalVariable(name: "walk_state", arg: 1, scope: !842, file: !3, line: 122, type: !134)
!844 = !DILocation(line: 122, column: 61, scope: !842)
!845 = !DILocalVariable(name: "operand", scope: !842, file: !3, line: 124, type: !98)
!846 = !DILocation(line: 124, column: 30, scope: !842)
!847 = !DILocation(line: 124, column: 41, scope: !842)
!848 = !DILocation(line: 124, column: 53, scope: !842)
!849 = !DILocalVariable(name: "return_desc1", scope: !842, file: !3, line: 125, type: !29)
!850 = !DILocation(line: 125, column: 29, scope: !842)
