; ModuleID = '../bcout/drivers/acpi/acpica/exregion.llvm.bc'
source_filename = "drivers/acpi/acpica/exregion.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !49, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !48, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/exregion.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !20, !21, !24, !16, !25, !29, !33, !34, !26, !30, !35, !36, !43, !45, !47}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !21)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !32)
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !21)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pci_id", file: !15, line: 1197, size: 64, elements: !38)
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "segment", scope: !37, file: !15, line: 1198, baseType: !30, size: 16)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !37, file: !15, line: 1199, baseType: !30, size: 16, offset: 16)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !37, file: !15, line: 1200, baseType: !30, size: 16, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !37, file: !15, line: 1201, baseType: !30, size: 16, offset: 48)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !46, line: 148, baseType: !7)
!46 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!47 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!48 = !{!0}
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 72, elements: !51)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!51 = !{!52}
!52 = !DISubrange(count: 9)
!53 = !{!"rsp"}
!54 = !{i32 7, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 2}
!57 = !{i32 1, !"Code Model", i32 2}
!58 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!59 = distinct !DISubprogram(name: "acpi_ex_system_memory_space_handler", scope: !3, file: !3, line: 35, type: !60, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !63)
!60 = !DISubroutineType(types: !61)
!61 = !{!14, !16, !62, !16, !34, !20, !20}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !21)
!63 = !{}
!64 = !DILocalVariable(name: "function", arg: 1, scope: !59, file: !3, line: 35, type: !16)
!65 = !DILocation(line: 35, column: 41, scope: !59)
!66 = !DILocalVariable(name: "address", arg: 2, scope: !59, file: !3, line: 36, type: !62)
!67 = !DILocation(line: 36, column: 31, scope: !59)
!68 = !DILocalVariable(name: "bit_width", arg: 3, scope: !59, file: !3, line: 37, type: !16)
!69 = !DILocation(line: 37, column: 13, scope: !59)
!70 = !DILocalVariable(name: "value", arg: 4, scope: !59, file: !3, line: 38, type: !34)
!71 = !DILocation(line: 38, column: 14, scope: !59)
!72 = !DILocalVariable(name: "handler_context", arg: 5, scope: !59, file: !3, line: 39, type: !20)
!73 = !DILocation(line: 39, column: 15, scope: !59)
!74 = !DILocalVariable(name: "region_context", arg: 6, scope: !59, file: !3, line: 39, type: !20)
!75 = !DILocation(line: 39, column: 38, scope: !59)
!76 = !DILocalVariable(name: "status", scope: !59, file: !3, line: 41, type: !14)
!77 = !DILocation(line: 41, column: 14, scope: !59)
!78 = !DILocalVariable(name: "logical_addr_ptr", scope: !59, file: !3, line: 42, type: !20)
!79 = !DILocation(line: 42, column: 8, scope: !59)
!80 = !DILocalVariable(name: "mem_info", scope: !59, file: !3, line: 43, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_mem_space_context", file: !15, line: 1211, size: 256, elements: !83)
!83 = !{!84, !85, !86, !94}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !82, file: !15, line: 1212, baseType: !16, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !82, file: !15, line: 1213, baseType: !62, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cur_mm", scope: !82, file: !15, line: 1214, baseType: !87, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_mem_mapping", file: !15, line: 1204, size: 256, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "physical_address", scope: !88, file: !15, line: 1205, baseType: !62, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "logical_address", scope: !88, file: !15, line: 1206, baseType: !25, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !88, file: !15, line: 1207, baseType: !24, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next_mm", scope: !88, file: !15, line: 1208, baseType: !87, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "first_mm", scope: !82, file: !15, line: 1215, baseType: !87, size: 64, offset: 192)
!95 = !DILocation(line: 43, column: 33, scope: !59)
!96 = !DILocation(line: 43, column: 44, scope: !59)
!97 = !DILocalVariable(name: "mm", scope: !59, file: !3, line: 44, type: !87)
!98 = !DILocation(line: 44, column: 27, scope: !59)
!99 = !DILocation(line: 44, column: 32, scope: !59)
!100 = !DILocation(line: 44, column: 42, scope: !59)
!101 = !DILocalVariable(name: "length", scope: !59, file: !3, line: 45, type: !16)
!102 = !DILocation(line: 45, column: 6, scope: !59)
!103 = !DILocalVariable(name: "map_length", scope: !59, file: !3, line: 46, type: !24)
!104 = !DILocation(line: 46, column: 12, scope: !59)
!105 = !DILocalVariable(name: "page_boundary_map_length", scope: !59, file: !3, line: 47, type: !24)
!106 = !DILocation(line: 47, column: 12, scope: !59)
!107 = !DILocation(line: 56, column: 10, scope: !59)
!108 = !DILocation(line: 56, column: 2, scope: !59)
!109 = !DILocation(line: 59, column: 10, scope: !110)
!110 = distinct !DILexicalBlock(scope: !59, file: !3, line: 56, column: 21)
!111 = !DILocation(line: 60, column: 3, scope: !110)
!112 = !DILocation(line: 64, column: 10, scope: !110)
!113 = !DILocation(line: 65, column: 3, scope: !110)
!114 = !DILocation(line: 69, column: 10, scope: !110)
!115 = !DILocation(line: 70, column: 3, scope: !110)
!116 = !DILocation(line: 74, column: 10, scope: !110)
!117 = !DILocation(line: 75, column: 3, scope: !110)
!118 = !DILocation(line: 79, column: 3, scope: !110)
!119 = !DILocation(line: 81, column: 3, scope: !110)
!120 = !DILocation(line: 100, column: 7, scope: !121)
!121 = distinct !DILexicalBlock(scope: !59, file: !3, line: 100, column: 6)
!122 = !DILocation(line: 100, column: 10, scope: !121)
!123 = !DILocation(line: 100, column: 14, scope: !121)
!124 = !DILocation(line: 100, column: 24, scope: !121)
!125 = !DILocation(line: 100, column: 28, scope: !121)
!126 = !DILocation(line: 100, column: 22, scope: !121)
!127 = !DILocation(line: 100, column: 46, scope: !121)
!128 = !DILocation(line: 101, column: 13, scope: !121)
!129 = !DILocation(line: 101, column: 23, scope: !121)
!130 = !DILocation(line: 101, column: 21, scope: !121)
!131 = !DILocation(line: 101, column: 38, scope: !121)
!132 = !DILocation(line: 101, column: 42, scope: !121)
!133 = !DILocation(line: 101, column: 61, scope: !121)
!134 = !DILocation(line: 101, column: 65, scope: !121)
!135 = !DILocation(line: 101, column: 59, scope: !121)
!136 = !DILocation(line: 101, column: 30, scope: !121)
!137 = !DILocation(line: 100, column: 6, scope: !59)
!138 = !DILocation(line: 109, column: 13, scope: !139)
!139 = distinct !DILexicalBlock(scope: !140, file: !3, line: 109, column: 3)
!140 = distinct !DILexicalBlock(scope: !121, file: !3, line: 101, column: 74)
!141 = !DILocation(line: 109, column: 23, scope: !139)
!142 = !DILocation(line: 109, column: 11, scope: !139)
!143 = !DILocation(line: 109, column: 8, scope: !139)
!144 = !DILocation(line: 109, column: 33, scope: !145)
!145 = distinct !DILexicalBlock(scope: !139, file: !3, line: 109, column: 3)
!146 = !DILocation(line: 109, column: 3, scope: !139)
!147 = !DILocation(line: 110, column: 8, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !3, line: 110, column: 8)
!149 = distinct !DILexicalBlock(scope: !145, file: !3, line: 109, column: 55)
!150 = !DILocation(line: 110, column: 14, scope: !148)
!151 = !DILocation(line: 110, column: 24, scope: !148)
!152 = !DILocation(line: 110, column: 11, scope: !148)
!153 = !DILocation(line: 110, column: 8, scope: !149)
!154 = !DILocation(line: 111, column: 5, scope: !148)
!155 = !DILocation(line: 113, column: 8, scope: !156)
!156 = distinct !DILexicalBlock(scope: !149, file: !3, line: 113, column: 8)
!157 = !DILocation(line: 113, column: 18, scope: !156)
!158 = !DILocation(line: 113, column: 22, scope: !156)
!159 = !DILocation(line: 113, column: 16, scope: !156)
!160 = !DILocation(line: 113, column: 8, scope: !149)
