; ModuleID = '../bcout/drivers/acpi/acpica/exstorob.llvm.bc'
source_filename = "drivers/acpi/acpica/exstorob.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/acpi/acpica/exstorob.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !4, line: 305, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!11 = !{!12, !18, !22, !23, !27, !29}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !13, line: 421, baseType: !14)
!13 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !15, line: 21, baseType: !16)
!15 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !5)
!17 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !15, line: 17, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !13, line: 127, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !15, line: 23, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !26)
!26 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !28, line: 148, baseType: !5)
!28 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !{!"rsp"}
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 2}
!34 = !{i32 1, !"Code Model", i32 2}
!35 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!36 = distinct !DISubprogram(name: "acpi_ex_store_buffer_to_buffer", scope: !1, file: !1, line: 30, type: !37, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !799)
!37 = !DISubroutineType(types: !38)
!38 = !{!12, !39, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !41, line: 367, size: 576, elements: !42)
!41 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!42 = !{!43, !54, !67, !79, !114, !128, !137, !450, !467, !482, !495, !573, !585, !599, !609, !627, !649, !668, !687, !706, !719, !745, !762, !775, !789, !798}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !40, file: !41, line: 368, baseType: !44, size: 128)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !41, line: 73, size: 128, elements: !45)
!45 = !{!46, !47, !48, !49, !53}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !44, file: !41, line: 74, baseType: !39, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !44, file: !41, line: 74, baseType: !19, size: 8, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !41, line: 74, baseType: !19, size: 8, offset: 72)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !44, file: !41, line: 74, baseType: !50, size: 16, offset: 80)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !15, line: 19, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !52)
!52 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !41, line: 74, baseType: !19, size: 8, offset: 96)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !40, file: !41, line: 369, baseType: !55, size: 192)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !41, line: 76, size: 192, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !66}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !55, file: !41, line: 77, baseType: !39, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !55, file: !41, line: 77, baseType: !19, size: 8, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !41, line: 77, baseType: !19, size: 8, offset: 72)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !55, file: !41, line: 77, baseType: !50, size: 16, offset: 80)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !41, line: 77, baseType: !19, size: 8, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !55, file: !41, line: 77, baseType: !63, size: 24, offset: 104)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 3)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !55, file: !41, line: 78, baseType: !24, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !40, file: !41, line: 370, baseType: !68, size: 256)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !41, line: 93, size: 256, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !78}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !68, file: !41, line: 94, baseType: !39, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !68, file: !41, line: 94, baseType: !19, size: 8, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !41, line: 94, baseType: !19, size: 8, offset: 72)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !68, file: !41, line: 94, baseType: !50, size: 16, offset: 80)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !41, line: 94, baseType: !19, size: 8, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !68, file: !41, line: 94, baseType: !76, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !68, file: !41, line: 94, baseType: !14, size: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !40, file: !41, line: 371, baseType: !80, size: 384)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !41, line: 97, size: 384, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !80, file: !41, line: 98, baseType: !39, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !80, file: !41, line: 98, baseType: !19, size: 8, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !41, line: 98, baseType: !19, size: 8, offset: 72)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !80, file: !41, line: 98, baseType: !50, size: 16, offset: 80)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !80, file: !41, line: 98, baseType: !19, size: 8, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !80, file: !41, line: 98, baseType: !18, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !80, file: !41, line: 98, baseType: !14, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !80, file: !41, line: 99, baseType: !14, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !80, file: !41, line: 100, baseType: !18, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !80, file: !41, line: 101, baseType: !92, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !94, line: 133, size: 384, elements: !95)
!94 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!95 = !{!96, !97, !98, !99, !100, !109, !110, !111, !112}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !93, file: !94, line: 134, baseType: !39, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !93, file: !94, line: 135, baseType: !19, size: 8, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !94, line: 136, baseType: !19, size: 8, offset: 72)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !94, line: 137, baseType: !50, size: 16, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !94, line: 138, baseType: !101, size: 32, offset: 96)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !102, line: 327, size: 32, elements: !103)
!102 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !101, file: !102, line: 328, baseType: !14, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !101, file: !102, line: 329, baseType: !106, size: 32)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 4)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !93, file: !94, line: 139, baseType: !92, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !93, file: !94, line: 140, baseType: !92, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !93, file: !94, line: 141, baseType: !92, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !93, file: !94, line: 142, baseType: !113, size: 16, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !13, line: 445, baseType: !50)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !40, file: !41, line: 372, baseType: !115, size: 384)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !41, line: 104, size: 384, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !125, !126, !127}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !115, file: !41, line: 105, baseType: !39, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !115, file: !41, line: 105, baseType: !19, size: 8, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !41, line: 105, baseType: !19, size: 8, offset: 72)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !115, file: !41, line: 105, baseType: !50, size: 16, offset: 80)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !115, file: !41, line: 105, baseType: !19, size: 8, offset: 96)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !115, file: !41, line: 105, baseType: !92, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !115, file: !41, line: 106, baseType: !124, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !115, file: !41, line: 107, baseType: !18, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !115, file: !41, line: 108, baseType: !14, size: 32, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !115, file: !41, line: 109, baseType: !14, size: 32, offset: 352)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !40, file: !41, line: 373, baseType: !129, size: 192)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !41, line: 118, size: 192, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !129, file: !41, line: 119, baseType: !39, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !129, file: !41, line: 119, baseType: !19, size: 8, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !41, line: 119, baseType: !19, size: 8, offset: 72)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !129, file: !41, line: 119, baseType: !50, size: 16, offset: 80)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !41, line: 119, baseType: !19, size: 8, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !129, file: !41, line: 119, baseType: !22, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !40, file: !41, line: 374, baseType: !138, size: 448)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !41, line: 143, size: 448, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !447, !448, !449}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !138, file: !41, line: 144, baseType: !39, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !138, file: !41, line: 144, baseType: !19, size: 8, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !41, line: 144, baseType: !19, size: 8, offset: 72)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !138, file: !41, line: 144, baseType: !50, size: 16, offset: 80)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !41, line: 144, baseType: !19, size: 8, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !138, file: !41, line: 144, baseType: !19, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !138, file: !41, line: 145, baseType: !19, size: 8, offset: 112)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !138, file: !41, line: 146, baseType: !19, size: 8, offset: 120)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !138, file: !41, line: 147, baseType: !39, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !138, file: !41, line: 148, baseType: !39, size: 64, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !138, file: !41, line: 149, baseType: !18, size: 64, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !138, file: !41, line: 153, baseType: !152, size: 64, offset: 320)
!152 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !41, line: 150, size: 64, elements: !153)
!153 = !{!154, !446}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !152, file: !41, line: 151, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !94, line: 248, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!12, !159}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !161, line: 37, size: 9024, elements: !162)
!161 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !392, !393, !394, !395, !396, !400, !402, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !429, !430, !431, !432, !433, !434, !435, !436, !438, !444}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !160, file: !161, line: 38, baseType: !159, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !160, file: !161, line: 39, baseType: !19, size: 8, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !160, file: !161, line: 40, baseType: !19, size: 8, offset: 72)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !160, file: !161, line: 41, baseType: !50, size: 16, offset: 80)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !160, file: !161, line: 42, baseType: !19, size: 8, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !160, file: !161, line: 43, baseType: !19, size: 8, offset: 104)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !160, file: !161, line: 44, baseType: !19, size: 8, offset: 112)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !160, file: !161, line: 45, baseType: !113, size: 16, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !160, file: !161, line: 46, baseType: !19, size: 8, offset: 144)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !160, file: !161, line: 47, baseType: !19, size: 8, offset: 152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !160, file: !161, line: 48, baseType: !19, size: 8, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !160, file: !161, line: 49, baseType: !19, size: 8, offset: 168)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !160, file: !161, line: 50, baseType: !19, size: 8, offset: 176)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !160, file: !161, line: 51, baseType: !19, size: 8, offset: 184)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !160, file: !161, line: 52, baseType: !19, size: 8, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !160, file: !161, line: 53, baseType: !19, size: 8, offset: 200)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !160, file: !161, line: 54, baseType: !18, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !160, file: !161, line: 55, baseType: !14, size: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !160, file: !161, line: 56, baseType: !14, size: 32, offset: 352)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !160, file: !161, line: 57, baseType: !14, size: 32, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !160, file: !161, line: 58, baseType: !14, size: 32, offset: 416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !160, file: !161, line: 60, baseType: !185, size: 640, offset: 448)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !94, line: 893, size: 640, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !273, !274, !390, !391}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !185, file: !94, line: 894, baseType: !18, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !185, file: !94, line: 895, baseType: !18, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !185, file: !94, line: 896, baseType: !18, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !185, file: !94, line: 897, baseType: !18, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !185, file: !94, line: 898, baseType: !18, size: 64, offset: 256)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !185, file: !94, line: 899, baseType: !193, size: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !94, line: 875, size: 1600, elements: !195)
!195 = !{!196, !216, !232}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !194, file: !94, line: 876, baseType: !197, size: 448)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !94, line: 828, size: 448, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !215}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !197, file: !94, line: 829, baseType: !193, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !197, file: !94, line: 829, baseType: !19, size: 8, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !197, file: !94, line: 829, baseType: !19, size: 8, offset: 72)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !197, file: !94, line: 829, baseType: !50, size: 16, offset: 80)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !197, file: !94, line: 829, baseType: !18, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !94, line: 829, baseType: !193, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !94, line: 829, baseType: !92, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !94, line: 829, baseType: !207, size: 64, offset: 320)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !94, line: 716, size: 64, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !207, file: !94, line: 717, baseType: !24, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !207, file: !94, line: 718, baseType: !14, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !207, file: !94, line: 719, baseType: !76, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !207, file: !94, line: 720, baseType: !18, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !94, line: 721, baseType: !76, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !207, file: !94, line: 722, baseType: !193, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !197, file: !94, line: 829, baseType: !19, size: 8, offset: 384)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !194, file: !94, line: 877, baseType: !217, size: 640)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !94, line: 835, size: 640, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !217, file: !94, line: 836, baseType: !193, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !217, file: !94, line: 836, baseType: !19, size: 8, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !217, file: !94, line: 836, baseType: !19, size: 8, offset: 72)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !217, file: !94, line: 836, baseType: !50, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !217, file: !94, line: 836, baseType: !18, size: 64, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !94, line: 836, baseType: !193, size: 64, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !217, file: !94, line: 836, baseType: !92, size: 64, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !94, line: 836, baseType: !207, size: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !217, file: !94, line: 836, baseType: !19, size: 8, offset: 384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !217, file: !94, line: 836, baseType: !76, size: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !94, line: 837, baseType: !18, size: 64, offset: 512)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !217, file: !94, line: 838, baseType: !14, size: 32, offset: 576)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !217, file: !94, line: 839, baseType: !14, size: 32, offset: 608)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !194, file: !94, line: 878, baseType: !233, size: 1600)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !94, line: 846, size: 1600, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !233, file: !94, line: 847, baseType: !193, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !233, file: !94, line: 847, baseType: !19, size: 8, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !233, file: !94, line: 847, baseType: !19, size: 8, offset: 72)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !233, file: !94, line: 847, baseType: !50, size: 16, offset: 80)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !233, file: !94, line: 847, baseType: !18, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !94, line: 847, baseType: !193, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !233, file: !94, line: 847, baseType: !92, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !233, file: !94, line: 847, baseType: !207, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !233, file: !94, line: 847, baseType: !19, size: 8, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !233, file: !94, line: 847, baseType: !193, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !233, file: !94, line: 848, baseType: !193, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !233, file: !94, line: 849, baseType: !76, size: 64, offset: 576)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !233, file: !94, line: 850, baseType: !19, size: 8, offset: 640)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !233, file: !94, line: 851, baseType: !76, size: 64, offset: 704)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !233, file: !94, line: 852, baseType: !76, size: 64, offset: 768)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !233, file: !94, line: 853, baseType: !76, size: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !233, file: !94, line: 854, baseType: !106, size: 32, offset: 896)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !233, file: !94, line: 855, baseType: !14, size: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !233, file: !94, line: 856, baseType: !14, size: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !233, file: !94, line: 857, baseType: !14, size: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !233, file: !94, line: 858, baseType: !14, size: 32, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !233, file: !94, line: 859, baseType: !14, size: 32, offset: 1056)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !233, file: !94, line: 860, baseType: !14, size: 32, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !233, file: !94, line: 861, baseType: !14, size: 32, offset: 1120)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !233, file: !94, line: 862, baseType: !14, size: 32, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !233, file: !94, line: 863, baseType: !14, size: 32, offset: 1184)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !233, file: !94, line: 864, baseType: !14, size: 32, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !233, file: !94, line: 865, baseType: !14, size: 32, offset: 1248)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !233, file: !94, line: 866, baseType: !14, size: 32, offset: 1280)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !233, file: !94, line: 867, baseType: !14, size: 32, offset: 1312)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !233, file: !94, line: 868, baseType: !50, size: 16, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !233, file: !94, line: 869, baseType: !19, size: 8, offset: 1360)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !233, file: !94, line: 870, baseType: !19, size: 8, offset: 1368)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !233, file: !94, line: 871, baseType: !19, size: 8, offset: 1376)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !233, file: !94, line: 872, baseType: !270, size: 160, offset: 1384)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 160, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 20)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !185, file: !94, line: 900, baseType: !92, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !185, file: !94, line: 901, baseType: !275, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !94, line: 663, size: 640, elements: !277)
!277 = !{!278, !286, !299, !308, !317, !330, !344, !356, !368}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !276, file: !94, line: 664, baseType: !279, size: 128)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !94, line: 567, size: 128, elements: !280)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !94, line: 568, baseType: !22, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !279, file: !94, line: 568, baseType: !19, size: 8, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !94, line: 568, baseType: !19, size: 8, offset: 72)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !279, file: !94, line: 568, baseType: !50, size: 16, offset: 80)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !279, file: !94, line: 568, baseType: !50, size: 16, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !276, file: !94, line: 665, baseType: !287, size: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !94, line: 593, size: 384, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !94, line: 594, baseType: !22, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !94, line: 594, baseType: !19, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !94, line: 594, baseType: !19, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !94, line: 594, baseType: !50, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !94, line: 594, baseType: !50, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !287, file: !94, line: 594, baseType: !50, size: 16, offset: 112)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !287, file: !94, line: 595, baseType: !193, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !287, file: !94, line: 596, baseType: !18, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !287, file: !94, line: 597, baseType: !18, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !287, file: !94, line: 598, baseType: !24, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !276, file: !94, line: 666, baseType: !300, size: 192)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !94, line: 573, size: 192, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !94, line: 574, baseType: !22, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !300, file: !94, line: 574, baseType: !19, size: 8, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !94, line: 574, baseType: !19, size: 8, offset: 72)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !300, file: !94, line: 574, baseType: !50, size: 16, offset: 80)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !300, file: !94, line: 574, baseType: !50, size: 16, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !94, line: 574, baseType: !39, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !276, file: !94, line: 667, baseType: !309, size: 192)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !94, line: 604, size: 192, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !94, line: 605, baseType: !22, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !309, file: !94, line: 605, baseType: !19, size: 8, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !94, line: 605, baseType: !19, size: 8, offset: 72)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !309, file: !94, line: 605, baseType: !50, size: 16, offset: 80)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !309, file: !94, line: 605, baseType: !50, size: 16, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !309, file: !94, line: 605, baseType: !92, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !276, file: !94, line: 668, baseType: !318, size: 448)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !94, line: 608, size: 448, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !94, line: 609, baseType: !22, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !318, file: !94, line: 609, baseType: !19, size: 8, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !94, line: 609, baseType: !19, size: 8, offset: 72)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !94, line: 609, baseType: !50, size: 16, offset: 80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !94, line: 609, baseType: !50, size: 16, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !318, file: !94, line: 609, baseType: !14, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !318, file: !94, line: 610, baseType: !193, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !318, file: !94, line: 611, baseType: !18, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !318, file: !94, line: 612, baseType: !18, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !318, file: !94, line: 613, baseType: !14, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !276, file: !94, line: 669, baseType: !331, size: 512)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !94, line: 580, size: 512, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !94, line: 581, baseType: !22, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !331, file: !94, line: 581, baseType: !19, size: 8, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !94, line: 581, baseType: !19, size: 8, offset: 72)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !331, file: !94, line: 581, baseType: !50, size: 16, offset: 80)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !331, file: !94, line: 581, baseType: !50, size: 16, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !331, file: !94, line: 581, baseType: !14, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !331, file: !94, line: 582, baseType: !39, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !331, file: !94, line: 583, baseType: !39, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !331, file: !94, line: 584, baseType: !159, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !331, file: !94, line: 585, baseType: !22, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !331, file: !94, line: 586, baseType: !14, size: 32, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !276, file: !94, line: 670, baseType: !345, size: 320)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !94, line: 620, size: 320, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !94, line: 621, baseType: !22, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !345, file: !94, line: 621, baseType: !19, size: 8, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !345, file: !94, line: 621, baseType: !19, size: 8, offset: 72)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !345, file: !94, line: 621, baseType: !50, size: 16, offset: 80)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !94, line: 621, baseType: !50, size: 16, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !345, file: !94, line: 621, baseType: !19, size: 8, offset: 112)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !345, file: !94, line: 622, baseType: !159, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !345, file: !94, line: 623, baseType: !39, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !345, file: !94, line: 624, baseType: !24, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !276, file: !94, line: 671, baseType: !357, size: 640)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !94, line: 631, size: 640, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !94, line: 632, baseType: !22, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !357, file: !94, line: 632, baseType: !19, size: 8, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !357, file: !94, line: 632, baseType: !19, size: 8, offset: 72)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !357, file: !94, line: 632, baseType: !50, size: 16, offset: 80)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !94, line: 632, baseType: !50, size: 16, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !357, file: !94, line: 633, baseType: !365, size: 512, offset: 128)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !276, file: !94, line: 672, baseType: !369, size: 320)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !94, line: 654, size: 320, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !94, line: 655, baseType: !22, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !369, file: !94, line: 655, baseType: !19, size: 8, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !94, line: 655, baseType: !19, size: 8, offset: 72)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !94, line: 655, baseType: !50, size: 16, offset: 80)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !94, line: 655, baseType: !50, size: 16, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !369, file: !94, line: 655, baseType: !19, size: 8, offset: 112)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !369, file: !94, line: 656, baseType: !92, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !369, file: !94, line: 657, baseType: !39, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !369, file: !94, line: 658, baseType: !380, size: 64, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !94, line: 645, size: 128, elements: !382)
!382 = !{!383, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !381, file: !94, line: 646, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !13, line: 1052, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !388, !14, !22}
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !13, line: 424, baseType: !22)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !381, file: !94, line: 647, baseType: !22, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !185, file: !94, line: 902, baseType: !193, size: 64, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !185, file: !94, line: 903, baseType: !14, size: 32, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !160, file: !161, line: 61, baseType: !14, size: 32, offset: 1088)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !160, file: !161, line: 62, baseType: !14, size: 32, offset: 1120)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !160, file: !161, line: 63, baseType: !50, size: 16, offset: 1152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !160, file: !161, line: 64, baseType: !19, size: 8, offset: 1168)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !160, file: !161, line: 66, baseType: !397, size: 2688, offset: 1216)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 2688, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 7)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !160, file: !161, line: 67, baseType: !401, size: 3072, offset: 3904)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3072, elements: !366)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !160, file: !161, line: 68, baseType: !403, size: 576, offset: 6976)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 576, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 9)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !160, file: !161, line: 69, baseType: !124, size: 64, offset: 7552)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !160, file: !161, line: 71, baseType: !18, size: 64, offset: 7616)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !160, file: !161, line: 72, baseType: !124, size: 64, offset: 7680)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !160, file: !161, line: 73, baseType: !275, size: 64, offset: 7744)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !160, file: !161, line: 74, baseType: !92, size: 64, offset: 7808)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !160, file: !161, line: 75, baseType: !39, size: 64, offset: 7872)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !160, file: !161, line: 76, baseType: !92, size: 64, offset: 7936)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !160, file: !161, line: 77, baseType: !193, size: 64, offset: 8000)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !160, file: !161, line: 78, baseType: !39, size: 64, offset: 8064)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !160, file: !161, line: 79, baseType: !92, size: 64, offset: 8128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !160, file: !161, line: 80, baseType: !76, size: 64, offset: 8192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !160, file: !161, line: 81, baseType: !193, size: 64, offset: 8256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !160, file: !161, line: 82, baseType: !419, size: 64, offset: 8320)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !94, line: 702, size: 128, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !421, file: !94, line: 706, baseType: !14, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !421, file: !94, line: 707, baseType: !14, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !421, file: !94, line: 708, baseType: !50, size: 16, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !421, file: !94, line: 709, baseType: !19, size: 8, offset: 80)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !421, file: !94, line: 710, baseType: !19, size: 8, offset: 88)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !421, file: !94, line: 711, baseType: !19, size: 8, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !160, file: !161, line: 83, baseType: !193, size: 64, offset: 8384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !160, file: !161, line: 84, baseType: !39, size: 64, offset: 8448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !160, file: !161, line: 85, baseType: !275, size: 64, offset: 8512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !160, file: !161, line: 86, baseType: !39, size: 64, offset: 8576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !160, file: !161, line: 87, baseType: !275, size: 64, offset: 8640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !160, file: !161, line: 88, baseType: !193, size: 64, offset: 8704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !160, file: !161, line: 89, baseType: !193, size: 64, offset: 8768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !160, file: !161, line: 90, baseType: !437, size: 64, offset: 8832)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !160, file: !161, line: 91, baseType: !439, size: 64, offset: 8896)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !94, line: 637, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!12, !159, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !160, file: !161, line: 92, baseType: !445, size: 64, offset: 8960)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !94, line: 641, baseType: !156)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !152, file: !41, line: 152, baseType: !39, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !138, file: !41, line: 155, baseType: !14, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !138, file: !41, line: 156, baseType: !113, size: 16, offset: 416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !138, file: !41, line: 157, baseType: !19, size: 8, offset: 432)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !40, file: !41, line: 375, baseType: !451, size: 576)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !41, line: 122, size: 576, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !451, file: !41, line: 123, baseType: !39, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !451, file: !41, line: 123, baseType: !19, size: 8, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !451, file: !41, line: 123, baseType: !19, size: 8, offset: 72)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !451, file: !41, line: 123, baseType: !50, size: 16, offset: 80)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !41, line: 123, baseType: !19, size: 8, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !451, file: !41, line: 123, baseType: !19, size: 8, offset: 104)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !451, file: !41, line: 124, baseType: !50, size: 16, offset: 112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !451, file: !41, line: 125, baseType: !22, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !451, file: !41, line: 126, baseType: !24, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !451, file: !41, line: 127, baseType: !437, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !451, file: !41, line: 128, baseType: !39, size: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !451, file: !41, line: 129, baseType: !39, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !451, file: !41, line: 130, baseType: !92, size: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !451, file: !41, line: 131, baseType: !19, size: 8, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !40, file: !41, line: 376, baseType: !468, size: 448)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !41, line: 134, size: 448, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !481}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !468, file: !41, line: 135, baseType: !39, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !468, file: !41, line: 135, baseType: !19, size: 8, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !41, line: 135, baseType: !19, size: 8, offset: 72)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !468, file: !41, line: 135, baseType: !50, size: 16, offset: 80)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !468, file: !41, line: 135, baseType: !19, size: 8, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !468, file: !41, line: 135, baseType: !19, size: 8, offset: 104)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !468, file: !41, line: 136, baseType: !92, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !468, file: !41, line: 137, baseType: !39, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !41, line: 138, baseType: !39, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !468, file: !41, line: 139, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !13, line: 129, baseType: !24)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !41, line: 140, baseType: !14, size: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !40, file: !41, line: 377, baseType: !483, size: 320)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !41, line: 184, size: 320, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !494}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !483, file: !41, line: 185, baseType: !39, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !483, file: !41, line: 185, baseType: !19, size: 8, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !41, line: 185, baseType: !19, size: 8, offset: 72)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !483, file: !41, line: 185, baseType: !50, size: 16, offset: 80)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !41, line: 185, baseType: !19, size: 8, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !483, file: !41, line: 185, baseType: !491, size: 128, offset: 128)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 2)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !483, file: !41, line: 185, baseType: !39, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !40, file: !41, line: 378, baseType: !496, size: 384)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !41, line: 187, size: 384, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !496, file: !41, line: 188, baseType: !39, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !496, file: !41, line: 188, baseType: !19, size: 8, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !41, line: 188, baseType: !19, size: 8, offset: 72)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !496, file: !41, line: 188, baseType: !50, size: 16, offset: 80)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !41, line: 188, baseType: !19, size: 8, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !496, file: !41, line: 189, baseType: !491, size: 128, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !496, file: !41, line: 189, baseType: !39, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !496, file: !41, line: 189, baseType: !506, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !94, line: 480, size: 576, elements: !508)
!508 = !{!509, !510, !511, !512, !520, !535, !567, !568, !569, !570, !571, !572}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !507, file: !94, line: 481, baseType: !92, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !507, file: !94, line: 482, baseType: !506, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !94, line: 483, baseType: !506, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !507, file: !94, line: 484, baseType: !513, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !94, line: 497, size: 256, elements: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !514, file: !94, line: 498, baseType: !513, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !94, line: 499, baseType: !513, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !514, file: !94, line: 500, baseType: !506, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !514, file: !94, line: 501, baseType: !14, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !507, file: !94, line: 485, baseType: !521, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !94, line: 466, size: 320, elements: !523)
!523 = !{!524, !529, !530, !531, !532, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !522, file: !94, line: 467, baseType: !525, size: 128)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !94, line: 459, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !525, file: !94, line: 460, baseType: !19, size: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !525, file: !94, line: 461, baseType: !24, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !522, file: !94, line: 468, baseType: !525, size: 128, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !522, file: !94, line: 469, baseType: !50, size: 16, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !522, file: !94, line: 470, baseType: !19, size: 8, offset: 272)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !522, file: !94, line: 471, baseType: !19, size: 8, offset: 280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !522, file: !94, line: 472, baseType: !19, size: 8, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !522, file: !94, line: 473, baseType: !19, size: 8, offset: 296)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !507, file: !94, line: 486, baseType: !536, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !94, line: 448, size: 192, elements: !538)
!538 = !{!539, !562, !563, !564, !565, !566}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !537, file: !94, line: 449, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !94, line: 438, size: 64, elements: !541)
!541 = !{!542, !543, !556}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !540, file: !94, line: 439, baseType: !92, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !540, file: !94, line: 440, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !94, line: 419, size: 256, elements: !546)
!546 = !{!547, !552, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !545, file: !94, line: 420, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !13, line: 1049, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!14, !388, !14, !22}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !545, file: !94, line: 421, baseType: !22, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !545, file: !94, line: 422, baseType: !92, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !545, file: !94, line: 423, baseType: !19, size: 8, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !545, file: !94, line: 424, baseType: !19, size: 8, offset: 200)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !540, file: !94, line: 441, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !94, line: 429, size: 128, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !558, file: !94, line: 430, baseType: !92, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !94, line: 431, baseType: !557, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !537, file: !94, line: 450, baseType: !521, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !537, file: !94, line: 451, baseType: !19, size: 8, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !537, file: !94, line: 452, baseType: !19, size: 8, offset: 136)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !537, file: !94, line: 453, baseType: !19, size: 8, offset: 144)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !537, file: !94, line: 454, baseType: !19, size: 8, offset: 152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !507, file: !94, line: 487, baseType: !24, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !507, file: !94, line: 488, baseType: !14, size: 32, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !507, file: !94, line: 489, baseType: !50, size: 16, offset: 480)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !507, file: !94, line: 490, baseType: !50, size: 16, offset: 496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !507, file: !94, line: 491, baseType: !19, size: 8, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !507, file: !94, line: 492, baseType: !19, size: 8, offset: 520)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !40, file: !41, line: 379, baseType: !574, size: 384)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !41, line: 192, size: 384, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !574, file: !41, line: 193, baseType: !39, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !574, file: !41, line: 193, baseType: !19, size: 8, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !41, line: 193, baseType: !19, size: 8, offset: 72)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !574, file: !41, line: 193, baseType: !50, size: 16, offset: 80)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !41, line: 193, baseType: !19, size: 8, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !574, file: !41, line: 193, baseType: !491, size: 128, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !574, file: !41, line: 193, baseType: !39, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !574, file: !41, line: 193, baseType: !14, size: 32, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !574, file: !41, line: 194, baseType: !14, size: 32, offset: 352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !40, file: !41, line: 380, baseType: !586, size: 384)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !41, line: 197, size: 384, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !586, file: !41, line: 198, baseType: !39, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !586, file: !41, line: 198, baseType: !19, size: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !41, line: 198, baseType: !19, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !586, file: !41, line: 198, baseType: !50, size: 16, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !41, line: 198, baseType: !19, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !586, file: !41, line: 200, baseType: !19, size: 8, offset: 104)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !586, file: !41, line: 201, baseType: !19, size: 8, offset: 112)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !586, file: !41, line: 202, baseType: !491, size: 128, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !586, file: !41, line: 202, baseType: !39, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !586, file: !41, line: 202, baseType: !598, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !13, line: 128, baseType: !24)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !40, file: !41, line: 381, baseType: !600, size: 320)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !41, line: 205, size: 320, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !600, file: !41, line: 206, baseType: !39, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !600, file: !41, line: 206, baseType: !19, size: 8, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !41, line: 206, baseType: !19, size: 8, offset: 72)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !600, file: !41, line: 206, baseType: !50, size: 16, offset: 80)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !600, file: !41, line: 206, baseType: !19, size: 8, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !600, file: !41, line: 206, baseType: !491, size: 128, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !600, file: !41, line: 206, baseType: !39, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !40, file: !41, line: 382, baseType: !610, size: 384)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !41, line: 233, size: 384, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !610, file: !41, line: 234, baseType: !39, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 72)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !610, file: !41, line: 234, baseType: !50, size: 16, offset: 80)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 104)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 112)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 120)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !610, file: !41, line: 234, baseType: !92, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !610, file: !41, line: 234, baseType: !14, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !610, file: !41, line: 234, baseType: !14, size: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !610, file: !41, line: 234, baseType: !14, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 288)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !610, file: !41, line: 234, baseType: !19, size: 8, offset: 296)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !610, file: !41, line: 234, baseType: !39, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !40, file: !41, line: 383, baseType: !628, size: 576)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !41, line: 237, size: 576, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !628, file: !41, line: 238, baseType: !39, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 72)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !628, file: !41, line: 238, baseType: !50, size: 16, offset: 80)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 104)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 112)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 120)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !628, file: !41, line: 238, baseType: !92, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !628, file: !41, line: 238, baseType: !14, size: 32, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !628, file: !41, line: 238, baseType: !14, size: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !628, file: !41, line: 238, baseType: !14, size: 32, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !628, file: !41, line: 238, baseType: !19, size: 8, offset: 296)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !628, file: !41, line: 238, baseType: !50, size: 16, offset: 304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !628, file: !41, line: 239, baseType: !39, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !628, file: !41, line: 240, baseType: !18, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !628, file: !41, line: 241, baseType: !50, size: 16, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !628, file: !41, line: 242, baseType: !18, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !40, file: !41, line: 384, baseType: !650, size: 384)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !41, line: 262, size: 384, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !650, file: !41, line: 263, baseType: !39, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 72)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !650, file: !41, line: 263, baseType: !50, size: 16, offset: 80)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 120)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !650, file: !41, line: 263, baseType: !92, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !650, file: !41, line: 263, baseType: !14, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !650, file: !41, line: 263, baseType: !14, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !650, file: !41, line: 263, baseType: !14, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 296)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !650, file: !41, line: 263, baseType: !19, size: 8, offset: 304)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !650, file: !41, line: 264, baseType: !39, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !40, file: !41, line: 385, baseType: !669, size: 448)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !41, line: 245, size: 448, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !669, file: !41, line: 246, baseType: !39, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 72)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !669, file: !41, line: 246, baseType: !50, size: 16, offset: 80)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 104)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 120)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !669, file: !41, line: 246, baseType: !92, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !669, file: !41, line: 246, baseType: !14, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !669, file: !41, line: 246, baseType: !14, size: 32, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !669, file: !41, line: 246, baseType: !14, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !669, file: !41, line: 246, baseType: !19, size: 8, offset: 296)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !669, file: !41, line: 246, baseType: !39, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !669, file: !41, line: 247, baseType: !39, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !40, file: !41, line: 386, baseType: !688, size: 448)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !41, line: 250, size: 448, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !688, file: !41, line: 251, baseType: !39, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 72)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !688, file: !41, line: 251, baseType: !50, size: 16, offset: 80)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 104)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 112)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 120)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !688, file: !41, line: 251, baseType: !92, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !688, file: !41, line: 251, baseType: !14, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !688, file: !41, line: 251, baseType: !14, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !688, file: !41, line: 251, baseType: !14, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !688, file: !41, line: 251, baseType: !19, size: 8, offset: 296)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !688, file: !41, line: 256, baseType: !39, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !688, file: !41, line: 257, baseType: !39, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !40, file: !41, line: 387, baseType: !707, size: 512)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !41, line: 273, size: 512, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !707, file: !41, line: 274, baseType: !39, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !707, file: !41, line: 274, baseType: !19, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !41, line: 274, baseType: !19, size: 8, offset: 72)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !707, file: !41, line: 274, baseType: !50, size: 16, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !41, line: 274, baseType: !19, size: 8, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !41, line: 274, baseType: !92, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !707, file: !41, line: 275, baseType: !14, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !707, file: !41, line: 276, baseType: !384, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !707, file: !41, line: 277, baseType: !22, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !41, line: 278, baseType: !491, size: 128, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !40, file: !41, line: 388, baseType: !720, size: 512)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !41, line: 281, size: 512, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !735, !736, !737, !743, !744}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !720, file: !41, line: 282, baseType: !39, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !720, file: !41, line: 282, baseType: !19, size: 8, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !41, line: 282, baseType: !19, size: 8, offset: 72)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !720, file: !41, line: 282, baseType: !50, size: 16, offset: 80)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !41, line: 282, baseType: !19, size: 8, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !720, file: !41, line: 282, baseType: !19, size: 8, offset: 104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !720, file: !41, line: 283, baseType: !19, size: 8, offset: 112)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !720, file: !41, line: 284, baseType: !730, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !13, line: 1084, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!12, !14, !480, !14, !734, !22, !22}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !720, file: !41, line: 285, baseType: !92, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !720, file: !41, line: 286, baseType: !22, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !720, file: !41, line: 287, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !13, line: 1102, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!12, !388, !14, !22, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !720, file: !41, line: 288, baseType: !39, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !41, line: 289, baseType: !39, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !40, file: !41, line: 389, baseType: !746, size: 512)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !41, line: 307, size: 512, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !746, file: !41, line: 308, baseType: !39, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !746, file: !41, line: 308, baseType: !19, size: 8, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !41, line: 308, baseType: !19, size: 8, offset: 72)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !746, file: !41, line: 308, baseType: !50, size: 16, offset: 80)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !41, line: 308, baseType: !19, size: 8, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !746, file: !41, line: 308, baseType: !19, size: 8, offset: 104)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !746, file: !41, line: 309, baseType: !19, size: 8, offset: 112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !746, file: !41, line: 310, baseType: !19, size: 8, offset: 120)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !746, file: !41, line: 311, baseType: !22, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !746, file: !41, line: 312, baseType: !92, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !746, file: !41, line: 313, baseType: !124, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !746, file: !41, line: 314, baseType: !18, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !746, file: !41, line: 315, baseType: !18, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !746, file: !41, line: 316, baseType: !14, size: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !40, file: !41, line: 390, baseType: !763, size: 448)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !41, line: 340, size: 448, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !763, file: !41, line: 341, baseType: !39, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !763, file: !41, line: 341, baseType: !19, size: 8, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !41, line: 341, baseType: !19, size: 8, offset: 72)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !763, file: !41, line: 341, baseType: !50, size: 16, offset: 80)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !41, line: 341, baseType: !19, size: 8, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !763, file: !41, line: 341, baseType: !92, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !763, file: !41, line: 342, baseType: !92, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !763, file: !41, line: 343, baseType: !22, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !763, file: !41, line: 344, baseType: !18, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !763, file: !41, line: 345, baseType: !14, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !41, line: 391, baseType: !776, size: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !41, line: 350, size: 256, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !788}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !776, file: !41, line: 351, baseType: !39, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !776, file: !41, line: 351, baseType: !19, size: 8, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !41, line: 351, baseType: !19, size: 8, offset: 72)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !776, file: !41, line: 351, baseType: !50, size: 16, offset: 80)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !41, line: 351, baseType: !19, size: 8, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !776, file: !41, line: 351, baseType: !784, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !13, line: 1055, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !388, !22}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !776, file: !41, line: 352, baseType: !22, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !40, file: !41, line: 392, baseType: !790, size: 192)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !41, line: 357, size: 192, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !790, file: !41, line: 358, baseType: !39, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !790, file: !41, line: 358, baseType: !19, size: 8, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !790, file: !41, line: 358, baseType: !19, size: 8, offset: 72)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !790, file: !41, line: 358, baseType: !50, size: 16, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !41, line: 358, baseType: !19, size: 8, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !41, line: 358, baseType: !39, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !40, file: !41, line: 399, baseType: !93, size: 384)
!799 = !{}
!800 = !DILocalVariable(name: "source_desc", arg: 1, scope: !36, file: !1, line: 30, type: !39)
!801 = !DILocation(line: 30, column: 59, scope: !36)
!802 = !DILocalVariable(name: "target_desc", arg: 2, scope: !36, file: !1, line: 31, type: !39)
!803 = !DILocation(line: 31, column: 38, scope: !36)
!804 = !DILocalVariable(name: "length", scope: !36, file: !1, line: 33, type: !14)
!805 = !DILocation(line: 33, column: 6, scope: !36)
!806 = !DILocalVariable(name: "buffer", scope: !36, file: !1, line: 34, type: !18)
!807 = !DILocation(line: 34, column: 6, scope: !36)
!808 = !DILocation(line: 40, column: 6, scope: !809)
!809 = distinct !DILexicalBlock(scope: !36, file: !1, line: 40, column: 6)
!810 = !DILocation(line: 40, column: 21, scope: !809)
!811 = !DILocation(line: 40, column: 18, scope: !809)
!812 = !DILocation(line: 40, column: 6, scope: !36)
!813 = !DILocation(line: 41, column: 3, scope: !814)
!814 = distinct !DILexicalBlock(scope: !809, file: !1, line: 40, column: 34)
!815 = !DILocation(line: 46, column: 11, scope: !36)
!816 = !DILocation(line: 46, column: 9, scope: !36)
!817 = !DILocation(line: 47, column: 11, scope: !36)
!818 = !DILocation(line: 47, column: 24, scope: !36)
!819 = !DILocation(line: 47, column: 31, scope: !36)
!820 = !DILocation(line: 47, column: 9, scope: !36)
!821 = !DILocation(line: 53, column: 7, scope: !822)
!822 = distinct !DILexicalBlock(scope: !36, file: !1, line: 53, column: 6)
!823 = !DILocation(line: 53, column: 20, scope: !822)
!824 = !DILocation(line: 53, column: 27, scope: !822)
!825 = !DILocation(line: 53, column: 34, scope: !822)
!826 = !DILocation(line: 53, column: 40, scope: !822)
!827 = !DILocation(line: 54, column: 7, scope: !822)
!828 = !DILocation(line: 54, column: 20, scope: !822)
!829 = !DILocation(line: 54, column: 27, scope: !822)
!830 = !DILocation(line: 54, column: 33, scope: !822)
!831 = !DILocation(line: 53, column: 6, scope: !36)
!832 = !DILocation(line: 55, column: 33, scope: !833)
!833 = distinct !DILexicalBlock(scope: !822, file: !1, line: 54, column: 59)
!834 = !DILocation(line: 55, column: 3, scope: !833)
!835 = !DILocation(line: 55, column: 16, scope: !833)
!836 = !DILocation(line: 55, column: 23, scope: !833)
!837 = !DILocation(line: 55, column: 31, scope: !833)
!838 = !DILocation(line: 56, column: 8, scope: !839)
!839 = distinct !DILexicalBlock(scope: !833, file: !1, line: 56, column: 7)
!840 = !DILocation(line: 56, column: 21, scope: !839)
!841 = !DILocation(line: 56, column: 28, scope: !839)
!842 = !DILocation(line: 56, column: 7, scope: !833)
!843 = !DILocation(line: 57, column: 4, scope: !844)
!844 = distinct !DILexicalBlock(scope: !839, file: !1, line: 56, column: 37)
!845 = !DILocation(line: 60, column: 32, scope: !833)
!846 = !DILocation(line: 60, column: 3, scope: !833)
!847 = !DILocation(line: 60, column: 16, scope: !833)
!848 = !DILocation(line: 60, column: 23, scope: !833)
!849 = !DILocation(line: 60, column: 30, scope: !833)
!850 = !DILocation(line: 61, column: 2, scope: !833)
!851 = !DILocation(line: 65, column: 6, scope: !852)
!852 = distinct !DILexicalBlock(scope: !36, file: !1, line: 65, column: 6)
!853 = !DILocation(line: 65, column: 16, scope: !852)
!854 = !DILocation(line: 65, column: 29, scope: !852)
!855 = !DILocation(line: 65, column: 36, scope: !852)
!856 = !DILocation(line: 65, column: 13, scope: !852)
!857 = !DILocation(line: 65, column: 6, scope: !36)
!858 = !DILocation(line: 69, column: 10, scope: !859)
!859 = distinct !DILexicalBlock(scope: !852, file: !1, line: 65, column: 44)
!860 = !DILocation(line: 69, column: 23, scope: !859)
!861 = !DILocation(line: 69, column: 30, scope: !859)
!862 = !DILocation(line: 70, column: 10, scope: !859)
