; ModuleID = '../bcout/drivers/acpi/acpica/hwesleep.llvm.bc'
source_filename = "drivers/acpi/acpica/hwesleep.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_fadt = type <{ %struct.acpi_table_header, i32, i32, i8, i8, i16, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i8, i8, i8, i16, i8, i32, %struct.acpi_generic_address, i8, i16, i8, i64, i64, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, i64 }>
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !21, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/hwesleep.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !11, !12, !17}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !7, line: 23, baseType: !8)
!7 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !9, line: 31, baseType: !10)
!9 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !13, line: 421, baseType: !14)
!13 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !7, line: 21, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !9, line: 27, baseType: !16)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !7, line: 17, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !9, line: 21, baseType: !19)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !{!0}
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 72, elements: !24)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !{!25}
!25 = !DISubrange(count: 9)
!26 = !{!"rsp"}
!27 = !{i32 7, !"Dwarf Version", i32 4}
!28 = !{i32 2, !"Debug Info Version", i32 3}
!29 = !{i32 1, !"wchar_size", i32 2}
!30 = !{i32 1, !"Code Model", i32 2}
!31 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!32 = distinct !DISubprogram(name: "acpi_hw_execute_sleep_method", scope: !3, file: !3, line: 30, type: !33, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !14}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!36 = !DILocalVariable(name: "method_pathname", arg: 1, scope: !32, file: !3, line: 30, type: !35)
!37 = !DILocation(line: 30, column: 41, scope: !32)
!38 = !DILocalVariable(name: "integer_argument", arg: 2, scope: !32, file: !3, line: 30, type: !14)
!39 = !DILocation(line: 30, column: 62, scope: !32)
!40 = !DILocalVariable(name: "arg_list", scope: !32, file: !3, line: 32, type: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_list", file: !13, line: 947, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !41, file: !13, line: 948, baseType: !14, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !41, file: !13, line: 949, baseType: !45, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !13, line: 899, size: 192, elements: !47)
!47 = !{!48, !50, !55, !61, !68, !74, !81, !89}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !13, line: 900, baseType: !49, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !13, line: 635, baseType: !14)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !46, file: !13, line: 904, baseType: !51, size: 128)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 901, size: 128, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !13, line: 902, baseType: !49, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !51, file: !13, line: 903, baseType: !6, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !46, file: !13, line: 910, baseType: !56, size: 128)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 906, size: 128, elements: !57)
!57 = !{!58, !59, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !56, file: !13, line: 907, baseType: !49, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !56, file: !13, line: 908, baseType: !14, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !56, file: !13, line: 909, baseType: !35, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !46, file: !13, line: 916, baseType: !62, size: 128)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 912, size: 128, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !13, line: 913, baseType: !49, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !62, file: !13, line: 914, baseType: !14, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !62, file: !13, line: 915, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !46, file: !13, line: 922, baseType: !69, size: 128)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 918, size: 128, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !13, line: 919, baseType: !49, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !69, file: !13, line: 920, baseType: !14, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !69, file: !13, line: 921, baseType: !45, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !46, file: !13, line: 928, baseType: !75, size: 128)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 924, size: 128, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !13, line: 925, baseType: !49, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !75, file: !13, line: 926, baseType: !49, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !75, file: !13, line: 927, baseType: !80, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !13, line: 424, baseType: !11)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !46, file: !13, line: 935, baseType: !82, size: 192)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 930, size: 192, elements: !83)
!83 = !{!84, !85, !86, !88}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !13, line: 931, baseType: !49, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !82, file: !13, line: 932, baseType: !14, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !82, file: !13, line: 933, baseType: !87, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !13, line: 128, baseType: !6)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !82, file: !13, line: 934, baseType: !14, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !46, file: !13, line: 941, baseType: !90, size: 96)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !46, file: !13, line: 937, size: 96, elements: !91)
!91 = !{!92, !93, !94}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !90, file: !13, line: 938, baseType: !49, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !90, file: !13, line: 939, baseType: !14, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !90, file: !13, line: 940, baseType: !14, size: 32, offset: 64)
!95 = !DILocation(line: 32, column: 26, scope: !32)
!96 = !DILocalVariable(name: "arg", scope: !32, file: !3, line: 33, type: !46)
!97 = !DILocation(line: 33, column: 20, scope: !32)
!98 = !DILocalVariable(name: "status", scope: !32, file: !3, line: 34, type: !12)
!99 = !DILocation(line: 34, column: 14, scope: !32)
!100 = !DILocation(line: 40, column: 11, scope: !32)
!101 = !DILocation(line: 40, column: 17, scope: !32)
!102 = !DILocation(line: 41, column: 11, scope: !32)
!103 = !DILocation(line: 41, column: 19, scope: !32)
!104 = !DILocation(line: 42, column: 6, scope: !32)
!105 = !DILocation(line: 42, column: 11, scope: !32)
!106 = !DILocation(line: 43, column: 27, scope: !32)
!107 = !DILocation(line: 43, column: 22, scope: !32)
!108 = !DILocation(line: 43, column: 6, scope: !32)
!109 = !DILocation(line: 43, column: 14, scope: !32)
!110 = !DILocation(line: 43, column: 20, scope: !32)
!111 = !DILocation(line: 45, column: 38, scope: !32)
!112 = !DILocation(line: 45, column: 11, scope: !32)
!113 = !DILocation(line: 45, column: 9, scope: !32)
!114 = !DILocation(line: 46, column: 6, scope: !115)
!115 = distinct !DILexicalBlock(scope: !32, file: !3, line: 46, column: 6)
!116 = !DILocation(line: 46, column: 27, scope: !115)
!117 = !DILocation(line: 46, column: 30, scope: !115)
!118 = !DILocation(line: 46, column: 37, scope: !115)
!119 = !DILocation(line: 46, column: 6, scope: !32)
!120 = !DILocation(line: 47, column: 3, scope: !121)
!121 = distinct !DILexicalBlock(scope: !115, file: !3, line: 46, column: 54)
!122 = !DILocation(line: 49, column: 2, scope: !121)
!123 = !DILocation(line: 51, column: 2, scope: !32)
!124 = distinct !DISubprogram(name: "acpi_hw_extended_sleep", scope: !3, file: !3, line: 68, type: !125, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!125 = !DISubroutineType(types: !126)
!126 = !{!12, !17}
!127 = !DILocalVariable(name: "sleep_state", arg: 1, scope: !124, file: !3, line: 68, type: !17)
!128 = !DILocation(line: 68, column: 39, scope: !124)
!129 = !DILocalVariable(name: "status", scope: !124, file: !3, line: 70, type: !12)
!130 = !DILocation(line: 70, column: 14, scope: !124)
!131 = !DILocalVariable(name: "sleep_control", scope: !124, file: !3, line: 71, type: !17)
!132 = !DILocation(line: 71, column: 5, scope: !124)
!133 = !DILocalVariable(name: "sleep_status", scope: !124, file: !3, line: 72, type: !6)
!134 = !DILocation(line: 72, column: 6, scope: !124)
!135 = !DILocation(line: 78, column: 35, scope: !136)
!136 = distinct !DILexicalBlock(scope: !124, file: !3, line: 78, column: 6)
!137 = !DILocation(line: 78, column: 7, scope: !136)
!138 = !DILocation(line: 78, column: 43, scope: !136)
!139 = !DILocation(line: 79, column: 34, scope: !136)
!140 = !DILocation(line: 79, column: 7, scope: !136)
!141 = !DILocation(line: 78, column: 6, scope: !124)
!142 = !DILocation(line: 80, column: 3, scope: !143)
!143 = distinct !DILexicalBlock(scope: !136, file: !3, line: 79, column: 43)
!144 = !DILocation(line: 85, column: 11, scope: !124)
!145 = !DILocation(line: 85, column: 9, scope: !124)
!146 = !DILocation(line: 87, column: 6, scope: !147)
!147 = distinct !DILexicalBlock(scope: !124, file: !3, line: 87, column: 6)
!148 = !DILocation(line: 87, column: 6, scope: !124)
!149 = !DILocation(line: 88, column: 3, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !3, line: 87, column: 28)
!151 = !DILocation(line: 91, column: 36, scope: !124)
!152 = !DILocation(line: 102, column: 20, scope: !124)
!153 = !DILocation(line: 102, column: 42, scope: !124)
!154 = !DILocation(line: 102, column: 73, scope: !124)
!155 = !DILocation(line: 103, column: 29, scope: !124)
!156 = !DILocation(line: 102, column: 18, scope: !124)
!157 = !DILocation(line: 102, column: 16, scope: !124)
!158 = !DILocation(line: 107, column: 2, scope: !124)
