; ModuleID = '../bcout/drivers/acpi/acpica/hwgpe.llvm.bc'
source_filename = "drivers/acpi/acpica/hwgpe.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.spinlock = type { %union.anon.0 }
%union.anon.0 = type { %struct.raw_spinlock }
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.acpi_gpe_address = type { i8, i64 }
%struct.acpi_gpe_event_info = type { %union.acpi_gpe_dispatch_info, %struct.acpi_gpe_register_info*, i8, i8, i8, i8 }
%union.acpi_gpe_dispatch_info = type { %struct.acpi_namespace_node* }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !26, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/hwgpe.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !13, !16, !17, !18, !19, !23, !8, !20, !24}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !7, line: 805, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !15)
!15 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !22)
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !7, line: 128, baseType: !13)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_event_status", file: !7, line: 738, baseType: !20)
!25 = !{!0}
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, elements: !29)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !{!30}
!30 = !DISubrange(count: 6)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 2}
!34 = !{i32 1, !"Code Model", i32 2}
!35 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!36 = distinct !DISubprogram(name: "acpi_hw_gpe_read", scope: !3, file: !3, line: 43, type: !37, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!37 = !DISubroutineType(types: !38)
!38 = !{!19, !39, !40}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !42, line: 459, size: 128, elements: !43)
!42 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!43 = !{!44, !45}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !41, file: !42, line: 460, baseType: !8, size: 8)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !41, file: !42, line: 461, baseType: !13, size: 64, offset: 64)
!46 = !DILocalVariable(name: "value", arg: 1, scope: !36, file: !3, line: 43, type: !39)
!47 = !DILocation(line: 43, column: 35, scope: !36)
!48 = !DILocalVariable(name: "reg", arg: 2, scope: !36, file: !3, line: 43, type: !40)
!49 = !DILocation(line: 43, column: 67, scope: !36)
!50 = !DILocalVariable(name: "status", scope: !36, file: !3, line: 45, type: !19)
!51 = !DILocation(line: 45, column: 14, scope: !36)
!52 = !DILocalVariable(name: "value32", scope: !36, file: !3, line: 46, type: !20)
!53 = !DILocation(line: 46, column: 6, scope: !36)
!54 = !DILocation(line: 48, column: 6, scope: !55)
!55 = distinct !DILexicalBlock(scope: !36, file: !3, line: 48, column: 6)
!56 = !DILocation(line: 48, column: 11, scope: !55)
!57 = !DILocation(line: 48, column: 20, scope: !55)
!58 = !DILocation(line: 48, column: 6, scope: !36)
!59 = !DILocation(line: 50, column: 17, scope: !60)
!60 = distinct !DILexicalBlock(scope: !55, file: !3, line: 48, column: 53)
!61 = !DILocation(line: 50, column: 12, scope: !60)
!62 = !DILocation(line: 50, column: 4, scope: !60)
!63 = !DILocation(line: 50, column: 10, scope: !60)
!64 = !DILocation(line: 51, column: 3, scope: !60)
!65 = !DILocation(line: 58, column: 46, scope: !36)
!66 = !DILocation(line: 58, column: 51, scope: !36)
!67 = !DILocation(line: 58, column: 11, scope: !36)
!68 = !DILocation(line: 58, column: 9, scope: !36)
!69 = !DILocation(line: 60, column: 6, scope: !70)
!70 = distinct !DILexicalBlock(scope: !36, file: !3, line: 60, column: 6)
!71 = !DILocation(line: 60, column: 6, scope: !36)
!72 = !DILocation(line: 61, column: 3, scope: !70)
!73 = !DILocation(line: 63, column: 16, scope: !36)
!74 = !DILocation(line: 63, column: 11, scope: !36)
!75 = !DILocation(line: 63, column: 3, scope: !36)
!76 = !DILocation(line: 63, column: 9, scope: !36)
!77 = !DILocation(line: 65, column: 2, scope: !36)
!78 = !DILocation(line: 66, column: 1, scope: !36)
!79 = distinct !DISubprogram(name: "acpi_hw_gpe_write", scope: !3, file: !3, line: 81, type: !80, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!80 = !DISubroutineType(types: !81)
!81 = !{!19, !13, !40}
!82 = !DILocalVariable(name: "value", arg: 1, scope: !79, file: !3, line: 81, type: !13)
!83 = !DILocation(line: 81, column: 35, scope: !79)
!84 = !DILocalVariable(name: "reg", arg: 2, scope: !79, file: !3, line: 81, type: !40)
!85 = !DILocation(line: 81, column: 67, scope: !79)
!86 = !DILocation(line: 83, column: 6, scope: !87)
!87 = distinct !DILexicalBlock(scope: !79, file: !3, line: 83, column: 6)
!88 = !DILocation(line: 83, column: 11, scope: !87)
!89 = !DILocation(line: 83, column: 20, scope: !87)
!90 = !DILocation(line: 83, column: 6, scope: !79)
!91 = !DILocation(line: 85, column: 3, scope: !92)
!92 = distinct !DILexicalBlock(scope: !87, file: !3, line: 83, column: 53)
!93 = !DILocation(line: 86, column: 3, scope: !92)
!94 = !DILocation(line: 93, column: 45, scope: !79)
!95 = !DILocation(line: 93, column: 50, scope: !79)
!96 = !DILocation(line: 93, column: 64, scope: !79)
!97 = !DILocation(line: 93, column: 59, scope: !79)
!98 = !DILocation(line: 93, column: 9, scope: !79)
!99 = !DILocation(line: 93, column: 2, scope: !79)
!100 = !DILocation(line: 95, column: 1, scope: !79)
!101 = distinct !DISubprogram(name: "acpi_hw_get_gpe_register_bit", scope: !3, file: !3, line: 110, type: !102, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!102 = !DISubroutineType(types: !103)
!103 = !{!20, !104}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !42, line: 448, size: 192, elements: !106)
!106 = !{!107, !851, !852, !853, !854, !855}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !105, file: !42, line: 449, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !42, line: 438, size: 64, elements: !109)
!109 = !{!110, !832, !845}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !108, file: !42, line: 439, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !42, line: 133, size: 384, elements: !113)
!113 = !{!114, !819, !820, !821, !822, !828, !829, !830, !831}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !112, file: !42, line: 134, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !117, line: 367, size: 576, elements: !118)
!117 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!118 = !{!119, !130, !143, !154, !167, !181, !190, !507, !524, !539, !552, !595, !607, !620, !630, !648, !670, !689, !708, !727, !740, !765, !782, !795, !809, !818}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !116, file: !117, line: 368, baseType: !120, size: 128)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !117, line: 73, size: 128, elements: !121)
!121 = !{!122, !123, !124, !125, !129}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !120, file: !117, line: 74, baseType: !115, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !120, file: !117, line: 74, baseType: !8, size: 8, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !117, line: 74, baseType: !8, size: 8, offset: 72)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !120, file: !117, line: 74, baseType: !126, size: 16, offset: 80)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !128)
!128 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !117, line: 74, baseType: !8, size: 8, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !116, file: !117, line: 369, baseType: !131, size: 192)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !117, line: 76, size: 192, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !142}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !131, file: !117, line: 77, baseType: !115, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !131, file: !117, line: 77, baseType: !8, size: 8, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !117, line: 77, baseType: !8, size: 8, offset: 72)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !131, file: !117, line: 77, baseType: !126, size: 16, offset: 80)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !117, line: 77, baseType: !8, size: 8, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !131, file: !117, line: 77, baseType: !139, size: 24, offset: 104)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 24, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 3)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !131, file: !117, line: 78, baseType: !13, size: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !116, file: !117, line: 370, baseType: !144, size: 256)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !117, line: 93, size: 256, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !153}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !144, file: !117, line: 94, baseType: !115, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !144, file: !117, line: 94, baseType: !8, size: 8, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !144, file: !117, line: 94, baseType: !8, size: 8, offset: 72)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !144, file: !117, line: 94, baseType: !126, size: 16, offset: 80)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !144, file: !117, line: 94, baseType: !8, size: 8, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !144, file: !117, line: 94, baseType: !152, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !144, file: !117, line: 94, baseType: !20, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !116, file: !117, line: 371, baseType: !155, size: 384)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !117, line: 97, size: 384, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !155, file: !117, line: 98, baseType: !115, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !155, file: !117, line: 98, baseType: !8, size: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !117, line: 98, baseType: !8, size: 8, offset: 72)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !155, file: !117, line: 98, baseType: !126, size: 16, offset: 80)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !117, line: 98, baseType: !8, size: 8, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !155, file: !117, line: 98, baseType: !16, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !155, file: !117, line: 98, baseType: !20, size: 32, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !155, file: !117, line: 99, baseType: !20, size: 32, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !155, file: !117, line: 100, baseType: !16, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !155, file: !117, line: 101, baseType: !111, size: 64, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !116, file: !117, line: 372, baseType: !168, size: 384)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !117, line: 104, size: 384, elements: !169)
!169 = !{!170, !171, !172, !173, !174, !175, !176, !178, !179, !180}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !168, file: !117, line: 105, baseType: !115, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !168, file: !117, line: 105, baseType: !8, size: 8, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !168, file: !117, line: 105, baseType: !8, size: 8, offset: 72)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !168, file: !117, line: 105, baseType: !126, size: 16, offset: 80)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !168, file: !117, line: 105, baseType: !8, size: 8, offset: 96)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !168, file: !117, line: 105, baseType: !111, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !168, file: !117, line: 106, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !168, file: !117, line: 107, baseType: !16, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !168, file: !117, line: 108, baseType: !20, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !168, file: !117, line: 109, baseType: !20, size: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !116, file: !117, line: 373, baseType: !182, size: 192)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !117, line: 118, size: 192, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !182, file: !117, line: 119, baseType: !115, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !182, file: !117, line: 119, baseType: !8, size: 8, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !182, file: !117, line: 119, baseType: !8, size: 8, offset: 72)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !182, file: !117, line: 119, baseType: !126, size: 16, offset: 80)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !182, file: !117, line: 119, baseType: !8, size: 8, offset: 96)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !182, file: !117, line: 119, baseType: !17, size: 64, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !116, file: !117, line: 374, baseType: !191, size: 448)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !117, line: 143, size: 448, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !504, !505, !506}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !191, file: !117, line: 144, baseType: !115, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !191, file: !117, line: 144, baseType: !8, size: 8, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !117, line: 144, baseType: !8, size: 8, offset: 72)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !191, file: !117, line: 144, baseType: !126, size: 16, offset: 80)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !191, file: !117, line: 144, baseType: !8, size: 8, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !191, file: !117, line: 144, baseType: !8, size: 8, offset: 104)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !191, file: !117, line: 145, baseType: !8, size: 8, offset: 112)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !191, file: !117, line: 146, baseType: !8, size: 8, offset: 120)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !191, file: !117, line: 147, baseType: !115, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !191, file: !117, line: 148, baseType: !115, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !191, file: !117, line: 149, baseType: !16, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !191, file: !117, line: 153, baseType: !205, size: 64, offset: 320)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !191, file: !117, line: 150, size: 64, elements: !206)
!206 = !{!207, !503}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !205, file: !117, line: 151, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !42, line: 248, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{!19, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !214, line: 37, size: 9024, elements: !215)
!214 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !449, !450, !451, !452, !453, !457, !459, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !486, !487, !488, !489, !490, !491, !492, !493, !495, !501}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !214, line: 38, baseType: !212, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !213, file: !214, line: 39, baseType: !8, size: 8, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !213, file: !214, line: 40, baseType: !8, size: 8, offset: 72)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !213, file: !214, line: 41, baseType: !126, size: 16, offset: 80)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !213, file: !214, line: 42, baseType: !8, size: 8, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !213, file: !214, line: 43, baseType: !8, size: 8, offset: 104)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !213, file: !214, line: 44, baseType: !8, size: 8, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !213, file: !214, line: 45, baseType: !224, size: 16, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !7, line: 445, baseType: !126)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !213, file: !214, line: 46, baseType: !8, size: 8, offset: 144)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !213, file: !214, line: 47, baseType: !8, size: 8, offset: 152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !213, file: !214, line: 48, baseType: !8, size: 8, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !213, file: !214, line: 49, baseType: !8, size: 8, offset: 168)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !213, file: !214, line: 50, baseType: !8, size: 8, offset: 176)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !213, file: !214, line: 51, baseType: !8, size: 8, offset: 184)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !213, file: !214, line: 52, baseType: !8, size: 8, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !213, file: !214, line: 53, baseType: !8, size: 8, offset: 200)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !213, file: !214, line: 54, baseType: !16, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !213, file: !214, line: 55, baseType: !20, size: 32, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !213, file: !214, line: 56, baseType: !20, size: 32, offset: 352)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !213, file: !214, line: 57, baseType: !20, size: 32, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !213, file: !214, line: 58, baseType: !20, size: 32, offset: 416)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !213, file: !214, line: 60, baseType: !239, size: 640, offset: 448)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !42, line: 893, size: 640, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !330, !331, !447, !448}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !239, file: !42, line: 894, baseType: !16, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !239, file: !42, line: 895, baseType: !16, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !239, file: !42, line: 896, baseType: !16, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !239, file: !42, line: 897, baseType: !16, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !239, file: !42, line: 898, baseType: !16, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !239, file: !42, line: 899, baseType: !247, size: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !42, line: 875, size: 1600, elements: !249)
!249 = !{!250, !270, !286}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !248, file: !42, line: 876, baseType: !251, size: 448)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !42, line: 828, size: 448, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !269}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !251, file: !42, line: 829, baseType: !247, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !251, file: !42, line: 829, baseType: !8, size: 8, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !42, line: 829, baseType: !8, size: 8, offset: 72)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !251, file: !42, line: 829, baseType: !126, size: 16, offset: 80)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !251, file: !42, line: 829, baseType: !16, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !251, file: !42, line: 829, baseType: !247, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !251, file: !42, line: 829, baseType: !111, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !251, file: !42, line: 829, baseType: !261, size: 64, offset: 320)
!261 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !42, line: 716, size: 64, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !261, file: !42, line: 717, baseType: !13, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !261, file: !42, line: 718, baseType: !20, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !261, file: !42, line: 719, baseType: !152, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !261, file: !42, line: 720, baseType: !16, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !42, line: 721, baseType: !152, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !261, file: !42, line: 722, baseType: !247, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !251, file: !42, line: 829, baseType: !8, size: 8, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !248, file: !42, line: 877, baseType: !271, size: 640)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !42, line: 835, size: 640, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !271, file: !42, line: 836, baseType: !247, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !271, file: !42, line: 836, baseType: !8, size: 8, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !42, line: 836, baseType: !8, size: 8, offset: 72)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !271, file: !42, line: 836, baseType: !126, size: 16, offset: 80)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !271, file: !42, line: 836, baseType: !16, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !42, line: 836, baseType: !247, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !271, file: !42, line: 836, baseType: !111, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !271, file: !42, line: 836, baseType: !261, size: 64, offset: 320)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !271, file: !42, line: 836, baseType: !8, size: 8, offset: 384)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !271, file: !42, line: 836, baseType: !152, size: 64, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !271, file: !42, line: 837, baseType: !16, size: 64, offset: 512)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !271, file: !42, line: 838, baseType: !20, size: 32, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !271, file: !42, line: 839, baseType: !20, size: 32, offset: 608)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !248, file: !42, line: 878, baseType: !287, size: 1600)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !42, line: 846, size: 1600, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !287, file: !42, line: 847, baseType: !247, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !42, line: 847, baseType: !8, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !42, line: 847, baseType: !8, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !287, file: !42, line: 847, baseType: !126, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !287, file: !42, line: 847, baseType: !16, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !42, line: 847, baseType: !247, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !287, file: !42, line: 847, baseType: !111, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !42, line: 847, baseType: !261, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !287, file: !42, line: 847, baseType: !8, size: 8, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !287, file: !42, line: 847, baseType: !247, size: 64, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !287, file: !42, line: 848, baseType: !247, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !287, file: !42, line: 849, baseType: !152, size: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !287, file: !42, line: 850, baseType: !8, size: 8, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !287, file: !42, line: 851, baseType: !152, size: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !287, file: !42, line: 852, baseType: !152, size: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !287, file: !42, line: 853, baseType: !152, size: 64, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !287, file: !42, line: 854, baseType: !306, size: 32, offset: 896)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 4)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !287, file: !42, line: 855, baseType: !20, size: 32, offset: 928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !287, file: !42, line: 856, baseType: !20, size: 32, offset: 960)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !287, file: !42, line: 857, baseType: !20, size: 32, offset: 992)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !287, file: !42, line: 858, baseType: !20, size: 32, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !287, file: !42, line: 859, baseType: !20, size: 32, offset: 1056)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !287, file: !42, line: 860, baseType: !20, size: 32, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !287, file: !42, line: 861, baseType: !20, size: 32, offset: 1120)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !287, file: !42, line: 862, baseType: !20, size: 32, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !287, file: !42, line: 863, baseType: !20, size: 32, offset: 1184)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !287, file: !42, line: 864, baseType: !20, size: 32, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !287, file: !42, line: 865, baseType: !20, size: 32, offset: 1248)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !287, file: !42, line: 866, baseType: !20, size: 32, offset: 1280)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !287, file: !42, line: 867, baseType: !20, size: 32, offset: 1312)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !287, file: !42, line: 868, baseType: !126, size: 16, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !287, file: !42, line: 869, baseType: !8, size: 8, offset: 1360)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !287, file: !42, line: 870, baseType: !8, size: 8, offset: 1368)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !287, file: !42, line: 871, baseType: !8, size: 8, offset: 1376)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !287, file: !42, line: 872, baseType: !327, size: 160, offset: 1384)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 20)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !239, file: !42, line: 900, baseType: !111, size: 64, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !239, file: !42, line: 901, baseType: !332, size: 64, offset: 448)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !42, line: 663, size: 640, elements: !334)
!334 = !{!335, !343, !356, !365, !374, !387, !401, !413, !425}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !333, file: !42, line: 664, baseType: !336, size: 128)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !42, line: 567, size: 128, elements: !337)
!337 = !{!338, !339, !340, !341, !342}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !42, line: 568, baseType: !17, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !336, file: !42, line: 568, baseType: !8, size: 8, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !336, file: !42, line: 568, baseType: !8, size: 8, offset: 72)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !336, file: !42, line: 568, baseType: !126, size: 16, offset: 80)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !336, file: !42, line: 568, baseType: !126, size: 16, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !333, file: !42, line: 665, baseType: !344, size: 384)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !42, line: 593, size: 384, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !42, line: 594, baseType: !17, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !344, file: !42, line: 594, baseType: !8, size: 8, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !42, line: 594, baseType: !8, size: 8, offset: 72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !344, file: !42, line: 594, baseType: !126, size: 16, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !42, line: 594, baseType: !126, size: 16, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !344, file: !42, line: 594, baseType: !126, size: 16, offset: 112)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !344, file: !42, line: 595, baseType: !247, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !344, file: !42, line: 596, baseType: !16, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !344, file: !42, line: 597, baseType: !16, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !344, file: !42, line: 598, baseType: !13, size: 64, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !333, file: !42, line: 666, baseType: !357, size: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !42, line: 573, size: 192, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !42, line: 574, baseType: !17, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !357, file: !42, line: 574, baseType: !8, size: 8, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !357, file: !42, line: 574, baseType: !8, size: 8, offset: 72)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !357, file: !42, line: 574, baseType: !126, size: 16, offset: 80)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !42, line: 574, baseType: !126, size: 16, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !357, file: !42, line: 574, baseType: !115, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !333, file: !42, line: 667, baseType: !366, size: 192)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !42, line: 604, size: 192, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !42, line: 605, baseType: !17, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !366, file: !42, line: 605, baseType: !8, size: 8, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !42, line: 605, baseType: !8, size: 8, offset: 72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !366, file: !42, line: 605, baseType: !126, size: 16, offset: 80)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !42, line: 605, baseType: !126, size: 16, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !366, file: !42, line: 605, baseType: !111, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !333, file: !42, line: 668, baseType: !375, size: 448)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !42, line: 608, size: 448, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !42, line: 609, baseType: !17, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !375, file: !42, line: 609, baseType: !8, size: 8, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !375, file: !42, line: 609, baseType: !8, size: 8, offset: 72)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !375, file: !42, line: 609, baseType: !126, size: 16, offset: 80)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !375, file: !42, line: 609, baseType: !126, size: 16, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !375, file: !42, line: 609, baseType: !20, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !375, file: !42, line: 610, baseType: !247, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !375, file: !42, line: 611, baseType: !16, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !375, file: !42, line: 612, baseType: !16, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !375, file: !42, line: 613, baseType: !20, size: 32, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !333, file: !42, line: 669, baseType: !388, size: 512)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !42, line: 580, size: 512, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !42, line: 581, baseType: !17, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !388, file: !42, line: 581, baseType: !8, size: 8, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !388, file: !42, line: 581, baseType: !8, size: 8, offset: 72)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !388, file: !42, line: 581, baseType: !126, size: 16, offset: 80)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !388, file: !42, line: 581, baseType: !126, size: 16, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !388, file: !42, line: 581, baseType: !20, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !388, file: !42, line: 582, baseType: !115, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !388, file: !42, line: 583, baseType: !115, size: 64, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !388, file: !42, line: 584, baseType: !212, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !388, file: !42, line: 585, baseType: !17, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !388, file: !42, line: 586, baseType: !20, size: 32, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !333, file: !42, line: 670, baseType: !402, size: 320)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !42, line: 620, size: 320, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !402, file: !42, line: 621, baseType: !17, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !402, file: !42, line: 621, baseType: !8, size: 8, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !402, file: !42, line: 621, baseType: !8, size: 8, offset: 72)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !402, file: !42, line: 621, baseType: !126, size: 16, offset: 80)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !402, file: !42, line: 621, baseType: !126, size: 16, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !402, file: !42, line: 621, baseType: !8, size: 8, offset: 112)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !402, file: !42, line: 622, baseType: !212, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !402, file: !42, line: 623, baseType: !115, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !402, file: !42, line: 624, baseType: !13, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !333, file: !42, line: 671, baseType: !414, size: 640)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !42, line: 631, size: 640, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !414, file: !42, line: 632, baseType: !17, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !414, file: !42, line: 632, baseType: !8, size: 8, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !414, file: !42, line: 632, baseType: !8, size: 8, offset: 72)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !414, file: !42, line: 632, baseType: !126, size: 16, offset: 80)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !414, file: !42, line: 632, baseType: !126, size: 16, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !414, file: !42, line: 633, baseType: !422, size: 512, offset: 128)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 512, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !333, file: !42, line: 672, baseType: !426, size: 320)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !42, line: 654, size: 320, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !42, line: 655, baseType: !17, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !426, file: !42, line: 655, baseType: !8, size: 8, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !426, file: !42, line: 655, baseType: !8, size: 8, offset: 72)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !426, file: !42, line: 655, baseType: !126, size: 16, offset: 80)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !426, file: !42, line: 655, baseType: !126, size: 16, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !426, file: !42, line: 655, baseType: !8, size: 8, offset: 112)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !426, file: !42, line: 656, baseType: !111, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !426, file: !42, line: 657, baseType: !115, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !426, file: !42, line: 658, baseType: !437, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !42, line: 645, size: 128, elements: !439)
!439 = !{!440, !446}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !438, file: !42, line: 646, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !7, line: 1052, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445, !20, !17}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !7, line: 424, baseType: !17)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !438, file: !42, line: 647, baseType: !17, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !239, file: !42, line: 902, baseType: !247, size: 64, offset: 512)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !239, file: !42, line: 903, baseType: !20, size: 32, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !213, file: !214, line: 61, baseType: !20, size: 32, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !213, file: !214, line: 62, baseType: !20, size: 32, offset: 1120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !213, file: !214, line: 63, baseType: !126, size: 16, offset: 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !213, file: !214, line: 64, baseType: !8, size: 8, offset: 1168)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !213, file: !214, line: 66, baseType: !454, size: 2688, offset: 1216)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 2688, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 7)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !213, file: !214, line: 67, baseType: !458, size: 3072, offset: 3904)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 3072, elements: !423)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !213, file: !214, line: 68, baseType: !460, size: 576, offset: 6976)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 576, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 9)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !213, file: !214, line: 69, baseType: !177, size: 64, offset: 7552)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !213, file: !214, line: 71, baseType: !16, size: 64, offset: 7616)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !213, file: !214, line: 72, baseType: !177, size: 64, offset: 7680)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !213, file: !214, line: 73, baseType: !332, size: 64, offset: 7744)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !213, file: !214, line: 74, baseType: !111, size: 64, offset: 7808)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !213, file: !214, line: 75, baseType: !115, size: 64, offset: 7872)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !213, file: !214, line: 76, baseType: !111, size: 64, offset: 7936)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !213, file: !214, line: 77, baseType: !247, size: 64, offset: 8000)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !213, file: !214, line: 78, baseType: !115, size: 64, offset: 8064)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !213, file: !214, line: 79, baseType: !111, size: 64, offset: 8128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !213, file: !214, line: 80, baseType: !152, size: 64, offset: 8192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !213, file: !214, line: 81, baseType: !247, size: 64, offset: 8256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !213, file: !214, line: 82, baseType: !476, size: 64, offset: 8320)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !42, line: 702, size: 128, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !478, file: !42, line: 706, baseType: !20, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !478, file: !42, line: 707, baseType: !20, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !42, line: 708, baseType: !126, size: 16, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !478, file: !42, line: 709, baseType: !8, size: 8, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !478, file: !42, line: 710, baseType: !8, size: 8, offset: 88)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !42, line: 711, baseType: !8, size: 8, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !213, file: !214, line: 83, baseType: !247, size: 64, offset: 8384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !213, file: !214, line: 84, baseType: !115, size: 64, offset: 8448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !213, file: !214, line: 85, baseType: !332, size: 64, offset: 8512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !213, file: !214, line: 86, baseType: !115, size: 64, offset: 8576)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !213, file: !214, line: 87, baseType: !332, size: 64, offset: 8640)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !213, file: !214, line: 88, baseType: !247, size: 64, offset: 8704)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !213, file: !214, line: 89, baseType: !247, size: 64, offset: 8768)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !213, file: !214, line: 90, baseType: !494, size: 64, offset: 8832)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !213, file: !214, line: 91, baseType: !496, size: 64, offset: 8896)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !42, line: 637, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DISubroutineType(types: !499)
!499 = !{!19, !212, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !213, file: !214, line: 92, baseType: !502, size: 64, offset: 8960)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !42, line: 641, baseType: !209)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !205, file: !117, line: 152, baseType: !115, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !191, file: !117, line: 155, baseType: !20, size: 32, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !191, file: !117, line: 156, baseType: !224, size: 16, offset: 416)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !191, file: !117, line: 157, baseType: !8, size: 8, offset: 432)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 375, baseType: !508, size: 576)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !117, line: 122, size: 576, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !508, file: !117, line: 123, baseType: !115, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !508, file: !117, line: 123, baseType: !8, size: 8, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !508, file: !117, line: 123, baseType: !8, size: 8, offset: 72)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !508, file: !117, line: 123, baseType: !126, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !117, line: 123, baseType: !8, size: 8, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !508, file: !117, line: 123, baseType: !8, size: 8, offset: 104)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !508, file: !117, line: 124, baseType: !126, size: 16, offset: 112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !508, file: !117, line: 125, baseType: !17, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !508, file: !117, line: 126, baseType: !13, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !508, file: !117, line: 127, baseType: !494, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !117, line: 128, baseType: !115, size: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !117, line: 129, baseType: !115, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !508, file: !117, line: 130, baseType: !111, size: 64, offset: 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !508, file: !117, line: 131, baseType: !8, size: 8, offset: 512)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !116, file: !117, line: 376, baseType: !525, size: 448)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !117, line: 134, size: 448, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !538}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !525, file: !117, line: 135, baseType: !115, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !525, file: !117, line: 135, baseType: !8, size: 8, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !117, line: 135, baseType: !8, size: 8, offset: 72)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !525, file: !117, line: 135, baseType: !126, size: 16, offset: 80)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !525, file: !117, line: 135, baseType: !8, size: 8, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !525, file: !117, line: 135, baseType: !8, size: 8, offset: 104)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !525, file: !117, line: 136, baseType: !111, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !525, file: !117, line: 137, baseType: !115, size: 64, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !117, line: 138, baseType: !115, size: 64, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !525, file: !117, line: 139, baseType: !537, size: 64, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !13)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !525, file: !117, line: 140, baseType: !20, size: 32, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !116, file: !117, line: 377, baseType: !540, size: 320)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !117, line: 184, size: 320, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !551}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !540, file: !117, line: 185, baseType: !115, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !540, file: !117, line: 185, baseType: !8, size: 8, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !540, file: !117, line: 185, baseType: !8, size: 8, offset: 72)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !540, file: !117, line: 185, baseType: !126, size: 16, offset: 80)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !540, file: !117, line: 185, baseType: !8, size: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !540, file: !117, line: 185, baseType: !548, size: 128, offset: 128)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 2)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !540, file: !117, line: 185, baseType: !115, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !116, file: !117, line: 378, baseType: !553, size: 384)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !117, line: 187, size: 384, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !553, file: !117, line: 188, baseType: !115, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !553, file: !117, line: 188, baseType: !8, size: 8, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !553, file: !117, line: 188, baseType: !8, size: 8, offset: 72)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !553, file: !117, line: 188, baseType: !126, size: 16, offset: 80)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !553, file: !117, line: 188, baseType: !8, size: 8, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !553, file: !117, line: 189, baseType: !548, size: 128, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !553, file: !117, line: 189, baseType: !115, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !553, file: !117, line: 189, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !42, line: 480, size: 576, elements: !565)
!565 = !{!566, !567, !568, !569, !577, !588, !589, !590, !591, !592, !593, !594}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !564, file: !42, line: 481, baseType: !111, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !564, file: !42, line: 482, baseType: !563, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !42, line: 483, baseType: !563, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !564, file: !42, line: 484, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !42, line: 497, size: 256, elements: !572)
!572 = !{!573, !574, !575, !576}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !571, file: !42, line: 498, baseType: !570, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !571, file: !42, line: 499, baseType: !570, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !571, file: !42, line: 500, baseType: !563, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !571, file: !42, line: 501, baseType: !20, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !564, file: !42, line: 485, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !42, line: 466, size: 320, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !579, file: !42, line: 467, baseType: !41, size: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !579, file: !42, line: 468, baseType: !41, size: 128, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !579, file: !42, line: 469, baseType: !126, size: 16, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !579, file: !42, line: 470, baseType: !8, size: 8, offset: 272)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !579, file: !42, line: 471, baseType: !8, size: 8, offset: 280)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !579, file: !42, line: 472, baseType: !8, size: 8, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !579, file: !42, line: 473, baseType: !8, size: 8, offset: 296)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !564, file: !42, line: 486, baseType: !104, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !564, file: !42, line: 487, baseType: !13, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !564, file: !42, line: 488, baseType: !20, size: 32, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !564, file: !42, line: 489, baseType: !126, size: 16, offset: 480)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !564, file: !42, line: 490, baseType: !126, size: 16, offset: 496)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !564, file: !42, line: 491, baseType: !8, size: 8, offset: 512)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !564, file: !42, line: 492, baseType: !8, size: 8, offset: 520)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !116, file: !117, line: 379, baseType: !596, size: 384)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !117, line: 192, size: 384, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !596, file: !117, line: 193, baseType: !115, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !596, file: !117, line: 193, baseType: !8, size: 8, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !596, file: !117, line: 193, baseType: !8, size: 8, offset: 72)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !596, file: !117, line: 193, baseType: !126, size: 16, offset: 80)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !117, line: 193, baseType: !8, size: 8, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !596, file: !117, line: 193, baseType: !548, size: 128, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !596, file: !117, line: 193, baseType: !115, size: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !596, file: !117, line: 193, baseType: !20, size: 32, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !596, file: !117, line: 194, baseType: !20, size: 32, offset: 352)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !116, file: !117, line: 380, baseType: !608, size: 384)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !117, line: 197, size: 384, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !608, file: !117, line: 198, baseType: !115, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !608, file: !117, line: 198, baseType: !8, size: 8, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !117, line: 198, baseType: !8, size: 8, offset: 72)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !608, file: !117, line: 198, baseType: !126, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !117, line: 198, baseType: !8, size: 8, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !608, file: !117, line: 200, baseType: !8, size: 8, offset: 104)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !608, file: !117, line: 201, baseType: !8, size: 8, offset: 112)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !608, file: !117, line: 202, baseType: !548, size: 128, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !608, file: !117, line: 202, baseType: !115, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !608, file: !117, line: 202, baseType: !23, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !116, file: !117, line: 381, baseType: !621, size: 320)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !117, line: 205, size: 320, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !621, file: !117, line: 206, baseType: !115, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !621, file: !117, line: 206, baseType: !8, size: 8, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !117, line: 206, baseType: !8, size: 8, offset: 72)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !621, file: !117, line: 206, baseType: !126, size: 16, offset: 80)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !621, file: !117, line: 206, baseType: !8, size: 8, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !621, file: !117, line: 206, baseType: !548, size: 128, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !621, file: !117, line: 206, baseType: !115, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !116, file: !117, line: 382, baseType: !631, size: 384)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !117, line: 233, size: 384, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !631, file: !117, line: 234, baseType: !115, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 72)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !631, file: !117, line: 234, baseType: !126, size: 16, offset: 80)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 104)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 112)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 120)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !631, file: !117, line: 234, baseType: !111, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !631, file: !117, line: 234, baseType: !20, size: 32, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !631, file: !117, line: 234, baseType: !20, size: 32, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !631, file: !117, line: 234, baseType: !20, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !631, file: !117, line: 234, baseType: !8, size: 8, offset: 296)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !631, file: !117, line: 234, baseType: !115, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !116, file: !117, line: 383, baseType: !649, size: 576)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !117, line: 237, size: 576, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !649, file: !117, line: 238, baseType: !115, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 72)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !649, file: !117, line: 238, baseType: !126, size: 16, offset: 80)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 104)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 112)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 120)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !649, file: !117, line: 238, baseType: !111, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !649, file: !117, line: 238, baseType: !20, size: 32, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !649, file: !117, line: 238, baseType: !20, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !117, line: 238, baseType: !20, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !649, file: !117, line: 238, baseType: !8, size: 8, offset: 296)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !649, file: !117, line: 238, baseType: !126, size: 16, offset: 304)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !649, file: !117, line: 239, baseType: !115, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !649, file: !117, line: 240, baseType: !16, size: 64, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !649, file: !117, line: 241, baseType: !126, size: 16, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !649, file: !117, line: 242, baseType: !16, size: 64, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !116, file: !117, line: 384, baseType: !671, size: 384)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !117, line: 262, size: 384, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !671, file: !117, line: 263, baseType: !115, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 72)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !671, file: !117, line: 263, baseType: !126, size: 16, offset: 80)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 104)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 120)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !671, file: !117, line: 263, baseType: !111, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !671, file: !117, line: 263, baseType: !20, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !671, file: !117, line: 263, baseType: !20, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !671, file: !117, line: 263, baseType: !20, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 296)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !671, file: !117, line: 263, baseType: !8, size: 8, offset: 304)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !671, file: !117, line: 264, baseType: !115, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !116, file: !117, line: 385, baseType: !690, size: 448)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !117, line: 245, size: 448, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !690, file: !117, line: 246, baseType: !115, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 72)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !690, file: !117, line: 246, baseType: !126, size: 16, offset: 80)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 104)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 112)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !690, file: !117, line: 246, baseType: !111, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !690, file: !117, line: 246, baseType: !20, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !690, file: !117, line: 246, baseType: !20, size: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !690, file: !117, line: 246, baseType: !20, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !690, file: !117, line: 246, baseType: !8, size: 8, offset: 296)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !690, file: !117, line: 246, baseType: !115, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !690, file: !117, line: 247, baseType: !115, size: 64, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !116, file: !117, line: 386, baseType: !709, size: 448)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !117, line: 250, size: 448, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !709, file: !117, line: 251, baseType: !115, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 72)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !709, file: !117, line: 251, baseType: !126, size: 16, offset: 80)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 104)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 120)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !709, file: !117, line: 251, baseType: !111, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !709, file: !117, line: 251, baseType: !20, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !709, file: !117, line: 251, baseType: !20, size: 32, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !709, file: !117, line: 251, baseType: !20, size: 32, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !709, file: !117, line: 251, baseType: !8, size: 8, offset: 296)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !709, file: !117, line: 256, baseType: !115, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !709, file: !117, line: 257, baseType: !115, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !116, file: !117, line: 387, baseType: !728, size: 512)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !117, line: 273, size: 512, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !728, file: !117, line: 274, baseType: !115, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !728, file: !117, line: 274, baseType: !8, size: 8, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !728, file: !117, line: 274, baseType: !8, size: 8, offset: 72)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !728, file: !117, line: 274, baseType: !126, size: 16, offset: 80)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !728, file: !117, line: 274, baseType: !8, size: 8, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !728, file: !117, line: 274, baseType: !111, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !728, file: !117, line: 275, baseType: !20, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !728, file: !117, line: 276, baseType: !441, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !728, file: !117, line: 277, baseType: !17, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !728, file: !117, line: 278, baseType: !548, size: 128, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !116, file: !117, line: 388, baseType: !741, size: 512)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !117, line: 281, size: 512, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !755, !756, !757, !763, !764}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !741, file: !117, line: 282, baseType: !115, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !741, file: !117, line: 282, baseType: !8, size: 8, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !117, line: 282, baseType: !8, size: 8, offset: 72)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !741, file: !117, line: 282, baseType: !126, size: 16, offset: 80)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !741, file: !117, line: 282, baseType: !8, size: 8, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !741, file: !117, line: 282, baseType: !8, size: 8, offset: 104)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !741, file: !117, line: 283, baseType: !8, size: 8, offset: 112)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !741, file: !117, line: 284, baseType: !751, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !7, line: 1084, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!19, !20, !537, !20, !39, !17, !17}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !741, file: !117, line: 285, baseType: !111, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !741, file: !117, line: 286, baseType: !17, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !741, file: !117, line: 287, baseType: !758, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !7, line: 1102, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!19, !445, !20, !17, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !741, file: !117, line: 288, baseType: !115, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !117, line: 289, baseType: !115, size: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !116, file: !117, line: 389, baseType: !766, size: 512)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !117, line: 307, size: 512, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !766, file: !117, line: 308, baseType: !115, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !766, file: !117, line: 308, baseType: !8, size: 8, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !766, file: !117, line: 308, baseType: !8, size: 8, offset: 72)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !766, file: !117, line: 308, baseType: !126, size: 16, offset: 80)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !766, file: !117, line: 308, baseType: !8, size: 8, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !766, file: !117, line: 308, baseType: !8, size: 8, offset: 104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !766, file: !117, line: 309, baseType: !8, size: 8, offset: 112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !766, file: !117, line: 310, baseType: !8, size: 8, offset: 120)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !766, file: !117, line: 311, baseType: !17, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !766, file: !117, line: 312, baseType: !111, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !766, file: !117, line: 313, baseType: !177, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !766, file: !117, line: 314, baseType: !16, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !766, file: !117, line: 315, baseType: !16, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !766, file: !117, line: 316, baseType: !20, size: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !116, file: !117, line: 390, baseType: !783, size: 448)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !117, line: 340, size: 448, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !783, file: !117, line: 341, baseType: !115, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !783, file: !117, line: 341, baseType: !8, size: 8, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !117, line: 341, baseType: !8, size: 8, offset: 72)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !783, file: !117, line: 341, baseType: !126, size: 16, offset: 80)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !117, line: 341, baseType: !8, size: 8, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !783, file: !117, line: 341, baseType: !111, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !783, file: !117, line: 342, baseType: !111, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !783, file: !117, line: 343, baseType: !17, size: 64, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !783, file: !117, line: 344, baseType: !16, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !783, file: !117, line: 345, baseType: !20, size: 32, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !117, line: 391, baseType: !796, size: 256)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !117, line: 350, size: 256, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !808}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !796, file: !117, line: 351, baseType: !115, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !796, file: !117, line: 351, baseType: !8, size: 8, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !796, file: !117, line: 351, baseType: !8, size: 8, offset: 72)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !796, file: !117, line: 351, baseType: !126, size: 16, offset: 80)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !117, line: 351, baseType: !8, size: 8, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !796, file: !117, line: 351, baseType: !804, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !7, line: 1055, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !445, !17}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !796, file: !117, line: 352, baseType: !17, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !116, file: !117, line: 392, baseType: !810, size: 192)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !117, line: 357, size: 192, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !810, file: !117, line: 358, baseType: !115, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !810, file: !117, line: 358, baseType: !8, size: 8, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !810, file: !117, line: 358, baseType: !8, size: 8, offset: 72)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !810, file: !117, line: 358, baseType: !126, size: 16, offset: 80)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !810, file: !117, line: 358, baseType: !8, size: 8, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !117, line: 358, baseType: !115, size: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !116, file: !117, line: 399, baseType: !112, size: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !112, file: !42, line: 135, baseType: !8, size: 8, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !42, line: 136, baseType: !8, size: 8, offset: 72)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !42, line: 137, baseType: !126, size: 16, offset: 80)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !42, line: 138, baseType: !823, size: 32, offset: 96)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !824, line: 327, size: 32, elements: !825)
!824 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !823, file: !824, line: 328, baseType: !20, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !823, file: !824, line: 329, baseType: !306, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !112, file: !42, line: 139, baseType: !111, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !112, file: !42, line: 140, baseType: !111, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !112, file: !42, line: 141, baseType: !111, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !112, file: !42, line: 142, baseType: !224, size: 16, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !108, file: !42, line: 440, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !42, line: 419, size: 256, elements: !835)
!835 = !{!836, !841, !842, !843, !844}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !834, file: !42, line: 420, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !7, line: 1049, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!20, !445, !20, !17}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !834, file: !42, line: 421, baseType: !17, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !834, file: !42, line: 422, baseType: !111, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !834, file: !42, line: 423, baseType: !8, size: 8, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !834, file: !42, line: 424, baseType: !8, size: 8, offset: 200)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !108, file: !42, line: 441, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !42, line: 429, size: 128, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !847, file: !42, line: 430, baseType: !111, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !847, file: !42, line: 431, baseType: !846, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !105, file: !42, line: 450, baseType: !578, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !42, line: 451, baseType: !8, size: 8, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !105, file: !42, line: 452, baseType: !8, size: 8, offset: 136)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !105, file: !42, line: 453, baseType: !8, size: 8, offset: 144)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !105, file: !42, line: 454, baseType: !8, size: 8, offset: 152)
!856 = !DILocalVariable(name: "gpe_event_info", arg: 1, scope: !101, file: !3, line: 110, type: !104)
!857 = !DILocation(line: 110, column: 62, scope: !101)
