; ModuleID = '../bcout/drivers/acpi/acpica/hwxface.llvm.bc'
source_filename = "drivers/acpi/acpica/hwxface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_fadt = type <{ %struct.acpi_table_header, i32, i32, i8, i8, i16, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i8, i8, i8, i16, i8, i32, %struct.acpi_generic_address, i8, i16, i8, i64, i64, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, i64 }>
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>
%struct.raw_spinlock = type { %struct.arch_spinlock_t }
%struct.arch_spinlock_t = type {}
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/hwxface.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !20, !24, !21, !28, !29, !30, !32}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !15, line: 805, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !23)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !27)
!27 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !25)
!29 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !31, line: 148, baseType: !7)
!31 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !{!0}
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !37)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !{!38}
!38 = !DISubrange(count: 8)
!39 = !{!"rsp"}
!40 = !{i32 7, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 2}
!43 = !{i32 1, !"Code Model", i32 2}
!44 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!45 = distinct !DISubprogram(name: "acpi_reset", scope: !3, file: !3, line: 32, type: !46, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{!14}
!48 = !{}
!49 = !DILocalVariable(name: "reset_reg", scope: !45, file: !3, line: 34, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_generic_address", file: !52, line: 90, size: 96, elements: !53)
!52 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!53 = !{!54, !55, !56, !57, !58}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !51, file: !52, line: 91, baseType: !21, size: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !51, file: !52, line: 92, baseType: !21, size: 8, offset: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !51, file: !52, line: 93, baseType: !21, size: 8, offset: 16)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "access_width", scope: !51, file: !52, line: 94, baseType: !21, size: 8, offset: 24)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !51, file: !52, line: 95, baseType: !25, size: 64, offset: 32)
!59 = !DILocation(line: 34, column: 31, scope: !45)
!60 = !DILocalVariable(name: "status", scope: !45, file: !3, line: 35, type: !14)
!61 = !DILocation(line: 35, column: 14, scope: !45)
!62 = !DILocation(line: 39, column: 12, scope: !45)
!63 = !DILocation(line: 43, column: 22, scope: !64)
!64 = distinct !DILexicalBlock(scope: !45, file: !3, line: 43, column: 6)
!65 = !DILocation(line: 43, column: 28, scope: !64)
!66 = !DILocation(line: 43, column: 56, scope: !64)
!67 = !DILocation(line: 44, column: 7, scope: !64)
!68 = !DILocation(line: 44, column: 18, scope: !64)
!69 = !DILocation(line: 43, column: 6, scope: !45)
!70 = !DILocation(line: 45, column: 3, scope: !71)
!71 = distinct !DILexicalBlock(scope: !64, file: !3, line: 44, column: 27)
!72 = !DILocation(line: 48, column: 6, scope: !73)
!73 = distinct !DILexicalBlock(scope: !45, file: !3, line: 48, column: 6)
!74 = !DILocation(line: 48, column: 17, scope: !73)
!75 = !DILocation(line: 48, column: 26, scope: !73)
!76 = !DILocation(line: 48, column: 6, scope: !45)
!77 = !DILocation(line: 60, column: 48, scope: !78)
!78 = distinct !DILexicalBlock(scope: !73, file: !3, line: 48, column: 55)
!79 = !DILocation(line: 60, column: 59, scope: !78)
!80 = !DILocation(line: 61, column: 24, scope: !78)
!81 = !DILocation(line: 61, column: 10, scope: !78)
!82 = !DILocation(line: 60, column: 12, scope: !78)
!83 = !DILocation(line: 60, column: 10, scope: !78)
!84 = !DILocation(line: 63, column: 2, scope: !78)
!85 = !DILocation(line: 66, column: 40, scope: !86)
!86 = distinct !DILexicalBlock(scope: !73, file: !3, line: 63, column: 9)
!87 = !DILocation(line: 66, column: 26, scope: !86)
!88 = !DILocation(line: 66, column: 53, scope: !86)
!89 = !DILocation(line: 66, column: 12, scope: !86)
!90 = !DILocation(line: 66, column: 10, scope: !86)
!91 = !DILocation(line: 69, column: 2, scope: !45)
!92 = !DILocation(line: 70, column: 1, scope: !45)
!93 = distinct !DISubprogram(name: "acpi_read", scope: !3, file: !3, line: 92, type: !94, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !48)
!94 = !DISubroutineType(types: !95)
!95 = !{!14, !96, !50}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!97 = !DILocalVariable(name: "return_value", arg: 1, scope: !93, file: !3, line: 92, type: !96)
!98 = !DILocation(line: 92, column: 28, scope: !93)
!99 = !DILocalVariable(name: "reg", arg: 2, scope: !93, file: !3, line: 92, type: !50)
!100 = !DILocation(line: 92, column: 71, scope: !93)
!101 = !DILocalVariable(name: "status", scope: !93, file: !3, line: 94, type: !14)
!102 = !DILocation(line: 94, column: 14, scope: !93)
!103 = !DILocation(line: 98, column: 24, scope: !93)
!104 = !DILocation(line: 98, column: 38, scope: !93)
!105 = !DILocation(line: 98, column: 11, scope: !93)
!106 = !DILocation(line: 98, column: 9, scope: !93)
!107 = !DILocation(line: 99, column: 10, scope: !93)
!108 = !DILocation(line: 99, column: 2, scope: !93)
!109 = distinct !DISubprogram(name: "acpi_write", scope: !3, file: !3, line: 116, type: !110, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !48)
!110 = !DISubroutineType(types: !111)
!111 = !{!14, !25, !50}
!112 = !DILocalVariable(name: "value", arg: 1, scope: !109, file: !3, line: 116, type: !25)
!113 = !DILocation(line: 116, column: 28, scope: !109)
!114 = !DILocalVariable(name: "reg", arg: 2, scope: !109, file: !3, line: 116, type: !50)
!115 = !DILocation(line: 116, column: 64, scope: !109)
!116 = !DILocalVariable(name: "status", scope: !109, file: !3, line: 118, type: !14)
!117 = !DILocation(line: 118, column: 14, scope: !109)
!118 = !DILocation(line: 122, column: 25, scope: !109)
!119 = !DILocation(line: 122, column: 32, scope: !109)
!120 = !DILocation(line: 122, column: 11, scope: !109)
!121 = !DILocation(line: 122, column: 9, scope: !109)
!122 = !DILocation(line: 123, column: 10, scope: !109)
!123 = !DILocation(line: 123, column: 2, scope: !109)
!124 = distinct !DISubprogram(name: "acpi_read_bit_register", scope: !3, file: !3, line: 153, type: !125, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !48)
!125 = !DISubroutineType(types: !126)
!126 = !{!14, !16, !127}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!128 = !DILocalVariable(name: "register_id", arg: 1, scope: !124, file: !3, line: 153, type: !16)
!129 = !DILocation(line: 153, column: 40, scope: !124)
!130 = !DILocalVariable(name: "return_value", arg: 2, scope: !124, file: !3, line: 153, type: !127)
!131 = !DILocation(line: 153, column: 58, scope: !124)
!132 = !DILocalVariable(name: "bit_reg_info", scope: !124, file: !3, line: 155, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_bit_register_info", file: !135, line: 934, size: 32, elements: !136)
!135 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "parent_register", scope: !134, file: !135, line: 935, baseType: !21, size: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "bit_position", scope: !134, file: !135, line: 936, baseType: !21, size: 8, offset: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "access_bit_mask", scope: !134, file: !135, line: 937, baseType: !140, size: 16, offset: 16)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !142)
!142 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!143 = !DILocation(line: 155, column: 33, scope: !124)
!144 = !DILocalVariable(name: "register_value", scope: !124, file: !3, line: 156, type: !16)
!145 = !DILocation(line: 156, column: 6, scope: !124)
!146 = !DILocalVariable(name: "value", scope: !124, file: !3, line: 157, type: !16)
!147 = !DILocation(line: 157, column: 6, scope: !124)
!148 = !DILocalVariable(name: "status", scope: !124, file: !3, line: 158, type: !14)
!149 = !DILocation(line: 158, column: 14, scope: !124)
!150 = !DILocation(line: 164, column: 47, scope: !124)
!151 = !DILocation(line: 164, column: 17, scope: !124)
!152 = !DILocation(line: 164, column: 15, scope: !124)
!153 = !DILocation(line: 165, column: 7, scope: !154)
!154 = distinct !DILexicalBlock(scope: !124, file: !3, line: 165, column: 6)
!155 = !DILocation(line: 165, column: 6, scope: !124)
!156 = !DILocation(line: 166, column: 3, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !3, line: 165, column: 21)
!158 = !DILocation(line: 171, column: 33, scope: !124)
!159 = !DILocation(line: 171, column: 47, scope: !124)
!160 = !DILocation(line: 171, column: 11, scope: !124)
!161 = !DILocation(line: 171, column: 9, scope: !124)
!162 = !DILocation(line: 173, column: 6, scope: !163)
!163 = distinct !DILexicalBlock(scope: !124, file: !3, line: 173, column: 6)
!164 = !DILocation(line: 173, column: 6, scope: !124)
!165 = !DILocation(line: 174, column: 3, scope: !166)
!166 = distinct !DILexicalBlock(scope: !163, file: !3, line: 173, column: 28)
!167 = !DILocation(line: 179, column: 12, scope: !124)
!168 = !DILocation(line: 179, column: 29, scope: !124)
!169 = !DILocation(line: 179, column: 43, scope: !124)
!170 = !DILocation(line: 179, column: 27, scope: !124)
!171 = !DILocation(line: 180, column: 7, scope: !124)
!172 = !DILocation(line: 180, column: 21, scope: !124)
!173 = !DILocation(line: 180, column: 4, scope: !124)
!174 = !DILocation(line: 179, column: 8, scope: !124)
!175 = !DILocation(line: 187, column: 18, scope: !124)
!176 = !DILocation(line: 187, column: 3, scope: !124)
!177 = !DILocation(line: 187, column: 16, scope: !124)
!178 = !DILocation(line: 188, column: 2, scope: !124)
!179 = !DILocation(line: 189, column: 1, scope: !124)
!180 = distinct !DISubprogram(name: "acpi_write_bit_register", scope: !3, file: !3, line: 214, type: !181, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !48)
!181 = !DISubroutineType(types: !182)
!182 = !{!14, !16, !16}
!183 = !DILocalVariable(name: "register_id", arg: 1, scope: !180, file: !3, line: 214, type: !16)
!184 = !DILocation(line: 214, column: 41, scope: !180)
!185 = !DILocalVariable(name: "value", arg: 2, scope: !180, file: !3, line: 214, type: !16)
!186 = !DILocation(line: 214, column: 58, scope: !180)
!187 = !DILocalVariable(name: "bit_reg_info", scope: !180, file: !3, line: 216, type: !133)
!188 = !DILocation(line: 216, column: 33, scope: !180)
!189 = !DILocalVariable(name: "lock_flags", scope: !180, file: !3, line: 217, type: !29)
!190 = !DILocation(line: 217, column: 17, scope: !180)
!191 = !DILocalVariable(name: "register_value", scope: !180, file: !3, line: 218, type: !16)
!192 = !DILocation(line: 218, column: 6, scope: !180)
!193 = !DILocalVariable(name: "status", scope: !180, file: !3, line: 219, type: !14)
!194 = !DILocation(line: 219, column: 14, scope: !180)
!195 = !DILocation(line: 225, column: 47, scope: !180)
!196 = !DILocation(line: 225, column: 17, scope: !180)
!197 = !DILocation(line: 225, column: 15, scope: !180)
!198 = !DILocation(line: 226, column: 7, scope: !199)
!199 = distinct !DILexicalBlock(scope: !180, file: !3, line: 226, column: 6)
!200 = !DILocation(line: 226, column: 6, scope: !180)
!201 = !DILocation(line: 227, column: 3, scope: !202)
!202 = distinct !DILexicalBlock(scope: !199, file: !3, line: 226, column: 21)
!203 = !DILocation(line: 230, column: 40, scope: !180)
!204 = !DILocation(line: 230, column: 15, scope: !180)
!205 = !DILocation(line: 230, column: 13, scope: !180)
!206 = !DILocation(line: 236, column: 6, scope: !207)
!207 = distinct !DILexicalBlock(scope: !180, file: !3, line: 236, column: 6)
!208 = !DILocation(line: 236, column: 20, scope: !207)
!209 = !DILocation(line: 236, column: 36, scope: !207)
!210 = !DILocation(line: 236, column: 6, scope: !180)
!211 = !DILocation(line: 243, column: 34, scope: !212)
!212 = distinct !DILexicalBlock(scope: !207, file: !3, line: 236, column: 65)
!213 = !DILocation(line: 243, column: 48, scope: !212)
!214 = !DILocation(line: 243, column: 12, scope: !212)
!215 = !DILocation(line: 243, column: 10, scope: !212)
!216 = !DILocation(line: 245, column: 7, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !3, line: 245, column: 7)
!218 = !DILocation(line: 245, column: 7, scope: !212)
!219 = !DILocation(line: 246, column: 4, scope: !220)
!220 = distinct !DILexicalBlock(scope: !217, file: !3, line: 245, column: 29)
!221 = !DILocation(line: 253, column: 3, scope: !212)
!222 = !DILocation(line: 258, column: 35, scope: !212)
!223 = !DILocation(line: 258, column: 49, scope: !212)
!224 = !DILocation(line: 259, column: 7, scope: !212)
!225 = !DILocation(line: 258, column: 12, scope: !212)
!226 = !DILocation(line: 258, column: 10, scope: !212)
!227 = !DILocation(line: 260, column: 2, scope: !212)
!228 = !DILocation(line: 269, column: 20, scope: !229)
!229 = distinct !DILexicalBlock(scope: !207, file: !3, line: 260, column: 9)
!230 = !DILocation(line: 269, column: 18, scope: !229)
!231 = !DILocation(line: 277, column: 7, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !3, line: 277, column: 7)
!233 = !DILocation(line: 277, column: 7, scope: !229)
!234 = !DILocation(line: 280, column: 10, scope: !235)
!235 = distinct !DILexicalBlock(scope: !232, file: !3, line: 277, column: 23)
!236 = !DILocation(line: 279, column: 8, scope: !235)
!237 = !DILocation(line: 278, column: 11, scope: !235)
!238 = !DILocation(line: 281, column: 3, scope: !235)
!239 = !DILocation(line: 236, column: 39, scope: !207)
!240 = !DILabel(scope: !180, name: "unlock_and_exit", file: !3, line: 289)
!241 = !DILocation(line: 289, column: 1, scope: !180)
!242 = !DILocation(line: 291, column: 27, scope: !180)
!243 = !DILocation(line: 291, column: 51, scope: !180)
!244 = !DILocation(line: 291, column: 2, scope: !180)
!245 = !DILocation(line: 292, column: 2, scope: !180)
!246 = !DILocation(line: 293, column: 1, scope: !180)
!247 = distinct !DISubprogram(name: "acpi_os_acquire_raw_lock", scope: !248, file: !248, line: 104, type: !249, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !48)
!248 = !DIFile(filename: "./include/acpi/platform/aclinuxex.h", directory: "/home/lizy2001/genbc/linux")
!249 = !DISubroutineType(types: !250)
!250 = !{!29, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !253, line: 29, baseType: !254)
!253 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !253, line: 20, elements: !255)
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !254, file: !253, line: 21, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !258, line: 25, baseType: !259)
!258 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !258, line: 25, elements: !48)
!260 = !DILocalVariable(name: "lockp", arg: 1, scope: !247, file: !248, line: 104, type: !251)
!261 = !DILocation(line: 104, column: 73, scope: !247)
!262 = !DILocalVariable(name: "flags", scope: !247, file: !248, line: 106, type: !29)
!263 = !DILocation(line: 106, column: 17, scope: !247)
!264 = !DILocation(line: 108, column: 2, scope: !247)
!265 = !DILocalVariable(name: "__dummy", scope: !266, file: !248, line: 108, type: !29)
!266 = distinct !DILexicalBlock(scope: !267, file: !248, line: 108, column: 2)
!267 = distinct !DILexicalBlock(scope: !247, file: !248, line: 108, column: 2)
!268 = !DILocation(line: 108, column: 2, scope: !266)
!269 = !DILocalVariable(name: "__dummy2", scope: !266, file: !248, line: 108, type: !29)
!270 = !DILocation(line: 108, column: 2, scope: !267)
!271 = !DILocation(line: 108, column: 2, scope: !272)
!272 = distinct !DILexicalBlock(scope: !267, file: !248, line: 108, column: 2)
!273 = !DILocation(line: 108, column: 2, scope: !274)
!274 = distinct !DILexicalBlock(scope: !272, file: !248, line: 108, column: 2)
!275 = !DILocalVariable(name: "__dummy", scope: !276, file: !248, line: 108, type: !29)
!276 = distinct !DILexicalBlock(scope: !277, file: !248, line: 108, column: 2)
!277 = distinct !DILexicalBlock(scope: !274, file: !248, line: 108, column: 2)
!278 = !DILocation(line: 108, column: 2, scope: !276)
!279 = !DILocalVariable(name: "__dummy2", scope: !276, file: !248, line: 108, type: !29)
!280 = !DILocation(line: 108, column: 2, scope: !277)
!281 = !DILocation(line: 108, column: 2, scope: !282)
!282 = distinct !DILexicalBlock(scope: !272, file: !248, line: 108, column: 2)
!283 = !{i32 -2143875997}
!284 = !DILocation(line: 108, column: 2, scope: !285)
!285 = distinct !DILexicalBlock(scope: !282, file: !248, line: 108, column: 2)
!286 = !DILocation(line: 109, column: 9, scope: !247)
!287 = !DILocation(line: 109, column: 2, scope: !247)
!288 = distinct !DISubprogram(name: "acpi_os_release_raw_lock", scope: !248, file: !248, line: 112, type: !289, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !48)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !251, !29}
!291 = !DILocalVariable(name: "lockp", arg: 1, scope: !288, file: !248, line: 112, type: !251)
!292 = !DILocation(line: 112, column: 63, scope: !288)
!293 = !DILocalVariable(name: "flags", arg: 2, scope: !288, file: !248, line: 113, type: !29)
!294 = !DILocation(line: 113, column: 25, scope: !288)
!295 = !DILocation(line: 115, column: 2, scope: !288)
!296 = !DILocalVariable(name: "__dummy", scope: !297, file: !248, line: 115, type: !29)
!297 = distinct !DILexicalBlock(scope: !298, file: !248, line: 115, column: 2)
!298 = distinct !DILexicalBlock(scope: !288, file: !248, line: 115, column: 2)
!299 = !DILocation(line: 115, column: 2, scope: !297)
!300 = !DILocalVariable(name: "__dummy2", scope: !297, file: !248, line: 115, type: !29)
!301 = !DILocation(line: 115, column: 2, scope: !298)
!302 = !DILocation(line: 115, column: 2, scope: !303)
!303 = distinct !DILexicalBlock(scope: !298, file: !248, line: 115, column: 2)
!304 = !DILocation(line: 115, column: 2, scope: !305)
!305 = distinct !DILexicalBlock(scope: !303, file: !248, line: 115, column: 2)
!306 = !DILocalVariable(name: "__dummy", scope: !307, file: !248, line: 115, type: !29)
!307 = distinct !DILexicalBlock(scope: !308, file: !248, line: 115, column: 2)
!308 = distinct !DILexicalBlock(scope: !305, file: !248, line: 115, column: 2)
!309 = !DILocation(line: 115, column: 2, scope: !307)
!310 = !DILocalVariable(name: "__dummy2", scope: !307, file: !248, line: 115, type: !29)
!311 = !DILocation(line: 115, column: 2, scope: !308)
!312 = !DILocation(line: 115, column: 2, scope: !313)
!313 = distinct !DILexicalBlock(scope: !303, file: !248, line: 115, column: 2)
!314 = !{i32 -2143875006}
!315 = !DILocation(line: 115, column: 2, scope: !316)
!316 = distinct !DILexicalBlock(scope: !313, file: !248, line: 115, column: 2)
!317 = !DILocation(line: 116, column: 1, scope: !288)
!318 = distinct !DISubprogram(name: "acpi_get_sleep_type_data", scope: !3, file: !3, line: 335, type: !319, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !48)
!319 = !DISubroutineType(types: !320)
!320 = !{!14, !21, !321, !321}
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!322 = !DILocalVariable(name: "sleep_state", arg: 1, scope: !318, file: !3, line: 335, type: !21)
!323 = !DILocation(line: 335, column: 29, scope: !318)
!324 = !DILocalVariable(name: "sleep_type_a", arg: 2, scope: !318, file: !3, line: 335, type: !321)
!325 = !DILocation(line: 335, column: 46, scope: !318)
!326 = !DILocalVariable(name: "sleep_type_b", arg: 3, scope: !318, file: !3, line: 335, type: !321)
!327 = !DILocation(line: 335, column: 64, scope: !318)
!328 = !DILocalVariable(name: "status", scope: !318, file: !3, line: 337, type: !14)
!329 = !DILocation(line: 337, column: 14, scope: !318)
!330 = !DILocalVariable(name: "info", scope: !318, file: !3, line: 338, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_evaluate_info", file: !333, line: 152, size: 704, elements: !334)
!333 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!334 = !{!335, !1085, !1087, !1088, !1089, !1090, !1091, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_node", scope: !332, file: !333, line: 155, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !135, line: 133, size: 384, elements: !338)
!338 = !{!339, !1073, !1074, !1075, !1076, !1081, !1082, !1083, !1084}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !337, file: !135, line: 134, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !342, line: 367, size: 576, elements: !343)
!342 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!343 = !{!344, !352, !365, !376, !389, !403, !412, !726, !743, !758, !771, !849, !861, !874, !884, !902, !924, !943, !962, !981, !994, !1019, !1036, !1049, !1063, !1072}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !341, file: !342, line: 368, baseType: !345, size: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !342, line: 73, size: 128, elements: !346)
!346 = !{!347, !348, !349, !350, !351}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !345, file: !342, line: 74, baseType: !340, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !345, file: !342, line: 74, baseType: !21, size: 8, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !342, line: 74, baseType: !21, size: 8, offset: 72)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !345, file: !342, line: 74, baseType: !140, size: 16, offset: 80)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !345, file: !342, line: 74, baseType: !21, size: 8, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !341, file: !342, line: 369, baseType: !353, size: 192)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !342, line: 76, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !364}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !353, file: !342, line: 77, baseType: !340, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !353, file: !342, line: 77, baseType: !21, size: 8, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !342, line: 77, baseType: !21, size: 8, offset: 72)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !353, file: !342, line: 77, baseType: !140, size: 16, offset: 80)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !353, file: !342, line: 77, baseType: !21, size: 8, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !353, file: !342, line: 77, baseType: !361, size: 24, offset: 104)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 24, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 3)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !353, file: !342, line: 78, baseType: !25, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !341, file: !342, line: 370, baseType: !366, size: 256)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !342, line: 93, size: 256, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !366, file: !342, line: 94, baseType: !340, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !366, file: !342, line: 94, baseType: !21, size: 8, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !342, line: 94, baseType: !21, size: 8, offset: 72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !366, file: !342, line: 94, baseType: !140, size: 16, offset: 80)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !342, line: 94, baseType: !21, size: 8, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !366, file: !342, line: 94, baseType: !374, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !366, file: !342, line: 94, baseType: !16, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !341, file: !342, line: 371, baseType: !377, size: 384)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !342, line: 97, size: 384, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !377, file: !342, line: 98, baseType: !340, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !377, file: !342, line: 98, baseType: !21, size: 8, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !377, file: !342, line: 98, baseType: !21, size: 8, offset: 72)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !377, file: !342, line: 98, baseType: !140, size: 16, offset: 80)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !342, line: 98, baseType: !21, size: 8, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !377, file: !342, line: 98, baseType: !321, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !377, file: !342, line: 98, baseType: !16, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !377, file: !342, line: 99, baseType: !16, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !377, file: !342, line: 100, baseType: !321, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !377, file: !342, line: 101, baseType: !336, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !341, file: !342, line: 372, baseType: !390, size: 384)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !342, line: 104, size: 384, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !400, !401, !402}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !390, file: !342, line: 105, baseType: !340, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !390, file: !342, line: 105, baseType: !21, size: 8, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !342, line: 105, baseType: !21, size: 8, offset: 72)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !390, file: !342, line: 105, baseType: !140, size: 16, offset: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !342, line: 105, baseType: !21, size: 8, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !390, file: !342, line: 105, baseType: !336, size: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !390, file: !342, line: 106, baseType: !399, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !390, file: !342, line: 107, baseType: !321, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !390, file: !342, line: 108, baseType: !16, size: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !390, file: !342, line: 109, baseType: !16, size: 32, offset: 352)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !341, file: !342, line: 373, baseType: !404, size: 192)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !342, line: 118, size: 192, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !404, file: !342, line: 119, baseType: !340, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !404, file: !342, line: 119, baseType: !21, size: 8, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !342, line: 119, baseType: !21, size: 8, offset: 72)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !404, file: !342, line: 119, baseType: !140, size: 16, offset: 80)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !404, file: !342, line: 119, baseType: !21, size: 8, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !404, file: !342, line: 119, baseType: !32, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !341, file: !342, line: 374, baseType: !413, size: 448)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !342, line: 143, size: 448, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !723, !724, !725}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !413, file: !342, line: 144, baseType: !340, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !413, file: !342, line: 144, baseType: !21, size: 8, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !342, line: 144, baseType: !21, size: 8, offset: 72)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !413, file: !342, line: 144, baseType: !140, size: 16, offset: 80)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !413, file: !342, line: 144, baseType: !21, size: 8, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !413, file: !342, line: 144, baseType: !21, size: 8, offset: 104)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !413, file: !342, line: 145, baseType: !21, size: 8, offset: 112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !413, file: !342, line: 146, baseType: !21, size: 8, offset: 120)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !413, file: !342, line: 147, baseType: !340, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !413, file: !342, line: 148, baseType: !340, size: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !413, file: !342, line: 149, baseType: !321, size: 64, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !413, file: !342, line: 153, baseType: !427, size: 64, offset: 320)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !413, file: !342, line: 150, size: 64, elements: !428)
!428 = !{!429, !722}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !427, file: !342, line: 151, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !135, line: 248, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DISubroutineType(types: !433)
!433 = !{!14, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !333, line: 37, size: 9024, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !668, !669, !670, !671, !672, !676, !678, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !705, !706, !707, !708, !709, !710, !711, !712, !714, !720}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !333, line: 38, baseType: !434, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !435, file: !333, line: 39, baseType: !21, size: 8, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !435, file: !333, line: 40, baseType: !21, size: 8, offset: 72)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !435, file: !333, line: 41, baseType: !140, size: 16, offset: 80)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !435, file: !333, line: 42, baseType: !21, size: 8, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !435, file: !333, line: 43, baseType: !21, size: 8, offset: 104)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !435, file: !333, line: 44, baseType: !21, size: 8, offset: 112)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !435, file: !333, line: 45, baseType: !445, size: 16, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !140)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !435, file: !333, line: 46, baseType: !21, size: 8, offset: 144)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !435, file: !333, line: 47, baseType: !21, size: 8, offset: 152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !435, file: !333, line: 48, baseType: !21, size: 8, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !435, file: !333, line: 49, baseType: !21, size: 8, offset: 168)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !435, file: !333, line: 50, baseType: !21, size: 8, offset: 176)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !435, file: !333, line: 51, baseType: !21, size: 8, offset: 184)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !435, file: !333, line: 52, baseType: !21, size: 8, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !435, file: !333, line: 53, baseType: !21, size: 8, offset: 200)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !435, file: !333, line: 54, baseType: !321, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !435, file: !333, line: 55, baseType: !16, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !435, file: !333, line: 56, baseType: !16, size: 32, offset: 352)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !435, file: !333, line: 57, baseType: !16, size: 32, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !435, file: !333, line: 58, baseType: !16, size: 32, offset: 416)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !435, file: !333, line: 60, baseType: !460, size: 640, offset: 448)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !135, line: 893, size: 640, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !551, !552, !666, !667}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !460, file: !135, line: 894, baseType: !321, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !460, file: !135, line: 895, baseType: !321, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !460, file: !135, line: 896, baseType: !321, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !460, file: !135, line: 897, baseType: !321, size: 64, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !460, file: !135, line: 898, baseType: !321, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !460, file: !135, line: 899, baseType: !468, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !135, line: 875, size: 1600, elements: !470)
!470 = !{!471, !491, !507}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !469, file: !135, line: 876, baseType: !472, size: 448)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !135, line: 828, size: 448, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !490}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !472, file: !135, line: 829, baseType: !468, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !472, file: !135, line: 829, baseType: !21, size: 8, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !135, line: 829, baseType: !21, size: 8, offset: 72)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !472, file: !135, line: 829, baseType: !140, size: 16, offset: 80)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !472, file: !135, line: 829, baseType: !321, size: 64, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !472, file: !135, line: 829, baseType: !468, size: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !472, file: !135, line: 829, baseType: !336, size: 64, offset: 256)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !472, file: !135, line: 829, baseType: !482, size: 64, offset: 320)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !135, line: 716, size: 64, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !482, file: !135, line: 717, baseType: !25, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !482, file: !135, line: 718, baseType: !16, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !482, file: !135, line: 719, baseType: !374, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !482, file: !135, line: 720, baseType: !321, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !482, file: !135, line: 721, baseType: !374, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !482, file: !135, line: 722, baseType: !468, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !472, file: !135, line: 829, baseType: !21, size: 8, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !469, file: !135, line: 877, baseType: !492, size: 640)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !135, line: 835, size: 640, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !492, file: !135, line: 836, baseType: !468, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !492, file: !135, line: 836, baseType: !21, size: 8, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !135, line: 836, baseType: !21, size: 8, offset: 72)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !492, file: !135, line: 836, baseType: !140, size: 16, offset: 80)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !492, file: !135, line: 836, baseType: !321, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !135, line: 836, baseType: !468, size: 64, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !492, file: !135, line: 836, baseType: !336, size: 64, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !492, file: !135, line: 836, baseType: !482, size: 64, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !492, file: !135, line: 836, baseType: !21, size: 8, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !492, file: !135, line: 836, baseType: !374, size: 64, offset: 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !492, file: !135, line: 837, baseType: !321, size: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !492, file: !135, line: 838, baseType: !16, size: 32, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !135, line: 839, baseType: !16, size: 32, offset: 608)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !469, file: !135, line: 878, baseType: !508, size: 1600)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !135, line: 846, size: 1600, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !508, file: !135, line: 847, baseType: !468, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !508, file: !135, line: 847, baseType: !21, size: 8, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !135, line: 847, baseType: !21, size: 8, offset: 72)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !508, file: !135, line: 847, baseType: !140, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !508, file: !135, line: 847, baseType: !321, size: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !135, line: 847, baseType: !468, size: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !508, file: !135, line: 847, baseType: !336, size: 64, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !508, file: !135, line: 847, baseType: !482, size: 64, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !508, file: !135, line: 847, baseType: !21, size: 8, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !508, file: !135, line: 847, baseType: !468, size: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !508, file: !135, line: 848, baseType: !468, size: 64, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !508, file: !135, line: 849, baseType: !374, size: 64, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !508, file: !135, line: 850, baseType: !21, size: 8, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !508, file: !135, line: 851, baseType: !374, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !508, file: !135, line: 852, baseType: !374, size: 64, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !508, file: !135, line: 853, baseType: !374, size: 64, offset: 832)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !508, file: !135, line: 854, baseType: !527, size: 32, offset: 896)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 32, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 4)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !508, file: !135, line: 855, baseType: !16, size: 32, offset: 928)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !508, file: !135, line: 856, baseType: !16, size: 32, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !508, file: !135, line: 857, baseType: !16, size: 32, offset: 992)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !508, file: !135, line: 858, baseType: !16, size: 32, offset: 1024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !508, file: !135, line: 859, baseType: !16, size: 32, offset: 1056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !508, file: !135, line: 860, baseType: !16, size: 32, offset: 1088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !508, file: !135, line: 861, baseType: !16, size: 32, offset: 1120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !508, file: !135, line: 862, baseType: !16, size: 32, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !508, file: !135, line: 863, baseType: !16, size: 32, offset: 1184)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !508, file: !135, line: 864, baseType: !16, size: 32, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !508, file: !135, line: 865, baseType: !16, size: 32, offset: 1248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !508, file: !135, line: 866, baseType: !16, size: 32, offset: 1280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !508, file: !135, line: 867, baseType: !16, size: 32, offset: 1312)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !508, file: !135, line: 868, baseType: !140, size: 16, offset: 1344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !508, file: !135, line: 869, baseType: !21, size: 8, offset: 1360)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !508, file: !135, line: 870, baseType: !21, size: 8, offset: 1368)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !508, file: !135, line: 871, baseType: !21, size: 8, offset: 1376)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !508, file: !135, line: 872, baseType: !548, size: 160, offset: 1384)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 20)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !460, file: !135, line: 900, baseType: !336, size: 64, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !460, file: !135, line: 901, baseType: !553, size: 64, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !135, line: 663, size: 640, elements: !555)
!555 = !{!556, !564, !577, !586, !595, !608, !622, !634, !644}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !554, file: !135, line: 664, baseType: !557, size: 128)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !135, line: 567, size: 128, elements: !558)
!558 = !{!559, !560, !561, !562, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !557, file: !135, line: 568, baseType: !32, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !557, file: !135, line: 568, baseType: !21, size: 8, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !557, file: !135, line: 568, baseType: !21, size: 8, offset: 72)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !557, file: !135, line: 568, baseType: !140, size: 16, offset: 80)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !557, file: !135, line: 568, baseType: !140, size: 16, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !554, file: !135, line: 665, baseType: !565, size: 384)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !135, line: 593, size: 384, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !135, line: 594, baseType: !32, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !565, file: !135, line: 594, baseType: !21, size: 8, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !565, file: !135, line: 594, baseType: !21, size: 8, offset: 72)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !565, file: !135, line: 594, baseType: !140, size: 16, offset: 80)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !565, file: !135, line: 594, baseType: !140, size: 16, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !565, file: !135, line: 594, baseType: !140, size: 16, offset: 112)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !565, file: !135, line: 595, baseType: !468, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !565, file: !135, line: 596, baseType: !321, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !565, file: !135, line: 597, baseType: !321, size: 64, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !565, file: !135, line: 598, baseType: !25, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !554, file: !135, line: 666, baseType: !578, size: 192)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !135, line: 573, size: 192, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !135, line: 574, baseType: !32, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !578, file: !135, line: 574, baseType: !21, size: 8, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !135, line: 574, baseType: !21, size: 8, offset: 72)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !578, file: !135, line: 574, baseType: !140, size: 16, offset: 80)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !578, file: !135, line: 574, baseType: !140, size: 16, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !578, file: !135, line: 574, baseType: !340, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !554, file: !135, line: 667, baseType: !587, size: 192)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !135, line: 604, size: 192, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !587, file: !135, line: 605, baseType: !32, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !587, file: !135, line: 605, baseType: !21, size: 8, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !135, line: 605, baseType: !21, size: 8, offset: 72)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !587, file: !135, line: 605, baseType: !140, size: 16, offset: 80)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !587, file: !135, line: 605, baseType: !140, size: 16, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !587, file: !135, line: 605, baseType: !336, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !554, file: !135, line: 668, baseType: !596, size: 448)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !135, line: 608, size: 448, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !135, line: 609, baseType: !32, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !596, file: !135, line: 609, baseType: !21, size: 8, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !135, line: 609, baseType: !21, size: 8, offset: 72)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !596, file: !135, line: 609, baseType: !140, size: 16, offset: 80)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !596, file: !135, line: 609, baseType: !140, size: 16, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !596, file: !135, line: 609, baseType: !16, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !596, file: !135, line: 610, baseType: !468, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !596, file: !135, line: 611, baseType: !321, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !596, file: !135, line: 612, baseType: !321, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !596, file: !135, line: 613, baseType: !16, size: 32, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !554, file: !135, line: 669, baseType: !609, size: 512)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !135, line: 580, size: 512, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !609, file: !135, line: 581, baseType: !32, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !609, file: !135, line: 581, baseType: !21, size: 8, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !609, file: !135, line: 581, baseType: !21, size: 8, offset: 72)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !609, file: !135, line: 581, baseType: !140, size: 16, offset: 80)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !609, file: !135, line: 581, baseType: !140, size: 16, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !609, file: !135, line: 581, baseType: !16, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !609, file: !135, line: 582, baseType: !340, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !609, file: !135, line: 583, baseType: !340, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !609, file: !135, line: 584, baseType: !434, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !609, file: !135, line: 585, baseType: !32, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !609, file: !135, line: 586, baseType: !16, size: 32, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !554, file: !135, line: 670, baseType: !623, size: 320)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !135, line: 620, size: 320, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !135, line: 621, baseType: !32, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !623, file: !135, line: 621, baseType: !21, size: 8, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !623, file: !135, line: 621, baseType: !21, size: 8, offset: 72)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !623, file: !135, line: 621, baseType: !140, size: 16, offset: 80)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !623, file: !135, line: 621, baseType: !140, size: 16, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !623, file: !135, line: 621, baseType: !21, size: 8, offset: 112)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !623, file: !135, line: 622, baseType: !434, size: 64, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !623, file: !135, line: 623, baseType: !340, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !623, file: !135, line: 624, baseType: !25, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !554, file: !135, line: 671, baseType: !635, size: 640)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !135, line: 631, size: 640, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !635, file: !135, line: 632, baseType: !32, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !635, file: !135, line: 632, baseType: !21, size: 8, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !635, file: !135, line: 632, baseType: !21, size: 8, offset: 72)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !635, file: !135, line: 632, baseType: !140, size: 16, offset: 80)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !635, file: !135, line: 632, baseType: !140, size: 16, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !635, file: !135, line: 633, baseType: !643, size: 512, offset: 128)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 512, elements: !37)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !554, file: !135, line: 672, baseType: !645, size: 320)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !135, line: 654, size: 320, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !135, line: 655, baseType: !32, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !645, file: !135, line: 655, baseType: !21, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !135, line: 655, baseType: !21, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !135, line: 655, baseType: !140, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !645, file: !135, line: 655, baseType: !140, size: 16, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !645, file: !135, line: 655, baseType: !21, size: 8, offset: 112)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !645, file: !135, line: 656, baseType: !336, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !645, file: !135, line: 657, baseType: !340, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !645, file: !135, line: 658, baseType: !656, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !135, line: 645, size: 128, elements: !658)
!658 = !{!659, !665}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !657, file: !135, line: 646, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !664, !16, !32}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !657, file: !135, line: 647, baseType: !32, size: 64, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !460, file: !135, line: 902, baseType: !468, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !460, file: !135, line: 903, baseType: !16, size: 32, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !435, file: !333, line: 61, baseType: !16, size: 32, offset: 1088)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !435, file: !333, line: 62, baseType: !16, size: 32, offset: 1120)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !435, file: !333, line: 63, baseType: !140, size: 16, offset: 1152)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !435, file: !333, line: 64, baseType: !21, size: 8, offset: 1168)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !435, file: !333, line: 66, baseType: !673, size: 2688, offset: 1216)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 2688, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 7)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !435, file: !333, line: 67, baseType: !677, size: 3072, offset: 3904)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 3072, elements: !37)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !435, file: !333, line: 68, baseType: !679, size: 576, offset: 6976)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 576, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 9)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !435, file: !333, line: 69, baseType: !399, size: 64, offset: 7552)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !435, file: !333, line: 71, baseType: !321, size: 64, offset: 7616)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !435, file: !333, line: 72, baseType: !399, size: 64, offset: 7680)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !435, file: !333, line: 73, baseType: !553, size: 64, offset: 7744)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !435, file: !333, line: 74, baseType: !336, size: 64, offset: 7808)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !435, file: !333, line: 75, baseType: !340, size: 64, offset: 7872)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !435, file: !333, line: 76, baseType: !336, size: 64, offset: 7936)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !435, file: !333, line: 77, baseType: !468, size: 64, offset: 8000)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !435, file: !333, line: 78, baseType: !340, size: 64, offset: 8064)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !435, file: !333, line: 79, baseType: !336, size: 64, offset: 8128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !435, file: !333, line: 80, baseType: !374, size: 64, offset: 8192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !435, file: !333, line: 81, baseType: !468, size: 64, offset: 8256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !435, file: !333, line: 82, baseType: !695, size: 64, offset: 8320)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !135, line: 702, size: 128, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !697, file: !135, line: 706, baseType: !16, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !697, file: !135, line: 707, baseType: !16, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !697, file: !135, line: 708, baseType: !140, size: 16, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !697, file: !135, line: 709, baseType: !21, size: 8, offset: 80)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !697, file: !135, line: 710, baseType: !21, size: 8, offset: 88)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !135, line: 711, baseType: !21, size: 8, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !435, file: !333, line: 83, baseType: !468, size: 64, offset: 8384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !435, file: !333, line: 84, baseType: !340, size: 64, offset: 8448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !435, file: !333, line: 85, baseType: !553, size: 64, offset: 8512)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !435, file: !333, line: 86, baseType: !340, size: 64, offset: 8576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !435, file: !333, line: 87, baseType: !553, size: 64, offset: 8640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !435, file: !333, line: 88, baseType: !468, size: 64, offset: 8704)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !435, file: !333, line: 89, baseType: !468, size: 64, offset: 8768)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !435, file: !333, line: 90, baseType: !713, size: 64, offset: 8832)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !435, file: !333, line: 91, baseType: !715, size: 64, offset: 8896)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !135, line: 637, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!14, !434, !719}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !435, file: !333, line: 92, baseType: !721, size: 64, offset: 8960)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !135, line: 641, baseType: !431)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !427, file: !342, line: 152, baseType: !340, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !413, file: !342, line: 155, baseType: !16, size: 32, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !413, file: !342, line: 156, baseType: !445, size: 16, offset: 416)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !413, file: !342, line: 157, baseType: !21, size: 8, offset: 432)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !341, file: !342, line: 375, baseType: !727, size: 576)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !342, line: 122, size: 576, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !727, file: !342, line: 123, baseType: !340, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !727, file: !342, line: 123, baseType: !21, size: 8, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !342, line: 123, baseType: !21, size: 8, offset: 72)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !727, file: !342, line: 123, baseType: !140, size: 16, offset: 80)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !727, file: !342, line: 123, baseType: !21, size: 8, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !727, file: !342, line: 123, baseType: !21, size: 8, offset: 104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !727, file: !342, line: 124, baseType: !140, size: 16, offset: 112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !727, file: !342, line: 125, baseType: !32, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !727, file: !342, line: 126, baseType: !25, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !727, file: !342, line: 127, baseType: !713, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !727, file: !342, line: 128, baseType: !340, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !727, file: !342, line: 129, baseType: !340, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !727, file: !342, line: 130, baseType: !336, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !727, file: !342, line: 131, baseType: !21, size: 8, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !341, file: !342, line: 376, baseType: !744, size: 448)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !342, line: 134, size: 448, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !757}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !744, file: !342, line: 135, baseType: !340, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !744, file: !342, line: 135, baseType: !21, size: 8, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !342, line: 135, baseType: !21, size: 8, offset: 72)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !744, file: !342, line: 135, baseType: !140, size: 16, offset: 80)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !744, file: !342, line: 135, baseType: !21, size: 8, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !744, file: !342, line: 135, baseType: !21, size: 8, offset: 104)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !342, line: 136, baseType: !336, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !744, file: !342, line: 137, baseType: !340, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !342, line: 138, baseType: !340, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !744, file: !342, line: 139, baseType: !756, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !25)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !744, file: !342, line: 140, baseType: !16, size: 32, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !341, file: !342, line: 377, baseType: !759, size: 320)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !342, line: 184, size: 320, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !770}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !759, file: !342, line: 185, baseType: !340, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !759, file: !342, line: 185, baseType: !21, size: 8, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !342, line: 185, baseType: !21, size: 8, offset: 72)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !759, file: !342, line: 185, baseType: !140, size: 16, offset: 80)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !342, line: 185, baseType: !21, size: 8, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !759, file: !342, line: 185, baseType: !767, size: 128, offset: 128)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 128, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 2)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !759, file: !342, line: 185, baseType: !340, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !341, file: !342, line: 378, baseType: !772, size: 384)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !342, line: 187, size: 384, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779, !780, !781}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !772, file: !342, line: 188, baseType: !340, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !772, file: !342, line: 188, baseType: !21, size: 8, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !342, line: 188, baseType: !21, size: 8, offset: 72)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !772, file: !342, line: 188, baseType: !140, size: 16, offset: 80)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !772, file: !342, line: 188, baseType: !21, size: 8, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !772, file: !342, line: 189, baseType: !767, size: 128, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !772, file: !342, line: 189, baseType: !340, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !772, file: !342, line: 189, baseType: !782, size: 64, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !135, line: 480, size: 576, elements: !784)
!784 = !{!785, !786, !787, !788, !796, !811, !843, !844, !845, !846, !847, !848}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !783, file: !135, line: 481, baseType: !336, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !783, file: !135, line: 482, baseType: !782, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !783, file: !135, line: 483, baseType: !782, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !783, file: !135, line: 484, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !135, line: 497, size: 256, elements: !791)
!791 = !{!792, !793, !794, !795}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !790, file: !135, line: 498, baseType: !789, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !135, line: 499, baseType: !789, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !790, file: !135, line: 500, baseType: !782, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !790, file: !135, line: 501, baseType: !16, size: 32, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !783, file: !135, line: 485, baseType: !797, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !135, line: 466, size: 320, elements: !799)
!799 = !{!800, !805, !806, !807, !808, !809, !810}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !798, file: !135, line: 467, baseType: !801, size: 128)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !135, line: 459, size: 128, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !801, file: !135, line: 460, baseType: !21, size: 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !801, file: !135, line: 461, baseType: !25, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !798, file: !135, line: 468, baseType: !801, size: 128, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !798, file: !135, line: 469, baseType: !140, size: 16, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !798, file: !135, line: 470, baseType: !21, size: 8, offset: 272)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !798, file: !135, line: 471, baseType: !21, size: 8, offset: 280)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !798, file: !135, line: 472, baseType: !21, size: 8, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !798, file: !135, line: 473, baseType: !21, size: 8, offset: 296)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !783, file: !135, line: 486, baseType: !812, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !135, line: 448, size: 192, elements: !814)
!814 = !{!815, !838, !839, !840, !841, !842}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !813, file: !135, line: 449, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !135, line: 438, size: 64, elements: !817)
!817 = !{!818, !819, !832}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !816, file: !135, line: 439, baseType: !336, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !816, file: !135, line: 440, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !135, line: 419, size: 256, elements: !822)
!822 = !{!823, !828, !829, !830, !831}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !821, file: !135, line: 420, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!16, !664, !16, !32}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !821, file: !135, line: 421, baseType: !32, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !821, file: !135, line: 422, baseType: !336, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !821, file: !135, line: 423, baseType: !21, size: 8, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !821, file: !135, line: 424, baseType: !21, size: 8, offset: 200)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !816, file: !135, line: 441, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !135, line: 429, size: 128, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !834, file: !135, line: 430, baseType: !336, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !135, line: 431, baseType: !833, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !813, file: !135, line: 450, baseType: !797, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !813, file: !135, line: 451, baseType: !21, size: 8, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !813, file: !135, line: 452, baseType: !21, size: 8, offset: 136)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !813, file: !135, line: 453, baseType: !21, size: 8, offset: 144)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !813, file: !135, line: 454, baseType: !21, size: 8, offset: 152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !783, file: !135, line: 487, baseType: !25, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !783, file: !135, line: 488, baseType: !16, size: 32, offset: 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !783, file: !135, line: 489, baseType: !140, size: 16, offset: 480)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !783, file: !135, line: 490, baseType: !140, size: 16, offset: 496)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !783, file: !135, line: 491, baseType: !21, size: 8, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !783, file: !135, line: 492, baseType: !21, size: 8, offset: 520)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !341, file: !342, line: 379, baseType: !850, size: 384)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !342, line: 192, size: 384, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !850, file: !342, line: 193, baseType: !340, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !850, file: !342, line: 193, baseType: !21, size: 8, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !342, line: 193, baseType: !21, size: 8, offset: 72)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !850, file: !342, line: 193, baseType: !140, size: 16, offset: 80)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !850, file: !342, line: 193, baseType: !21, size: 8, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !850, file: !342, line: 193, baseType: !767, size: 128, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !850, file: !342, line: 193, baseType: !340, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !850, file: !342, line: 193, baseType: !16, size: 32, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !850, file: !342, line: 194, baseType: !16, size: 32, offset: 352)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !341, file: !342, line: 380, baseType: !862, size: 384)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !342, line: 197, size: 384, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !862, file: !342, line: 198, baseType: !340, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !862, file: !342, line: 198, baseType: !21, size: 8, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !862, file: !342, line: 198, baseType: !21, size: 8, offset: 72)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !862, file: !342, line: 198, baseType: !140, size: 16, offset: 80)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !862, file: !342, line: 198, baseType: !21, size: 8, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !862, file: !342, line: 200, baseType: !21, size: 8, offset: 104)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !862, file: !342, line: 201, baseType: !21, size: 8, offset: 112)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !862, file: !342, line: 202, baseType: !767, size: 128, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !862, file: !342, line: 202, baseType: !340, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !862, file: !342, line: 202, baseType: !24, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !341, file: !342, line: 381, baseType: !875, size: 320)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !342, line: 205, size: 320, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !875, file: !342, line: 206, baseType: !340, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !875, file: !342, line: 206, baseType: !21, size: 8, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !875, file: !342, line: 206, baseType: !21, size: 8, offset: 72)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !875, file: !342, line: 206, baseType: !140, size: 16, offset: 80)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !342, line: 206, baseType: !21, size: 8, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !875, file: !342, line: 206, baseType: !767, size: 128, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !875, file: !342, line: 206, baseType: !340, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !341, file: !342, line: 382, baseType: !885, size: 384)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !342, line: 233, size: 384, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !885, file: !342, line: 234, baseType: !340, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 72)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !885, file: !342, line: 234, baseType: !140, size: 16, offset: 80)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 104)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 112)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 120)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !885, file: !342, line: 234, baseType: !336, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !885, file: !342, line: 234, baseType: !16, size: 32, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !885, file: !342, line: 234, baseType: !16, size: 32, offset: 224)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !885, file: !342, line: 234, baseType: !16, size: 32, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !885, file: !342, line: 234, baseType: !21, size: 8, offset: 296)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !885, file: !342, line: 234, baseType: !340, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !341, file: !342, line: 383, baseType: !903, size: 576)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !342, line: 237, size: 576, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !903, file: !342, line: 238, baseType: !340, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 72)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !903, file: !342, line: 238, baseType: !140, size: 16, offset: 80)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 104)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 112)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 120)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !903, file: !342, line: 238, baseType: !336, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !903, file: !342, line: 238, baseType: !16, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !903, file: !342, line: 238, baseType: !16, size: 32, offset: 224)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !903, file: !342, line: 238, baseType: !16, size: 32, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !903, file: !342, line: 238, baseType: !21, size: 8, offset: 296)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !903, file: !342, line: 238, baseType: !140, size: 16, offset: 304)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !903, file: !342, line: 239, baseType: !340, size: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !903, file: !342, line: 240, baseType: !321, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !903, file: !342, line: 241, baseType: !140, size: 16, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !903, file: !342, line: 242, baseType: !321, size: 64, offset: 512)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !341, file: !342, line: 384, baseType: !925, size: 384)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !342, line: 262, size: 384, elements: !926)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !925, file: !342, line: 263, baseType: !340, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 72)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !925, file: !342, line: 263, baseType: !140, size: 16, offset: 80)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 104)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 112)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 120)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !925, file: !342, line: 263, baseType: !336, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !925, file: !342, line: 263, baseType: !16, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !925, file: !342, line: 263, baseType: !16, size: 32, offset: 224)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !925, file: !342, line: 263, baseType: !16, size: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 288)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 296)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !925, file: !342, line: 263, baseType: !21, size: 8, offset: 304)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !925, file: !342, line: 264, baseType: !340, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !341, file: !342, line: 385, baseType: !944, size: 448)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !342, line: 245, size: 448, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !944, file: !342, line: 246, baseType: !340, size: 64)
