; ModuleID = '../bcout/drivers/acpi/acpica/hwxfsleep.llvm.bc'
source_filename = "drivers/acpi/acpica/hwxfsleep.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_facs = type { [4 x i8], i32, i32, i32, i32, i32, i64, i8, [3 x i8], i32, [24 x i8] }
%struct.acpi_table_fadt = type <{ %struct.acpi_table_header, i32, i32, i8, i8, i16, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i8, i8, i8, i16, i8, i32, %struct.acpi_generic_address, i8, i16, i8, i64, i64, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, i64 }>
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 16, type: !15, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/hwxfsleep.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !8, !13}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !{!0}
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 80, elements: !18)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !{!19}
!19 = !DISubrange(count: 10)
!20 = !{!"rsp"}
!21 = !{i32 7, !"Dwarf Version", i32 4}
!22 = !{i32 2, !"Debug Info Version", i32 3}
!23 = !{i32 1, !"wchar_size", i32 2}
!24 = !{i32 1, !"Code Model", i32 2}
!25 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!26 = distinct !DISubprogram(name: "acpi_set_firmware_waking_vector", scope: !3, file: !3, line: 101, type: !27, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!27 = !DISubroutineType(types: !28)
!28 = !{!6, !29, !29}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !32)
!32 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DILocalVariable(name: "physical_address", arg: 1, scope: !26, file: !3, line: 101, type: !29)
!34 = !DILocation(line: 101, column: 55, scope: !26)
!35 = !DILocalVariable(name: "physical_address64", arg: 2, scope: !26, file: !3, line: 102, type: !29)
!36 = !DILocation(line: 102, column: 27, scope: !26)
!37 = !DILocation(line: 107, column: 6, scope: !38)
!38 = distinct !DILexicalBlock(scope: !26, file: !3, line: 107, column: 6)
!39 = !DILocation(line: 107, column: 6, scope: !26)
!40 = !DILocation(line: 108, column: 44, scope: !41)
!41 = distinct !DILexicalBlock(scope: !38, file: !3, line: 107, column: 21)
!42 = !DILocation(line: 109, column: 9, scope: !41)
!43 = !DILocation(line: 110, column: 9, scope: !41)
!44 = !DILocation(line: 108, column: 9, scope: !41)
!45 = !DILocation(line: 111, column: 2, scope: !41)
!46 = !DILocation(line: 113, column: 2, scope: !26)
!47 = distinct !DISubprogram(name: "acpi_hw_set_firmware_waking_vector", scope: !3, file: !3, line: 50, type: !48, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50, !29, !29}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_facs", file: !52, line: 162, size: 512, elements: !53)
!52 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!53 = !{!54, !58, !59, !60, !61, !62, !63, !64, !68, !72, !73}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !51, file: !52, line: 163, baseType: !55, size: 32)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 4)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !51, file: !52, line: 164, baseType: !8, size: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "hardware_signature", scope: !51, file: !52, line: 165, baseType: !8, size: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "firmware_waking_vector", scope: !51, file: !52, line: 166, baseType: !8, size: 32, offset: 96)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "global_lock", scope: !51, file: !52, line: 167, baseType: !8, size: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !51, file: !52, line: 168, baseType: !8, size: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "xfirmware_waking_vector", scope: !51, file: !52, line: 169, baseType: !30, size: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !51, file: !52, line: 170, baseType: !65, size: 8, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !67)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !51, file: !52, line: 171, baseType: !69, size: 24, offset: 264)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 24, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ospm_flags", scope: !51, file: !52, line: 172, baseType: !8, size: 32, offset: 288)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !51, file: !52, line: 173, baseType: !74, size: 192, offset: 320)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 192, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 24)
!77 = !DILocalVariable(name: "facs", arg: 1, scope: !47, file: !3, line: 50, type: !50)
!78 = !DILocation(line: 50, column: 60, scope: !47)
!79 = !DILocalVariable(name: "physical_address", arg: 2, scope: !47, file: !3, line: 51, type: !29)
!80 = !DILocation(line: 51, column: 30, scope: !47)
!81 = !DILocalVariable(name: "physical_address64", arg: 3, scope: !47, file: !3, line: 52, type: !29)
!82 = !DILocation(line: 52, column: 30, scope: !47)
!83 = !DILocation(line: 67, column: 38, scope: !47)
!84 = !DILocation(line: 67, column: 33, scope: !47)
!85 = !DILocation(line: 67, column: 2, scope: !47)
!86 = !DILocation(line: 67, column: 8, scope: !47)
!87 = !DILocation(line: 67, column: 31, scope: !47)
!88 = !DILocation(line: 69, column: 6, scope: !89)
!89 = distinct !DILexicalBlock(scope: !47, file: !3, line: 69, column: 6)
!90 = !DILocation(line: 69, column: 12, scope: !89)
!91 = !DILocation(line: 69, column: 19, scope: !89)
!92 = !DILocation(line: 69, column: 6, scope: !47)
!93 = !DILocation(line: 70, column: 7, scope: !94)
!94 = distinct !DILexicalBlock(scope: !95, file: !3, line: 70, column: 7)
!95 = distinct !DILexicalBlock(scope: !89, file: !3, line: 69, column: 25)
!96 = !DILocation(line: 70, column: 13, scope: !94)
!97 = !DILocation(line: 70, column: 21, scope: !94)
!98 = !DILocation(line: 70, column: 7, scope: !95)
!99 = !DILocation(line: 74, column: 36, scope: !100)
!100 = distinct !DILexicalBlock(scope: !94, file: !3, line: 70, column: 27)
!101 = !DILocation(line: 74, column: 4, scope: !100)
!102 = !DILocation(line: 74, column: 10, scope: !100)
!103 = !DILocation(line: 74, column: 34, scope: !100)
!104 = !DILocation(line: 75, column: 3, scope: !100)
!105 = !DILocation(line: 78, column: 4, scope: !106)
!106 = distinct !DILexicalBlock(scope: !94, file: !3, line: 75, column: 10)
!107 = !DILocation(line: 78, column: 10, scope: !106)
!108 = !DILocation(line: 78, column: 34, scope: !106)
!109 = !DILocation(line: 80, column: 2, scope: !95)
!110 = !DILocation(line: 82, column: 2, scope: !47)
!111 = distinct !DISubprogram(name: "acpi_enter_sleep_state_s4bios", scope: !3, file: !3, line: 130, type: !112, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!112 = !DISubroutineType(types: !113)
!113 = !{!6}
!114 = !DILocalVariable(name: "in_value", scope: !111, file: !3, line: 132, type: !8)
!115 = !DILocation(line: 132, column: 6, scope: !111)
!116 = !DILocalVariable(name: "status", scope: !111, file: !3, line: 133, type: !6)
!117 = !DILocation(line: 133, column: 14, scope: !111)
!118 = !DILocation(line: 140, column: 6, scope: !111)
!119 = !DILocation(line: 139, column: 9, scope: !111)
!120 = !DILocation(line: 141, column: 6, scope: !121)
!121 = distinct !DILexicalBlock(scope: !111, file: !3, line: 141, column: 6)
!122 = !DILocation(line: 141, column: 6, scope: !111)
!123 = !DILocation(line: 142, column: 3, scope: !124)
!124 = distinct !DILexicalBlock(scope: !121, file: !3, line: 141, column: 28)
!125 = !DILocation(line: 145, column: 11, scope: !111)
!126 = !DILocation(line: 145, column: 9, scope: !111)
!127 = !DILocation(line: 146, column: 6, scope: !128)
!128 = distinct !DILexicalBlock(scope: !111, file: !3, line: 146, column: 6)
!129 = !DILocation(line: 146, column: 6, scope: !111)
!130 = !DILocation(line: 147, column: 3, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !3, line: 146, column: 28)
!132 = !DILocation(line: 154, column: 11, scope: !111)
!133 = !DILocation(line: 154, column: 9, scope: !111)
!134 = !DILocation(line: 155, column: 6, scope: !135)
!135 = distinct !DILexicalBlock(scope: !111, file: !3, line: 155, column: 6)
!136 = !DILocation(line: 155, column: 6, scope: !111)
!137 = !DILocation(line: 156, column: 3, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !3, line: 155, column: 28)
!139 = !DILocation(line: 158, column: 36, scope: !111)
!140 = !DILocation(line: 160, column: 11, scope: !111)
!141 = !DILocation(line: 160, column: 9, scope: !111)
!142 = !DILocation(line: 161, column: 6, scope: !143)
!143 = distinct !DILexicalBlock(scope: !111, file: !3, line: 161, column: 6)
!144 = !DILocation(line: 161, column: 6, scope: !111)
!145 = !DILocation(line: 162, column: 3, scope: !146)
!146 = distinct !DILexicalBlock(scope: !143, file: !3, line: 161, column: 28)
!147 = !DILocation(line: 165, column: 2, scope: !111)
!148 = !DILocation(line: 167, column: 44, scope: !111)
!149 = !DILocation(line: 167, column: 30, scope: !111)
!150 = !DILocation(line: 168, column: 28, scope: !111)
!151 = !DILocation(line: 168, column: 9, scope: !111)
!152 = !DILocation(line: 167, column: 11, scope: !111)
!153 = !DILocation(line: 167, column: 9, scope: !111)
!154 = !DILocation(line: 169, column: 6, scope: !155)
!155 = distinct !DILexicalBlock(scope: !111, file: !3, line: 169, column: 6)
!156 = !DILocation(line: 169, column: 6, scope: !111)
!157 = !DILocation(line: 170, column: 3, scope: !158)
!158 = distinct !DILexicalBlock(scope: !155, file: !3, line: 169, column: 28)
!159 = !DILocation(line: 173, column: 2, scope: !111)
!160 = !DILocation(line: 174, column: 3, scope: !161)
!161 = distinct !DILexicalBlock(scope: !111, file: !3, line: 173, column: 5)
!162 = !DILocation(line: 176, column: 7, scope: !161)
!163 = !DILocation(line: 175, column: 10, scope: !161)
!164 = !DILocation(line: 177, column: 7, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !3, line: 177, column: 7)
!166 = !DILocation(line: 177, column: 7, scope: !161)
!167 = !DILocation(line: 178, column: 4, scope: !168)
!168 = distinct !DILexicalBlock(scope: !165, file: !3, line: 177, column: 29)
!169 = !DILocation(line: 181, column: 2, scope: !161)
!170 = !DILocation(line: 181, column: 12, scope: !111)
!171 = !DILocation(line: 181, column: 11, scope: !111)
!172 = distinct !{!172, !159, !173}
!173 = !DILocation(line: 181, column: 20, scope: !111)
!174 = !DILocation(line: 183, column: 2, scope: !111)
!175 = !DILocation(line: 184, column: 1, scope: !111)
!176 = distinct !DISubprogram(name: "wbinvd", scope: !177, file: !177, line: 158, type: !178, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!177 = !DIFile(filename: "./arch/x86/include/asm/paravirt.h", directory: "/home/lizy2001/genbc/linux")
!178 = !DISubroutineType(types: !179)
!179 = !{null}
!180 = !DILocalVariable(name: "__edi", scope: !181, file: !177, line: 160, type: !182)
!181 = distinct !DILexicalBlock(scope: !176, file: !177, line: 160, column: 2)
!182 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!183 = !DILocation(line: 160, column: 2, scope: !181)
!184 = !DILocalVariable(name: "__esi", scope: !181, file: !177, line: 160, type: !182)
!185 = !DILocalVariable(name: "__edx", scope: !181, file: !177, line: 160, type: !182)
!186 = !DILocalVariable(name: "__ecx", scope: !181, file: !177, line: 160, type: !182)
!187 = !DILocalVariable(name: "__eax", scope: !181, file: !177, line: 160, type: !182)
!188 = !{i32 -2145988405, i32 -2145987523, i32 -2145987289, i32 -2145987238, i32 -2145987210, i32 -2145987185, i32 -2145987501, i32 -2145987488, i32 -2145987050, i32 -2145986931, i32 -2145987396, i32 -2145987369, i32 -2145987341, i32 -2145987311}
!189 = !DILocation(line: 161, column: 1, scope: !176)
!190 = distinct !DISubprogram(name: "acpi_enter_sleep_state_prep", scope: !3, file: !3, line: 204, type: !191, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!191 = !DISubroutineType(types: !192)
!192 = !{!6, !65}
!193 = !DILocalVariable(name: "sleep_state", arg: 1, scope: !190, file: !3, line: 204, type: !65)
!194 = !DILocation(line: 204, column: 44, scope: !190)
!195 = !DILocalVariable(name: "status", scope: !190, file: !3, line: 206, type: !6)
!196 = !DILocation(line: 206, column: 14, scope: !190)
!197 = !DILocalVariable(name: "arg_list", scope: !190, file: !3, line: 207, type: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_list", file: !7, line: 947, size: 128, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !198, file: !7, line: 948, baseType: !8, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !198, file: !7, line: 949, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !7, line: 899, size: 192, elements: !204)
!204 = !{!205, !207, !212, !219, !226, !232, !239, !247}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !7, line: 900, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !7, line: 635, baseType: !8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !203, file: !7, line: 904, baseType: !208, size: 128)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 901, size: 128, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !208, file: !7, line: 902, baseType: !206, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !208, file: !7, line: 903, baseType: !30, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !203, file: !7, line: 910, baseType: !213, size: 128)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 906, size: 128, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !7, line: 907, baseType: !206, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !213, file: !7, line: 908, baseType: !8, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !213, file: !7, line: 909, baseType: !218, size: 64, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !203, file: !7, line: 916, baseType: !220, size: 128)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 912, size: 128, elements: !221)
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !7, line: 913, baseType: !206, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !220, file: !7, line: 914, baseType: !8, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !220, file: !7, line: 915, baseType: !225, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !203, file: !7, line: 922, baseType: !227, size: 128)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 918, size: 128, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !7, line: 919, baseType: !206, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !227, file: !7, line: 920, baseType: !8, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !227, file: !7, line: 921, baseType: !202, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !203, file: !7, line: 928, baseType: !233, size: 128)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 924, size: 128, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !7, line: 925, baseType: !206, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !233, file: !7, line: 926, baseType: !206, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !233, file: !7, line: 927, baseType: !238, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !7, line: 424, baseType: !13)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !203, file: !7, line: 935, baseType: !240, size: 192)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 930, size: 192, elements: !241)
!241 = !{!242, !243, !244, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !7, line: 931, baseType: !206, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !240, file: !7, line: 932, baseType: !8, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !240, file: !7, line: 933, baseType: !245, size: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !7, line: 128, baseType: !30)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !240, file: !7, line: 934, baseType: !8, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !203, file: !7, line: 941, baseType: !248, size: 96)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !7, line: 937, size: 96, elements: !249)
!249 = !{!250, !251, !252}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !7, line: 938, baseType: !206, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !248, file: !7, line: 939, baseType: !8, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !248, file: !7, line: 940, baseType: !8, size: 32, offset: 64)
!253 = !DILocation(line: 207, column: 26, scope: !190)
!254 = !DILocalVariable(name: "arg", scope: !190, file: !3, line: 208, type: !203)
!255 = !DILocation(line: 208, column: 20, scope: !190)
!256 = !DILocalVariable(name: "sst_value", scope: !190, file: !3, line: 209, type: !8)
!257 = !DILocation(line: 209, column: 6, scope: !190)
!258 = !DILocation(line: 213, column: 36, scope: !190)
!259 = !DILocation(line: 213, column: 11, scope: !190)
!260 = !DILocation(line: 213, column: 9, scope: !190)
!261 = !DILocation(line: 216, column: 6, scope: !262)
!262 = distinct !DILexicalBlock(scope: !190, file: !3, line: 216, column: 6)
!263 = !DILocation(line: 216, column: 6, scope: !190)
!264 = !DILocation(line: 217, column: 3, scope: !265)
!265 = distinct !DILexicalBlock(scope: !262, file: !3, line: 216, column: 28)
!266 = !DILocation(line: 222, column: 11, scope: !190)
!267 = !DILocation(line: 222, column: 17, scope: !190)
!268 = !DILocation(line: 223, column: 11, scope: !190)
!269 = !DILocation(line: 223, column: 19, scope: !190)
!270 = !DILocation(line: 224, column: 6, scope: !190)
!271 = !DILocation(line: 224, column: 11, scope: !190)
!272 = !DILocation(line: 225, column: 22, scope: !190)
!273 = !DILocation(line: 225, column: 6, scope: !190)
!274 = !DILocation(line: 225, column: 14, scope: !190)
!275 = !DILocation(line: 225, column: 20, scope: !190)
!276 = !DILocation(line: 228, column: 6, scope: !190)
!277 = !DILocation(line: 227, column: 9, scope: !190)
!278 = !DILocation(line: 229, column: 6, scope: !279)
!279 = distinct !DILexicalBlock(scope: !190, file: !3, line: 229, column: 6)
!280 = !DILocation(line: 229, column: 27, scope: !279)
!281 = !DILocation(line: 229, column: 30, scope: !279)
!282 = !DILocation(line: 229, column: 37, scope: !279)
!283 = !DILocation(line: 229, column: 6, scope: !190)
!284 = !DILocation(line: 230, column: 3, scope: !285)
!285 = distinct !DILexicalBlock(scope: !279, file: !3, line: 229, column: 54)
!286 = !DILocation(line: 235, column: 10, scope: !190)
!287 = !DILocation(line: 235, column: 2, scope: !190)
!288 = !DILocation(line: 238, column: 13, scope: !289)
!289 = distinct !DILexicalBlock(scope: !190, file: !3, line: 235, column: 23)
!290 = !DILocation(line: 239, column: 3, scope: !289)
!291 = !DILocation(line: 245, column: 13, scope: !289)
!292 = !DILocation(line: 246, column: 3, scope: !289)
!293 = !DILocation(line: 250, column: 13, scope: !289)
!294 = !DILocation(line: 251, column: 3, scope: !289)
!295 = !DILocation(line: 255, column: 13, scope: !289)
!296 = !DILocation(line: 256, column: 3, scope: !289)
!297 = !DILocation(line: 263, column: 53, scope: !190)
!298 = !DILocation(line: 263, column: 2, scope: !190)
!299 = !DILocation(line: 264, column: 2, scope: !190)
!300 = !DILocation(line: 265, column: 1, scope: !190)
!301 = distinct !DISubprogram(name: "acpi_enter_sleep_state", scope: !3, file: !3, line: 281, type: !191, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!302 = !DILocalVariable(name: "sleep_state", arg: 1, scope: !301, file: !3, line: 281, type: !65)
!303 = !DILocation(line: 281, column: 39, scope: !301)
!304 = !DILocalVariable(name: "status", scope: !301, file: !3, line: 283, type: !6)
!305 = !DILocation(line: 283, column: 14, scope: !301)
!306 = !DILocation(line: 287, column: 7, scope: !307)
!307 = distinct !DILexicalBlock(scope: !301, file: !3, line: 287, column: 6)
!308 = !DILocation(line: 287, column: 29, scope: !307)
!309 = !DILocation(line: 287, column: 52, scope: !307)
!310 = !DILocation(line: 288, column: 7, scope: !307)
!311 = !DILocation(line: 288, column: 29, scope: !307)
!312 = !DILocation(line: 287, column: 6, scope: !301)
!313 = !DILocation(line: 289, column: 3, scope: !314)
!314 = distinct !DILexicalBlock(scope: !307, file: !3, line: 288, column: 53)
!315 = !DILocation(line: 291, column: 3, scope: !314)
