; ModuleID = '../bcout/drivers/acpi/acpica/nsaccess.llvm.bc'
source_filename = "drivers/acpi/acpica/nsaccess.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 19, type: !810, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !809, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsaccess.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !13, line: 305, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!19 = !{!20, !26, !30, !31, !32, !35, !22, !36, !56, !82, !98, !806, !808}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !21, line: 421, baseType: !22)
!21 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !25, line: 27, baseType: !7)
!25 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !21, line: 127, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !23, line: 23, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !25, line: 31, baseType: !29)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !23, line: 17, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !25, line: 21, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_descriptor", file: !38, line: 432, size: 1600, elements: !39)
!38 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!39 = !{!40, !45, !804, !805}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !37, file: !38, line: 433, baseType: !41, size: 128)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_descriptor", file: !38, line: 427, size: 128, elements: !42)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "common_pointer", scope: !41, file: !38, line: 428, baseType: !31, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !41, file: !38, line: 429, baseType: !32, size: 8, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !37, file: !38, line: 434, baseType: !46, size: 576)
!46 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !38, line: 367, size: 576, elements: !47)
!47 = !{!48, !60, !73, !85, !119, !133, !142, !455, !472, !487, !500, !578, !590, !604, !614, !632, !654, !673, !692, !711, !724, !750, !767, !780, !794, !803}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !46, file: !38, line: 368, baseType: !49, size: 128)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !38, line: 73, size: 128, elements: !50)
!50 = !{!51, !53, !54, !55, !59}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !49, file: !38, line: 74, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !49, file: !38, line: 74, baseType: !32, size: 8, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !38, line: 74, baseType: !32, size: 8, offset: 72)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !49, file: !38, line: 74, baseType: !56, size: 16, offset: 80)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !23, line: 19, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !25, line: 24, baseType: !58)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !38, line: 74, baseType: !32, size: 8, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !46, file: !38, line: 369, baseType: !61, size: 192)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !38, line: 76, size: 192, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !72}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !61, file: !38, line: 77, baseType: !52, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !61, file: !38, line: 77, baseType: !32, size: 8, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !38, line: 77, baseType: !32, size: 8, offset: 72)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !61, file: !38, line: 77, baseType: !56, size: 16, offset: 80)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !38, line: 77, baseType: !32, size: 8, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !61, file: !38, line: 77, baseType: !69, size: 24, offset: 104)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 24, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 3)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !61, file: !38, line: 78, baseType: !27, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !46, file: !38, line: 370, baseType: !74, size: 256)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !38, line: 93, size: 256, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !84}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !74, file: !38, line: 94, baseType: !52, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !74, file: !38, line: 94, baseType: !32, size: 8, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !38, line: 94, baseType: !32, size: 8, offset: 72)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !74, file: !38, line: 94, baseType: !56, size: 16, offset: 80)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !38, line: 94, baseType: !32, size: 8, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !74, file: !38, line: 94, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !74, file: !38, line: 94, baseType: !22, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !46, file: !38, line: 371, baseType: !86, size: 384)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !38, line: 97, size: 384, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !86, file: !38, line: 98, baseType: !52, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !86, file: !38, line: 98, baseType: !32, size: 8, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !86, file: !38, line: 98, baseType: !32, size: 8, offset: 72)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !86, file: !38, line: 98, baseType: !56, size: 16, offset: 80)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !86, file: !38, line: 98, baseType: !32, size: 8, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !86, file: !38, line: 98, baseType: !35, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !86, file: !38, line: 98, baseType: !22, size: 32, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !86, file: !38, line: 99, baseType: !22, size: 32, offset: 224)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !86, file: !38, line: 100, baseType: !35, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !38, line: 101, baseType: !98, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !114, !115, !116, !117}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !99, file: !6, line: 134, baseType: !52, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !99, file: !6, line: 135, baseType: !32, size: 8, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !6, line: 136, baseType: !32, size: 8, offset: 72)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !6, line: 137, baseType: !56, size: 16, offset: 80)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !99, file: !6, line: 138, baseType: !106, size: 32, offset: 96)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !107, line: 327, size: 32, elements: !108)
!107 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !106, file: !107, line: 328, baseType: !22, size: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !106, file: !107, line: 329, baseType: !111, size: 32)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 4)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !99, file: !6, line: 139, baseType: !98, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !99, file: !6, line: 140, baseType: !98, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !99, file: !6, line: 141, baseType: !98, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !99, file: !6, line: 142, baseType: !118, size: 16, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !21, line: 445, baseType: !56)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !46, file: !38, line: 372, baseType: !120, size: 384)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !38, line: 104, size: 384, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !130, !131, !132}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !120, file: !38, line: 105, baseType: !52, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !120, file: !38, line: 105, baseType: !32, size: 8, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !38, line: 105, baseType: !32, size: 8, offset: 72)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !120, file: !38, line: 105, baseType: !56, size: 16, offset: 80)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !38, line: 105, baseType: !32, size: 8, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !120, file: !38, line: 105, baseType: !98, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !120, file: !38, line: 106, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !120, file: !38, line: 107, baseType: !35, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !120, file: !38, line: 108, baseType: !22, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !120, file: !38, line: 109, baseType: !22, size: 32, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !46, file: !38, line: 373, baseType: !134, size: 192)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !38, line: 118, size: 192, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !134, file: !38, line: 119, baseType: !52, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !134, file: !38, line: 119, baseType: !32, size: 8, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !38, line: 119, baseType: !32, size: 8, offset: 72)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !134, file: !38, line: 119, baseType: !56, size: 16, offset: 80)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !38, line: 119, baseType: !32, size: 8, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !134, file: !38, line: 119, baseType: !31, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !46, file: !38, line: 374, baseType: !143, size: 448)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !38, line: 143, size: 448, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !452, !453, !454}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !143, file: !38, line: 144, baseType: !52, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !143, file: !38, line: 144, baseType: !32, size: 8, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !143, file: !38, line: 144, baseType: !32, size: 8, offset: 72)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !143, file: !38, line: 144, baseType: !56, size: 16, offset: 80)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !143, file: !38, line: 144, baseType: !32, size: 8, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !143, file: !38, line: 144, baseType: !32, size: 8, offset: 104)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !143, file: !38, line: 145, baseType: !32, size: 8, offset: 112)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !143, file: !38, line: 146, baseType: !32, size: 8, offset: 120)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !143, file: !38, line: 147, baseType: !52, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !143, file: !38, line: 148, baseType: !52, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !143, file: !38, line: 149, baseType: !35, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !143, file: !38, line: 153, baseType: !157, size: 64, offset: 320)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !143, file: !38, line: 150, size: 64, elements: !158)
!158 = !{!159, !451}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !157, file: !38, line: 151, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!20, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !166, line: 37, size: 9024, elements: !167)
!166 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !397, !398, !399, !400, !401, !405, !407, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !434, !435, !436, !437, !438, !439, !440, !441, !443, !449}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !165, file: !166, line: 38, baseType: !164, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !165, file: !166, line: 39, baseType: !32, size: 8, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !165, file: !166, line: 40, baseType: !32, size: 8, offset: 72)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !165, file: !166, line: 41, baseType: !56, size: 16, offset: 80)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !165, file: !166, line: 42, baseType: !32, size: 8, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !165, file: !166, line: 43, baseType: !32, size: 8, offset: 104)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !165, file: !166, line: 44, baseType: !32, size: 8, offset: 112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !165, file: !166, line: 45, baseType: !118, size: 16, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !165, file: !166, line: 46, baseType: !32, size: 8, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !165, file: !166, line: 47, baseType: !32, size: 8, offset: 152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !165, file: !166, line: 48, baseType: !32, size: 8, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !165, file: !166, line: 49, baseType: !32, size: 8, offset: 168)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !165, file: !166, line: 50, baseType: !32, size: 8, offset: 176)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !165, file: !166, line: 51, baseType: !32, size: 8, offset: 184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !165, file: !166, line: 52, baseType: !32, size: 8, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !165, file: !166, line: 53, baseType: !32, size: 8, offset: 200)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !165, file: !166, line: 54, baseType: !35, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !165, file: !166, line: 55, baseType: !22, size: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !165, file: !166, line: 56, baseType: !22, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !165, file: !166, line: 57, baseType: !22, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !165, file: !166, line: 58, baseType: !22, size: 32, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !165, file: !166, line: 60, baseType: !190, size: 640, offset: 448)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !278, !279, !395, !396}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !190, file: !6, line: 894, baseType: !35, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !190, file: !6, line: 895, baseType: !35, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !190, file: !6, line: 896, baseType: !35, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !190, file: !6, line: 897, baseType: !35, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !190, file: !6, line: 898, baseType: !35, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !190, file: !6, line: 899, baseType: !198, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !200)
!200 = !{!201, !221, !237}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !199, file: !6, line: 876, baseType: !202, size: 448)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !220}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !202, file: !6, line: 829, baseType: !198, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !202, file: !6, line: 829, baseType: !32, size: 8, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !202, file: !6, line: 829, baseType: !32, size: 8, offset: 72)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !202, file: !6, line: 829, baseType: !56, size: 16, offset: 80)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !202, file: !6, line: 829, baseType: !35, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !6, line: 829, baseType: !198, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !6, line: 829, baseType: !98, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !202, file: !6, line: 829, baseType: !212, size: 64, offset: 320)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !212, file: !6, line: 717, baseType: !27, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !212, file: !6, line: 718, baseType: !22, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !212, file: !6, line: 719, baseType: !82, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !6, line: 720, baseType: !35, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !212, file: !6, line: 721, baseType: !82, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !212, file: !6, line: 722, baseType: !198, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !202, file: !6, line: 829, baseType: !32, size: 8, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !199, file: !6, line: 877, baseType: !222, size: 640)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !222, file: !6, line: 836, baseType: !198, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !222, file: !6, line: 836, baseType: !32, size: 8, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !222, file: !6, line: 836, baseType: !32, size: 8, offset: 72)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !222, file: !6, line: 836, baseType: !56, size: 16, offset: 80)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !222, file: !6, line: 836, baseType: !35, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !222, file: !6, line: 836, baseType: !198, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !222, file: !6, line: 836, baseType: !98, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !222, file: !6, line: 836, baseType: !212, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !222, file: !6, line: 836, baseType: !32, size: 8, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !222, file: !6, line: 836, baseType: !82, size: 64, offset: 448)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !6, line: 837, baseType: !35, size: 64, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !222, file: !6, line: 838, baseType: !22, size: 32, offset: 576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !222, file: !6, line: 839, baseType: !22, size: 32, offset: 608)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !199, file: !6, line: 878, baseType: !238, size: 1600)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !238, file: !6, line: 847, baseType: !198, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !238, file: !6, line: 847, baseType: !32, size: 8, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !6, line: 847, baseType: !32, size: 8, offset: 72)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !238, file: !6, line: 847, baseType: !56, size: 16, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !238, file: !6, line: 847, baseType: !35, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !6, line: 847, baseType: !198, size: 64, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !238, file: !6, line: 847, baseType: !98, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !6, line: 847, baseType: !212, size: 64, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !238, file: !6, line: 847, baseType: !32, size: 8, offset: 384)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !238, file: !6, line: 847, baseType: !198, size: 64, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !238, file: !6, line: 848, baseType: !198, size: 64, offset: 512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !238, file: !6, line: 849, baseType: !82, size: 64, offset: 576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !238, file: !6, line: 850, baseType: !32, size: 8, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !238, file: !6, line: 851, baseType: !82, size: 64, offset: 704)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !238, file: !6, line: 852, baseType: !82, size: 64, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !238, file: !6, line: 853, baseType: !82, size: 64, offset: 832)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !238, file: !6, line: 854, baseType: !111, size: 32, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !238, file: !6, line: 855, baseType: !22, size: 32, offset: 928)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !238, file: !6, line: 856, baseType: !22, size: 32, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !238, file: !6, line: 857, baseType: !22, size: 32, offset: 992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !238, file: !6, line: 858, baseType: !22, size: 32, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !238, file: !6, line: 859, baseType: !22, size: 32, offset: 1056)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !238, file: !6, line: 860, baseType: !22, size: 32, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !238, file: !6, line: 861, baseType: !22, size: 32, offset: 1120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !238, file: !6, line: 862, baseType: !22, size: 32, offset: 1152)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !238, file: !6, line: 863, baseType: !22, size: 32, offset: 1184)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !238, file: !6, line: 864, baseType: !22, size: 32, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !238, file: !6, line: 865, baseType: !22, size: 32, offset: 1248)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !238, file: !6, line: 866, baseType: !22, size: 32, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !238, file: !6, line: 867, baseType: !22, size: 32, offset: 1312)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !238, file: !6, line: 868, baseType: !56, size: 16, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !238, file: !6, line: 869, baseType: !32, size: 8, offset: 1360)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !238, file: !6, line: 870, baseType: !32, size: 8, offset: 1368)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !238, file: !6, line: 871, baseType: !32, size: 8, offset: 1376)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !238, file: !6, line: 872, baseType: !275, size: 160, offset: 1384)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 160, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 20)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !190, file: !6, line: 900, baseType: !98, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !190, file: !6, line: 901, baseType: !280, size: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !282)
!282 = !{!283, !291, !304, !313, !322, !335, !349, !361, !373}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !281, file: !6, line: 664, baseType: !284, size: 128)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !285)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !6, line: 568, baseType: !31, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !284, file: !6, line: 568, baseType: !32, size: 8, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !284, file: !6, line: 568, baseType: !32, size: 8, offset: 72)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !6, line: 568, baseType: !56, size: 16, offset: 80)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !284, file: !6, line: 568, baseType: !56, size: 16, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !281, file: !6, line: 665, baseType: !292, size: 384)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !6, line: 594, baseType: !31, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !292, file: !6, line: 594, baseType: !32, size: 8, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !6, line: 594, baseType: !32, size: 8, offset: 72)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !292, file: !6, line: 594, baseType: !56, size: 16, offset: 80)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !6, line: 594, baseType: !56, size: 16, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !292, file: !6, line: 594, baseType: !56, size: 16, offset: 112)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !292, file: !6, line: 595, baseType: !198, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !292, file: !6, line: 596, baseType: !35, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !292, file: !6, line: 597, baseType: !35, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !292, file: !6, line: 598, baseType: !27, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !281, file: !6, line: 666, baseType: !305, size: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !6, line: 574, baseType: !31, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !305, file: !6, line: 574, baseType: !32, size: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !6, line: 574, baseType: !32, size: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !6, line: 574, baseType: !56, size: 16, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !305, file: !6, line: 574, baseType: !56, size: 16, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !305, file: !6, line: 574, baseType: !52, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !281, file: !6, line: 667, baseType: !314, size: 192)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !6, line: 605, baseType: !31, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !314, file: !6, line: 605, baseType: !32, size: 8, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !6, line: 605, baseType: !32, size: 8, offset: 72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !314, file: !6, line: 605, baseType: !56, size: 16, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !6, line: 605, baseType: !56, size: 16, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !314, file: !6, line: 605, baseType: !98, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !281, file: !6, line: 668, baseType: !323, size: 448)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !6, line: 609, baseType: !31, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !323, file: !6, line: 609, baseType: !32, size: 8, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !323, file: !6, line: 609, baseType: !32, size: 8, offset: 72)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !323, file: !6, line: 609, baseType: !56, size: 16, offset: 80)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !323, file: !6, line: 609, baseType: !56, size: 16, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !323, file: !6, line: 609, baseType: !22, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !323, file: !6, line: 610, baseType: !198, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !323, file: !6, line: 611, baseType: !35, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !323, file: !6, line: 612, baseType: !35, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !323, file: !6, line: 613, baseType: !22, size: 32, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !281, file: !6, line: 669, baseType: !336, size: 512)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !336, file: !6, line: 581, baseType: !31, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !336, file: !6, line: 581, baseType: !32, size: 8, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !336, file: !6, line: 581, baseType: !32, size: 8, offset: 72)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !336, file: !6, line: 581, baseType: !56, size: 16, offset: 80)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !336, file: !6, line: 581, baseType: !56, size: 16, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !336, file: !6, line: 581, baseType: !22, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !336, file: !6, line: 582, baseType: !52, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !336, file: !6, line: 583, baseType: !52, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !336, file: !6, line: 584, baseType: !164, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !336, file: !6, line: 585, baseType: !31, size: 64, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !336, file: !6, line: 586, baseType: !22, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !281, file: !6, line: 670, baseType: !350, size: 320)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !6, line: 621, baseType: !31, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !350, file: !6, line: 621, baseType: !32, size: 8, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !6, line: 621, baseType: !32, size: 8, offset: 72)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !6, line: 621, baseType: !56, size: 16, offset: 80)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !350, file: !6, line: 621, baseType: !56, size: 16, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !350, file: !6, line: 621, baseType: !32, size: 8, offset: 112)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !350, file: !6, line: 622, baseType: !164, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !350, file: !6, line: 623, baseType: !52, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !350, file: !6, line: 624, baseType: !27, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !281, file: !6, line: 671, baseType: !362, size: 640)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !6, line: 632, baseType: !31, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !362, file: !6, line: 632, baseType: !32, size: 8, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !362, file: !6, line: 632, baseType: !32, size: 8, offset: 72)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !362, file: !6, line: 632, baseType: !56, size: 16, offset: 80)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !362, file: !6, line: 632, baseType: !56, size: 16, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !362, file: !6, line: 633, baseType: !370, size: 512, offset: 128)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 8)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !281, file: !6, line: 672, baseType: !374, size: 320)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !6, line: 655, baseType: !31, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !374, file: !6, line: 655, baseType: !32, size: 8, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !374, file: !6, line: 655, baseType: !32, size: 8, offset: 72)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !374, file: !6, line: 655, baseType: !56, size: 16, offset: 80)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !374, file: !6, line: 655, baseType: !56, size: 16, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !374, file: !6, line: 655, baseType: !32, size: 8, offset: 112)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !374, file: !6, line: 656, baseType: !98, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !374, file: !6, line: 657, baseType: !52, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !374, file: !6, line: 658, baseType: !385, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !387)
!387 = !{!388, !394}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !386, file: !6, line: 646, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !21, line: 1052, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !393, !22, !31}
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !21, line: 424, baseType: !31)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !386, file: !6, line: 647, baseType: !31, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !190, file: !6, line: 902, baseType: !198, size: 64, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !190, file: !6, line: 903, baseType: !22, size: 32, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !165, file: !166, line: 61, baseType: !22, size: 32, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !165, file: !166, line: 62, baseType: !22, size: 32, offset: 1120)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !165, file: !166, line: 63, baseType: !56, size: 16, offset: 1152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !165, file: !166, line: 64, baseType: !32, size: 8, offset: 1168)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !165, file: !166, line: 66, baseType: !402, size: 2688, offset: 1216)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 2688, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 7)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !165, file: !166, line: 67, baseType: !406, size: 3072, offset: 3904)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 3072, elements: !371)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !165, file: !166, line: 68, baseType: !408, size: 576, offset: 6976)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 576, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 9)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !165, file: !166, line: 69, baseType: !129, size: 64, offset: 7552)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !165, file: !166, line: 71, baseType: !35, size: 64, offset: 7616)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !165, file: !166, line: 72, baseType: !129, size: 64, offset: 7680)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !165, file: !166, line: 73, baseType: !280, size: 64, offset: 7744)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !165, file: !166, line: 74, baseType: !98, size: 64, offset: 7808)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !165, file: !166, line: 75, baseType: !52, size: 64, offset: 7872)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !165, file: !166, line: 76, baseType: !98, size: 64, offset: 7936)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !165, file: !166, line: 77, baseType: !198, size: 64, offset: 8000)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !165, file: !166, line: 78, baseType: !52, size: 64, offset: 8064)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !165, file: !166, line: 79, baseType: !98, size: 64, offset: 8128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !165, file: !166, line: 80, baseType: !82, size: 64, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !165, file: !166, line: 81, baseType: !198, size: 64, offset: 8256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !165, file: !166, line: 82, baseType: !424, size: 64, offset: 8320)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !426, file: !6, line: 706, baseType: !22, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !426, file: !6, line: 707, baseType: !22, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !426, file: !6, line: 708, baseType: !56, size: 16, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !426, file: !6, line: 709, baseType: !32, size: 8, offset: 80)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !426, file: !6, line: 710, baseType: !32, size: 8, offset: 88)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !426, file: !6, line: 711, baseType: !32, size: 8, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !165, file: !166, line: 83, baseType: !198, size: 64, offset: 8384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !165, file: !166, line: 84, baseType: !52, size: 64, offset: 8448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !165, file: !166, line: 85, baseType: !280, size: 64, offset: 8512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !165, file: !166, line: 86, baseType: !52, size: 64, offset: 8576)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !165, file: !166, line: 87, baseType: !280, size: 64, offset: 8640)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !165, file: !166, line: 88, baseType: !198, size: 64, offset: 8704)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !165, file: !166, line: 89, baseType: !198, size: 64, offset: 8768)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !165, file: !166, line: 90, baseType: !442, size: 64, offset: 8832)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !165, file: !166, line: 91, baseType: !444, size: 64, offset: 8896)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{!20, !164, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !165, file: !166, line: 92, baseType: !450, size: 64, offset: 8960)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !161)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !157, file: !38, line: 152, baseType: !52, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !143, file: !38, line: 155, baseType: !22, size: 32, offset: 384)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !143, file: !38, line: 156, baseType: !118, size: 16, offset: 416)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !143, file: !38, line: 157, baseType: !32, size: 8, offset: 432)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !46, file: !38, line: 375, baseType: !456, size: 576)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !38, line: 122, size: 576, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !456, file: !38, line: 123, baseType: !52, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !456, file: !38, line: 123, baseType: !32, size: 8, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !456, file: !38, line: 123, baseType: !32, size: 8, offset: 72)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !456, file: !38, line: 123, baseType: !56, size: 16, offset: 80)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !456, file: !38, line: 123, baseType: !32, size: 8, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !456, file: !38, line: 123, baseType: !32, size: 8, offset: 104)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !456, file: !38, line: 124, baseType: !56, size: 16, offset: 112)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !456, file: !38, line: 125, baseType: !31, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !456, file: !38, line: 126, baseType: !27, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !456, file: !38, line: 127, baseType: !442, size: 64, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !38, line: 128, baseType: !52, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !38, line: 129, baseType: !52, size: 64, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !456, file: !38, line: 130, baseType: !98, size: 64, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !456, file: !38, line: 131, baseType: !32, size: 8, offset: 512)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !46, file: !38, line: 376, baseType: !473, size: 448)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !38, line: 134, size: 448, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !473, file: !38, line: 135, baseType: !52, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !473, file: !38, line: 135, baseType: !32, size: 8, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !38, line: 135, baseType: !32, size: 8, offset: 72)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !473, file: !38, line: 135, baseType: !56, size: 16, offset: 80)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !38, line: 135, baseType: !32, size: 8, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !473, file: !38, line: 135, baseType: !32, size: 8, offset: 104)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !38, line: 136, baseType: !98, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !473, file: !38, line: 137, baseType: !52, size: 64, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !38, line: 138, baseType: !52, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !473, file: !38, line: 139, baseType: !485, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !21, line: 129, baseType: !27)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !473, file: !38, line: 140, baseType: !22, size: 32, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !46, file: !38, line: 377, baseType: !488, size: 320)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !38, line: 184, size: 320, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !499}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !488, file: !38, line: 185, baseType: !52, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !488, file: !38, line: 185, baseType: !32, size: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !38, line: 185, baseType: !32, size: 8, offset: 72)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !488, file: !38, line: 185, baseType: !56, size: 16, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !488, file: !38, line: 185, baseType: !32, size: 8, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !488, file: !38, line: 185, baseType: !496, size: 128, offset: 128)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 2)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !488, file: !38, line: 185, baseType: !52, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !46, file: !38, line: 378, baseType: !501, size: 384)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !38, line: 187, size: 384, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !501, file: !38, line: 188, baseType: !52, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !501, file: !38, line: 188, baseType: !32, size: 8, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !38, line: 188, baseType: !32, size: 8, offset: 72)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !501, file: !38, line: 188, baseType: !56, size: 16, offset: 80)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !501, file: !38, line: 188, baseType: !32, size: 8, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !501, file: !38, line: 189, baseType: !496, size: 128, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !501, file: !38, line: 189, baseType: !52, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !501, file: !38, line: 189, baseType: !511, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !513)
!513 = !{!514, !515, !516, !517, !525, !540, !572, !573, !574, !575, !576, !577}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !512, file: !6, line: 481, baseType: !98, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !512, file: !6, line: 482, baseType: !511, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !6, line: 483, baseType: !511, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !512, file: !6, line: 484, baseType: !518, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !519, file: !6, line: 498, baseType: !518, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !519, file: !6, line: 499, baseType: !518, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !519, file: !6, line: 500, baseType: !511, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !519, file: !6, line: 501, baseType: !22, size: 32, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !512, file: !6, line: 485, baseType: !526, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !528)
!528 = !{!529, !534, !535, !536, !537, !538, !539}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !527, file: !6, line: 467, baseType: !530, size: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !530, file: !6, line: 460, baseType: !32, size: 8)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !530, file: !6, line: 461, baseType: !27, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !527, file: !6, line: 468, baseType: !530, size: 128, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !527, file: !6, line: 469, baseType: !56, size: 16, offset: 256)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !527, file: !6, line: 470, baseType: !32, size: 8, offset: 272)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !527, file: !6, line: 471, baseType: !32, size: 8, offset: 280)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !527, file: !6, line: 472, baseType: !32, size: 8, offset: 288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !527, file: !6, line: 473, baseType: !32, size: 8, offset: 296)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !512, file: !6, line: 486, baseType: !541, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !543)
!543 = !{!544, !567, !568, !569, !570, !571}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !542, file: !6, line: 449, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !546)
!546 = !{!547, !548, !561}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !545, file: !6, line: 439, baseType: !98, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !545, file: !6, line: 440, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !551)
!551 = !{!552, !557, !558, !559, !560}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !550, file: !6, line: 420, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !21, line: 1049, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!22, !393, !22, !31}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !550, file: !6, line: 421, baseType: !31, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !550, file: !6, line: 422, baseType: !98, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !550, file: !6, line: 423, baseType: !32, size: 8, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !550, file: !6, line: 424, baseType: !32, size: 8, offset: 200)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !545, file: !6, line: 441, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !563, file: !6, line: 430, baseType: !98, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !563, file: !6, line: 431, baseType: !562, size: 64, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !542, file: !6, line: 450, baseType: !526, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !542, file: !6, line: 451, baseType: !32, size: 8, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !542, file: !6, line: 452, baseType: !32, size: 8, offset: 136)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !542, file: !6, line: 453, baseType: !32, size: 8, offset: 144)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !542, file: !6, line: 454, baseType: !32, size: 8, offset: 152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !512, file: !6, line: 487, baseType: !27, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !512, file: !6, line: 488, baseType: !22, size: 32, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !512, file: !6, line: 489, baseType: !56, size: 16, offset: 480)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !512, file: !6, line: 490, baseType: !56, size: 16, offset: 496)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !512, file: !6, line: 491, baseType: !32, size: 8, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !512, file: !6, line: 492, baseType: !32, size: 8, offset: 520)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !46, file: !38, line: 379, baseType: !579, size: 384)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !38, line: 192, size: 384, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !579, file: !38, line: 193, baseType: !52, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !579, file: !38, line: 193, baseType: !32, size: 8, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !38, line: 193, baseType: !32, size: 8, offset: 72)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !579, file: !38, line: 193, baseType: !56, size: 16, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !38, line: 193, baseType: !32, size: 8, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !579, file: !38, line: 193, baseType: !496, size: 128, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !579, file: !38, line: 193, baseType: !52, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !579, file: !38, line: 193, baseType: !22, size: 32, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !579, file: !38, line: 194, baseType: !22, size: 32, offset: 352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !46, file: !38, line: 380, baseType: !591, size: 384)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !38, line: 197, size: 384, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !591, file: !38, line: 198, baseType: !52, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !591, file: !38, line: 198, baseType: !32, size: 8, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !38, line: 198, baseType: !32, size: 8, offset: 72)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !591, file: !38, line: 198, baseType: !56, size: 16, offset: 80)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !591, file: !38, line: 198, baseType: !32, size: 8, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !591, file: !38, line: 200, baseType: !32, size: 8, offset: 104)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !591, file: !38, line: 201, baseType: !32, size: 8, offset: 112)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !591, file: !38, line: 202, baseType: !496, size: 128, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !591, file: !38, line: 202, baseType: !52, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !591, file: !38, line: 202, baseType: !603, size: 64, offset: 320)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !21, line: 128, baseType: !27)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !46, file: !38, line: 381, baseType: !605, size: 320)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !38, line: 205, size: 320, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !605, file: !38, line: 206, baseType: !52, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !605, file: !38, line: 206, baseType: !32, size: 8, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !38, line: 206, baseType: !32, size: 8, offset: 72)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !605, file: !38, line: 206, baseType: !56, size: 16, offset: 80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !38, line: 206, baseType: !32, size: 8, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !605, file: !38, line: 206, baseType: !496, size: 128, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !605, file: !38, line: 206, baseType: !52, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !46, file: !38, line: 382, baseType: !615, size: 384)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !38, line: 233, size: 384, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !615, file: !38, line: 234, baseType: !52, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 72)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !615, file: !38, line: 234, baseType: !56, size: 16, offset: 80)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 104)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 112)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 120)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !615, file: !38, line: 234, baseType: !98, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !615, file: !38, line: 234, baseType: !22, size: 32, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !615, file: !38, line: 234, baseType: !22, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !615, file: !38, line: 234, baseType: !22, size: 32, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !615, file: !38, line: 234, baseType: !32, size: 8, offset: 296)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !615, file: !38, line: 234, baseType: !52, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !46, file: !38, line: 383, baseType: !633, size: 576)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !38, line: 237, size: 576, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !633, file: !38, line: 238, baseType: !52, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 72)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !633, file: !38, line: 238, baseType: !56, size: 16, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 104)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 120)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !633, file: !38, line: 238, baseType: !98, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !633, file: !38, line: 238, baseType: !22, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !633, file: !38, line: 238, baseType: !22, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !633, file: !38, line: 238, baseType: !22, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !633, file: !38, line: 238, baseType: !32, size: 8, offset: 296)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !633, file: !38, line: 238, baseType: !56, size: 16, offset: 304)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !633, file: !38, line: 239, baseType: !52, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !633, file: !38, line: 240, baseType: !35, size: 64, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !633, file: !38, line: 241, baseType: !56, size: 16, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !633, file: !38, line: 242, baseType: !35, size: 64, offset: 512)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !46, file: !38, line: 384, baseType: !655, size: 384)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !38, line: 262, size: 384, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !655, file: !38, line: 263, baseType: !52, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 72)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !655, file: !38, line: 263, baseType: !56, size: 16, offset: 80)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 104)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !655, file: !38, line: 263, baseType: !98, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !655, file: !38, line: 263, baseType: !22, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !655, file: !38, line: 263, baseType: !22, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !655, file: !38, line: 263, baseType: !22, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 296)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !655, file: !38, line: 263, baseType: !32, size: 8, offset: 304)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !655, file: !38, line: 264, baseType: !52, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !46, file: !38, line: 385, baseType: !674, size: 448)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !38, line: 245, size: 448, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !674, file: !38, line: 246, baseType: !52, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 72)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !674, file: !38, line: 246, baseType: !56, size: 16, offset: 80)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 104)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 112)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 120)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !674, file: !38, line: 246, baseType: !98, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !674, file: !38, line: 246, baseType: !22, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !674, file: !38, line: 246, baseType: !22, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !674, file: !38, line: 246, baseType: !22, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !674, file: !38, line: 246, baseType: !32, size: 8, offset: 296)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !674, file: !38, line: 246, baseType: !52, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !674, file: !38, line: 247, baseType: !52, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !46, file: !38, line: 386, baseType: !693, size: 448)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !38, line: 250, size: 448, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !693, file: !38, line: 251, baseType: !52, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 72)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !693, file: !38, line: 251, baseType: !56, size: 16, offset: 80)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 104)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 112)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 120)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !693, file: !38, line: 251, baseType: !98, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !693, file: !38, line: 251, baseType: !22, size: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !693, file: !38, line: 251, baseType: !22, size: 32, offset: 224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !693, file: !38, line: 251, baseType: !22, size: 32, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !693, file: !38, line: 251, baseType: !32, size: 8, offset: 296)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !693, file: !38, line: 256, baseType: !52, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !693, file: !38, line: 257, baseType: !52, size: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !46, file: !38, line: 387, baseType: !712, size: 512)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !38, line: 273, size: 512, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !712, file: !38, line: 274, baseType: !52, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !712, file: !38, line: 274, baseType: !32, size: 8, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !38, line: 274, baseType: !32, size: 8, offset: 72)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !712, file: !38, line: 274, baseType: !56, size: 16, offset: 80)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !712, file: !38, line: 274, baseType: !32, size: 8, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !712, file: !38, line: 274, baseType: !98, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !712, file: !38, line: 275, baseType: !22, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !712, file: !38, line: 276, baseType: !389, size: 64, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !712, file: !38, line: 277, baseType: !31, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !38, line: 278, baseType: !496, size: 128, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !46, file: !38, line: 388, baseType: !725, size: 512)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !38, line: 281, size: 512, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !740, !741, !742, !748, !749}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !725, file: !38, line: 282, baseType: !52, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !725, file: !38, line: 282, baseType: !32, size: 8, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !38, line: 282, baseType: !32, size: 8, offset: 72)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !725, file: !38, line: 282, baseType: !56, size: 16, offset: 80)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !38, line: 282, baseType: !32, size: 8, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !725, file: !38, line: 282, baseType: !32, size: 8, offset: 104)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !725, file: !38, line: 283, baseType: !32, size: 8, offset: 112)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !725, file: !38, line: 284, baseType: !735, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !21, line: 1084, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!20, !22, !485, !22, !739, !31, !31}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !725, file: !38, line: 285, baseType: !98, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !725, file: !38, line: 286, baseType: !31, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !725, file: !38, line: 287, baseType: !743, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !21, line: 1102, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!20, !393, !22, !31, !747}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !725, file: !38, line: 288, baseType: !52, size: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !725, file: !38, line: 289, baseType: !52, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !46, file: !38, line: 389, baseType: !751, size: 512)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !38, line: 307, size: 512, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !751, file: !38, line: 308, baseType: !52, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !751, file: !38, line: 308, baseType: !32, size: 8, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !751, file: !38, line: 308, baseType: !32, size: 8, offset: 72)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !751, file: !38, line: 308, baseType: !56, size: 16, offset: 80)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !751, file: !38, line: 308, baseType: !32, size: 8, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !751, file: !38, line: 308, baseType: !32, size: 8, offset: 104)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !751, file: !38, line: 309, baseType: !32, size: 8, offset: 112)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !751, file: !38, line: 310, baseType: !32, size: 8, offset: 120)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !751, file: !38, line: 311, baseType: !31, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !751, file: !38, line: 312, baseType: !98, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !751, file: !38, line: 313, baseType: !129, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !751, file: !38, line: 314, baseType: !35, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !751, file: !38, line: 315, baseType: !35, size: 64, offset: 384)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !751, file: !38, line: 316, baseType: !22, size: 32, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !46, file: !38, line: 390, baseType: !768, size: 448)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !38, line: 340, size: 448, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !768, file: !38, line: 341, baseType: !52, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !768, file: !38, line: 341, baseType: !32, size: 8, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !38, line: 341, baseType: !32, size: 8, offset: 72)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !768, file: !38, line: 341, baseType: !56, size: 16, offset: 80)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !768, file: !38, line: 341, baseType: !32, size: 8, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !768, file: !38, line: 341, baseType: !98, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !768, file: !38, line: 342, baseType: !98, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !768, file: !38, line: 343, baseType: !31, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !768, file: !38, line: 344, baseType: !35, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !768, file: !38, line: 345, baseType: !22, size: 32, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !38, line: 391, baseType: !781, size: 256)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !38, line: 350, size: 256, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !781, file: !38, line: 351, baseType: !52, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !781, file: !38, line: 351, baseType: !32, size: 8, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !781, file: !38, line: 351, baseType: !32, size: 8, offset: 72)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !781, file: !38, line: 351, baseType: !56, size: 16, offset: 80)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !38, line: 351, baseType: !32, size: 8, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !781, file: !38, line: 351, baseType: !789, size: 64, offset: 128)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !21, line: 1055, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !393, !31}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !781, file: !38, line: 352, baseType: !31, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !46, file: !38, line: 392, baseType: !795, size: 192)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !38, line: 357, size: 192, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !795, file: !38, line: 358, baseType: !52, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !795, file: !38, line: 358, baseType: !32, size: 8, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !795, file: !38, line: 358, baseType: !32, size: 8, offset: 72)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !795, file: !38, line: 358, baseType: !56, size: 16, offset: 80)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !38, line: 358, baseType: !32, size: 8, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !38, line: 358, baseType: !52, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !46, file: !38, line: 399, baseType: !99, size: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !37, file: !38, line: 435, baseType: !99, size: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !37, file: !38, line: 436, baseType: !199, size: 1600)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !807, line: 148, baseType: !7)
!807 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!808 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!809 = !{!0}
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 72, elements: !409)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!812 = !{!"rsp"}
!813 = !{i32 7, !"Dwarf Version", i32 4}
!814 = !{i32 2, !"Debug Info Version", i32 3}
!815 = !{i32 1, !"wchar_size", i32 2}
!816 = !{i32 1, !"Code Model", i32 2}
!817 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!818 = distinct !DISubprogram(name: "acpi_ns_root_initialize", scope: !3, file: !3, line: 34, type: !819, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{!20}
!821 = !{}
!822 = !DILocalVariable(name: "status", scope: !818, file: !3, line: 36, type: !20)
!823 = !DILocation(line: 36, column: 14, scope: !818)
!824 = !DILocalVariable(name: "init_val", scope: !818, file: !3, line: 37, type: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_predefined_names", file: !21, line: 985, size: 192, elements: !828)
!828 = !{!829, !831, !832}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !21, line: 986, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !827, file: !21, line: 987, baseType: !32, size: 8, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !827, file: !21, line: 988, baseType: !82, size: 64, offset: 128)
!833 = !DILocation(line: 37, column: 38, scope: !818)
!834 = !DILocalVariable(name: "new_node", scope: !818, file: !3, line: 38, type: !98)
!835 = !DILocation(line: 38, column: 30, scope: !818)
!836 = !DILocalVariable(name: "prev_node", scope: !818, file: !3, line: 39, type: !98)
!837 = !DILocation(line: 39, column: 30, scope: !818)
!838 = !DILocalVariable(name: "obj_desc", scope: !818, file: !3, line: 40, type: !52)
!839 = !DILocation(line: 40, column: 29, scope: !818)
!840 = !DILocalVariable(name: "val", scope: !818, file: !3, line: 41, type: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_string", file: !21, line: 423, baseType: !82)
!842 = !DILocation(line: 41, column: 14, scope: !818)
!843 = !DILocation(line: 45, column: 11, scope: !818)
!844 = !DILocation(line: 45, column: 9, scope: !818)
!845 = !DILocation(line: 46, column: 6, scope: !846)
!846 = distinct !DILexicalBlock(scope: !818, file: !3, line: 46, column: 6)
!847 = !DILocation(line: 46, column: 6, scope: !818)
!848 = !DILocation(line: 47, column: 3, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !3, line: 46, column: 28)
!850 = !DILocation(line: 54, column: 6, scope: !851)
!851 = distinct !DILexicalBlock(scope: !818, file: !3, line: 54, column: 6)
!852 = !DILocation(line: 54, column: 6, scope: !818)
!853 = !DILocation(line: 55, column: 10, scope: !854)
!854 = distinct !DILexicalBlock(scope: !851, file: !3, line: 54, column: 26)
!855 = !DILocation(line: 56, column: 3, scope: !854)
!856 = !DILocation(line: 63, column: 21, scope: !818)
!857 = !DILocation(line: 85, column: 16, scope: !858)
