; ModuleID = '../bcout/drivers/acpi/acpica/nsinit.llvm.bc'
source_filename = "drivers/acpi/acpica/nsinit.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 18, type: !913, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !912, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsinit.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !16, !17, !18, !23, !25, !26, !789, !791, !792, !811, !911}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !19, line: 23, baseType: !20)
!19 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !21, line: 31, baseType: !22)
!21 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !19, line: 21, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !21, line: 27, baseType: !7)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !23)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !28, line: 133, size: 384, elements: !29)
!28 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!29 = !{!30, !776, !777, !778, !779, !785, !786, !787, !788}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !27, file: !28, line: 134, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !33, line: 367, size: 576, elements: !34)
!33 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!34 = !{!35, !49, !62, !74, !88, !102, !111, !427, !444, !459, !472, !550, !562, !576, !586, !604, !626, !645, !664, !683, !696, !722, !739, !752, !766, !775}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !32, file: !33, line: 368, baseType: !36, size: 128)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !33, line: 73, size: 128, elements: !37)
!37 = !{!38, !39, !43, !44, !48}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !36, file: !33, line: 74, baseType: !31, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !36, file: !33, line: 74, baseType: !40, size: 8, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !19, line: 17, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !21, line: 21, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !33, line: 74, baseType: !40, size: 8, offset: 72)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !36, file: !33, line: 74, baseType: !45, size: 16, offset: 80)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !19, line: 19, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !21, line: 24, baseType: !47)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !33, line: 74, baseType: !40, size: 8, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !32, file: !33, line: 369, baseType: !50, size: 192)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !33, line: 76, size: 192, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !61}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !50, file: !33, line: 77, baseType: !31, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !50, file: !33, line: 77, baseType: !40, size: 8, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !33, line: 77, baseType: !40, size: 8, offset: 72)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !50, file: !33, line: 77, baseType: !45, size: 16, offset: 80)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !50, file: !33, line: 77, baseType: !40, size: 8, offset: 96)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !50, file: !33, line: 77, baseType: !58, size: 24, offset: 104)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 24, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 3)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !50, file: !33, line: 78, baseType: !18, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !32, file: !33, line: 370, baseType: !63, size: 256)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !33, line: 93, size: 256, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !73}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !63, file: !33, line: 94, baseType: !31, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !63, file: !33, line: 94, baseType: !40, size: 8, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !33, line: 94, baseType: !40, size: 8, offset: 72)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !63, file: !33, line: 94, baseType: !45, size: 16, offset: 80)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !33, line: 94, baseType: !40, size: 8, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !63, file: !33, line: 94, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !63, file: !33, line: 94, baseType: !23, size: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !32, file: !33, line: 371, baseType: !75, size: 384)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !33, line: 97, size: 384, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !84, !85, !86, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !75, file: !33, line: 98, baseType: !31, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !75, file: !33, line: 98, baseType: !40, size: 8, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !33, line: 98, baseType: !40, size: 8, offset: 72)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !75, file: !33, line: 98, baseType: !45, size: 16, offset: 80)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !33, line: 98, baseType: !40, size: 8, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !75, file: !33, line: 98, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !75, file: !33, line: 98, baseType: !23, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !75, file: !33, line: 99, baseType: !23, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !75, file: !33, line: 100, baseType: !83, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !75, file: !33, line: 101, baseType: !26, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !32, file: !33, line: 372, baseType: !89, size: 384)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !33, line: 104, size: 384, elements: !90)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !99, !100, !101}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !89, file: !33, line: 105, baseType: !31, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !89, file: !33, line: 105, baseType: !40, size: 8, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !33, line: 105, baseType: !40, size: 8, offset: 72)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !89, file: !33, line: 105, baseType: !45, size: 16, offset: 80)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !33, line: 105, baseType: !40, size: 8, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !89, file: !33, line: 105, baseType: !26, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !89, file: !33, line: 106, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !89, file: !33, line: 107, baseType: !83, size: 64, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !89, file: !33, line: 108, baseType: !23, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !89, file: !33, line: 109, baseType: !23, size: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !32, file: !33, line: 373, baseType: !103, size: 192)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !33, line: 118, size: 192, elements: !104)
!104 = !{!105, !106, !107, !108, !109, !110}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !103, file: !33, line: 119, baseType: !31, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !103, file: !33, line: 119, baseType: !40, size: 8, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !103, file: !33, line: 119, baseType: !40, size: 8, offset: 72)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !103, file: !33, line: 119, baseType: !45, size: 16, offset: 80)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !103, file: !33, line: 119, baseType: !40, size: 8, offset: 96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !103, file: !33, line: 119, baseType: !16, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !32, file: !33, line: 374, baseType: !112, size: 448)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !33, line: 143, size: 448, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !424, !425, !426}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !112, file: !33, line: 144, baseType: !31, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !112, file: !33, line: 144, baseType: !40, size: 8, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !33, line: 144, baseType: !40, size: 8, offset: 72)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !112, file: !33, line: 144, baseType: !45, size: 16, offset: 80)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !33, line: 144, baseType: !40, size: 8, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !112, file: !33, line: 144, baseType: !40, size: 8, offset: 104)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !112, file: !33, line: 145, baseType: !40, size: 8, offset: 112)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !112, file: !33, line: 146, baseType: !40, size: 8, offset: 120)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !112, file: !33, line: 147, baseType: !31, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !112, file: !33, line: 148, baseType: !31, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !112, file: !33, line: 149, baseType: !83, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !112, file: !33, line: 153, baseType: !126, size: 64, offset: 320)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !112, file: !33, line: 150, size: 64, elements: !127)
!127 = !{!128, !423}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !126, file: !33, line: 151, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !28, line: 248, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DISubroutineType(types: !132)
!132 = !{!25, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !135, line: 37, size: 9024, elements: !136)
!135 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !369, !370, !371, !372, !373, !377, !379, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !406, !407, !408, !409, !410, !411, !412, !413, !415, !421}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !134, file: !135, line: 38, baseType: !133, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !134, file: !135, line: 39, baseType: !40, size: 8, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !134, file: !135, line: 40, baseType: !40, size: 8, offset: 72)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !134, file: !135, line: 41, baseType: !45, size: 16, offset: 80)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !134, file: !135, line: 42, baseType: !40, size: 8, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !134, file: !135, line: 43, baseType: !40, size: 8, offset: 104)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !134, file: !135, line: 44, baseType: !40, size: 8, offset: 112)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !134, file: !135, line: 45, baseType: !145, size: 16, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !45)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !134, file: !135, line: 46, baseType: !40, size: 8, offset: 144)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !134, file: !135, line: 47, baseType: !40, size: 8, offset: 152)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !134, file: !135, line: 48, baseType: !40, size: 8, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !134, file: !135, line: 49, baseType: !40, size: 8, offset: 168)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !134, file: !135, line: 50, baseType: !40, size: 8, offset: 176)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !134, file: !135, line: 51, baseType: !40, size: 8, offset: 184)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !134, file: !135, line: 52, baseType: !40, size: 8, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !134, file: !135, line: 53, baseType: !40, size: 8, offset: 200)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !134, file: !135, line: 54, baseType: !83, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !134, file: !135, line: 55, baseType: !23, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !134, file: !135, line: 56, baseType: !23, size: 32, offset: 352)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !134, file: !135, line: 57, baseType: !23, size: 32, offset: 384)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !134, file: !135, line: 58, baseType: !23, size: 32, offset: 416)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !134, file: !135, line: 60, baseType: !160, size: 640, offset: 448)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !28, line: 893, size: 640, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !251, !252, !367, !368}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !160, file: !28, line: 894, baseType: !83, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !160, file: !28, line: 895, baseType: !83, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !160, file: !28, line: 896, baseType: !83, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !160, file: !28, line: 897, baseType: !83, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !160, file: !28, line: 898, baseType: !83, size: 64, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !160, file: !28, line: 899, baseType: !168, size: 64, offset: 320)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !28, line: 875, size: 1600, elements: !170)
!170 = !{!171, !191, !207}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !169, file: !28, line: 876, baseType: !172, size: 448)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !28, line: 828, size: 448, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181, !190}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !172, file: !28, line: 829, baseType: !168, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !172, file: !28, line: 829, baseType: !40, size: 8, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !28, line: 829, baseType: !40, size: 8, offset: 72)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !172, file: !28, line: 829, baseType: !45, size: 16, offset: 80)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !172, file: !28, line: 829, baseType: !83, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !28, line: 829, baseType: !168, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !172, file: !28, line: 829, baseType: !26, size: 64, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !172, file: !28, line: 829, baseType: !182, size: 64, offset: 320)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !28, line: 716, size: 64, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !182, file: !28, line: 717, baseType: !18, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !182, file: !28, line: 718, baseType: !23, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !182, file: !28, line: 719, baseType: !71, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !182, file: !28, line: 720, baseType: !83, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !182, file: !28, line: 721, baseType: !71, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !182, file: !28, line: 722, baseType: !168, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !172, file: !28, line: 829, baseType: !40, size: 8, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !169, file: !28, line: 877, baseType: !192, size: 640)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !28, line: 835, size: 640, elements: !193)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !192, file: !28, line: 836, baseType: !168, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !192, file: !28, line: 836, baseType: !40, size: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !192, file: !28, line: 836, baseType: !40, size: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !192, file: !28, line: 836, baseType: !45, size: 16, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !192, file: !28, line: 836, baseType: !83, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !28, line: 836, baseType: !168, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !192, file: !28, line: 836, baseType: !26, size: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !192, file: !28, line: 836, baseType: !182, size: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !192, file: !28, line: 836, baseType: !40, size: 8, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !192, file: !28, line: 836, baseType: !71, size: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !192, file: !28, line: 837, baseType: !83, size: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !192, file: !28, line: 838, baseType: !23, size: 32, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !192, file: !28, line: 839, baseType: !23, size: 32, offset: 608)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !169, file: !28, line: 878, baseType: !208, size: 1600)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !28, line: 846, size: 1600, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !208, file: !28, line: 847, baseType: !168, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !208, file: !28, line: 847, baseType: !40, size: 8, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !208, file: !28, line: 847, baseType: !40, size: 8, offset: 72)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !208, file: !28, line: 847, baseType: !45, size: 16, offset: 80)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !208, file: !28, line: 847, baseType: !83, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !28, line: 847, baseType: !168, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !208, file: !28, line: 847, baseType: !26, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !208, file: !28, line: 847, baseType: !182, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !208, file: !28, line: 847, baseType: !40, size: 8, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !208, file: !28, line: 847, baseType: !168, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !208, file: !28, line: 848, baseType: !168, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !208, file: !28, line: 849, baseType: !71, size: 64, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !208, file: !28, line: 850, baseType: !40, size: 8, offset: 640)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !208, file: !28, line: 851, baseType: !71, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !208, file: !28, line: 852, baseType: !71, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !208, file: !28, line: 853, baseType: !71, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !208, file: !28, line: 854, baseType: !227, size: 32, offset: 896)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 32, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 4)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !208, file: !28, line: 855, baseType: !23, size: 32, offset: 928)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !208, file: !28, line: 856, baseType: !23, size: 32, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !208, file: !28, line: 857, baseType: !23, size: 32, offset: 992)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !208, file: !28, line: 858, baseType: !23, size: 32, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !208, file: !28, line: 859, baseType: !23, size: 32, offset: 1056)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !208, file: !28, line: 860, baseType: !23, size: 32, offset: 1088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !208, file: !28, line: 861, baseType: !23, size: 32, offset: 1120)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !208, file: !28, line: 862, baseType: !23, size: 32, offset: 1152)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !208, file: !28, line: 863, baseType: !23, size: 32, offset: 1184)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !208, file: !28, line: 864, baseType: !23, size: 32, offset: 1216)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !208, file: !28, line: 865, baseType: !23, size: 32, offset: 1248)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !208, file: !28, line: 866, baseType: !23, size: 32, offset: 1280)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !208, file: !28, line: 867, baseType: !23, size: 32, offset: 1312)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !208, file: !28, line: 868, baseType: !45, size: 16, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !208, file: !28, line: 869, baseType: !40, size: 8, offset: 1360)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !208, file: !28, line: 870, baseType: !40, size: 8, offset: 1368)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !208, file: !28, line: 871, baseType: !40, size: 8, offset: 1376)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !208, file: !28, line: 872, baseType: !248, size: 160, offset: 1384)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 160, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 20)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !160, file: !28, line: 900, baseType: !26, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !160, file: !28, line: 901, baseType: !253, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !28, line: 663, size: 640, elements: !255)
!255 = !{!256, !264, !277, !286, !295, !308, !322, !334, !346}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !254, file: !28, line: 664, baseType: !257, size: 128)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !28, line: 567, size: 128, elements: !258)
!258 = !{!259, !260, !261, !262, !263}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !28, line: 568, baseType: !16, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !257, file: !28, line: 568, baseType: !40, size: 8, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !28, line: 568, baseType: !40, size: 8, offset: 72)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !257, file: !28, line: 568, baseType: !45, size: 16, offset: 80)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !257, file: !28, line: 568, baseType: !45, size: 16, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !254, file: !28, line: 665, baseType: !265, size: 384)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !28, line: 593, size: 384, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !28, line: 594, baseType: !16, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !265, file: !28, line: 594, baseType: !40, size: 8, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !28, line: 594, baseType: !40, size: 8, offset: 72)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !28, line: 594, baseType: !45, size: 16, offset: 80)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !265, file: !28, line: 594, baseType: !45, size: 16, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !265, file: !28, line: 594, baseType: !45, size: 16, offset: 112)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !265, file: !28, line: 595, baseType: !168, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !265, file: !28, line: 596, baseType: !83, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !265, file: !28, line: 597, baseType: !83, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !265, file: !28, line: 598, baseType: !18, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !254, file: !28, line: 666, baseType: !278, size: 192)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !28, line: 573, size: 192, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !28, line: 574, baseType: !16, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !278, file: !28, line: 574, baseType: !40, size: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !278, file: !28, line: 574, baseType: !40, size: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !278, file: !28, line: 574, baseType: !45, size: 16, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !278, file: !28, line: 574, baseType: !45, size: 16, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !278, file: !28, line: 574, baseType: !31, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !254, file: !28, line: 667, baseType: !287, size: 192)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !28, line: 604, size: 192, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !28, line: 605, baseType: !16, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !28, line: 605, baseType: !40, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !28, line: 605, baseType: !40, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !28, line: 605, baseType: !45, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !28, line: 605, baseType: !45, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !287, file: !28, line: 605, baseType: !26, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !254, file: !28, line: 668, baseType: !296, size: 448)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !28, line: 608, size: 448, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !28, line: 609, baseType: !16, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !296, file: !28, line: 609, baseType: !40, size: 8, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !28, line: 609, baseType: !40, size: 8, offset: 72)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !28, line: 609, baseType: !45, size: 16, offset: 80)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !28, line: 609, baseType: !45, size: 16, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !296, file: !28, line: 609, baseType: !23, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !296, file: !28, line: 610, baseType: !168, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !296, file: !28, line: 611, baseType: !83, size: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !296, file: !28, line: 612, baseType: !83, size: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !296, file: !28, line: 613, baseType: !23, size: 32, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !254, file: !28, line: 669, baseType: !309, size: 512)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !28, line: 580, size: 512, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !28, line: 581, baseType: !16, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !309, file: !28, line: 581, baseType: !40, size: 8, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !28, line: 581, baseType: !40, size: 8, offset: 72)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !309, file: !28, line: 581, baseType: !45, size: 16, offset: 80)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !309, file: !28, line: 581, baseType: !45, size: 16, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !309, file: !28, line: 581, baseType: !23, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !309, file: !28, line: 582, baseType: !31, size: 64, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !309, file: !28, line: 583, baseType: !31, size: 64, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !309, file: !28, line: 584, baseType: !133, size: 64, offset: 320)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !309, file: !28, line: 585, baseType: !16, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !309, file: !28, line: 586, baseType: !23, size: 32, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !254, file: !28, line: 670, baseType: !323, size: 320)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !28, line: 620, size: 320, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !28, line: 621, baseType: !16, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !323, file: !28, line: 621, baseType: !40, size: 8, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !323, file: !28, line: 621, baseType: !40, size: 8, offset: 72)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !323, file: !28, line: 621, baseType: !45, size: 16, offset: 80)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !323, file: !28, line: 621, baseType: !45, size: 16, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !323, file: !28, line: 621, baseType: !40, size: 8, offset: 112)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !323, file: !28, line: 622, baseType: !133, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !323, file: !28, line: 623, baseType: !31, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !323, file: !28, line: 624, baseType: !18, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !254, file: !28, line: 671, baseType: !335, size: 640)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !28, line: 631, size: 640, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !335, file: !28, line: 632, baseType: !16, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !335, file: !28, line: 632, baseType: !40, size: 8, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !28, line: 632, baseType: !40, size: 8, offset: 72)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !335, file: !28, line: 632, baseType: !45, size: 16, offset: 80)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !28, line: 632, baseType: !45, size: 16, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !335, file: !28, line: 633, baseType: !343, size: 512, offset: 128)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 512, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !254, file: !28, line: 672, baseType: !347, size: 320)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !28, line: 654, size: 320, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !28, line: 655, baseType: !16, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !347, file: !28, line: 655, baseType: !40, size: 8, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !347, file: !28, line: 655, baseType: !40, size: 8, offset: 72)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !28, line: 655, baseType: !45, size: 16, offset: 80)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !347, file: !28, line: 655, baseType: !45, size: 16, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !347, file: !28, line: 655, baseType: !40, size: 8, offset: 112)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !347, file: !28, line: 656, baseType: !26, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !347, file: !28, line: 657, baseType: !31, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !347, file: !28, line: 658, baseType: !358, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !28, line: 645, size: 128, elements: !360)
!360 = !{!361, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !359, file: !28, line: 646, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !14, !23, !16}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !359, file: !28, line: 647, baseType: !16, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !160, file: !28, line: 902, baseType: !168, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !160, file: !28, line: 903, baseType: !23, size: 32, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !134, file: !135, line: 61, baseType: !23, size: 32, offset: 1088)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !134, file: !135, line: 62, baseType: !23, size: 32, offset: 1120)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !134, file: !135, line: 63, baseType: !45, size: 16, offset: 1152)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !134, file: !135, line: 64, baseType: !40, size: 8, offset: 1168)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !134, file: !135, line: 66, baseType: !374, size: 2688, offset: 1216)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2688, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 7)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !134, file: !135, line: 67, baseType: !378, size: 3072, offset: 3904)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 3072, elements: !344)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !134, file: !135, line: 68, baseType: !380, size: 576, offset: 6976)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 576, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 9)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !134, file: !135, line: 69, baseType: !98, size: 64, offset: 7552)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !134, file: !135, line: 71, baseType: !83, size: 64, offset: 7616)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !134, file: !135, line: 72, baseType: !98, size: 64, offset: 7680)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !134, file: !135, line: 73, baseType: !253, size: 64, offset: 7744)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !134, file: !135, line: 74, baseType: !26, size: 64, offset: 7808)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !134, file: !135, line: 75, baseType: !31, size: 64, offset: 7872)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !134, file: !135, line: 76, baseType: !26, size: 64, offset: 7936)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !134, file: !135, line: 77, baseType: !168, size: 64, offset: 8000)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !134, file: !135, line: 78, baseType: !31, size: 64, offset: 8064)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !134, file: !135, line: 79, baseType: !26, size: 64, offset: 8128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !134, file: !135, line: 80, baseType: !71, size: 64, offset: 8192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !134, file: !135, line: 81, baseType: !168, size: 64, offset: 8256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !134, file: !135, line: 82, baseType: !396, size: 64, offset: 8320)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !28, line: 702, size: 128, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !398, file: !28, line: 706, baseType: !23, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !398, file: !28, line: 707, baseType: !23, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !28, line: 708, baseType: !45, size: 16, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !398, file: !28, line: 709, baseType: !40, size: 8, offset: 80)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !398, file: !28, line: 710, baseType: !40, size: 8, offset: 88)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !398, file: !28, line: 711, baseType: !40, size: 8, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !134, file: !135, line: 83, baseType: !168, size: 64, offset: 8384)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !134, file: !135, line: 84, baseType: !31, size: 64, offset: 8448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !134, file: !135, line: 85, baseType: !253, size: 64, offset: 8512)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !134, file: !135, line: 86, baseType: !31, size: 64, offset: 8576)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !134, file: !135, line: 87, baseType: !253, size: 64, offset: 8640)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !134, file: !135, line: 88, baseType: !168, size: 64, offset: 8704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !134, file: !135, line: 89, baseType: !168, size: 64, offset: 8768)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !134, file: !135, line: 90, baseType: !414, size: 64, offset: 8832)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !134, file: !135, line: 91, baseType: !416, size: 64, offset: 8896)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !28, line: 637, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DISubroutineType(types: !419)
!419 = !{!25, !133, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !134, file: !135, line: 92, baseType: !422, size: 64, offset: 8960)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !28, line: 641, baseType: !130)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !126, file: !33, line: 152, baseType: !31, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !112, file: !33, line: 155, baseType: !23, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !112, file: !33, line: 156, baseType: !145, size: 16, offset: 416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !112, file: !33, line: 157, baseType: !40, size: 8, offset: 432)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !32, file: !33, line: 375, baseType: !428, size: 576)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !33, line: 122, size: 576, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !428, file: !33, line: 123, baseType: !31, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !428, file: !33, line: 123, baseType: !40, size: 8, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !33, line: 123, baseType: !40, size: 8, offset: 72)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !428, file: !33, line: 123, baseType: !45, size: 16, offset: 80)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !428, file: !33, line: 123, baseType: !40, size: 8, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !428, file: !33, line: 123, baseType: !40, size: 8, offset: 104)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !428, file: !33, line: 124, baseType: !45, size: 16, offset: 112)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !428, file: !33, line: 125, baseType: !16, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !428, file: !33, line: 126, baseType: !18, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !428, file: !33, line: 127, baseType: !414, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !428, file: !33, line: 128, baseType: !31, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !428, file: !33, line: 129, baseType: !31, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !428, file: !33, line: 130, baseType: !26, size: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !428, file: !33, line: 131, baseType: !40, size: 8, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !32, file: !33, line: 376, baseType: !445, size: 448)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !33, line: 134, size: 448, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !458}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !445, file: !33, line: 135, baseType: !31, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !445, file: !33, line: 135, baseType: !40, size: 8, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !445, file: !33, line: 135, baseType: !40, size: 8, offset: 72)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !445, file: !33, line: 135, baseType: !45, size: 16, offset: 80)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !445, file: !33, line: 135, baseType: !40, size: 8, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !445, file: !33, line: 135, baseType: !40, size: 8, offset: 104)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !445, file: !33, line: 136, baseType: !26, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !445, file: !33, line: 137, baseType: !31, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !33, line: 138, baseType: !31, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !445, file: !33, line: 139, baseType: !457, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !18)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !445, file: !33, line: 140, baseType: !23, size: 32, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !32, file: !33, line: 377, baseType: !460, size: 320)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !33, line: 184, size: 320, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !471}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !460, file: !33, line: 185, baseType: !31, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !460, file: !33, line: 185, baseType: !40, size: 8, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !33, line: 185, baseType: !40, size: 8, offset: 72)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !460, file: !33, line: 185, baseType: !45, size: 16, offset: 80)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !33, line: 185, baseType: !40, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !460, file: !33, line: 185, baseType: !468, size: 128, offset: 128)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 2)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !460, file: !33, line: 185, baseType: !31, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !32, file: !33, line: 378, baseType: !473, size: 384)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !33, line: 187, size: 384, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !473, file: !33, line: 188, baseType: !31, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !473, file: !33, line: 188, baseType: !40, size: 8, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !33, line: 188, baseType: !40, size: 8, offset: 72)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !473, file: !33, line: 188, baseType: !45, size: 16, offset: 80)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !33, line: 188, baseType: !40, size: 8, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !473, file: !33, line: 189, baseType: !468, size: 128, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !473, file: !33, line: 189, baseType: !31, size: 64, offset: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !473, file: !33, line: 189, baseType: !483, size: 64, offset: 320)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !28, line: 480, size: 576, elements: !485)
!485 = !{!486, !487, !488, !489, !497, !512, !544, !545, !546, !547, !548, !549}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !484, file: !28, line: 481, baseType: !26, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !484, file: !28, line: 482, baseType: !483, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !484, file: !28, line: 483, baseType: !483, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !484, file: !28, line: 484, baseType: !490, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !28, line: 497, size: 256, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !491, file: !28, line: 498, baseType: !490, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !28, line: 499, baseType: !490, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !491, file: !28, line: 500, baseType: !483, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !491, file: !28, line: 501, baseType: !23, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !484, file: !28, line: 485, baseType: !498, size: 64, offset: 256)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !28, line: 466, size: 320, elements: !500)
!500 = !{!501, !506, !507, !508, !509, !510, !511}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !499, file: !28, line: 467, baseType: !502, size: 128)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !28, line: 459, size: 128, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !502, file: !28, line: 460, baseType: !40, size: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !502, file: !28, line: 461, baseType: !18, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !499, file: !28, line: 468, baseType: !502, size: 128, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !499, file: !28, line: 469, baseType: !45, size: 16, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !499, file: !28, line: 470, baseType: !40, size: 8, offset: 272)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !499, file: !28, line: 471, baseType: !40, size: 8, offset: 280)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !499, file: !28, line: 472, baseType: !40, size: 8, offset: 288)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !499, file: !28, line: 473, baseType: !40, size: 8, offset: 296)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !484, file: !28, line: 486, baseType: !513, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !28, line: 448, size: 192, elements: !515)
!515 = !{!516, !539, !540, !541, !542, !543}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !514, file: !28, line: 449, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !28, line: 438, size: 64, elements: !518)
!518 = !{!519, !520, !533}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !517, file: !28, line: 439, baseType: !26, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !517, file: !28, line: 440, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !28, line: 419, size: 256, elements: !523)
!523 = !{!524, !529, !530, !531, !532}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !522, file: !28, line: 420, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!23, !14, !23, !16}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !522, file: !28, line: 421, baseType: !16, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !522, file: !28, line: 422, baseType: !26, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !522, file: !28, line: 423, baseType: !40, size: 8, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !522, file: !28, line: 424, baseType: !40, size: 8, offset: 200)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !517, file: !28, line: 441, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !28, line: 429, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !535, file: !28, line: 430, baseType: !26, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !28, line: 431, baseType: !534, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !514, file: !28, line: 450, baseType: !498, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !514, file: !28, line: 451, baseType: !40, size: 8, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !514, file: !28, line: 452, baseType: !40, size: 8, offset: 136)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !514, file: !28, line: 453, baseType: !40, size: 8, offset: 144)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !514, file: !28, line: 454, baseType: !40, size: 8, offset: 152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !484, file: !28, line: 487, baseType: !18, size: 64, offset: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !484, file: !28, line: 488, baseType: !23, size: 32, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !484, file: !28, line: 489, baseType: !45, size: 16, offset: 480)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !484, file: !28, line: 490, baseType: !45, size: 16, offset: 496)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !484, file: !28, line: 491, baseType: !40, size: 8, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !484, file: !28, line: 492, baseType: !40, size: 8, offset: 520)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !32, file: !33, line: 379, baseType: !551, size: 384)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !33, line: 192, size: 384, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !551, file: !33, line: 193, baseType: !31, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !551, file: !33, line: 193, baseType: !40, size: 8, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !551, file: !33, line: 193, baseType: !40, size: 8, offset: 72)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !551, file: !33, line: 193, baseType: !45, size: 16, offset: 80)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !551, file: !33, line: 193, baseType: !40, size: 8, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !551, file: !33, line: 193, baseType: !468, size: 128, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !551, file: !33, line: 193, baseType: !31, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !551, file: !33, line: 193, baseType: !23, size: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !551, file: !33, line: 194, baseType: !23, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !32, file: !33, line: 380, baseType: !563, size: 384)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !33, line: 197, size: 384, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !563, file: !33, line: 198, baseType: !31, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !563, file: !33, line: 198, baseType: !40, size: 8, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !563, file: !33, line: 198, baseType: !40, size: 8, offset: 72)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !563, file: !33, line: 198, baseType: !45, size: 16, offset: 80)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !33, line: 198, baseType: !40, size: 8, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !563, file: !33, line: 200, baseType: !40, size: 8, offset: 104)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !563, file: !33, line: 201, baseType: !40, size: 8, offset: 112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !563, file: !33, line: 202, baseType: !468, size: 128, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !563, file: !33, line: 202, baseType: !31, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !563, file: !33, line: 202, baseType: !575, size: 64, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !18)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !32, file: !33, line: 381, baseType: !577, size: 320)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !33, line: 205, size: 320, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !577, file: !33, line: 206, baseType: !31, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !577, file: !33, line: 206, baseType: !40, size: 8, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !577, file: !33, line: 206, baseType: !40, size: 8, offset: 72)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !577, file: !33, line: 206, baseType: !45, size: 16, offset: 80)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !577, file: !33, line: 206, baseType: !40, size: 8, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !577, file: !33, line: 206, baseType: !468, size: 128, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !577, file: !33, line: 206, baseType: !31, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !32, file: !33, line: 382, baseType: !587, size: 384)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !33, line: 233, size: 384, elements: !588)
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !587, file: !33, line: 234, baseType: !31, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 72)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !587, file: !33, line: 234, baseType: !45, size: 16, offset: 80)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 104)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 112)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 120)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !587, file: !33, line: 234, baseType: !26, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !587, file: !33, line: 234, baseType: !23, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !587, file: !33, line: 234, baseType: !23, size: 32, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !587, file: !33, line: 234, baseType: !23, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !587, file: !33, line: 234, baseType: !40, size: 8, offset: 296)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !587, file: !33, line: 234, baseType: !31, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !32, file: !33, line: 383, baseType: !605, size: 576)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !33, line: 237, size: 576, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !605, file: !33, line: 238, baseType: !31, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 72)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !605, file: !33, line: 238, baseType: !45, size: 16, offset: 80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 104)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 120)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !605, file: !33, line: 238, baseType: !26, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !605, file: !33, line: 238, baseType: !23, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !605, file: !33, line: 238, baseType: !23, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !605, file: !33, line: 238, baseType: !23, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !605, file: !33, line: 238, baseType: !40, size: 8, offset: 296)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !605, file: !33, line: 238, baseType: !45, size: 16, offset: 304)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !605, file: !33, line: 239, baseType: !31, size: 64, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !605, file: !33, line: 240, baseType: !83, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !605, file: !33, line: 241, baseType: !45, size: 16, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !605, file: !33, line: 242, baseType: !83, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !32, file: !33, line: 384, baseType: !627, size: 384)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !33, line: 262, size: 384, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !627, file: !33, line: 263, baseType: !31, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 72)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !627, file: !33, line: 263, baseType: !45, size: 16, offset: 80)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 104)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 112)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 120)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !627, file: !33, line: 263, baseType: !26, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !627, file: !33, line: 263, baseType: !23, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !627, file: !33, line: 263, baseType: !23, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !627, file: !33, line: 263, baseType: !23, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 296)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !627, file: !33, line: 263, baseType: !40, size: 8, offset: 304)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !627, file: !33, line: 264, baseType: !31, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !32, file: !33, line: 385, baseType: !646, size: 448)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !33, line: 245, size: 448, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !646, file: !33, line: 246, baseType: !31, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 72)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !646, file: !33, line: 246, baseType: !45, size: 16, offset: 80)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 104)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 112)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 120)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !646, file: !33, line: 246, baseType: !26, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !646, file: !33, line: 246, baseType: !23, size: 32, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !646, file: !33, line: 246, baseType: !23, size: 32, offset: 224)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !646, file: !33, line: 246, baseType: !23, size: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 288)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !646, file: !33, line: 246, baseType: !40, size: 8, offset: 296)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !646, file: !33, line: 246, baseType: !31, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !646, file: !33, line: 247, baseType: !31, size: 64, offset: 384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !32, file: !33, line: 386, baseType: !665, size: 448)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !33, line: 250, size: 448, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !665, file: !33, line: 251, baseType: !31, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 72)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !665, file: !33, line: 251, baseType: !45, size: 16, offset: 80)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 104)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 120)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !665, file: !33, line: 251, baseType: !26, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !665, file: !33, line: 251, baseType: !23, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !665, file: !33, line: 251, baseType: !23, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !665, file: !33, line: 251, baseType: !23, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !665, file: !33, line: 251, baseType: !40, size: 8, offset: 296)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !665, file: !33, line: 256, baseType: !31, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !665, file: !33, line: 257, baseType: !31, size: 64, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !32, file: !33, line: 387, baseType: !684, size: 512)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !33, line: 273, size: 512, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !684, file: !33, line: 274, baseType: !31, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !684, file: !33, line: 274, baseType: !40, size: 8, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !33, line: 274, baseType: !40, size: 8, offset: 72)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !684, file: !33, line: 274, baseType: !45, size: 16, offset: 80)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !684, file: !33, line: 274, baseType: !40, size: 8, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !684, file: !33, line: 274, baseType: !26, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !684, file: !33, line: 275, baseType: !23, size: 32, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !684, file: !33, line: 276, baseType: !362, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !684, file: !33, line: 277, baseType: !16, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !33, line: 278, baseType: !468, size: 128, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !32, file: !33, line: 388, baseType: !697, size: 512)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !33, line: 281, size: 512, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !712, !713, !714, !720, !721}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !697, file: !33, line: 282, baseType: !31, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !697, file: !33, line: 282, baseType: !40, size: 8, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !33, line: 282, baseType: !40, size: 8, offset: 72)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !697, file: !33, line: 282, baseType: !45, size: 16, offset: 80)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !697, file: !33, line: 282, baseType: !40, size: 8, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !697, file: !33, line: 282, baseType: !40, size: 8, offset: 104)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !697, file: !33, line: 283, baseType: !40, size: 8, offset: 112)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !697, file: !33, line: 284, baseType: !707, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!25, !23, !457, !23, !711, !16, !16}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !697, file: !33, line: 285, baseType: !26, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !697, file: !33, line: 286, baseType: !16, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !697, file: !33, line: 287, baseType: !715, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{!25, !14, !23, !16, !719}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !697, file: !33, line: 288, baseType: !31, size: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !33, line: 289, baseType: !31, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !32, file: !33, line: 389, baseType: !723, size: 512)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !33, line: 307, size: 512, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !723, file: !33, line: 308, baseType: !31, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !723, file: !33, line: 308, baseType: !40, size: 8, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !33, line: 308, baseType: !40, size: 8, offset: 72)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !723, file: !33, line: 308, baseType: !45, size: 16, offset: 80)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !723, file: !33, line: 308, baseType: !40, size: 8, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !723, file: !33, line: 308, baseType: !40, size: 8, offset: 104)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !723, file: !33, line: 309, baseType: !40, size: 8, offset: 112)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !723, file: !33, line: 310, baseType: !40, size: 8, offset: 120)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !723, file: !33, line: 311, baseType: !16, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !723, file: !33, line: 312, baseType: !26, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !723, file: !33, line: 313, baseType: !98, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !723, file: !33, line: 314, baseType: !83, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !723, file: !33, line: 315, baseType: !83, size: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !723, file: !33, line: 316, baseType: !23, size: 32, offset: 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !32, file: !33, line: 390, baseType: !740, size: 448)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !33, line: 340, size: 448, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !740, file: !33, line: 341, baseType: !31, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !740, file: !33, line: 341, baseType: !40, size: 8, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !740, file: !33, line: 341, baseType: !40, size: 8, offset: 72)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !740, file: !33, line: 341, baseType: !45, size: 16, offset: 80)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !740, file: !33, line: 341, baseType: !40, size: 8, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !740, file: !33, line: 341, baseType: !26, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !740, file: !33, line: 342, baseType: !26, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !740, file: !33, line: 343, baseType: !16, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !740, file: !33, line: 344, baseType: !83, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !740, file: !33, line: 345, baseType: !23, size: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !32, file: !33, line: 391, baseType: !753, size: 256)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !33, line: 350, size: 256, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !765}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !753, file: !33, line: 351, baseType: !31, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !753, file: !33, line: 351, baseType: !40, size: 8, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !33, line: 351, baseType: !40, size: 8, offset: 72)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !753, file: !33, line: 351, baseType: !45, size: 16, offset: 80)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !33, line: 351, baseType: !40, size: 8, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !753, file: !33, line: 351, baseType: !761, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !14, !16}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !753, file: !33, line: 352, baseType: !16, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !32, file: !33, line: 392, baseType: !767, size: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !33, line: 357, size: 192, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !767, file: !33, line: 358, baseType: !31, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !767, file: !33, line: 358, baseType: !40, size: 8, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !33, line: 358, baseType: !40, size: 8, offset: 72)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !767, file: !33, line: 358, baseType: !45, size: 16, offset: 80)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !767, file: !33, line: 358, baseType: !40, size: 8, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !33, line: 358, baseType: !31, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !32, file: !33, line: 399, baseType: !27, size: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !27, file: !28, line: 135, baseType: !40, size: 8, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 136, baseType: !40, size: 8, offset: 72)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !27, file: !28, line: 137, baseType: !45, size: 16, offset: 80)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !28, line: 138, baseType: !780, size: 32, offset: 96)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !781, line: 327, size: 32, elements: !782)
!781 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !780, file: !781, line: 328, baseType: !23, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !780, file: !781, line: 329, baseType: !227, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !27, file: !28, line: 139, baseType: !26, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !27, file: !28, line: 140, baseType: !26, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !27, file: !28, line: 141, baseType: !26, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !27, file: !28, line: 142, baseType: !145, size: 16, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !790, line: 148, baseType: !7)
!790 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!791 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_init_walk_info", file: !135, line: 97, size: 512, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "table_index", scope: !793, file: !135, line: 98, baseType: !23, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "object_count", scope: !793, file: !135, line: 99, baseType: !23, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "method_count", scope: !793, file: !135, line: 100, baseType: !23, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "serial_method_count", scope: !793, file: !135, line: 101, baseType: !23, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "non_serial_method_count", scope: !793, file: !135, line: 102, baseType: !23, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "serialized_method_count", scope: !793, file: !135, line: 103, baseType: !23, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "device_count", scope: !793, file: !135, line: 104, baseType: !23, size: 32, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "op_region_count", scope: !793, file: !135, line: 105, baseType: !23, size: 32, offset: 224)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "field_count", scope: !793, file: !135, line: 106, baseType: !23, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_count", scope: !793, file: !135, line: 107, baseType: !23, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "package_count", scope: !793, file: !135, line: 108, baseType: !23, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "op_region_init", scope: !793, file: !135, line: 109, baseType: !23, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "field_init", scope: !793, file: !135, line: 110, baseType: !23, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_init", scope: !793, file: !135, line: 111, baseType: !23, size: 32, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "package_init", scope: !793, file: !135, line: 112, baseType: !23, size: 32, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !793, file: !135, line: 113, baseType: !145, size: 16, offset: 480)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_device_walk_info", file: !135, line: 187, size: 256, elements: !813)
!813 = !{!814, !841, !908, !909, !910}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "table_desc", scope: !812, file: !135, line: 188, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !781, line: 334, size: 256, elements: !817)
!817 = !{!818, !819, !836, !837, !838, !839, !840}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !816, file: !781, line: 335, baseType: !457, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !816, file: !781, line: 336, baseType: !820, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !781, line: 68, size: 288, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !831, !833, !834, !835}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !821, file: !781, line: 69, baseType: !227, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !821, file: !781, line: 70, baseType: !23, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !821, file: !781, line: 71, baseType: !40, size: 8, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !821, file: !781, line: 72, baseType: !40, size: 8, offset: 72)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !821, file: !781, line: 73, baseType: !828, size: 48, offset: 80)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 48, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 6)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !821, file: !781, line: 74, baseType: !832, size: 64, offset: 128)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 64, elements: !344)
