; ModuleID = '../bcout/drivers/acpi/acpica/nsnames.llvm.bc'
source_filename = "drivers/acpi/acpica/nsnames.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 14, type: !805, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !804, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsnames.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !22, !156, !799, !69, !72, !40, !800, !801, !803}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_descriptor", file: !16, line: 432, size: 1600, elements: !17)
!16 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!17 = !{!18, !29, !797, !798}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !15, file: !16, line: 433, baseType: !19, size: 128)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_descriptor", file: !16, line: 427, size: 128, elements: !20)
!20 = !{!21, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "common_pointer", scope: !19, file: !16, line: 428, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !19, file: !16, line: 429, baseType: !24, size: 8, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !25, line: 17, baseType: !26)
!25 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !27, line: 21, baseType: !28)
!27 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !15, file: !16, line: 434, baseType: !30, size: 576)
!30 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !16, line: 367, size: 576, elements: !31)
!31 = !{!32, !44, !60, !74, !111, !125, !134, !448, !465, !480, !493, !571, !583, !597, !607, !625, !647, !666, !685, !704, !717, !743, !760, !773, !787, !796}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !30, file: !16, line: 368, baseType: !33, size: 128)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !16, line: 73, size: 128, elements: !34)
!34 = !{!35, !37, !38, !39, !43}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !33, file: !16, line: 74, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !33, file: !16, line: 74, baseType: !24, size: 8, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !33, file: !16, line: 74, baseType: !24, size: 8, offset: 72)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !33, file: !16, line: 74, baseType: !40, size: 16, offset: 80)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !25, line: 19, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !27, line: 24, baseType: !42)
!42 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !33, file: !16, line: 74, baseType: !24, size: 8, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !30, file: !16, line: 369, baseType: !45, size: 192)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !16, line: 76, size: 192, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !56}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !45, file: !16, line: 77, baseType: !36, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !45, file: !16, line: 77, baseType: !24, size: 8, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !45, file: !16, line: 77, baseType: !24, size: 8, offset: 72)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !45, file: !16, line: 77, baseType: !40, size: 16, offset: 80)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !45, file: !16, line: 77, baseType: !24, size: 8, offset: 96)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !45, file: !16, line: 77, baseType: !53, size: 24, offset: 104)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 24, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 3)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !45, file: !16, line: 78, baseType: !57, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !25, line: 23, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !27, line: 31, baseType: !59)
!59 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !30, file: !16, line: 370, baseType: !61, size: 256)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !16, line: 93, size: 256, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !71}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !61, file: !16, line: 94, baseType: !36, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !61, file: !16, line: 94, baseType: !24, size: 8, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !16, line: 94, baseType: !24, size: 8, offset: 72)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !61, file: !16, line: 94, baseType: !40, size: 16, offset: 80)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !16, line: 94, baseType: !24, size: 8, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !61, file: !16, line: 94, baseType: !69, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !61, file: !16, line: 94, baseType: !72, size: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !25, line: 21, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !27, line: 27, baseType: !7)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !30, file: !16, line: 371, baseType: !75, size: 384)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !16, line: 97, size: 384, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !84, !85, !86, !87}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !75, file: !16, line: 98, baseType: !36, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !75, file: !16, line: 98, baseType: !24, size: 8, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !16, line: 98, baseType: !24, size: 8, offset: 72)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !75, file: !16, line: 98, baseType: !40, size: 16, offset: 80)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !16, line: 98, baseType: !24, size: 8, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !75, file: !16, line: 98, baseType: !83, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !75, file: !16, line: 98, baseType: !72, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !75, file: !16, line: 99, baseType: !72, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !75, file: !16, line: 100, baseType: !83, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !75, file: !16, line: 101, baseType: !88, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !90, line: 133, size: 384, elements: !91)
!90 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!91 = !{!92, !93, !94, !95, !96, !105, !106, !107, !108}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !89, file: !90, line: 134, baseType: !36, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !89, file: !90, line: 135, baseType: !24, size: 8, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !90, line: 136, baseType: !24, size: 8, offset: 72)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !90, line: 137, baseType: !40, size: 16, offset: 80)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !90, line: 138, baseType: !97, size: 32, offset: 96)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !98, line: 327, size: 32, elements: !99)
!98 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !97, file: !98, line: 328, baseType: !72, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !97, file: !98, line: 329, baseType: !102, size: 32)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 4)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !89, file: !90, line: 139, baseType: !88, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !89, file: !90, line: 140, baseType: !88, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !89, file: !90, line: 141, baseType: !88, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !89, file: !90, line: 142, baseType: !109, size: 16, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !110, line: 445, baseType: !40)
!110 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!111 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !30, file: !16, line: 372, baseType: !112, size: 384)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !16, line: 104, size: 384, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !122, !123, !124}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !112, file: !16, line: 105, baseType: !36, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !112, file: !16, line: 105, baseType: !24, size: 8, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !16, line: 105, baseType: !24, size: 8, offset: 72)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !112, file: !16, line: 105, baseType: !40, size: 16, offset: 80)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !16, line: 105, baseType: !24, size: 8, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !112, file: !16, line: 105, baseType: !88, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !112, file: !16, line: 106, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !112, file: !16, line: 107, baseType: !83, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !112, file: !16, line: 108, baseType: !72, size: 32, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !112, file: !16, line: 109, baseType: !72, size: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !30, file: !16, line: 373, baseType: !126, size: 192)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !16, line: 118, size: 192, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !126, file: !16, line: 119, baseType: !36, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !126, file: !16, line: 119, baseType: !24, size: 8, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !16, line: 119, baseType: !24, size: 8, offset: 72)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !126, file: !16, line: 119, baseType: !40, size: 16, offset: 80)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !16, line: 119, baseType: !24, size: 8, offset: 96)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !126, file: !16, line: 119, baseType: !22, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !30, file: !16, line: 374, baseType: !135, size: 448)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !16, line: 143, size: 448, elements: !136)
!136 = !{!137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !445, !446, !447}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !135, file: !16, line: 144, baseType: !36, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !135, file: !16, line: 144, baseType: !24, size: 8, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !135, file: !16, line: 144, baseType: !24, size: 8, offset: 72)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !135, file: !16, line: 144, baseType: !40, size: 16, offset: 80)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !135, file: !16, line: 144, baseType: !24, size: 8, offset: 96)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !135, file: !16, line: 144, baseType: !24, size: 8, offset: 104)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !135, file: !16, line: 145, baseType: !24, size: 8, offset: 112)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !135, file: !16, line: 146, baseType: !24, size: 8, offset: 120)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !135, file: !16, line: 147, baseType: !36, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !135, file: !16, line: 148, baseType: !36, size: 64, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !135, file: !16, line: 149, baseType: !83, size: 64, offset: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !135, file: !16, line: 153, baseType: !149, size: 64, offset: 320)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !135, file: !16, line: 150, size: 64, elements: !150)
!150 = !{!151, !444}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !149, file: !16, line: 151, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !90, line: 248, baseType: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !110, line: 421, baseType: !72)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !159, line: 37, size: 9024, elements: !160)
!159 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !390, !391, !392, !393, !394, !398, !400, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !427, !428, !429, !430, !431, !432, !433, !434, !436, !442}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !159, line: 38, baseType: !157, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !158, file: !159, line: 39, baseType: !24, size: 8, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !158, file: !159, line: 40, baseType: !24, size: 8, offset: 72)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !158, file: !159, line: 41, baseType: !40, size: 16, offset: 80)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !158, file: !159, line: 42, baseType: !24, size: 8, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !158, file: !159, line: 43, baseType: !24, size: 8, offset: 104)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !158, file: !159, line: 44, baseType: !24, size: 8, offset: 112)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !158, file: !159, line: 45, baseType: !109, size: 16, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !158, file: !159, line: 46, baseType: !24, size: 8, offset: 144)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !158, file: !159, line: 47, baseType: !24, size: 8, offset: 152)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !158, file: !159, line: 48, baseType: !24, size: 8, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !158, file: !159, line: 49, baseType: !24, size: 8, offset: 168)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !158, file: !159, line: 50, baseType: !24, size: 8, offset: 176)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !158, file: !159, line: 51, baseType: !24, size: 8, offset: 184)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !158, file: !159, line: 52, baseType: !24, size: 8, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !158, file: !159, line: 53, baseType: !24, size: 8, offset: 200)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !158, file: !159, line: 54, baseType: !83, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !158, file: !159, line: 55, baseType: !72, size: 32, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !158, file: !159, line: 56, baseType: !72, size: 32, offset: 352)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !158, file: !159, line: 57, baseType: !72, size: 32, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !158, file: !159, line: 58, baseType: !72, size: 32, offset: 416)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !158, file: !159, line: 60, baseType: !183, size: 640, offset: 448)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !90, line: 893, size: 640, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !271, !272, !388, !389}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !183, file: !90, line: 894, baseType: !83, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !183, file: !90, line: 895, baseType: !83, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !183, file: !90, line: 896, baseType: !83, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !183, file: !90, line: 897, baseType: !83, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !183, file: !90, line: 898, baseType: !83, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !183, file: !90, line: 899, baseType: !191, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !90, line: 875, size: 1600, elements: !193)
!193 = !{!194, !214, !230}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !192, file: !90, line: 876, baseType: !195, size: 448)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !90, line: 828, size: 448, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !213}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !195, file: !90, line: 829, baseType: !191, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !195, file: !90, line: 829, baseType: !24, size: 8, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !90, line: 829, baseType: !24, size: 8, offset: 72)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !195, file: !90, line: 829, baseType: !40, size: 16, offset: 80)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !195, file: !90, line: 829, baseType: !83, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !195, file: !90, line: 829, baseType: !191, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !195, file: !90, line: 829, baseType: !88, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !195, file: !90, line: 829, baseType: !205, size: 64, offset: 320)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !90, line: 716, size: 64, elements: !206)
!206 = !{!207, !208, !209, !210, !211, !212}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !205, file: !90, line: 717, baseType: !57, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !205, file: !90, line: 718, baseType: !72, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !205, file: !90, line: 719, baseType: !69, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !205, file: !90, line: 720, baseType: !83, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !90, line: 721, baseType: !69, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !205, file: !90, line: 722, baseType: !191, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !195, file: !90, line: 829, baseType: !24, size: 8, offset: 384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !192, file: !90, line: 877, baseType: !215, size: 640)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !90, line: 835, size: 640, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !215, file: !90, line: 836, baseType: !191, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !215, file: !90, line: 836, baseType: !24, size: 8, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !215, file: !90, line: 836, baseType: !24, size: 8, offset: 72)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !215, file: !90, line: 836, baseType: !40, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !215, file: !90, line: 836, baseType: !83, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !215, file: !90, line: 836, baseType: !191, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !215, file: !90, line: 836, baseType: !88, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !215, file: !90, line: 836, baseType: !205, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !215, file: !90, line: 836, baseType: !24, size: 8, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !215, file: !90, line: 836, baseType: !69, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !90, line: 837, baseType: !83, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !215, file: !90, line: 838, baseType: !72, size: 32, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !90, line: 839, baseType: !72, size: 32, offset: 608)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !192, file: !90, line: 878, baseType: !231, size: 1600)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !90, line: 846, size: 1600, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !231, file: !90, line: 847, baseType: !191, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !231, file: !90, line: 847, baseType: !24, size: 8, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !231, file: !90, line: 847, baseType: !24, size: 8, offset: 72)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !231, file: !90, line: 847, baseType: !40, size: 16, offset: 80)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !231, file: !90, line: 847, baseType: !83, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !90, line: 847, baseType: !191, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !231, file: !90, line: 847, baseType: !88, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !231, file: !90, line: 847, baseType: !205, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !231, file: !90, line: 847, baseType: !24, size: 8, offset: 384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !231, file: !90, line: 847, baseType: !191, size: 64, offset: 448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !231, file: !90, line: 848, baseType: !191, size: 64, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !231, file: !90, line: 849, baseType: !69, size: 64, offset: 576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !231, file: !90, line: 850, baseType: !24, size: 8, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !231, file: !90, line: 851, baseType: !69, size: 64, offset: 704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !231, file: !90, line: 852, baseType: !69, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !231, file: !90, line: 853, baseType: !69, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !231, file: !90, line: 854, baseType: !102, size: 32, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !231, file: !90, line: 855, baseType: !72, size: 32, offset: 928)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !231, file: !90, line: 856, baseType: !72, size: 32, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !231, file: !90, line: 857, baseType: !72, size: 32, offset: 992)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !231, file: !90, line: 858, baseType: !72, size: 32, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !231, file: !90, line: 859, baseType: !72, size: 32, offset: 1056)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !231, file: !90, line: 860, baseType: !72, size: 32, offset: 1088)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !231, file: !90, line: 861, baseType: !72, size: 32, offset: 1120)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !231, file: !90, line: 862, baseType: !72, size: 32, offset: 1152)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !231, file: !90, line: 863, baseType: !72, size: 32, offset: 1184)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !231, file: !90, line: 864, baseType: !72, size: 32, offset: 1216)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !231, file: !90, line: 865, baseType: !72, size: 32, offset: 1248)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !231, file: !90, line: 866, baseType: !72, size: 32, offset: 1280)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !231, file: !90, line: 867, baseType: !72, size: 32, offset: 1312)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !231, file: !90, line: 868, baseType: !40, size: 16, offset: 1344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !231, file: !90, line: 869, baseType: !24, size: 8, offset: 1360)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !231, file: !90, line: 870, baseType: !24, size: 8, offset: 1368)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !231, file: !90, line: 871, baseType: !24, size: 8, offset: 1376)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !231, file: !90, line: 872, baseType: !268, size: 160, offset: 1384)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 160, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 20)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !183, file: !90, line: 900, baseType: !88, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !183, file: !90, line: 901, baseType: !273, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !90, line: 663, size: 640, elements: !275)
!275 = !{!276, !284, !297, !306, !315, !328, !342, !354, !366}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !274, file: !90, line: 664, baseType: !277, size: 128)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !90, line: 567, size: 128, elements: !278)
!278 = !{!279, !280, !281, !282, !283}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !90, line: 568, baseType: !22, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !277, file: !90, line: 568, baseType: !24, size: 8, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !277, file: !90, line: 568, baseType: !24, size: 8, offset: 72)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !90, line: 568, baseType: !40, size: 16, offset: 80)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !277, file: !90, line: 568, baseType: !40, size: 16, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !274, file: !90, line: 665, baseType: !285, size: 384)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !90, line: 593, size: 384, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !90, line: 594, baseType: !22, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !285, file: !90, line: 594, baseType: !24, size: 8, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !285, file: !90, line: 594, baseType: !24, size: 8, offset: 72)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !285, file: !90, line: 594, baseType: !40, size: 16, offset: 80)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !285, file: !90, line: 594, baseType: !40, size: 16, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !285, file: !90, line: 594, baseType: !40, size: 16, offset: 112)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !285, file: !90, line: 595, baseType: !191, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !285, file: !90, line: 596, baseType: !83, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !285, file: !90, line: 597, baseType: !83, size: 64, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !285, file: !90, line: 598, baseType: !57, size: 64, offset: 320)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !274, file: !90, line: 666, baseType: !298, size: 192)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !90, line: 573, size: 192, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !90, line: 574, baseType: !22, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !298, file: !90, line: 574, baseType: !24, size: 8, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !298, file: !90, line: 574, baseType: !24, size: 8, offset: 72)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !298, file: !90, line: 574, baseType: !40, size: 16, offset: 80)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !298, file: !90, line: 574, baseType: !40, size: 16, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !298, file: !90, line: 574, baseType: !36, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !274, file: !90, line: 667, baseType: !307, size: 192)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !90, line: 604, size: 192, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !307, file: !90, line: 605, baseType: !22, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !307, file: !90, line: 605, baseType: !24, size: 8, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !90, line: 605, baseType: !24, size: 8, offset: 72)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !307, file: !90, line: 605, baseType: !40, size: 16, offset: 80)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !307, file: !90, line: 605, baseType: !40, size: 16, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !307, file: !90, line: 605, baseType: !88, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !274, file: !90, line: 668, baseType: !316, size: 448)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !90, line: 608, size: 448, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !90, line: 609, baseType: !22, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !316, file: !90, line: 609, baseType: !24, size: 8, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !90, line: 609, baseType: !24, size: 8, offset: 72)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !316, file: !90, line: 609, baseType: !40, size: 16, offset: 80)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !316, file: !90, line: 609, baseType: !40, size: 16, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !316, file: !90, line: 609, baseType: !72, size: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !316, file: !90, line: 610, baseType: !191, size: 64, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !316, file: !90, line: 611, baseType: !83, size: 64, offset: 256)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !316, file: !90, line: 612, baseType: !83, size: 64, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !316, file: !90, line: 613, baseType: !72, size: 32, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !274, file: !90, line: 669, baseType: !329, size: 512)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !90, line: 580, size: 512, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !90, line: 581, baseType: !22, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !329, file: !90, line: 581, baseType: !24, size: 8, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !329, file: !90, line: 581, baseType: !24, size: 8, offset: 72)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !329, file: !90, line: 581, baseType: !40, size: 16, offset: 80)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !329, file: !90, line: 581, baseType: !40, size: 16, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !329, file: !90, line: 581, baseType: !72, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !329, file: !90, line: 582, baseType: !36, size: 64, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !329, file: !90, line: 583, baseType: !36, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !329, file: !90, line: 584, baseType: !157, size: 64, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !329, file: !90, line: 585, baseType: !22, size: 64, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !329, file: !90, line: 586, baseType: !72, size: 32, offset: 448)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !274, file: !90, line: 670, baseType: !343, size: 320)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !90, line: 620, size: 320, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !90, line: 621, baseType: !22, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !343, file: !90, line: 621, baseType: !24, size: 8, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !343, file: !90, line: 621, baseType: !24, size: 8, offset: 72)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !343, file: !90, line: 621, baseType: !40, size: 16, offset: 80)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !343, file: !90, line: 621, baseType: !40, size: 16, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !343, file: !90, line: 621, baseType: !24, size: 8, offset: 112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !343, file: !90, line: 622, baseType: !157, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !343, file: !90, line: 623, baseType: !36, size: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !343, file: !90, line: 624, baseType: !57, size: 64, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !274, file: !90, line: 671, baseType: !355, size: 640)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !90, line: 631, size: 640, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !362}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !90, line: 632, baseType: !22, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !355, file: !90, line: 632, baseType: !24, size: 8, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !90, line: 632, baseType: !24, size: 8, offset: 72)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !355, file: !90, line: 632, baseType: !40, size: 16, offset: 80)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !90, line: 632, baseType: !40, size: 16, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !355, file: !90, line: 633, baseType: !363, size: 512, offset: 128)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 512, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !274, file: !90, line: 672, baseType: !367, size: 320)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !90, line: 654, size: 320, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !90, line: 655, baseType: !22, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !367, file: !90, line: 655, baseType: !24, size: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !367, file: !90, line: 655, baseType: !24, size: 8, offset: 72)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !367, file: !90, line: 655, baseType: !40, size: 16, offset: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !90, line: 655, baseType: !40, size: 16, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !367, file: !90, line: 655, baseType: !24, size: 8, offset: 112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !367, file: !90, line: 656, baseType: !88, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !367, file: !90, line: 657, baseType: !36, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !367, file: !90, line: 658, baseType: !378, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !90, line: 645, size: 128, elements: !380)
!380 = !{!381, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !379, file: !90, line: 646, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !110, line: 1052, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386, !72, !22}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !110, line: 424, baseType: !22)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !379, file: !90, line: 647, baseType: !22, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !183, file: !90, line: 902, baseType: !191, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !183, file: !90, line: 903, baseType: !72, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !158, file: !159, line: 61, baseType: !72, size: 32, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !158, file: !159, line: 62, baseType: !72, size: 32, offset: 1120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !158, file: !159, line: 63, baseType: !40, size: 16, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !158, file: !159, line: 64, baseType: !24, size: 8, offset: 1168)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !158, file: !159, line: 66, baseType: !395, size: 2688, offset: 1216)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2688, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 7)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !158, file: !159, line: 67, baseType: !399, size: 3072, offset: 3904)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 3072, elements: !364)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !158, file: !159, line: 68, baseType: !401, size: 576, offset: 6976)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 576, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 9)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !158, file: !159, line: 69, baseType: !121, size: 64, offset: 7552)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !158, file: !159, line: 71, baseType: !83, size: 64, offset: 7616)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !158, file: !159, line: 72, baseType: !121, size: 64, offset: 7680)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !158, file: !159, line: 73, baseType: !273, size: 64, offset: 7744)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !158, file: !159, line: 74, baseType: !88, size: 64, offset: 7808)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !158, file: !159, line: 75, baseType: !36, size: 64, offset: 7872)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !158, file: !159, line: 76, baseType: !88, size: 64, offset: 7936)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !158, file: !159, line: 77, baseType: !191, size: 64, offset: 8000)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !158, file: !159, line: 78, baseType: !36, size: 64, offset: 8064)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !158, file: !159, line: 79, baseType: !88, size: 64, offset: 8128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !158, file: !159, line: 80, baseType: !69, size: 64, offset: 8192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !158, file: !159, line: 81, baseType: !191, size: 64, offset: 8256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !158, file: !159, line: 82, baseType: !417, size: 64, offset: 8320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !90, line: 702, size: 128, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !419, file: !90, line: 706, baseType: !72, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !419, file: !90, line: 707, baseType: !72, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !419, file: !90, line: 708, baseType: !40, size: 16, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !419, file: !90, line: 709, baseType: !24, size: 8, offset: 80)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !419, file: !90, line: 710, baseType: !24, size: 8, offset: 88)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !90, line: 711, baseType: !24, size: 8, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !158, file: !159, line: 83, baseType: !191, size: 64, offset: 8384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !158, file: !159, line: 84, baseType: !36, size: 64, offset: 8448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !158, file: !159, line: 85, baseType: !273, size: 64, offset: 8512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !158, file: !159, line: 86, baseType: !36, size: 64, offset: 8576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !158, file: !159, line: 87, baseType: !273, size: 64, offset: 8640)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !158, file: !159, line: 88, baseType: !191, size: 64, offset: 8704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !158, file: !159, line: 89, baseType: !191, size: 64, offset: 8768)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !158, file: !159, line: 90, baseType: !435, size: 64, offset: 8832)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !158, file: !159, line: 91, baseType: !437, size: 64, offset: 8896)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !90, line: 637, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!156, !157, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !158, file: !159, line: 92, baseType: !443, size: 64, offset: 8960)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !90, line: 641, baseType: !153)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !149, file: !16, line: 152, baseType: !36, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !135, file: !16, line: 155, baseType: !72, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !135, file: !16, line: 156, baseType: !109, size: 16, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !135, file: !16, line: 157, baseType: !24, size: 8, offset: 432)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !30, file: !16, line: 375, baseType: !449, size: 576)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !16, line: 122, size: 576, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !449, file: !16, line: 123, baseType: !36, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !449, file: !16, line: 123, baseType: !24, size: 8, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !16, line: 123, baseType: !24, size: 8, offset: 72)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !449, file: !16, line: 123, baseType: !40, size: 16, offset: 80)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !16, line: 123, baseType: !24, size: 8, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !449, file: !16, line: 123, baseType: !24, size: 8, offset: 104)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !449, file: !16, line: 124, baseType: !40, size: 16, offset: 112)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !449, file: !16, line: 125, baseType: !22, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !449, file: !16, line: 126, baseType: !57, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !449, file: !16, line: 127, baseType: !435, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !449, file: !16, line: 128, baseType: !36, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !16, line: 129, baseType: !36, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !449, file: !16, line: 130, baseType: !88, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !449, file: !16, line: 131, baseType: !24, size: 8, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !30, file: !16, line: 376, baseType: !466, size: 448)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !16, line: 134, size: 448, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !479}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !466, file: !16, line: 135, baseType: !36, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !466, file: !16, line: 135, baseType: !24, size: 8, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !16, line: 135, baseType: !24, size: 8, offset: 72)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !466, file: !16, line: 135, baseType: !40, size: 16, offset: 80)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !16, line: 135, baseType: !24, size: 8, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !466, file: !16, line: 135, baseType: !24, size: 8, offset: 104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !466, file: !16, line: 136, baseType: !88, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !466, file: !16, line: 137, baseType: !36, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !16, line: 138, baseType: !36, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !466, file: !16, line: 139, baseType: !478, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !110, line: 129, baseType: !57)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !466, file: !16, line: 140, baseType: !72, size: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !30, file: !16, line: 377, baseType: !481, size: 320)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !16, line: 184, size: 320, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !492}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !481, file: !16, line: 185, baseType: !36, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !481, file: !16, line: 185, baseType: !24, size: 8, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !481, file: !16, line: 185, baseType: !24, size: 8, offset: 72)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !481, file: !16, line: 185, baseType: !40, size: 16, offset: 80)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !481, file: !16, line: 185, baseType: !24, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !481, file: !16, line: 185, baseType: !489, size: 128, offset: 128)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 128, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 2)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !481, file: !16, line: 185, baseType: !36, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !30, file: !16, line: 378, baseType: !494, size: 384)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !16, line: 187, size: 384, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !494, file: !16, line: 188, baseType: !36, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !494, file: !16, line: 188, baseType: !24, size: 8, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !16, line: 188, baseType: !24, size: 8, offset: 72)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !494, file: !16, line: 188, baseType: !40, size: 16, offset: 80)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !494, file: !16, line: 188, baseType: !24, size: 8, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !494, file: !16, line: 189, baseType: !489, size: 128, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !494, file: !16, line: 189, baseType: !36, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !494, file: !16, line: 189, baseType: !504, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !90, line: 480, size: 576, elements: !506)
!506 = !{!507, !508, !509, !510, !518, !533, !565, !566, !567, !568, !569, !570}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !505, file: !90, line: 481, baseType: !88, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !505, file: !90, line: 482, baseType: !504, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !90, line: 483, baseType: !504, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !505, file: !90, line: 484, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !90, line: 497, size: 256, elements: !513)
!513 = !{!514, !515, !516, !517}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !512, file: !90, line: 498, baseType: !511, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !90, line: 499, baseType: !511, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !512, file: !90, line: 500, baseType: !504, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !512, file: !90, line: 501, baseType: !72, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !505, file: !90, line: 485, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !90, line: 466, size: 320, elements: !521)
!521 = !{!522, !527, !528, !529, !530, !531, !532}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !520, file: !90, line: 467, baseType: !523, size: 128)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !90, line: 459, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !523, file: !90, line: 460, baseType: !24, size: 8)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !523, file: !90, line: 461, baseType: !57, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !520, file: !90, line: 468, baseType: !523, size: 128, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !520, file: !90, line: 469, baseType: !40, size: 16, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !520, file: !90, line: 470, baseType: !24, size: 8, offset: 272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !520, file: !90, line: 471, baseType: !24, size: 8, offset: 280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !520, file: !90, line: 472, baseType: !24, size: 8, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !520, file: !90, line: 473, baseType: !24, size: 8, offset: 296)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !505, file: !90, line: 486, baseType: !534, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !90, line: 448, size: 192, elements: !536)
!536 = !{!537, !560, !561, !562, !563, !564}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !535, file: !90, line: 449, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !90, line: 438, size: 64, elements: !539)
!539 = !{!540, !541, !554}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !538, file: !90, line: 439, baseType: !88, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !538, file: !90, line: 440, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !90, line: 419, size: 256, elements: !544)
!544 = !{!545, !550, !551, !552, !553}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !543, file: !90, line: 420, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !110, line: 1049, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!72, !386, !72, !22}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !543, file: !90, line: 421, baseType: !22, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !543, file: !90, line: 422, baseType: !88, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !543, file: !90, line: 423, baseType: !24, size: 8, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !543, file: !90, line: 424, baseType: !24, size: 8, offset: 200)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !538, file: !90, line: 441, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !90, line: 429, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !556, file: !90, line: 430, baseType: !88, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !90, line: 431, baseType: !555, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !535, file: !90, line: 450, baseType: !519, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !90, line: 451, baseType: !24, size: 8, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !535, file: !90, line: 452, baseType: !24, size: 8, offset: 136)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !535, file: !90, line: 453, baseType: !24, size: 8, offset: 144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !535, file: !90, line: 454, baseType: !24, size: 8, offset: 152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !505, file: !90, line: 487, baseType: !57, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !505, file: !90, line: 488, baseType: !72, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !505, file: !90, line: 489, baseType: !40, size: 16, offset: 480)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !505, file: !90, line: 490, baseType: !40, size: 16, offset: 496)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !505, file: !90, line: 491, baseType: !24, size: 8, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !505, file: !90, line: 492, baseType: !24, size: 8, offset: 520)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !30, file: !16, line: 379, baseType: !572, size: 384)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !16, line: 192, size: 384, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !572, file: !16, line: 193, baseType: !36, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !572, file: !16, line: 193, baseType: !24, size: 8, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !16, line: 193, baseType: !24, size: 8, offset: 72)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !572, file: !16, line: 193, baseType: !40, size: 16, offset: 80)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !572, file: !16, line: 193, baseType: !24, size: 8, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !572, file: !16, line: 193, baseType: !489, size: 128, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !572, file: !16, line: 193, baseType: !36, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !572, file: !16, line: 193, baseType: !72, size: 32, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !572, file: !16, line: 194, baseType: !72, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !30, file: !16, line: 380, baseType: !584, size: 384)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !16, line: 197, size: 384, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !584, file: !16, line: 198, baseType: !36, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !584, file: !16, line: 198, baseType: !24, size: 8, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !16, line: 198, baseType: !24, size: 8, offset: 72)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !584, file: !16, line: 198, baseType: !40, size: 16, offset: 80)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !16, line: 198, baseType: !24, size: 8, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !584, file: !16, line: 200, baseType: !24, size: 8, offset: 104)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !584, file: !16, line: 201, baseType: !24, size: 8, offset: 112)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !584, file: !16, line: 202, baseType: !489, size: 128, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !584, file: !16, line: 202, baseType: !36, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !584, file: !16, line: 202, baseType: !596, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !110, line: 128, baseType: !57)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !30, file: !16, line: 381, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !16, line: 205, size: 320, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !598, file: !16, line: 206, baseType: !36, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !598, file: !16, line: 206, baseType: !24, size: 8, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !598, file: !16, line: 206, baseType: !24, size: 8, offset: 72)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !598, file: !16, line: 206, baseType: !40, size: 16, offset: 80)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !598, file: !16, line: 206, baseType: !24, size: 8, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !598, file: !16, line: 206, baseType: !489, size: 128, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !598, file: !16, line: 206, baseType: !36, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !30, file: !16, line: 382, baseType: !608, size: 384)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !16, line: 233, size: 384, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !608, file: !16, line: 234, baseType: !36, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 72)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !608, file: !16, line: 234, baseType: !40, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 104)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 112)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 120)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !608, file: !16, line: 234, baseType: !88, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !608, file: !16, line: 234, baseType: !72, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !608, file: !16, line: 234, baseType: !72, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !608, file: !16, line: 234, baseType: !72, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !608, file: !16, line: 234, baseType: !24, size: 8, offset: 296)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !608, file: !16, line: 234, baseType: !36, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !30, file: !16, line: 383, baseType: !626, size: 576)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !16, line: 237, size: 576, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !626, file: !16, line: 238, baseType: !36, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 72)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !626, file: !16, line: 238, baseType: !40, size: 16, offset: 80)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 104)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 112)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 120)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !626, file: !16, line: 238, baseType: !88, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !626, file: !16, line: 238, baseType: !72, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !626, file: !16, line: 238, baseType: !72, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !626, file: !16, line: 238, baseType: !72, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !626, file: !16, line: 238, baseType: !24, size: 8, offset: 296)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !626, file: !16, line: 238, baseType: !40, size: 16, offset: 304)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !626, file: !16, line: 239, baseType: !36, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !626, file: !16, line: 240, baseType: !83, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !626, file: !16, line: 241, baseType: !40, size: 16, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !626, file: !16, line: 242, baseType: !83, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !30, file: !16, line: 384, baseType: !648, size: 384)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !16, line: 262, size: 384, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !648, file: !16, line: 263, baseType: !36, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 72)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !648, file: !16, line: 263, baseType: !40, size: 16, offset: 80)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 104)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 112)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 120)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !648, file: !16, line: 263, baseType: !88, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !648, file: !16, line: 263, baseType: !72, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !648, file: !16, line: 263, baseType: !72, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !648, file: !16, line: 263, baseType: !72, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 296)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !648, file: !16, line: 263, baseType: !24, size: 8, offset: 304)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !648, file: !16, line: 264, baseType: !36, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !30, file: !16, line: 385, baseType: !667, size: 448)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !16, line: 245, size: 448, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !667, file: !16, line: 246, baseType: !36, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 72)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !667, file: !16, line: 246, baseType: !40, size: 16, offset: 80)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 104)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 120)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !667, file: !16, line: 246, baseType: !88, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !667, file: !16, line: 246, baseType: !72, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !667, file: !16, line: 246, baseType: !72, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !667, file: !16, line: 246, baseType: !72, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !667, file: !16, line: 246, baseType: !24, size: 8, offset: 296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !667, file: !16, line: 246, baseType: !36, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !667, file: !16, line: 247, baseType: !36, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !30, file: !16, line: 386, baseType: !686, size: 448)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !16, line: 250, size: 448, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !686, file: !16, line: 251, baseType: !36, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 72)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !686, file: !16, line: 251, baseType: !40, size: 16, offset: 80)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 104)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 120)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !686, file: !16, line: 251, baseType: !88, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !686, file: !16, line: 251, baseType: !72, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !686, file: !16, line: 251, baseType: !72, size: 32, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !686, file: !16, line: 251, baseType: !72, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 288)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !686, file: !16, line: 251, baseType: !24, size: 8, offset: 296)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !686, file: !16, line: 256, baseType: !36, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !686, file: !16, line: 257, baseType: !36, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !30, file: !16, line: 387, baseType: !705, size: 512)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !16, line: 273, size: 512, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !705, file: !16, line: 274, baseType: !36, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !705, file: !16, line: 274, baseType: !24, size: 8, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !16, line: 274, baseType: !24, size: 8, offset: 72)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !705, file: !16, line: 274, baseType: !40, size: 16, offset: 80)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !16, line: 274, baseType: !24, size: 8, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !705, file: !16, line: 274, baseType: !88, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !705, file: !16, line: 275, baseType: !72, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !705, file: !16, line: 276, baseType: !382, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !705, file: !16, line: 277, baseType: !22, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !16, line: 278, baseType: !489, size: 128, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !30, file: !16, line: 388, baseType: !718, size: 512)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !16, line: 281, size: 512, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !733, !734, !735, !741, !742}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !718, file: !16, line: 282, baseType: !36, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !718, file: !16, line: 282, baseType: !24, size: 8, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !16, line: 282, baseType: !24, size: 8, offset: 72)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !718, file: !16, line: 282, baseType: !40, size: 16, offset: 80)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !718, file: !16, line: 282, baseType: !24, size: 8, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !718, file: !16, line: 282, baseType: !24, size: 8, offset: 104)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !718, file: !16, line: 283, baseType: !24, size: 8, offset: 112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !718, file: !16, line: 284, baseType: !728, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !110, line: 1084, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!156, !72, !478, !72, !732, !22, !22}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !718, file: !16, line: 285, baseType: !88, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !718, file: !16, line: 286, baseType: !22, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !718, file: !16, line: 287, baseType: !736, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !110, line: 1102, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!156, !386, !72, !22, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !718, file: !16, line: 288, baseType: !36, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !16, line: 289, baseType: !36, size: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !30, file: !16, line: 389, baseType: !744, size: 512)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !16, line: 307, size: 512, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !744, file: !16, line: 308, baseType: !36, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !744, file: !16, line: 308, baseType: !24, size: 8, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !16, line: 308, baseType: !24, size: 8, offset: 72)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !744, file: !16, line: 308, baseType: !40, size: 16, offset: 80)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !744, file: !16, line: 308, baseType: !24, size: 8, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !744, file: !16, line: 308, baseType: !24, size: 8, offset: 104)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !744, file: !16, line: 309, baseType: !24, size: 8, offset: 112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !744, file: !16, line: 310, baseType: !24, size: 8, offset: 120)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !744, file: !16, line: 311, baseType: !22, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !16, line: 312, baseType: !88, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !744, file: !16, line: 313, baseType: !121, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !744, file: !16, line: 314, baseType: !83, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !744, file: !16, line: 315, baseType: !83, size: 64, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !744, file: !16, line: 316, baseType: !72, size: 32, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !30, file: !16, line: 390, baseType: !761, size: 448)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !16, line: 340, size: 448, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !761, file: !16, line: 341, baseType: !36, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !761, file: !16, line: 341, baseType: !24, size: 8, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !16, line: 341, baseType: !24, size: 8, offset: 72)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !761, file: !16, line: 341, baseType: !40, size: 16, offset: 80)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !16, line: 341, baseType: !24, size: 8, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !761, file: !16, line: 341, baseType: !88, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !761, file: !16, line: 342, baseType: !88, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !761, file: !16, line: 343, baseType: !22, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !761, file: !16, line: 344, baseType: !83, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !761, file: !16, line: 345, baseType: !72, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !16, line: 391, baseType: !774, size: 256)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !16, line: 350, size: 256, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !786}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !774, file: !16, line: 351, baseType: !36, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !774, file: !16, line: 351, baseType: !24, size: 8, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !16, line: 351, baseType: !24, size: 8, offset: 72)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !774, file: !16, line: 351, baseType: !40, size: 16, offset: 80)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !774, file: !16, line: 351, baseType: !24, size: 8, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !774, file: !16, line: 351, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !110, line: 1055, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !386, !22}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !774, file: !16, line: 352, baseType: !22, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !30, file: !16, line: 392, baseType: !788, size: 192)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !16, line: 357, size: 192, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !788, file: !16, line: 358, baseType: !36, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !788, file: !16, line: 358, baseType: !24, size: 8, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !788, file: !16, line: 358, baseType: !24, size: 8, offset: 72)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !788, file: !16, line: 358, baseType: !40, size: 16, offset: 80)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !788, file: !16, line: 358, baseType: !24, size: 8, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !16, line: 358, baseType: !36, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !30, file: !16, line: 399, baseType: !89, size: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !15, file: !16, line: 435, baseType: !89, size: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !15, file: !16, line: 436, baseType: !192, size: 1600)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !110, line: 127, baseType: !57)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !802, line: 148, baseType: !7)
!802 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!803 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!804 = !{!0}
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 64, elements: !364)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!807 = !{!"rsp"}
!808 = !{i32 7, !"Dwarf Version", i32 4}
!809 = !{i32 2, !"Debug Info Version", i32 3}
!810 = !{i32 1, !"wchar_size", i32 2}
!811 = !{i32 1, !"Code Model", i32 2}
!812 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!813 = distinct !DISubprogram(name: "acpi_ns_get_external_pathname", scope: !3, file: !3, line: 30, type: !814, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{!69, !88}
!816 = !{}
!817 = !DILocalVariable(name: "node", arg: 1, scope: !813, file: !3, line: 30, type: !88)
!818 = !DILocation(line: 30, column: 65, scope: !813)
!819 = !DILocalVariable(name: "name_buffer", scope: !813, file: !3, line: 32, type: !69)
!820 = !DILocation(line: 32, column: 8, scope: !813)
!821 = !DILocation(line: 36, column: 48, scope: !813)
!822 = !DILocation(line: 36, column: 16, scope: !813)
!823 = !DILocation(line: 36, column: 14, scope: !813)
!824 = !DILocation(line: 37, column: 2, scope: !813)
!825 = distinct !DISubprogram(name: "acpi_ns_get_normalized_pathname", scope: !3, file: !3, line: 289, type: !826, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !816)
!826 = !DISubroutineType(types: !827)
!827 = !{!69, !88, !24}
!828 = !DILocalVariable(name: "node", arg: 1, scope: !825, file: !3, line: 289, type: !88)
!829 = !DILocation(line: 289, column: 67, scope: !825)
!830 = !DILocalVariable(name: "no_trailing", arg: 2, scope: !825, file: !3, line: 290, type: !24)
!831 = !DILocation(line: 290, column: 14, scope: !825)
!832 = !DILocalVariable(name: "name_buffer", scope: !825, file: !3, line: 292, type: !69)
!833 = !DILocation(line: 292, column: 8, scope: !825)
!834 = !DILocalVariable(name: "size", scope: !825, file: !3, line: 293, type: !800)
!835 = !DILocation(line: 293, column: 12, scope: !825)
!836 = !DILocation(line: 299, column: 39, scope: !825)
!837 = !DILocation(line: 299, column: 54, scope: !825)
!838 = !DILocation(line: 299, column: 9, scope: !825)
!839 = !DILocation(line: 299, column: 7, scope: !825)
!840 = !DILocation(line: 300, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !825, file: !3, line: 300, column: 6)
!842 = !DILocation(line: 300, column: 6, scope: !825)
!843 = !DILocation(line: 301, column: 3, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !3, line: 300, column: 13)
!845 = !DILocation(line: 306, column: 16, scope: !825)
!846 = !DILocation(line: 306, column: 14, scope: !825)
!847 = !DILocation(line: 307, column: 7, scope: !848)
!848 = distinct !DILexicalBlock(scope: !825, file: !3, line: 307, column: 6)
!849 = !DILocation(line: 307, column: 6, scope: !825)
!850 = !DILocation(line: 308, column: 3, scope: !851)
!851 = distinct !DILexicalBlock(scope: !848, file: !3, line: 307, column: 20)
!852 = !DILocation(line: 309, column: 3, scope: !851)
!853 = !DILocation(line: 314, column: 38, scope: !825)
!854 = !DILocation(line: 314, column: 44, scope: !825)
!855 = !DILocation(line: 314, column: 62, scope: !825)
!856 = !DILocation(line: 314, column: 57, scope: !825)
!857 = !DILocation(line: 315, column: 10, scope: !825)
!858 = !DILocation(line: 314, column: 8, scope: !825)
!859 = !DILocation(line: 320, column: 2, scope: !825)
