; ModuleID = '../bcout/drivers/acpi/acpica/nsparse.llvm.bc'
source_filename = "drivers/acpi/acpica/nsparse.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 19, type: !40, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !39, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsparse.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !13, line: 305, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!19 = !{!20, !26, !30, !27, !34, !35, !36, !38}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !21, line: 421, baseType: !22)
!21 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !25, line: 27, baseType: !7)
!25 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !23, line: 17, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !25, line: 21, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !21, line: 127, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !23, line: 23, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !25, line: 31, baseType: !33)
!33 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !37, line: 148, baseType: !7)
!37 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !{!0}
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !43)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!43 = !{!44}
!44 = !DISubrange(count: 8)
!45 = !{!"rsp"}
!46 = !{i32 7, !"Dwarf Version", i32 4}
!47 = !{i32 2, !"Debug Info Version", i32 3}
!48 = !{i32 1, !"wchar_size", i32 2}
!49 = !{i32 1, !"Code Model", i32 2}
!50 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!51 = distinct !DISubprogram(name: "acpi_ns_execute_table", scope: !3, file: !3, line: 44, type: !52, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !810)
!52 = !DISubroutineType(types: !53)
!53 = !{!20, !22, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !56)
!56 = !{!57, !797, !798, !799, !800, !806, !807, !808, !809}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !55, file: !6, line: 134, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !60, line: 367, size: 576, elements: !61)
!60 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!61 = !{!62, !73, !86, !97, !110, !124, !133, !448, !465, !480, !493, !571, !583, !597, !607, !625, !647, !666, !685, !704, !717, !743, !760, !773, !787, !796}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !59, file: !60, line: 368, baseType: !63, size: 128)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !60, line: 73, size: 128, elements: !64)
!64 = !{!65, !66, !67, !68, !72}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !63, file: !60, line: 74, baseType: !58, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !63, file: !60, line: 74, baseType: !27, size: 8, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !60, line: 74, baseType: !27, size: 8, offset: 72)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !63, file: !60, line: 74, baseType: !69, size: 16, offset: 80)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !23, line: 19, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !25, line: 24, baseType: !71)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !60, line: 74, baseType: !27, size: 8, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !59, file: !60, line: 369, baseType: !74, size: 192)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !60, line: 76, size: 192, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !81, !85}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !74, file: !60, line: 77, baseType: !58, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !74, file: !60, line: 77, baseType: !27, size: 8, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !60, line: 77, baseType: !27, size: 8, offset: 72)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !74, file: !60, line: 77, baseType: !69, size: 16, offset: 80)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !74, file: !60, line: 77, baseType: !27, size: 8, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !74, file: !60, line: 77, baseType: !82, size: 24, offset: 104)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 3)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !74, file: !60, line: 78, baseType: !31, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !59, file: !60, line: 370, baseType: !87, size: 256)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !60, line: 93, size: 256, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !96}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !87, file: !60, line: 94, baseType: !58, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !87, file: !60, line: 94, baseType: !27, size: 8, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !60, line: 94, baseType: !27, size: 8, offset: 72)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !87, file: !60, line: 94, baseType: !69, size: 16, offset: 80)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !87, file: !60, line: 94, baseType: !27, size: 8, offset: 96)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !87, file: !60, line: 94, baseType: !95, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !87, file: !60, line: 94, baseType: !22, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !59, file: !60, line: 371, baseType: !98, size: 384)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !60, line: 97, size: 384, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !98, file: !60, line: 98, baseType: !58, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !98, file: !60, line: 98, baseType: !27, size: 8, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !60, line: 98, baseType: !27, size: 8, offset: 72)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !98, file: !60, line: 98, baseType: !69, size: 16, offset: 80)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !98, file: !60, line: 98, baseType: !27, size: 8, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !98, file: !60, line: 98, baseType: !26, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !98, file: !60, line: 98, baseType: !22, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !98, file: !60, line: 99, baseType: !22, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !98, file: !60, line: 100, baseType: !26, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !98, file: !60, line: 101, baseType: !54, size: 64, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !59, file: !60, line: 372, baseType: !111, size: 384)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !60, line: 104, size: 384, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !121, !122, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !111, file: !60, line: 105, baseType: !58, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !111, file: !60, line: 105, baseType: !27, size: 8, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !60, line: 105, baseType: !27, size: 8, offset: 72)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !111, file: !60, line: 105, baseType: !69, size: 16, offset: 80)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !60, line: 105, baseType: !27, size: 8, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !111, file: !60, line: 105, baseType: !54, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !111, file: !60, line: 106, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !111, file: !60, line: 107, baseType: !26, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !111, file: !60, line: 108, baseType: !22, size: 32, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !111, file: !60, line: 109, baseType: !22, size: 32, offset: 352)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !59, file: !60, line: 373, baseType: !125, size: 192)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !60, line: 118, size: 192, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !125, file: !60, line: 119, baseType: !58, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !125, file: !60, line: 119, baseType: !27, size: 8, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !60, line: 119, baseType: !27, size: 8, offset: 72)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !125, file: !60, line: 119, baseType: !69, size: 16, offset: 80)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !125, file: !60, line: 119, baseType: !27, size: 8, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !125, file: !60, line: 119, baseType: !35, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !59, file: !60, line: 374, baseType: !134, size: 448)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !60, line: 143, size: 448, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !445, !446, !447}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !134, file: !60, line: 144, baseType: !58, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !134, file: !60, line: 144, baseType: !27, size: 8, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !60, line: 144, baseType: !27, size: 8, offset: 72)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !134, file: !60, line: 144, baseType: !69, size: 16, offset: 80)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !60, line: 144, baseType: !27, size: 8, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !134, file: !60, line: 144, baseType: !27, size: 8, offset: 104)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !134, file: !60, line: 145, baseType: !27, size: 8, offset: 112)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !134, file: !60, line: 146, baseType: !27, size: 8, offset: 120)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !134, file: !60, line: 147, baseType: !58, size: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !134, file: !60, line: 148, baseType: !58, size: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !134, file: !60, line: 149, baseType: !26, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !134, file: !60, line: 153, baseType: !148, size: 64, offset: 320)
!148 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !134, file: !60, line: 150, size: 64, elements: !149)
!149 = !{!150, !444}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !148, file: !60, line: 151, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!20, !155}
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !157, line: 37, size: 9024, elements: !158)
!157 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !390, !391, !392, !393, !394, !398, !400, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !427, !428, !429, !430, !431, !432, !433, !434, !436, !442}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !156, file: !157, line: 38, baseType: !155, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !156, file: !157, line: 39, baseType: !27, size: 8, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !156, file: !157, line: 40, baseType: !27, size: 8, offset: 72)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !156, file: !157, line: 41, baseType: !69, size: 16, offset: 80)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !156, file: !157, line: 42, baseType: !27, size: 8, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !156, file: !157, line: 43, baseType: !27, size: 8, offset: 104)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !156, file: !157, line: 44, baseType: !27, size: 8, offset: 112)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !156, file: !157, line: 45, baseType: !167, size: 16, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !21, line: 445, baseType: !69)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !156, file: !157, line: 46, baseType: !27, size: 8, offset: 144)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !156, file: !157, line: 47, baseType: !27, size: 8, offset: 152)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !156, file: !157, line: 48, baseType: !27, size: 8, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !156, file: !157, line: 49, baseType: !27, size: 8, offset: 168)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !156, file: !157, line: 50, baseType: !27, size: 8, offset: 176)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !156, file: !157, line: 51, baseType: !27, size: 8, offset: 184)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !156, file: !157, line: 52, baseType: !27, size: 8, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !156, file: !157, line: 53, baseType: !27, size: 8, offset: 200)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !156, file: !157, line: 54, baseType: !26, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !156, file: !157, line: 55, baseType: !22, size: 32, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !156, file: !157, line: 56, baseType: !22, size: 32, offset: 352)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !156, file: !157, line: 57, baseType: !22, size: 32, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !156, file: !157, line: 58, baseType: !22, size: 32, offset: 416)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !156, file: !157, line: 60, baseType: !182, size: 640, offset: 448)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !273, !274, !388, !389}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !182, file: !6, line: 894, baseType: !26, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !182, file: !6, line: 895, baseType: !26, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !182, file: !6, line: 896, baseType: !26, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !182, file: !6, line: 897, baseType: !26, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !182, file: !6, line: 898, baseType: !26, size: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !182, file: !6, line: 899, baseType: !190, size: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !192)
!192 = !{!193, !213, !229}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !191, file: !6, line: 876, baseType: !194, size: 448)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !212}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !194, file: !6, line: 829, baseType: !190, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !194, file: !6, line: 829, baseType: !27, size: 8, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !6, line: 829, baseType: !27, size: 8, offset: 72)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !194, file: !6, line: 829, baseType: !69, size: 16, offset: 80)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !194, file: !6, line: 829, baseType: !26, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !6, line: 829, baseType: !190, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !194, file: !6, line: 829, baseType: !54, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !194, file: !6, line: 829, baseType: !204, size: 64, offset: 320)
!204 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !204, file: !6, line: 717, baseType: !31, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !204, file: !6, line: 718, baseType: !22, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !204, file: !6, line: 719, baseType: !95, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !204, file: !6, line: 720, baseType: !26, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !204, file: !6, line: 721, baseType: !95, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !204, file: !6, line: 722, baseType: !190, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !194, file: !6, line: 829, baseType: !27, size: 8, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !191, file: !6, line: 877, baseType: !214, size: 640)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !214, file: !6, line: 836, baseType: !190, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !214, file: !6, line: 836, baseType: !27, size: 8, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !214, file: !6, line: 836, baseType: !27, size: 8, offset: 72)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !214, file: !6, line: 836, baseType: !69, size: 16, offset: 80)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !214, file: !6, line: 836, baseType: !26, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !6, line: 836, baseType: !190, size: 64, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !214, file: !6, line: 836, baseType: !54, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !214, file: !6, line: 836, baseType: !204, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !214, file: !6, line: 836, baseType: !27, size: 8, offset: 384)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !214, file: !6, line: 836, baseType: !95, size: 64, offset: 448)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !6, line: 837, baseType: !26, size: 64, offset: 512)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !214, file: !6, line: 838, baseType: !22, size: 32, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !6, line: 839, baseType: !22, size: 32, offset: 608)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !191, file: !6, line: 878, baseType: !230, size: 1600)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !230, file: !6, line: 847, baseType: !190, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !230, file: !6, line: 847, baseType: !27, size: 8, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !230, file: !6, line: 847, baseType: !27, size: 8, offset: 72)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !230, file: !6, line: 847, baseType: !69, size: 16, offset: 80)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !230, file: !6, line: 847, baseType: !26, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !230, file: !6, line: 847, baseType: !190, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !230, file: !6, line: 847, baseType: !54, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !230, file: !6, line: 847, baseType: !204, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !230, file: !6, line: 847, baseType: !27, size: 8, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !230, file: !6, line: 847, baseType: !190, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !230, file: !6, line: 848, baseType: !190, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !230, file: !6, line: 849, baseType: !95, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !230, file: !6, line: 850, baseType: !27, size: 8, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !230, file: !6, line: 851, baseType: !95, size: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !230, file: !6, line: 852, baseType: !95, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !230, file: !6, line: 853, baseType: !95, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !230, file: !6, line: 854, baseType: !249, size: 32, offset: 896)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 32, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 4)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !230, file: !6, line: 855, baseType: !22, size: 32, offset: 928)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !230, file: !6, line: 856, baseType: !22, size: 32, offset: 960)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !230, file: !6, line: 857, baseType: !22, size: 32, offset: 992)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !230, file: !6, line: 858, baseType: !22, size: 32, offset: 1024)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !230, file: !6, line: 859, baseType: !22, size: 32, offset: 1056)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !230, file: !6, line: 860, baseType: !22, size: 32, offset: 1088)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !230, file: !6, line: 861, baseType: !22, size: 32, offset: 1120)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !230, file: !6, line: 862, baseType: !22, size: 32, offset: 1152)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !230, file: !6, line: 863, baseType: !22, size: 32, offset: 1184)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !230, file: !6, line: 864, baseType: !22, size: 32, offset: 1216)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !230, file: !6, line: 865, baseType: !22, size: 32, offset: 1248)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !230, file: !6, line: 866, baseType: !22, size: 32, offset: 1280)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !230, file: !6, line: 867, baseType: !22, size: 32, offset: 1312)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !230, file: !6, line: 868, baseType: !69, size: 16, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !230, file: !6, line: 869, baseType: !27, size: 8, offset: 1360)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !230, file: !6, line: 870, baseType: !27, size: 8, offset: 1368)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !230, file: !6, line: 871, baseType: !27, size: 8, offset: 1376)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !230, file: !6, line: 872, baseType: !270, size: 160, offset: 1384)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 160, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 20)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !182, file: !6, line: 900, baseType: !54, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !182, file: !6, line: 901, baseType: !275, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !277)
!277 = !{!278, !286, !299, !308, !317, !330, !344, !356, !366}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !276, file: !6, line: 664, baseType: !279, size: 128)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !280)
!280 = !{!281, !282, !283, !284, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !6, line: 568, baseType: !35, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !279, file: !6, line: 568, baseType: !27, size: 8, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !6, line: 568, baseType: !27, size: 8, offset: 72)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !279, file: !6, line: 568, baseType: !69, size: 16, offset: 80)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !279, file: !6, line: 568, baseType: !69, size: 16, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !276, file: !6, line: 665, baseType: !287, size: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !6, line: 594, baseType: !35, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !6, line: 594, baseType: !27, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !6, line: 594, baseType: !27, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !6, line: 594, baseType: !69, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !6, line: 594, baseType: !69, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !287, file: !6, line: 594, baseType: !69, size: 16, offset: 112)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !287, file: !6, line: 595, baseType: !190, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !287, file: !6, line: 596, baseType: !26, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !287, file: !6, line: 597, baseType: !26, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !287, file: !6, line: 598, baseType: !31, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !276, file: !6, line: 666, baseType: !300, size: 192)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !6, line: 574, baseType: !35, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !300, file: !6, line: 574, baseType: !27, size: 8, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !6, line: 574, baseType: !27, size: 8, offset: 72)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !300, file: !6, line: 574, baseType: !69, size: 16, offset: 80)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !300, file: !6, line: 574, baseType: !69, size: 16, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !300, file: !6, line: 574, baseType: !58, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !276, file: !6, line: 667, baseType: !309, size: 192)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !309, file: !6, line: 605, baseType: !35, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !309, file: !6, line: 605, baseType: !27, size: 8, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !6, line: 605, baseType: !27, size: 8, offset: 72)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !309, file: !6, line: 605, baseType: !69, size: 16, offset: 80)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !309, file: !6, line: 605, baseType: !69, size: 16, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !309, file: !6, line: 605, baseType: !54, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !276, file: !6, line: 668, baseType: !318, size: 448)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !6, line: 609, baseType: !35, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !318, file: !6, line: 609, baseType: !27, size: 8, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !318, file: !6, line: 609, baseType: !27, size: 8, offset: 72)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !318, file: !6, line: 609, baseType: !69, size: 16, offset: 80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !318, file: !6, line: 609, baseType: !69, size: 16, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !318, file: !6, line: 609, baseType: !22, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !318, file: !6, line: 610, baseType: !190, size: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !318, file: !6, line: 611, baseType: !26, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !318, file: !6, line: 612, baseType: !26, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !318, file: !6, line: 613, baseType: !22, size: 32, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !276, file: !6, line: 669, baseType: !331, size: 512)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !6, line: 581, baseType: !35, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !331, file: !6, line: 581, baseType: !27, size: 8, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !331, file: !6, line: 581, baseType: !27, size: 8, offset: 72)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !331, file: !6, line: 581, baseType: !69, size: 16, offset: 80)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !331, file: !6, line: 581, baseType: !69, size: 16, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !331, file: !6, line: 581, baseType: !22, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !331, file: !6, line: 582, baseType: !58, size: 64, offset: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !331, file: !6, line: 583, baseType: !58, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !331, file: !6, line: 584, baseType: !155, size: 64, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !331, file: !6, line: 585, baseType: !35, size: 64, offset: 384)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !331, file: !6, line: 586, baseType: !22, size: 32, offset: 448)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !276, file: !6, line: 670, baseType: !345, size: 320)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !6, line: 621, baseType: !35, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !345, file: !6, line: 621, baseType: !27, size: 8, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !345, file: !6, line: 621, baseType: !27, size: 8, offset: 72)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !345, file: !6, line: 621, baseType: !69, size: 16, offset: 80)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !6, line: 621, baseType: !69, size: 16, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !345, file: !6, line: 621, baseType: !27, size: 8, offset: 112)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !345, file: !6, line: 622, baseType: !155, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !345, file: !6, line: 623, baseType: !58, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !345, file: !6, line: 624, baseType: !31, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !276, file: !6, line: 671, baseType: !357, size: 640)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !6, line: 632, baseType: !35, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !357, file: !6, line: 632, baseType: !27, size: 8, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !357, file: !6, line: 632, baseType: !27, size: 8, offset: 72)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !357, file: !6, line: 632, baseType: !69, size: 16, offset: 80)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !6, line: 632, baseType: !69, size: 16, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !357, file: !6, line: 633, baseType: !365, size: 512, offset: 128)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 512, elements: !43)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !276, file: !6, line: 672, baseType: !367, size: 320)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !6, line: 655, baseType: !35, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !367, file: !6, line: 655, baseType: !27, size: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !367, file: !6, line: 655, baseType: !27, size: 8, offset: 72)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !367, file: !6, line: 655, baseType: !69, size: 16, offset: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !6, line: 655, baseType: !69, size: 16, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !367, file: !6, line: 655, baseType: !27, size: 8, offset: 112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !367, file: !6, line: 656, baseType: !54, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !367, file: !6, line: 657, baseType: !58, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !367, file: !6, line: 658, baseType: !378, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !380)
!380 = !{!381, !387}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !379, file: !6, line: 646, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !21, line: 1052, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386, !22, !35}
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !21, line: 424, baseType: !35)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !379, file: !6, line: 647, baseType: !35, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !182, file: !6, line: 902, baseType: !190, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !182, file: !6, line: 903, baseType: !22, size: 32, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !156, file: !157, line: 61, baseType: !22, size: 32, offset: 1088)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !156, file: !157, line: 62, baseType: !22, size: 32, offset: 1120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !156, file: !157, line: 63, baseType: !69, size: 16, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !156, file: !157, line: 64, baseType: !27, size: 8, offset: 1168)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !156, file: !157, line: 66, baseType: !395, size: 2688, offset: 1216)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 2688, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 7)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !156, file: !157, line: 67, baseType: !399, size: 3072, offset: 3904)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 3072, elements: !43)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !156, file: !157, line: 68, baseType: !401, size: 576, offset: 6976)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 576, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 9)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !156, file: !157, line: 69, baseType: !120, size: 64, offset: 7552)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !156, file: !157, line: 71, baseType: !26, size: 64, offset: 7616)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !156, file: !157, line: 72, baseType: !120, size: 64, offset: 7680)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !156, file: !157, line: 73, baseType: !275, size: 64, offset: 7744)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !156, file: !157, line: 74, baseType: !54, size: 64, offset: 7808)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !156, file: !157, line: 75, baseType: !58, size: 64, offset: 7872)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !156, file: !157, line: 76, baseType: !54, size: 64, offset: 7936)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !156, file: !157, line: 77, baseType: !190, size: 64, offset: 8000)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !156, file: !157, line: 78, baseType: !58, size: 64, offset: 8064)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !156, file: !157, line: 79, baseType: !54, size: 64, offset: 8128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !156, file: !157, line: 80, baseType: !95, size: 64, offset: 8192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !156, file: !157, line: 81, baseType: !190, size: 64, offset: 8256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !156, file: !157, line: 82, baseType: !417, size: 64, offset: 8320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !420)
!420 = !{!421, !422, !423, !424, !425, !426}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !419, file: !6, line: 706, baseType: !22, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !419, file: !6, line: 707, baseType: !22, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !419, file: !6, line: 708, baseType: !69, size: 16, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !419, file: !6, line: 709, baseType: !27, size: 8, offset: 80)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !419, file: !6, line: 710, baseType: !27, size: 8, offset: 88)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !419, file: !6, line: 711, baseType: !27, size: 8, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !156, file: !157, line: 83, baseType: !190, size: 64, offset: 8384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !156, file: !157, line: 84, baseType: !58, size: 64, offset: 8448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !156, file: !157, line: 85, baseType: !275, size: 64, offset: 8512)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !156, file: !157, line: 86, baseType: !58, size: 64, offset: 8576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !156, file: !157, line: 87, baseType: !275, size: 64, offset: 8640)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !156, file: !157, line: 88, baseType: !190, size: 64, offset: 8704)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !156, file: !157, line: 89, baseType: !190, size: 64, offset: 8768)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !156, file: !157, line: 90, baseType: !435, size: 64, offset: 8832)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !156, file: !157, line: 91, baseType: !437, size: 64, offset: 8896)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!20, !155, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !156, file: !157, line: 92, baseType: !443, size: 64, offset: 8960)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !148, file: !60, line: 152, baseType: !58, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !134, file: !60, line: 155, baseType: !22, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !134, file: !60, line: 156, baseType: !167, size: 16, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !134, file: !60, line: 157, baseType: !27, size: 8, offset: 432)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !59, file: !60, line: 375, baseType: !449, size: 576)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !60, line: 122, size: 576, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !449, file: !60, line: 123, baseType: !58, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !449, file: !60, line: 123, baseType: !27, size: 8, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !60, line: 123, baseType: !27, size: 8, offset: 72)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !449, file: !60, line: 123, baseType: !69, size: 16, offset: 80)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !60, line: 123, baseType: !27, size: 8, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !449, file: !60, line: 123, baseType: !27, size: 8, offset: 104)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !449, file: !60, line: 124, baseType: !69, size: 16, offset: 112)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !449, file: !60, line: 125, baseType: !35, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !449, file: !60, line: 126, baseType: !31, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !449, file: !60, line: 127, baseType: !435, size: 64, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !449, file: !60, line: 128, baseType: !58, size: 64, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !60, line: 129, baseType: !58, size: 64, offset: 384)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !449, file: !60, line: 130, baseType: !54, size: 64, offset: 448)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !449, file: !60, line: 131, baseType: !27, size: 8, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !59, file: !60, line: 376, baseType: !466, size: 448)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !60, line: 134, size: 448, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !479}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !466, file: !60, line: 135, baseType: !58, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !466, file: !60, line: 135, baseType: !27, size: 8, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !466, file: !60, line: 135, baseType: !27, size: 8, offset: 72)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !466, file: !60, line: 135, baseType: !69, size: 16, offset: 80)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !466, file: !60, line: 135, baseType: !27, size: 8, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !466, file: !60, line: 135, baseType: !27, size: 8, offset: 104)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !466, file: !60, line: 136, baseType: !54, size: 64, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !466, file: !60, line: 137, baseType: !58, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !466, file: !60, line: 138, baseType: !58, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !466, file: !60, line: 139, baseType: !478, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !21, line: 129, baseType: !31)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !466, file: !60, line: 140, baseType: !22, size: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !59, file: !60, line: 377, baseType: !481, size: 320)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !60, line: 184, size: 320, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !492}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !481, file: !60, line: 185, baseType: !58, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !481, file: !60, line: 185, baseType: !27, size: 8, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !481, file: !60, line: 185, baseType: !27, size: 8, offset: 72)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !481, file: !60, line: 185, baseType: !69, size: 16, offset: 80)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !481, file: !60, line: 185, baseType: !27, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !481, file: !60, line: 185, baseType: !489, size: 128, offset: 128)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 2)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !481, file: !60, line: 185, baseType: !58, size: 64, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !59, file: !60, line: 378, baseType: !494, size: 384)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !60, line: 187, size: 384, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !494, file: !60, line: 188, baseType: !58, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !494, file: !60, line: 188, baseType: !27, size: 8, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !494, file: !60, line: 188, baseType: !27, size: 8, offset: 72)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !494, file: !60, line: 188, baseType: !69, size: 16, offset: 80)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !494, file: !60, line: 188, baseType: !27, size: 8, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !494, file: !60, line: 189, baseType: !489, size: 128, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !494, file: !60, line: 189, baseType: !58, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !494, file: !60, line: 189, baseType: !504, size: 64, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !506)
!506 = !{!507, !508, !509, !510, !518, !533, !565, !566, !567, !568, !569, !570}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !505, file: !6, line: 481, baseType: !54, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !505, file: !6, line: 482, baseType: !504, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !505, file: !6, line: 483, baseType: !504, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !505, file: !6, line: 484, baseType: !511, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !513)
!513 = !{!514, !515, !516, !517}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !512, file: !6, line: 498, baseType: !511, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !512, file: !6, line: 499, baseType: !511, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !512, file: !6, line: 500, baseType: !504, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !512, file: !6, line: 501, baseType: !22, size: 32, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !505, file: !6, line: 485, baseType: !519, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !521)
!521 = !{!522, !527, !528, !529, !530, !531, !532}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !520, file: !6, line: 467, baseType: !523, size: 128)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !523, file: !6, line: 460, baseType: !27, size: 8)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !523, file: !6, line: 461, baseType: !31, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !520, file: !6, line: 468, baseType: !523, size: 128, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !520, file: !6, line: 469, baseType: !69, size: 16, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !520, file: !6, line: 470, baseType: !27, size: 8, offset: 272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !520, file: !6, line: 471, baseType: !27, size: 8, offset: 280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !520, file: !6, line: 472, baseType: !27, size: 8, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !520, file: !6, line: 473, baseType: !27, size: 8, offset: 296)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !505, file: !6, line: 486, baseType: !534, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !536)
!536 = !{!537, !560, !561, !562, !563, !564}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !535, file: !6, line: 449, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !539)
!539 = !{!540, !541, !554}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !538, file: !6, line: 439, baseType: !54, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !538, file: !6, line: 440, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !544)
!544 = !{!545, !550, !551, !552, !553}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !543, file: !6, line: 420, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !21, line: 1049, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!22, !386, !22, !35}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !543, file: !6, line: 421, baseType: !35, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !543, file: !6, line: 422, baseType: !54, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !543, file: !6, line: 423, baseType: !27, size: 8, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !543, file: !6, line: 424, baseType: !27, size: 8, offset: 200)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !538, file: !6, line: 441, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !556, file: !6, line: 430, baseType: !54, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !6, line: 431, baseType: !555, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !535, file: !6, line: 450, baseType: !519, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !6, line: 451, baseType: !27, size: 8, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !535, file: !6, line: 452, baseType: !27, size: 8, offset: 136)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !535, file: !6, line: 453, baseType: !27, size: 8, offset: 144)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !535, file: !6, line: 454, baseType: !27, size: 8, offset: 152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !505, file: !6, line: 487, baseType: !31, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !505, file: !6, line: 488, baseType: !22, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !505, file: !6, line: 489, baseType: !69, size: 16, offset: 480)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !505, file: !6, line: 490, baseType: !69, size: 16, offset: 496)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !505, file: !6, line: 491, baseType: !27, size: 8, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !505, file: !6, line: 492, baseType: !27, size: 8, offset: 520)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !59, file: !60, line: 379, baseType: !572, size: 384)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !60, line: 192, size: 384, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !572, file: !60, line: 193, baseType: !58, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !572, file: !60, line: 193, baseType: !27, size: 8, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !60, line: 193, baseType: !27, size: 8, offset: 72)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !572, file: !60, line: 193, baseType: !69, size: 16, offset: 80)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !572, file: !60, line: 193, baseType: !27, size: 8, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !572, file: !60, line: 193, baseType: !489, size: 128, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !572, file: !60, line: 193, baseType: !58, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !572, file: !60, line: 193, baseType: !22, size: 32, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !572, file: !60, line: 194, baseType: !22, size: 32, offset: 352)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !59, file: !60, line: 380, baseType: !584, size: 384)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !60, line: 197, size: 384, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !584, file: !60, line: 198, baseType: !58, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !584, file: !60, line: 198, baseType: !27, size: 8, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !584, file: !60, line: 198, baseType: !27, size: 8, offset: 72)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !584, file: !60, line: 198, baseType: !69, size: 16, offset: 80)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !60, line: 198, baseType: !27, size: 8, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !584, file: !60, line: 200, baseType: !27, size: 8, offset: 104)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !584, file: !60, line: 201, baseType: !27, size: 8, offset: 112)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !584, file: !60, line: 202, baseType: !489, size: 128, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !584, file: !60, line: 202, baseType: !58, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !584, file: !60, line: 202, baseType: !596, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !21, line: 128, baseType: !31)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !59, file: !60, line: 381, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !60, line: 205, size: 320, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !598, file: !60, line: 206, baseType: !58, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !598, file: !60, line: 206, baseType: !27, size: 8, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !598, file: !60, line: 206, baseType: !27, size: 8, offset: 72)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !598, file: !60, line: 206, baseType: !69, size: 16, offset: 80)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !598, file: !60, line: 206, baseType: !27, size: 8, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !598, file: !60, line: 206, baseType: !489, size: 128, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !598, file: !60, line: 206, baseType: !58, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !59, file: !60, line: 382, baseType: !608, size: 384)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !60, line: 233, size: 384, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !608, file: !60, line: 234, baseType: !58, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 72)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !608, file: !60, line: 234, baseType: !69, size: 16, offset: 80)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 104)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 112)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 120)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !608, file: !60, line: 234, baseType: !54, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !608, file: !60, line: 234, baseType: !22, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !608, file: !60, line: 234, baseType: !22, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !608, file: !60, line: 234, baseType: !22, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !608, file: !60, line: 234, baseType: !27, size: 8, offset: 296)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !608, file: !60, line: 234, baseType: !58, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !59, file: !60, line: 383, baseType: !626, size: 576)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !60, line: 237, size: 576, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !626, file: !60, line: 238, baseType: !58, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 72)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !626, file: !60, line: 238, baseType: !69, size: 16, offset: 80)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 104)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 112)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 120)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !626, file: !60, line: 238, baseType: !54, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !626, file: !60, line: 238, baseType: !22, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !626, file: !60, line: 238, baseType: !22, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !626, file: !60, line: 238, baseType: !22, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !626, file: !60, line: 238, baseType: !27, size: 8, offset: 296)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !626, file: !60, line: 238, baseType: !69, size: 16, offset: 304)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !626, file: !60, line: 239, baseType: !58, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !626, file: !60, line: 240, baseType: !26, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !626, file: !60, line: 241, baseType: !69, size: 16, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !626, file: !60, line: 242, baseType: !26, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !59, file: !60, line: 384, baseType: !648, size: 384)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !60, line: 262, size: 384, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !648, file: !60, line: 263, baseType: !58, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 72)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !648, file: !60, line: 263, baseType: !69, size: 16, offset: 80)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 104)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 112)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 120)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !648, file: !60, line: 263, baseType: !54, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !648, file: !60, line: 263, baseType: !22, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !648, file: !60, line: 263, baseType: !22, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !648, file: !60, line: 263, baseType: !22, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 296)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !648, file: !60, line: 263, baseType: !27, size: 8, offset: 304)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !648, file: !60, line: 264, baseType: !58, size: 64, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !59, file: !60, line: 385, baseType: !667, size: 448)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !60, line: 245, size: 448, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !667, file: !60, line: 246, baseType: !58, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 72)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !667, file: !60, line: 246, baseType: !69, size: 16, offset: 80)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 104)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 120)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !667, file: !60, line: 246, baseType: !54, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !667, file: !60, line: 246, baseType: !22, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !667, file: !60, line: 246, baseType: !22, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !667, file: !60, line: 246, baseType: !22, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !667, file: !60, line: 246, baseType: !27, size: 8, offset: 296)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !667, file: !60, line: 246, baseType: !58, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !667, file: !60, line: 247, baseType: !58, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !59, file: !60, line: 386, baseType: !686, size: 448)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !60, line: 250, size: 448, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !686, file: !60, line: 251, baseType: !58, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 72)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !686, file: !60, line: 251, baseType: !69, size: 16, offset: 80)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 104)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 120)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !686, file: !60, line: 251, baseType: !54, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !686, file: !60, line: 251, baseType: !22, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !686, file: !60, line: 251, baseType: !22, size: 32, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !686, file: !60, line: 251, baseType: !22, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 288)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !686, file: !60, line: 251, baseType: !27, size: 8, offset: 296)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !686, file: !60, line: 256, baseType: !58, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !686, file: !60, line: 257, baseType: !58, size: 64, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !59, file: !60, line: 387, baseType: !705, size: 512)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !60, line: 273, size: 512, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !705, file: !60, line: 274, baseType: !58, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !705, file: !60, line: 274, baseType: !27, size: 8, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !60, line: 274, baseType: !27, size: 8, offset: 72)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !705, file: !60, line: 274, baseType: !69, size: 16, offset: 80)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !60, line: 274, baseType: !27, size: 8, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !705, file: !60, line: 274, baseType: !54, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !705, file: !60, line: 275, baseType: !22, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !705, file: !60, line: 276, baseType: !382, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !705, file: !60, line: 277, baseType: !35, size: 64, offset: 320)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !60, line: 278, baseType: !489, size: 128, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !59, file: !60, line: 388, baseType: !718, size: 512)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !60, line: 281, size: 512, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !733, !734, !735, !741, !742}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !718, file: !60, line: 282, baseType: !58, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !718, file: !60, line: 282, baseType: !27, size: 8, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !60, line: 282, baseType: !27, size: 8, offset: 72)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !718, file: !60, line: 282, baseType: !69, size: 16, offset: 80)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !718, file: !60, line: 282, baseType: !27, size: 8, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !718, file: !60, line: 282, baseType: !27, size: 8, offset: 104)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !718, file: !60, line: 283, baseType: !27, size: 8, offset: 112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !718, file: !60, line: 284, baseType: !728, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !21, line: 1084, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!20, !22, !478, !22, !732, !35, !35}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !718, file: !60, line: 285, baseType: !54, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !718, file: !60, line: 286, baseType: !35, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !718, file: !60, line: 287, baseType: !736, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !21, line: 1102, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!20, !386, !22, !35, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !718, file: !60, line: 288, baseType: !58, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !60, line: 289, baseType: !58, size: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !59, file: !60, line: 389, baseType: !744, size: 512)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !60, line: 307, size: 512, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !744, file: !60, line: 308, baseType: !58, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !744, file: !60, line: 308, baseType: !27, size: 8, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !60, line: 308, baseType: !27, size: 8, offset: 72)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !744, file: !60, line: 308, baseType: !69, size: 16, offset: 80)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !744, file: !60, line: 308, baseType: !27, size: 8, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !744, file: !60, line: 308, baseType: !27, size: 8, offset: 104)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !744, file: !60, line: 309, baseType: !27, size: 8, offset: 112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !744, file: !60, line: 310, baseType: !27, size: 8, offset: 120)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !744, file: !60, line: 311, baseType: !35, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !60, line: 312, baseType: !54, size: 64, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !744, file: !60, line: 313, baseType: !120, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !744, file: !60, line: 314, baseType: !26, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !744, file: !60, line: 315, baseType: !26, size: 64, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !744, file: !60, line: 316, baseType: !22, size: 32, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !59, file: !60, line: 390, baseType: !761, size: 448)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !60, line: 340, size: 448, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !761, file: !60, line: 341, baseType: !58, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !761, file: !60, line: 341, baseType: !27, size: 8, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !60, line: 341, baseType: !27, size: 8, offset: 72)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !761, file: !60, line: 341, baseType: !69, size: 16, offset: 80)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !761, file: !60, line: 341, baseType: !27, size: 8, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !761, file: !60, line: 341, baseType: !54, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !761, file: !60, line: 342, baseType: !54, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !761, file: !60, line: 343, baseType: !35, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !761, file: !60, line: 344, baseType: !26, size: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !761, file: !60, line: 345, baseType: !22, size: 32, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !60, line: 391, baseType: !774, size: 256)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !60, line: 350, size: 256, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !786}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !774, file: !60, line: 351, baseType: !58, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !774, file: !60, line: 351, baseType: !27, size: 8, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !774, file: !60, line: 351, baseType: !27, size: 8, offset: 72)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !774, file: !60, line: 351, baseType: !69, size: 16, offset: 80)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !774, file: !60, line: 351, baseType: !27, size: 8, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !774, file: !60, line: 351, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !21, line: 1055, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !386, !35}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !774, file: !60, line: 352, baseType: !35, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !59, file: !60, line: 392, baseType: !788, size: 192)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !60, line: 357, size: 192, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !788, file: !60, line: 358, baseType: !58, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !788, file: !60, line: 358, baseType: !27, size: 8, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !788, file: !60, line: 358, baseType: !27, size: 8, offset: 72)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !788, file: !60, line: 358, baseType: !69, size: 16, offset: 80)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !788, file: !60, line: 358, baseType: !27, size: 8, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !788, file: !60, line: 358, baseType: !58, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !59, file: !60, line: 399, baseType: !55, size: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !55, file: !6, line: 135, baseType: !27, size: 8, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !55, file: !6, line: 136, baseType: !27, size: 8, offset: 72)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !6, line: 137, baseType: !69, size: 16, offset: 80)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !6, line: 138, baseType: !801, size: 32, offset: 96)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !802, line: 327, size: 32, elements: !803)
!802 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !801, file: !802, line: 328, baseType: !22, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !801, file: !802, line: 329, baseType: !249, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !55, file: !6, line: 139, baseType: !54, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !55, file: !6, line: 140, baseType: !54, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !55, file: !6, line: 141, baseType: !54, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !55, file: !6, line: 142, baseType: !167, size: 16, offset: 320)
!810 = !{}
!811 = !DILocalVariable(name: "table_index", arg: 1, scope: !51, file: !3, line: 44, type: !22)
!812 = !DILocation(line: 44, column: 27, scope: !51)
!813 = !DILocalVariable(name: "start_node", arg: 2, scope: !51, file: !3, line: 44, type: !54)
!814 = !DILocation(line: 44, column: 68, scope: !51)
!815 = !DILocalVariable(name: "status", scope: !51, file: !3, line: 46, type: !20)
!816 = !DILocation(line: 46, column: 14, scope: !51)
!817 = !DILocalVariable(name: "table", scope: !51, file: !3, line: 47, type: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !802, line: 68, size: 288, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !829, !831, !832, !833}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !819, file: !802, line: 69, baseType: !249, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !819, file: !802, line: 70, baseType: !22, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !819, file: !802, line: 71, baseType: !27, size: 8, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !819, file: !802, line: 72, baseType: !27, size: 8, offset: 72)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !819, file: !802, line: 73, baseType: !826, size: 48, offset: 80)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 48, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 6)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !819, file: !802, line: 74, baseType: !830, size: 64, offset: 128)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64, elements: !43)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !819, file: !802, line: 75, baseType: !22, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !819, file: !802, line: 76, baseType: !249, size: 32, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !819, file: !802, line: 77, baseType: !22, size: 32, offset: 256)
!834 = !DILocation(line: 47, column: 28, scope: !51)
!835 = !DILocalVariable(name: "owner_id", scope: !51, file: !3, line: 48, type: !167)
!836 = !DILocation(line: 48, column: 16, scope: !51)
!837 = !DILocalVariable(name: "info", scope: !51, file: !3, line: 49, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_evaluate_info", file: !157, line: 152, size: 704, elements: !840)
!840 = !{!841, !842, !844, !845, !846, !847, !848, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_node", scope: !839, file: !157, line: 155, baseType: !54, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "relative_pathname", scope: !839, file: !157, line: 156, baseType: !843, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !839, file: !157, line: 157, baseType: !120, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !839, file: !157, line: 159, baseType: !54, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !839, file: !157, line: 160, baseType: !58, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "full_pathname", scope: !839, file: !157, line: 161, baseType: !95, size: 64, offset: 320)
