; ModuleID = '../bcout/drivers/acpi/acpica/nsprepkg.llvm.bc'
source_filename = "drivers/acpi/acpica/nsprepkg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_evaluate_info = type { %struct.acpi_namespace_node*, i8*, %union.acpi_operand_object**, %struct.acpi_namespace_node*, %union.acpi_operand_object*, i8*, %union.acpi_predefined_info*, %union.acpi_operand_object*, %union.acpi_operand_object*, i32, i32, i16, i16, i8, i8, i8 }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_name_union = type { i32 }
%union.acpi_predefined_info = type { %struct.acpi_name_info }
%struct.acpi_name_info = type <{ [4 x i8], i16, i8 }>
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 16, type: !30, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !22, globals: !29, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsprepkg.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "acpi_return_package_types", file: !6, line: 86, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/acpredef.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!9 = !DIEnumerator(name: "ACPI_PTYPE1_FIXED", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_PTYPE1_VAR", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_PTYPE1_OPTION", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "ACPI_PTYPE2", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "ACPI_PTYPE2_COUNT", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "ACPI_PTYPE2_PKG_COUNT", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "ACPI_PTYPE2_FIXED", value: 7, isUnsigned: true)
!16 = !DIEnumerator(name: "ACPI_PTYPE2_MIN", value: 8, isUnsigned: true)
!17 = !DIEnumerator(name: "ACPI_PTYPE2_REV_FIXED", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "ACPI_PTYPE2_FIX_VAR", value: 10, isUnsigned: true)
!19 = !DIEnumerator(name: "ACPI_PTYPE2_VAR_VAR", value: 11, isUnsigned: true)
!20 = !DIEnumerator(name: "ACPI_PTYPE2_UUID_PAIR", value: 12, isUnsigned: true)
!21 = !DIEnumerator(name: "ACPI_PTYPE_CUSTOM", value: 13, isUnsigned: true)
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !24, line: 421, baseType: !25)
!24 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !26, line: 21, baseType: !27)
!26 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !28, line: 27, baseType: !7)
!28 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!29 = !{!0}
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 72, elements: !33)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!33 = !{!34}
!34 = !DISubrange(count: 9)
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 2}
!38 = !{i32 1, !"Code Model", i32 2}
!39 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!40 = distinct !DISubprogram(name: "acpi_ns_check_package", scope: !3, file: !3, line: 51, type: !41, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !873)
!41 = !DISubroutineType(types: !42)
!42 = !{!23, !43, !122}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_evaluate_info", file: !45, line: 152, size: 704, elements: !46)
!45 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !812, !814, !815, !816, !817, !818, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_node", scope: !44, file: !45, line: 155, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !50, line: 133, size: 384, elements: !51)
!50 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!51 = !{!52, !799, !800, !801, !802, !808, !809, !810, !811}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !49, file: !50, line: 134, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !55, line: 367, size: 576, elements: !56)
!55 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!56 = !{!57, !71, !87, !98, !112, !126, !136, !450, !467, !482, !495, !573, !585, !599, !609, !627, !649, !668, !687, !706, !719, !745, !762, !775, !789, !798}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !54, file: !55, line: 368, baseType: !58, size: 128)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !55, line: 73, size: 128, elements: !59)
!59 = !{!60, !61, !65, !66, !70}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !58, file: !55, line: 74, baseType: !53, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !58, file: !55, line: 74, baseType: !62, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !26, line: 17, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !28, line: 21, baseType: !64)
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !55, line: 74, baseType: !62, size: 8, offset: 72)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !58, file: !55, line: 74, baseType: !67, size: 16, offset: 80)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !26, line: 19, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !28, line: 24, baseType: !69)
!69 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !55, line: 74, baseType: !62, size: 8, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !54, file: !55, line: 369, baseType: !72, size: 192)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !55, line: 76, size: 192, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !83}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !72, file: !55, line: 77, baseType: !53, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !72, file: !55, line: 77, baseType: !62, size: 8, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !55, line: 77, baseType: !62, size: 8, offset: 72)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !72, file: !55, line: 77, baseType: !67, size: 16, offset: 80)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !72, file: !55, line: 77, baseType: !62, size: 8, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !72, file: !55, line: 77, baseType: !80, size: 24, offset: 104)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 24, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !72, file: !55, line: 78, baseType: !84, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !26, line: 23, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !28, line: 31, baseType: !86)
!86 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !54, file: !55, line: 370, baseType: !88, size: 256)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !55, line: 93, size: 256, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !88, file: !55, line: 94, baseType: !53, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !88, file: !55, line: 94, baseType: !62, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !55, line: 94, baseType: !62, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !88, file: !55, line: 94, baseType: !67, size: 16, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !55, line: 94, baseType: !62, size: 8, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !88, file: !55, line: 94, baseType: !96, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !88, file: !55, line: 94, baseType: !25, size: 32, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !54, file: !55, line: 371, baseType: !99, size: 384)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !55, line: 97, size: 384, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !108, !109, !110, !111}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !99, file: !55, line: 98, baseType: !53, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !99, file: !55, line: 98, baseType: !62, size: 8, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !55, line: 98, baseType: !62, size: 8, offset: 72)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !99, file: !55, line: 98, baseType: !67, size: 16, offset: 80)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !99, file: !55, line: 98, baseType: !62, size: 8, offset: 96)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !99, file: !55, line: 98, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !99, file: !55, line: 98, baseType: !25, size: 32, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !99, file: !55, line: 99, baseType: !25, size: 32, offset: 224)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !99, file: !55, line: 100, baseType: !107, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !99, file: !55, line: 101, baseType: !48, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !54, file: !55, line: 372, baseType: !113, size: 384)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !55, line: 104, size: 384, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !123, !124, !125}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !113, file: !55, line: 105, baseType: !53, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !113, file: !55, line: 105, baseType: !62, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !55, line: 105, baseType: !62, size: 8, offset: 72)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !113, file: !55, line: 105, baseType: !67, size: 16, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !55, line: 105, baseType: !62, size: 8, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !113, file: !55, line: 105, baseType: !48, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !113, file: !55, line: 106, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !113, file: !55, line: 107, baseType: !107, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !113, file: !55, line: 108, baseType: !25, size: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !113, file: !55, line: 109, baseType: !25, size: 32, offset: 352)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !54, file: !55, line: 373, baseType: !127, size: 192)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !55, line: 118, size: 192, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !127, file: !55, line: 119, baseType: !53, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !127, file: !55, line: 119, baseType: !62, size: 8, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !55, line: 119, baseType: !62, size: 8, offset: 72)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !127, file: !55, line: 119, baseType: !67, size: 16, offset: 80)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !55, line: 119, baseType: !62, size: 8, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !127, file: !55, line: 119, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !54, file: !55, line: 374, baseType: !137, size: 448)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !55, line: 143, size: 448, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !447, !448, !449}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !137, file: !55, line: 144, baseType: !53, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !137, file: !55, line: 144, baseType: !62, size: 8, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !137, file: !55, line: 144, baseType: !62, size: 8, offset: 72)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !137, file: !55, line: 144, baseType: !67, size: 16, offset: 80)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !137, file: !55, line: 144, baseType: !62, size: 8, offset: 96)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !137, file: !55, line: 144, baseType: !62, size: 8, offset: 104)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !137, file: !55, line: 145, baseType: !62, size: 8, offset: 112)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !137, file: !55, line: 146, baseType: !62, size: 8, offset: 120)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !137, file: !55, line: 147, baseType: !53, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !137, file: !55, line: 148, baseType: !53, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !137, file: !55, line: 149, baseType: !107, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !137, file: !55, line: 153, baseType: !151, size: 64, offset: 320)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !55, line: 150, size: 64, elements: !152)
!152 = !{!153, !446}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !151, file: !55, line: 151, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !50, line: 248, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{!23, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !45, line: 37, size: 9024, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !394, !395, !396, !397, !398, !402, !404, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !429, !430, !431, !432, !433, !434, !435, !436, !438, !444}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !45, line: 38, baseType: !158, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !159, file: !45, line: 39, baseType: !62, size: 8, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !159, file: !45, line: 40, baseType: !62, size: 8, offset: 72)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !159, file: !45, line: 41, baseType: !67, size: 16, offset: 80)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !159, file: !45, line: 42, baseType: !62, size: 8, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !159, file: !45, line: 43, baseType: !62, size: 8, offset: 104)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !159, file: !45, line: 44, baseType: !62, size: 8, offset: 112)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !159, file: !45, line: 45, baseType: !169, size: 16, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !24, line: 445, baseType: !67)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !159, file: !45, line: 46, baseType: !62, size: 8, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !159, file: !45, line: 47, baseType: !62, size: 8, offset: 152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !159, file: !45, line: 48, baseType: !62, size: 8, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !159, file: !45, line: 49, baseType: !62, size: 8, offset: 168)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !159, file: !45, line: 50, baseType: !62, size: 8, offset: 176)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !159, file: !45, line: 51, baseType: !62, size: 8, offset: 184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !159, file: !45, line: 52, baseType: !62, size: 8, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !159, file: !45, line: 53, baseType: !62, size: 8, offset: 200)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !159, file: !45, line: 54, baseType: !107, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !159, file: !45, line: 55, baseType: !25, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !159, file: !45, line: 56, baseType: !25, size: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !159, file: !45, line: 57, baseType: !25, size: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !159, file: !45, line: 58, baseType: !25, size: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !159, file: !45, line: 60, baseType: !184, size: 640, offset: 448)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !50, line: 893, size: 640, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !275, !276, !392, !393}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !184, file: !50, line: 894, baseType: !107, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !184, file: !50, line: 895, baseType: !107, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !184, file: !50, line: 896, baseType: !107, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !184, file: !50, line: 897, baseType: !107, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !184, file: !50, line: 898, baseType: !107, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !184, file: !50, line: 899, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !50, line: 875, size: 1600, elements: !194)
!194 = !{!195, !215, !231}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !193, file: !50, line: 876, baseType: !196, size: 448)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !50, line: 828, size: 448, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !214}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !50, line: 829, baseType: !192, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !196, file: !50, line: 829, baseType: !62, size: 8, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !50, line: 829, baseType: !62, size: 8, offset: 72)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !196, file: !50, line: 829, baseType: !67, size: 16, offset: 80)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !196, file: !50, line: 829, baseType: !107, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !50, line: 829, baseType: !192, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !196, file: !50, line: 829, baseType: !48, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !196, file: !50, line: 829, baseType: !206, size: 64, offset: 320)
!206 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !50, line: 716, size: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !206, file: !50, line: 717, baseType: !84, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !50, line: 718, baseType: !25, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !206, file: !50, line: 719, baseType: !96, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !206, file: !50, line: 720, baseType: !107, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !50, line: 721, baseType: !96, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !206, file: !50, line: 722, baseType: !192, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !196, file: !50, line: 829, baseType: !62, size: 8, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !193, file: !50, line: 877, baseType: !216, size: 640)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !50, line: 835, size: 640, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !216, file: !50, line: 836, baseType: !192, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !216, file: !50, line: 836, baseType: !62, size: 8, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !216, file: !50, line: 836, baseType: !62, size: 8, offset: 72)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !216, file: !50, line: 836, baseType: !67, size: 16, offset: 80)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !216, file: !50, line: 836, baseType: !107, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !50, line: 836, baseType: !192, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !216, file: !50, line: 836, baseType: !48, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !216, file: !50, line: 836, baseType: !206, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !216, file: !50, line: 836, baseType: !62, size: 8, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !216, file: !50, line: 836, baseType: !96, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !50, line: 837, baseType: !107, size: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !216, file: !50, line: 838, baseType: !25, size: 32, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !50, line: 839, baseType: !25, size: 32, offset: 608)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !193, file: !50, line: 878, baseType: !232, size: 1600)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !50, line: 846, size: 1600, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !232, file: !50, line: 847, baseType: !192, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !232, file: !50, line: 847, baseType: !62, size: 8, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !50, line: 847, baseType: !62, size: 8, offset: 72)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !232, file: !50, line: 847, baseType: !67, size: 16, offset: 80)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !232, file: !50, line: 847, baseType: !107, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !50, line: 847, baseType: !192, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !232, file: !50, line: 847, baseType: !48, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !232, file: !50, line: 847, baseType: !206, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !232, file: !50, line: 847, baseType: !62, size: 8, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !232, file: !50, line: 847, baseType: !192, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !232, file: !50, line: 848, baseType: !192, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !232, file: !50, line: 849, baseType: !96, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !232, file: !50, line: 850, baseType: !62, size: 8, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !232, file: !50, line: 851, baseType: !96, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !232, file: !50, line: 852, baseType: !96, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !232, file: !50, line: 853, baseType: !96, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !232, file: !50, line: 854, baseType: !251, size: 32, offset: 896)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 32, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !232, file: !50, line: 855, baseType: !25, size: 32, offset: 928)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !232, file: !50, line: 856, baseType: !25, size: 32, offset: 960)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !232, file: !50, line: 857, baseType: !25, size: 32, offset: 992)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !232, file: !50, line: 858, baseType: !25, size: 32, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !232, file: !50, line: 859, baseType: !25, size: 32, offset: 1056)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !232, file: !50, line: 860, baseType: !25, size: 32, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !232, file: !50, line: 861, baseType: !25, size: 32, offset: 1120)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !232, file: !50, line: 862, baseType: !25, size: 32, offset: 1152)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !232, file: !50, line: 863, baseType: !25, size: 32, offset: 1184)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !232, file: !50, line: 864, baseType: !25, size: 32, offset: 1216)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !232, file: !50, line: 865, baseType: !25, size: 32, offset: 1248)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !232, file: !50, line: 866, baseType: !25, size: 32, offset: 1280)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !232, file: !50, line: 867, baseType: !25, size: 32, offset: 1312)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !232, file: !50, line: 868, baseType: !67, size: 16, offset: 1344)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !232, file: !50, line: 869, baseType: !62, size: 8, offset: 1360)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !232, file: !50, line: 870, baseType: !62, size: 8, offset: 1368)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !232, file: !50, line: 871, baseType: !62, size: 8, offset: 1376)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !232, file: !50, line: 872, baseType: !272, size: 160, offset: 1384)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 160, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 20)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !184, file: !50, line: 900, baseType: !48, size: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !184, file: !50, line: 901, baseType: !277, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !50, line: 663, size: 640, elements: !279)
!279 = !{!280, !288, !301, !310, !319, !332, !346, !358, !370}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !278, file: !50, line: 664, baseType: !281, size: 128)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !50, line: 567, size: 128, elements: !282)
!282 = !{!283, !284, !285, !286, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !50, line: 568, baseType: !135, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !281, file: !50, line: 568, baseType: !62, size: 8, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !50, line: 568, baseType: !62, size: 8, offset: 72)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !50, line: 568, baseType: !67, size: 16, offset: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !281, file: !50, line: 568, baseType: !67, size: 16, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !278, file: !50, line: 665, baseType: !289, size: 384)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !50, line: 593, size: 384, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !50, line: 594, baseType: !135, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !289, file: !50, line: 594, baseType: !62, size: 8, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !50, line: 594, baseType: !62, size: 8, offset: 72)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !289, file: !50, line: 594, baseType: !67, size: 16, offset: 80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !289, file: !50, line: 594, baseType: !67, size: 16, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !289, file: !50, line: 594, baseType: !67, size: 16, offset: 112)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !289, file: !50, line: 595, baseType: !192, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !289, file: !50, line: 596, baseType: !107, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !289, file: !50, line: 597, baseType: !107, size: 64, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !289, file: !50, line: 598, baseType: !84, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !278, file: !50, line: 666, baseType: !302, size: 192)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !50, line: 573, size: 192, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !50, line: 574, baseType: !135, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !302, file: !50, line: 574, baseType: !62, size: 8, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !302, file: !50, line: 574, baseType: !62, size: 8, offset: 72)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !302, file: !50, line: 574, baseType: !67, size: 16, offset: 80)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !302, file: !50, line: 574, baseType: !67, size: 16, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !302, file: !50, line: 574, baseType: !53, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !278, file: !50, line: 667, baseType: !311, size: 192)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !50, line: 604, size: 192, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !50, line: 605, baseType: !135, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !311, file: !50, line: 605, baseType: !62, size: 8, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !50, line: 605, baseType: !62, size: 8, offset: 72)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !311, file: !50, line: 605, baseType: !67, size: 16, offset: 80)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !311, file: !50, line: 605, baseType: !67, size: 16, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !311, file: !50, line: 605, baseType: !48, size: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !278, file: !50, line: 668, baseType: !320, size: 448)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !50, line: 608, size: 448, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !50, line: 609, baseType: !135, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !320, file: !50, line: 609, baseType: !62, size: 8, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !50, line: 609, baseType: !62, size: 8, offset: 72)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !320, file: !50, line: 609, baseType: !67, size: 16, offset: 80)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !320, file: !50, line: 609, baseType: !67, size: 16, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !320, file: !50, line: 609, baseType: !25, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !320, file: !50, line: 610, baseType: !192, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !320, file: !50, line: 611, baseType: !107, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !320, file: !50, line: 612, baseType: !107, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !320, file: !50, line: 613, baseType: !25, size: 32, offset: 384)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !278, file: !50, line: 669, baseType: !333, size: 512)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !50, line: 580, size: 512, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !50, line: 581, baseType: !135, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !333, file: !50, line: 581, baseType: !62, size: 8, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !333, file: !50, line: 581, baseType: !62, size: 8, offset: 72)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !333, file: !50, line: 581, baseType: !67, size: 16, offset: 80)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !50, line: 581, baseType: !67, size: 16, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !333, file: !50, line: 581, baseType: !25, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !333, file: !50, line: 582, baseType: !53, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !333, file: !50, line: 583, baseType: !53, size: 64, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !333, file: !50, line: 584, baseType: !158, size: 64, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !333, file: !50, line: 585, baseType: !135, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !333, file: !50, line: 586, baseType: !25, size: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !278, file: !50, line: 670, baseType: !347, size: 320)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !50, line: 620, size: 320, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !50, line: 621, baseType: !135, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !347, file: !50, line: 621, baseType: !62, size: 8, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !347, file: !50, line: 621, baseType: !62, size: 8, offset: 72)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !50, line: 621, baseType: !67, size: 16, offset: 80)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !347, file: !50, line: 621, baseType: !67, size: 16, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !347, file: !50, line: 621, baseType: !62, size: 8, offset: 112)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !347, file: !50, line: 622, baseType: !158, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !347, file: !50, line: 623, baseType: !53, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !347, file: !50, line: 624, baseType: !84, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !278, file: !50, line: 671, baseType: !359, size: 640)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !50, line: 631, size: 640, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !359, file: !50, line: 632, baseType: !135, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !359, file: !50, line: 632, baseType: !62, size: 8, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !359, file: !50, line: 632, baseType: !62, size: 8, offset: 72)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !359, file: !50, line: 632, baseType: !67, size: 16, offset: 80)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !359, file: !50, line: 632, baseType: !67, size: 16, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !359, file: !50, line: 633, baseType: !367, size: 512, offset: 128)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !278, file: !50, line: 672, baseType: !371, size: 320)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !50, line: 654, size: 320, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !50, line: 655, baseType: !135, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !371, file: !50, line: 655, baseType: !62, size: 8, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !371, file: !50, line: 655, baseType: !62, size: 8, offset: 72)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !371, file: !50, line: 655, baseType: !67, size: 16, offset: 80)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !371, file: !50, line: 655, baseType: !67, size: 16, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !371, file: !50, line: 655, baseType: !62, size: 8, offset: 112)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !371, file: !50, line: 656, baseType: !48, size: 64, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !371, file: !50, line: 657, baseType: !53, size: 64, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !371, file: !50, line: 658, baseType: !382, size: 64, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !50, line: 645, size: 128, elements: !384)
!384 = !{!385, !391}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !383, file: !50, line: 646, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !24, line: 1052, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390, !25, !135}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !24, line: 424, baseType: !135)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !383, file: !50, line: 647, baseType: !135, size: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !184, file: !50, line: 902, baseType: !192, size: 64, offset: 512)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !184, file: !50, line: 903, baseType: !25, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !159, file: !45, line: 61, baseType: !25, size: 32, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !159, file: !45, line: 62, baseType: !25, size: 32, offset: 1120)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !159, file: !45, line: 63, baseType: !67, size: 16, offset: 1152)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !159, file: !45, line: 64, baseType: !62, size: 8, offset: 1168)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !159, file: !45, line: 66, baseType: !399, size: 2688, offset: 1216)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2688, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 7)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !159, file: !45, line: 67, baseType: !403, size: 3072, offset: 3904)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 3072, elements: !368)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !159, file: !45, line: 68, baseType: !405, size: 576, offset: 6976)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 576, elements: !33)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !159, file: !45, line: 69, baseType: !122, size: 64, offset: 7552)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !159, file: !45, line: 71, baseType: !107, size: 64, offset: 7616)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !159, file: !45, line: 72, baseType: !122, size: 64, offset: 7680)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !159, file: !45, line: 73, baseType: !277, size: 64, offset: 7744)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !159, file: !45, line: 74, baseType: !48, size: 64, offset: 7808)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !159, file: !45, line: 75, baseType: !53, size: 64, offset: 7872)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !159, file: !45, line: 76, baseType: !48, size: 64, offset: 7936)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !159, file: !45, line: 77, baseType: !192, size: 64, offset: 8000)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !159, file: !45, line: 78, baseType: !53, size: 64, offset: 8064)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !159, file: !45, line: 79, baseType: !48, size: 64, offset: 8128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !159, file: !45, line: 80, baseType: !96, size: 64, offset: 8192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !159, file: !45, line: 81, baseType: !192, size: 64, offset: 8256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !159, file: !45, line: 82, baseType: !419, size: 64, offset: 8320)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !50, line: 702, size: 128, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !421, file: !50, line: 706, baseType: !25, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !421, file: !50, line: 707, baseType: !25, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !421, file: !50, line: 708, baseType: !67, size: 16, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !421, file: !50, line: 709, baseType: !62, size: 8, offset: 80)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !421, file: !50, line: 710, baseType: !62, size: 8, offset: 88)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !421, file: !50, line: 711, baseType: !62, size: 8, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !159, file: !45, line: 83, baseType: !192, size: 64, offset: 8384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !159, file: !45, line: 84, baseType: !53, size: 64, offset: 8448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !159, file: !45, line: 85, baseType: !277, size: 64, offset: 8512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !159, file: !45, line: 86, baseType: !53, size: 64, offset: 8576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !159, file: !45, line: 87, baseType: !277, size: 64, offset: 8640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !159, file: !45, line: 88, baseType: !192, size: 64, offset: 8704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !159, file: !45, line: 89, baseType: !192, size: 64, offset: 8768)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !159, file: !45, line: 90, baseType: !437, size: 64, offset: 8832)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !159, file: !45, line: 91, baseType: !439, size: 64, offset: 8896)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !50, line: 637, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DISubroutineType(types: !442)
!442 = !{!23, !158, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !159, file: !45, line: 92, baseType: !445, size: 64, offset: 8960)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !50, line: 641, baseType: !155)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !151, file: !55, line: 152, baseType: !53, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !137, file: !55, line: 155, baseType: !25, size: 32, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !137, file: !55, line: 156, baseType: !169, size: 16, offset: 416)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !137, file: !55, line: 157, baseType: !62, size: 8, offset: 432)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !54, file: !55, line: 375, baseType: !451, size: 576)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !55, line: 122, size: 576, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !451, file: !55, line: 123, baseType: !53, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !451, file: !55, line: 123, baseType: !62, size: 8, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !451, file: !55, line: 123, baseType: !62, size: 8, offset: 72)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !451, file: !55, line: 123, baseType: !67, size: 16, offset: 80)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !451, file: !55, line: 123, baseType: !62, size: 8, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !451, file: !55, line: 123, baseType: !62, size: 8, offset: 104)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !451, file: !55, line: 124, baseType: !67, size: 16, offset: 112)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !451, file: !55, line: 125, baseType: !135, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !451, file: !55, line: 126, baseType: !84, size: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !451, file: !55, line: 127, baseType: !437, size: 64, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !451, file: !55, line: 128, baseType: !53, size: 64, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !451, file: !55, line: 129, baseType: !53, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !451, file: !55, line: 130, baseType: !48, size: 64, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !451, file: !55, line: 131, baseType: !62, size: 8, offset: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !54, file: !55, line: 376, baseType: !468, size: 448)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !55, line: 134, size: 448, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !481}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !468, file: !55, line: 135, baseType: !53, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !468, file: !55, line: 135, baseType: !62, size: 8, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !55, line: 135, baseType: !62, size: 8, offset: 72)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !468, file: !55, line: 135, baseType: !67, size: 16, offset: 80)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !468, file: !55, line: 135, baseType: !62, size: 8, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !468, file: !55, line: 135, baseType: !62, size: 8, offset: 104)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !468, file: !55, line: 136, baseType: !48, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !468, file: !55, line: 137, baseType: !53, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !55, line: 138, baseType: !53, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !468, file: !55, line: 139, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !24, line: 129, baseType: !84)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !468, file: !55, line: 140, baseType: !25, size: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !54, file: !55, line: 377, baseType: !483, size: 320)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !55, line: 184, size: 320, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !494}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !483, file: !55, line: 185, baseType: !53, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !483, file: !55, line: 185, baseType: !62, size: 8, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !55, line: 185, baseType: !62, size: 8, offset: 72)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !483, file: !55, line: 185, baseType: !67, size: 16, offset: 80)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !55, line: 185, baseType: !62, size: 8, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !483, file: !55, line: 185, baseType: !491, size: 128, offset: 128)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 2)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !483, file: !55, line: 185, baseType: !53, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !54, file: !55, line: 378, baseType: !496, size: 384)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !55, line: 187, size: 384, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !496, file: !55, line: 188, baseType: !53, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !496, file: !55, line: 188, baseType: !62, size: 8, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !496, file: !55, line: 188, baseType: !62, size: 8, offset: 72)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !496, file: !55, line: 188, baseType: !67, size: 16, offset: 80)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !55, line: 188, baseType: !62, size: 8, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !496, file: !55, line: 189, baseType: !491, size: 128, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !496, file: !55, line: 189, baseType: !53, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !496, file: !55, line: 189, baseType: !506, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !50, line: 480, size: 576, elements: !508)
!508 = !{!509, !510, !511, !512, !520, !535, !567, !568, !569, !570, !571, !572}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !507, file: !50, line: 481, baseType: !48, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !507, file: !50, line: 482, baseType: !506, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !50, line: 483, baseType: !506, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !507, file: !50, line: 484, baseType: !513, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !50, line: 497, size: 256, elements: !515)
!515 = !{!516, !517, !518, !519}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !514, file: !50, line: 498, baseType: !513, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !50, line: 499, baseType: !513, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !514, file: !50, line: 500, baseType: !506, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !514, file: !50, line: 501, baseType: !25, size: 32, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !507, file: !50, line: 485, baseType: !521, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !50, line: 466, size: 320, elements: !523)
!523 = !{!524, !529, !530, !531, !532, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !522, file: !50, line: 467, baseType: !525, size: 128)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !50, line: 459, size: 128, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !525, file: !50, line: 460, baseType: !62, size: 8)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !525, file: !50, line: 461, baseType: !84, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !522, file: !50, line: 468, baseType: !525, size: 128, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !522, file: !50, line: 469, baseType: !67, size: 16, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !522, file: !50, line: 470, baseType: !62, size: 8, offset: 272)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !522, file: !50, line: 471, baseType: !62, size: 8, offset: 280)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !522, file: !50, line: 472, baseType: !62, size: 8, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !522, file: !50, line: 473, baseType: !62, size: 8, offset: 296)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !507, file: !50, line: 486, baseType: !536, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !50, line: 448, size: 192, elements: !538)
!538 = !{!539, !562, !563, !564, !565, !566}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !537, file: !50, line: 449, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !50, line: 438, size: 64, elements: !541)
!541 = !{!542, !543, !556}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !540, file: !50, line: 439, baseType: !48, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !540, file: !50, line: 440, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !50, line: 419, size: 256, elements: !546)
!546 = !{!547, !552, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !545, file: !50, line: 420, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !24, line: 1049, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!25, !390, !25, !135}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !545, file: !50, line: 421, baseType: !135, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !545, file: !50, line: 422, baseType: !48, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !545, file: !50, line: 423, baseType: !62, size: 8, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !545, file: !50, line: 424, baseType: !62, size: 8, offset: 200)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !540, file: !50, line: 441, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !50, line: 429, size: 128, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !558, file: !50, line: 430, baseType: !48, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !50, line: 431, baseType: !557, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !537, file: !50, line: 450, baseType: !521, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !537, file: !50, line: 451, baseType: !62, size: 8, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !537, file: !50, line: 452, baseType: !62, size: 8, offset: 136)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !537, file: !50, line: 453, baseType: !62, size: 8, offset: 144)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !537, file: !50, line: 454, baseType: !62, size: 8, offset: 152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !507, file: !50, line: 487, baseType: !84, size: 64, offset: 384)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !507, file: !50, line: 488, baseType: !25, size: 32, offset: 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !507, file: !50, line: 489, baseType: !67, size: 16, offset: 480)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !507, file: !50, line: 490, baseType: !67, size: 16, offset: 496)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !507, file: !50, line: 491, baseType: !62, size: 8, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !507, file: !50, line: 492, baseType: !62, size: 8, offset: 520)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !54, file: !55, line: 379, baseType: !574, size: 384)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !55, line: 192, size: 384, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !574, file: !55, line: 193, baseType: !53, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !574, file: !55, line: 193, baseType: !62, size: 8, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !55, line: 193, baseType: !62, size: 8, offset: 72)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !574, file: !55, line: 193, baseType: !67, size: 16, offset: 80)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !55, line: 193, baseType: !62, size: 8, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !574, file: !55, line: 193, baseType: !491, size: 128, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !574, file: !55, line: 193, baseType: !53, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !574, file: !55, line: 193, baseType: !25, size: 32, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !574, file: !55, line: 194, baseType: !25, size: 32, offset: 352)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !54, file: !55, line: 380, baseType: !586, size: 384)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !55, line: 197, size: 384, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !586, file: !55, line: 198, baseType: !53, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !586, file: !55, line: 198, baseType: !62, size: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !55, line: 198, baseType: !62, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !586, file: !55, line: 198, baseType: !67, size: 16, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !55, line: 198, baseType: !62, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !586, file: !55, line: 200, baseType: !62, size: 8, offset: 104)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !586, file: !55, line: 201, baseType: !62, size: 8, offset: 112)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !586, file: !55, line: 202, baseType: !491, size: 128, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !586, file: !55, line: 202, baseType: !53, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !586, file: !55, line: 202, baseType: !598, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !24, line: 128, baseType: !84)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !54, file: !55, line: 381, baseType: !600, size: 320)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !55, line: 205, size: 320, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !600, file: !55, line: 206, baseType: !53, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !600, file: !55, line: 206, baseType: !62, size: 8, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !600, file: !55, line: 206, baseType: !62, size: 8, offset: 72)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !600, file: !55, line: 206, baseType: !67, size: 16, offset: 80)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !600, file: !55, line: 206, baseType: !62, size: 8, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !600, file: !55, line: 206, baseType: !491, size: 128, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !600, file: !55, line: 206, baseType: !53, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !54, file: !55, line: 382, baseType: !610, size: 384)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !55, line: 233, size: 384, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !610, file: !55, line: 234, baseType: !53, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 72)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !610, file: !55, line: 234, baseType: !67, size: 16, offset: 80)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 104)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 112)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 120)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !610, file: !55, line: 234, baseType: !48, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !610, file: !55, line: 234, baseType: !25, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !610, file: !55, line: 234, baseType: !25, size: 32, offset: 224)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !610, file: !55, line: 234, baseType: !25, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 288)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !610, file: !55, line: 234, baseType: !62, size: 8, offset: 296)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !610, file: !55, line: 234, baseType: !53, size: 64, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !54, file: !55, line: 383, baseType: !628, size: 576)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !55, line: 237, size: 576, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !628, file: !55, line: 238, baseType: !53, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 72)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !628, file: !55, line: 238, baseType: !67, size: 16, offset: 80)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 104)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 112)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 120)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !628, file: !55, line: 238, baseType: !48, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !628, file: !55, line: 238, baseType: !25, size: 32, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !628, file: !55, line: 238, baseType: !25, size: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !628, file: !55, line: 238, baseType: !25, size: 32, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !628, file: !55, line: 238, baseType: !62, size: 8, offset: 296)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !628, file: !55, line: 238, baseType: !67, size: 16, offset: 304)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !628, file: !55, line: 239, baseType: !53, size: 64, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !628, file: !55, line: 240, baseType: !107, size: 64, offset: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !628, file: !55, line: 241, baseType: !67, size: 16, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !628, file: !55, line: 242, baseType: !107, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !54, file: !55, line: 384, baseType: !650, size: 384)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !55, line: 262, size: 384, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !650, file: !55, line: 263, baseType: !53, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 72)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !650, file: !55, line: 263, baseType: !67, size: 16, offset: 80)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 120)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !650, file: !55, line: 263, baseType: !48, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !650, file: !55, line: 263, baseType: !25, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !650, file: !55, line: 263, baseType: !25, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !650, file: !55, line: 263, baseType: !25, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 296)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !650, file: !55, line: 263, baseType: !62, size: 8, offset: 304)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !650, file: !55, line: 264, baseType: !53, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !54, file: !55, line: 385, baseType: !669, size: 448)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !55, line: 245, size: 448, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !669, file: !55, line: 246, baseType: !53, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 72)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !669, file: !55, line: 246, baseType: !67, size: 16, offset: 80)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 104)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 112)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 120)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !669, file: !55, line: 246, baseType: !48, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !669, file: !55, line: 246, baseType: !25, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !669, file: !55, line: 246, baseType: !25, size: 32, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !669, file: !55, line: 246, baseType: !25, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !669, file: !55, line: 246, baseType: !62, size: 8, offset: 296)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !669, file: !55, line: 246, baseType: !53, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !669, file: !55, line: 247, baseType: !53, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !54, file: !55, line: 386, baseType: !688, size: 448)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !55, line: 250, size: 448, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !688, file: !55, line: 251, baseType: !53, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 72)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !688, file: !55, line: 251, baseType: !67, size: 16, offset: 80)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 104)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 112)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 120)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !688, file: !55, line: 251, baseType: !48, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !688, file: !55, line: 251, baseType: !25, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !688, file: !55, line: 251, baseType: !25, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !688, file: !55, line: 251, baseType: !25, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !688, file: !55, line: 251, baseType: !62, size: 8, offset: 296)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !688, file: !55, line: 256, baseType: !53, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !688, file: !55, line: 257, baseType: !53, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !54, file: !55, line: 387, baseType: !707, size: 512)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !55, line: 273, size: 512, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !707, file: !55, line: 274, baseType: !53, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !707, file: !55, line: 274, baseType: !62, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !55, line: 274, baseType: !62, size: 8, offset: 72)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !707, file: !55, line: 274, baseType: !67, size: 16, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !55, line: 274, baseType: !62, size: 8, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !55, line: 274, baseType: !48, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !707, file: !55, line: 275, baseType: !25, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !707, file: !55, line: 276, baseType: !386, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !707, file: !55, line: 277, baseType: !135, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !55, line: 278, baseType: !491, size: 128, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !54, file: !55, line: 388, baseType: !720, size: 512)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !55, line: 281, size: 512, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !735, !736, !737, !743, !744}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !720, file: !55, line: 282, baseType: !53, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !720, file: !55, line: 282, baseType: !62, size: 8, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !55, line: 282, baseType: !62, size: 8, offset: 72)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !720, file: !55, line: 282, baseType: !67, size: 16, offset: 80)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !55, line: 282, baseType: !62, size: 8, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !720, file: !55, line: 282, baseType: !62, size: 8, offset: 104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !720, file: !55, line: 283, baseType: !62, size: 8, offset: 112)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !720, file: !55, line: 284, baseType: !730, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !24, line: 1084, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!23, !25, !480, !25, !734, !135, !135}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !720, file: !55, line: 285, baseType: !48, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !720, file: !55, line: 286, baseType: !135, size: 64, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !720, file: !55, line: 287, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !24, line: 1102, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!23, !390, !25, !135, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !720, file: !55, line: 288, baseType: !53, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !55, line: 289, baseType: !53, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !54, file: !55, line: 389, baseType: !746, size: 512)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !55, line: 307, size: 512, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !746, file: !55, line: 308, baseType: !53, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !746, file: !55, line: 308, baseType: !62, size: 8, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !55, line: 308, baseType: !62, size: 8, offset: 72)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !746, file: !55, line: 308, baseType: !67, size: 16, offset: 80)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !55, line: 308, baseType: !62, size: 8, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !746, file: !55, line: 308, baseType: !62, size: 8, offset: 104)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !746, file: !55, line: 309, baseType: !62, size: 8, offset: 112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !746, file: !55, line: 310, baseType: !62, size: 8, offset: 120)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !746, file: !55, line: 311, baseType: !135, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !746, file: !55, line: 312, baseType: !48, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !746, file: !55, line: 313, baseType: !122, size: 64, offset: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !746, file: !55, line: 314, baseType: !107, size: 64, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !746, file: !55, line: 315, baseType: !107, size: 64, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !746, file: !55, line: 316, baseType: !25, size: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !54, file: !55, line: 390, baseType: !763, size: 448)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !55, line: 340, size: 448, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !763, file: !55, line: 341, baseType: !53, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !763, file: !55, line: 341, baseType: !62, size: 8, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !55, line: 341, baseType: !62, size: 8, offset: 72)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !763, file: !55, line: 341, baseType: !67, size: 16, offset: 80)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !55, line: 341, baseType: !62, size: 8, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !763, file: !55, line: 341, baseType: !48, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !763, file: !55, line: 342, baseType: !48, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !763, file: !55, line: 343, baseType: !135, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !763, file: !55, line: 344, baseType: !107, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !763, file: !55, line: 345, baseType: !25, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !55, line: 391, baseType: !776, size: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !55, line: 350, size: 256, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !788}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !776, file: !55, line: 351, baseType: !53, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !776, file: !55, line: 351, baseType: !62, size: 8, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !55, line: 351, baseType: !62, size: 8, offset: 72)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !776, file: !55, line: 351, baseType: !67, size: 16, offset: 80)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !55, line: 351, baseType: !62, size: 8, offset: 96)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !776, file: !55, line: 351, baseType: !784, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !24, line: 1055, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !390, !135}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !776, file: !55, line: 352, baseType: !135, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !54, file: !55, line: 392, baseType: !790, size: 192)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !55, line: 357, size: 192, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !790, file: !55, line: 358, baseType: !53, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !790, file: !55, line: 358, baseType: !62, size: 8, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !790, file: !55, line: 358, baseType: !62, size: 8, offset: 72)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !790, file: !55, line: 358, baseType: !67, size: 16, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !55, line: 358, baseType: !62, size: 8, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !55, line: 358, baseType: !53, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !54, file: !55, line: 399, baseType: !49, size: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !49, file: !50, line: 135, baseType: !62, size: 8, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !50, line: 136, baseType: !62, size: 8, offset: 72)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !50, line: 137, baseType: !67, size: 16, offset: 80)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 138, baseType: !803, size: 32, offset: 96)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !804, line: 327, size: 32, elements: !805)
!804 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !803, file: !804, line: 328, baseType: !25, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !803, file: !804, line: 329, baseType: !251, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !49, file: !50, line: 139, baseType: !48, size: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !49, file: !50, line: 140, baseType: !48, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !49, file: !50, line: 141, baseType: !48, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !49, file: !50, line: 142, baseType: !169, size: 16, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "relative_pathname", scope: !44, file: !45, line: 156, baseType: !813, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !44, file: !45, line: 157, baseType: !122, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !44, file: !45, line: 159, baseType: !48, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !44, file: !45, line: 160, baseType: !53, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "full_pathname", scope: !44, file: !45, line: 161, baseType: !96, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "predefined", scope: !44, file: !45, line: 163, baseType: !819, size: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_predefined_info", file: !50, line: 351, size: 56, elements: !822)
!822 = !{!823, !829, !838, !846, !855}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !821, file: !50, line: 352, baseType: !824, size: 56)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_name_info", file: !50, line: 295, size: 56, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !50, line: 296, baseType: !251, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "argument_list", scope: !824, file: !50, line: 297, baseType: !67, size: 16, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "expected_btypes", scope: !824, file: !50, line: 298, baseType: !62, size: 8, offset: 48)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ret_info", scope: !821, file: !50, line: 353, baseType: !830, size: 56)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_package_info", file: !50, line: 314, size: 56, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !830, file: !50, line: 315, baseType: !62, size: 8)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "object_type1", scope: !830, file: !50, line: 316, baseType: !62, size: 8, offset: 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "count1", scope: !830, file: !50, line: 317, baseType: !62, size: 8, offset: 16)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "object_type2", scope: !830, file: !50, line: 318, baseType: !62, size: 8, offset: 24)
