; ModuleID = '../bcout/drivers/acpi/acpica/nsrepair2.llvm.bc'
source_filename = "drivers/acpi/acpica/nsrepair2.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_repair_info = type { [4 x i8], i32 (%struct.acpi_evaluate_info*, %union.acpi_operand_object**)* }
%struct.acpi_evaluate_info = type { %struct.acpi_namespace_node*, i8*, %union.acpi_operand_object**, %struct.acpi_namespace_node*, %union.acpi_operand_object*, i8*, %union.acpi_predefined_info*, %union.acpi_operand_object*, %union.acpi_operand_object*, i32, i32, i16, i16, i8, i8, i8 }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_name_union = type { i32 }
%union.acpi_predefined_info = type { %struct.acpi_name_info }
%struct.acpi_name_info = type <{ [4 x i8], i16, i8 }>
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "acpi_ns_repairable_names", scope: !2, file: !3, line: 114, type: !25, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !18, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsrepair2.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !12, !13, !7, !15, !16, !17}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !10, line: 27, baseType: !11)
!10 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !14, line: 421, baseType: !7)
!14 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !{!0, !19}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 16, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 80, elements: !23)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!23 = !{!24}
!24 = !DISubrange(count: 10)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1280, elements: !23)
!26 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_repair_info", file: !3, line: 27, size: 128, elements: !28)
!28 = !{!29, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !27, file: !3, line: 28, baseType: !30, size: 32)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 32, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 4)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "repair_function", scope: !27, file: !3, line: 29, baseType: !34, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_repair_function", file: !3, line: 23, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DISubroutineType(types: !37)
!37 = !{!13, !38, !116}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_evaluate_info", file: !40, line: 152, size: 704, elements: !41)
!40 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!41 = !{!42, !804, !806, !807, !808, !809, !810, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_node", scope: !39, file: !40, line: 155, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !45, line: 133, size: 384, elements: !46)
!45 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !791, !792, !793, !794, !800, !801, !802, !803}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !44, file: !45, line: 134, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !50, line: 367, size: 576, elements: !51)
!50 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!51 = !{!52, !65, !81, !92, !106, !120, !129, !442, !459, !474, !487, !565, !577, !591, !601, !619, !641, !660, !679, !698, !711, !737, !754, !767, !781, !790}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !49, file: !50, line: 368, baseType: !53, size: 128)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !50, line: 73, size: 128, elements: !54)
!54 = !{!55, !56, !59, !60, !64}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !53, file: !50, line: 74, baseType: !48, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !53, file: !50, line: 74, baseType: !57, size: 8, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !8, line: 17, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !10, line: 21, baseType: !17)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !50, line: 74, baseType: !57, size: 8, offset: 72)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !53, file: !50, line: 74, baseType: !61, size: 16, offset: 80)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !8, line: 19, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !10, line: 24, baseType: !63)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !53, file: !50, line: 74, baseType: !57, size: 8, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !49, file: !50, line: 369, baseType: !66, size: 192)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !50, line: 76, size: 192, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !66, file: !50, line: 77, baseType: !48, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !66, file: !50, line: 77, baseType: !57, size: 8, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !50, line: 77, baseType: !57, size: 8, offset: 72)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !66, file: !50, line: 77, baseType: !61, size: 16, offset: 80)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !50, line: 77, baseType: !57, size: 8, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !66, file: !50, line: 77, baseType: !74, size: 24, offset: 104)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 24, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 3)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !66, file: !50, line: 78, baseType: !78, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !8, line: 23, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !10, line: 31, baseType: !80)
!80 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !49, file: !50, line: 370, baseType: !82, size: 256)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !50, line: 93, size: 256, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !91}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !82, file: !50, line: 94, baseType: !48, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !82, file: !50, line: 94, baseType: !57, size: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !50, line: 94, baseType: !57, size: 8, offset: 72)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !82, file: !50, line: 94, baseType: !61, size: 16, offset: 80)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !50, line: 94, baseType: !57, size: 8, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !82, file: !50, line: 94, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !82, file: !50, line: 94, baseType: !7, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !49, file: !50, line: 371, baseType: !93, size: 384)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !50, line: 97, size: 384, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !102, !103, !104, !105}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !93, file: !50, line: 98, baseType: !48, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !93, file: !50, line: 98, baseType: !57, size: 8, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !50, line: 98, baseType: !57, size: 8, offset: 72)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !93, file: !50, line: 98, baseType: !61, size: 16, offset: 80)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !50, line: 98, baseType: !57, size: 8, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !93, file: !50, line: 98, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !93, file: !50, line: 98, baseType: !7, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !93, file: !50, line: 99, baseType: !7, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !93, file: !50, line: 100, baseType: !101, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !93, file: !50, line: 101, baseType: !43, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !49, file: !50, line: 372, baseType: !107, size: 384)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !50, line: 104, size: 384, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !117, !118, !119}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !107, file: !50, line: 105, baseType: !48, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !107, file: !50, line: 105, baseType: !57, size: 8, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !50, line: 105, baseType: !57, size: 8, offset: 72)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !107, file: !50, line: 105, baseType: !61, size: 16, offset: 80)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !50, line: 105, baseType: !57, size: 8, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !107, file: !50, line: 105, baseType: !43, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !107, file: !50, line: 106, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !107, file: !50, line: 107, baseType: !101, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !107, file: !50, line: 108, baseType: !7, size: 32, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !107, file: !50, line: 109, baseType: !7, size: 32, offset: 352)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !49, file: !50, line: 373, baseType: !121, size: 192)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !50, line: 118, size: 192, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !121, file: !50, line: 119, baseType: !48, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !121, file: !50, line: 119, baseType: !57, size: 8, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !50, line: 119, baseType: !57, size: 8, offset: 72)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !121, file: !50, line: 119, baseType: !61, size: 16, offset: 80)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !50, line: 119, baseType: !57, size: 8, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !121, file: !50, line: 119, baseType: !12, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !49, file: !50, line: 374, baseType: !130, size: 448)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !50, line: 143, size: 448, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !439, !440, !441}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !130, file: !50, line: 144, baseType: !48, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !130, file: !50, line: 144, baseType: !57, size: 8, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !50, line: 144, baseType: !57, size: 8, offset: 72)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !130, file: !50, line: 144, baseType: !61, size: 16, offset: 80)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !50, line: 144, baseType: !57, size: 8, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !130, file: !50, line: 144, baseType: !57, size: 8, offset: 104)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !130, file: !50, line: 145, baseType: !57, size: 8, offset: 112)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !130, file: !50, line: 146, baseType: !57, size: 8, offset: 120)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !130, file: !50, line: 147, baseType: !48, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !130, file: !50, line: 148, baseType: !48, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !130, file: !50, line: 149, baseType: !101, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !130, file: !50, line: 153, baseType: !144, size: 64, offset: 320)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !50, line: 150, size: 64, elements: !145)
!145 = !{!146, !438}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !144, file: !50, line: 151, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !45, line: 248, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!13, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !40, line: 37, size: 9024, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !384, !385, !386, !387, !388, !392, !394, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !421, !422, !423, !424, !425, !426, !427, !428, !430, !436}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !40, line: 38, baseType: !151, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !152, file: !40, line: 39, baseType: !57, size: 8, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !152, file: !40, line: 40, baseType: !57, size: 8, offset: 72)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !152, file: !40, line: 41, baseType: !61, size: 16, offset: 80)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !152, file: !40, line: 42, baseType: !57, size: 8, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !152, file: !40, line: 43, baseType: !57, size: 8, offset: 104)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !152, file: !40, line: 44, baseType: !57, size: 8, offset: 112)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !152, file: !40, line: 45, baseType: !162, size: 16, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !14, line: 445, baseType: !61)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !152, file: !40, line: 46, baseType: !57, size: 8, offset: 144)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !152, file: !40, line: 47, baseType: !57, size: 8, offset: 152)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !152, file: !40, line: 48, baseType: !57, size: 8, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !152, file: !40, line: 49, baseType: !57, size: 8, offset: 168)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !152, file: !40, line: 50, baseType: !57, size: 8, offset: 176)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !152, file: !40, line: 51, baseType: !57, size: 8, offset: 184)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !152, file: !40, line: 52, baseType: !57, size: 8, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !152, file: !40, line: 53, baseType: !57, size: 8, offset: 200)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !152, file: !40, line: 54, baseType: !101, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !152, file: !40, line: 55, baseType: !7, size: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !152, file: !40, line: 56, baseType: !7, size: 32, offset: 352)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !152, file: !40, line: 57, baseType: !7, size: 32, offset: 384)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !152, file: !40, line: 58, baseType: !7, size: 32, offset: 416)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !152, file: !40, line: 60, baseType: !177, size: 640, offset: 448)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !45, line: 893, size: 640, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !265, !266, !382, !383}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !177, file: !45, line: 894, baseType: !101, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !177, file: !45, line: 895, baseType: !101, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !177, file: !45, line: 896, baseType: !101, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !177, file: !45, line: 897, baseType: !101, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !177, file: !45, line: 898, baseType: !101, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !177, file: !45, line: 899, baseType: !185, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !45, line: 875, size: 1600, elements: !187)
!187 = !{!188, !208, !224}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !186, file: !45, line: 876, baseType: !189, size: 448)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !45, line: 828, size: 448, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !189, file: !45, line: 829, baseType: !185, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !189, file: !45, line: 829, baseType: !57, size: 8, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !45, line: 829, baseType: !57, size: 8, offset: 72)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !189, file: !45, line: 829, baseType: !61, size: 16, offset: 80)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !189, file: !45, line: 829, baseType: !101, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !189, file: !45, line: 829, baseType: !185, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !189, file: !45, line: 829, baseType: !43, size: 64, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !189, file: !45, line: 829, baseType: !199, size: 64, offset: 320)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !45, line: 716, size: 64, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !199, file: !45, line: 717, baseType: !78, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !199, file: !45, line: 718, baseType: !7, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !199, file: !45, line: 719, baseType: !90, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !199, file: !45, line: 720, baseType: !101, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !45, line: 721, baseType: !90, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !199, file: !45, line: 722, baseType: !185, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !189, file: !45, line: 829, baseType: !57, size: 8, offset: 384)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !186, file: !45, line: 877, baseType: !209, size: 640)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !45, line: 835, size: 640, elements: !210)
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !209, file: !45, line: 836, baseType: !185, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !209, file: !45, line: 836, baseType: !57, size: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !209, file: !45, line: 836, baseType: !57, size: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !209, file: !45, line: 836, baseType: !61, size: 16, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !209, file: !45, line: 836, baseType: !101, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !45, line: 836, baseType: !185, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !209, file: !45, line: 836, baseType: !43, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !209, file: !45, line: 836, baseType: !199, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !209, file: !45, line: 836, baseType: !57, size: 8, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !209, file: !45, line: 836, baseType: !90, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !209, file: !45, line: 837, baseType: !101, size: 64, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !209, file: !45, line: 838, baseType: !7, size: 32, offset: 576)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !45, line: 839, baseType: !7, size: 32, offset: 608)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !186, file: !45, line: 878, baseType: !225, size: 1600)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !45, line: 846, size: 1600, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !225, file: !45, line: 847, baseType: !185, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !225, file: !45, line: 847, baseType: !57, size: 8, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !45, line: 847, baseType: !57, size: 8, offset: 72)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !225, file: !45, line: 847, baseType: !61, size: 16, offset: 80)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !225, file: !45, line: 847, baseType: !101, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !45, line: 847, baseType: !185, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !225, file: !45, line: 847, baseType: !43, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !225, file: !45, line: 847, baseType: !199, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !225, file: !45, line: 847, baseType: !57, size: 8, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !225, file: !45, line: 847, baseType: !185, size: 64, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !225, file: !45, line: 848, baseType: !185, size: 64, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !225, file: !45, line: 849, baseType: !90, size: 64, offset: 576)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !225, file: !45, line: 850, baseType: !57, size: 8, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !225, file: !45, line: 851, baseType: !90, size: 64, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !225, file: !45, line: 852, baseType: !90, size: 64, offset: 768)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !225, file: !45, line: 853, baseType: !90, size: 64, offset: 832)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !225, file: !45, line: 854, baseType: !30, size: 32, offset: 896)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !225, file: !45, line: 855, baseType: !7, size: 32, offset: 928)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !225, file: !45, line: 856, baseType: !7, size: 32, offset: 960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !225, file: !45, line: 857, baseType: !7, size: 32, offset: 992)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !225, file: !45, line: 858, baseType: !7, size: 32, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !225, file: !45, line: 859, baseType: !7, size: 32, offset: 1056)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !225, file: !45, line: 860, baseType: !7, size: 32, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !225, file: !45, line: 861, baseType: !7, size: 32, offset: 1120)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !225, file: !45, line: 862, baseType: !7, size: 32, offset: 1152)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !225, file: !45, line: 863, baseType: !7, size: 32, offset: 1184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !225, file: !45, line: 864, baseType: !7, size: 32, offset: 1216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !225, file: !45, line: 865, baseType: !7, size: 32, offset: 1248)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !225, file: !45, line: 866, baseType: !7, size: 32, offset: 1280)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !225, file: !45, line: 867, baseType: !7, size: 32, offset: 1312)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !225, file: !45, line: 868, baseType: !61, size: 16, offset: 1344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !225, file: !45, line: 869, baseType: !57, size: 8, offset: 1360)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !225, file: !45, line: 870, baseType: !57, size: 8, offset: 1368)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !225, file: !45, line: 871, baseType: !57, size: 8, offset: 1376)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !225, file: !45, line: 872, baseType: !262, size: 160, offset: 1384)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 20)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !177, file: !45, line: 900, baseType: !43, size: 64, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !177, file: !45, line: 901, baseType: !267, size: 64, offset: 448)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !45, line: 663, size: 640, elements: !269)
!269 = !{!270, !278, !291, !300, !309, !322, !336, !348, !360}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !268, file: !45, line: 664, baseType: !271, size: 128)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !45, line: 567, size: 128, elements: !272)
!272 = !{!273, !274, !275, !276, !277}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !271, file: !45, line: 568, baseType: !12, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !271, file: !45, line: 568, baseType: !57, size: 8, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !271, file: !45, line: 568, baseType: !57, size: 8, offset: 72)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !271, file: !45, line: 568, baseType: !61, size: 16, offset: 80)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !271, file: !45, line: 568, baseType: !61, size: 16, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !268, file: !45, line: 665, baseType: !279, size: 384)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !45, line: 593, size: 384, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !45, line: 594, baseType: !12, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !279, file: !45, line: 594, baseType: !57, size: 8, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !279, file: !45, line: 594, baseType: !57, size: 8, offset: 72)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !279, file: !45, line: 594, baseType: !61, size: 16, offset: 80)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !279, file: !45, line: 594, baseType: !61, size: 16, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !279, file: !45, line: 594, baseType: !61, size: 16, offset: 112)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !279, file: !45, line: 595, baseType: !185, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !279, file: !45, line: 596, baseType: !101, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !279, file: !45, line: 597, baseType: !101, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !279, file: !45, line: 598, baseType: !78, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !268, file: !45, line: 666, baseType: !292, size: 192)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !45, line: 573, size: 192, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !45, line: 574, baseType: !12, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !292, file: !45, line: 574, baseType: !57, size: 8, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !45, line: 574, baseType: !57, size: 8, offset: 72)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !292, file: !45, line: 574, baseType: !61, size: 16, offset: 80)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !45, line: 574, baseType: !61, size: 16, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !292, file: !45, line: 574, baseType: !48, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !268, file: !45, line: 667, baseType: !301, size: 192)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !45, line: 604, size: 192, elements: !302)
!302 = !{!303, !304, !305, !306, !307, !308}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !45, line: 605, baseType: !12, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !301, file: !45, line: 605, baseType: !57, size: 8, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !301, file: !45, line: 605, baseType: !57, size: 8, offset: 72)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !301, file: !45, line: 605, baseType: !61, size: 16, offset: 80)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !301, file: !45, line: 605, baseType: !61, size: 16, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !301, file: !45, line: 605, baseType: !43, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !268, file: !45, line: 668, baseType: !310, size: 448)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !45, line: 608, size: 448, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !45, line: 609, baseType: !12, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !310, file: !45, line: 609, baseType: !57, size: 8, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !45, line: 609, baseType: !57, size: 8, offset: 72)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !310, file: !45, line: 609, baseType: !61, size: 16, offset: 80)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !310, file: !45, line: 609, baseType: !61, size: 16, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !310, file: !45, line: 609, baseType: !7, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !310, file: !45, line: 610, baseType: !185, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !310, file: !45, line: 611, baseType: !101, size: 64, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !310, file: !45, line: 612, baseType: !101, size: 64, offset: 320)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !310, file: !45, line: 613, baseType: !7, size: 32, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !268, file: !45, line: 669, baseType: !323, size: 512)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !45, line: 580, size: 512, elements: !324)
!324 = !{!325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !45, line: 581, baseType: !12, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !323, file: !45, line: 581, baseType: !57, size: 8, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !323, file: !45, line: 581, baseType: !57, size: 8, offset: 72)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !323, file: !45, line: 581, baseType: !61, size: 16, offset: 80)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !323, file: !45, line: 581, baseType: !61, size: 16, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !323, file: !45, line: 581, baseType: !7, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !323, file: !45, line: 582, baseType: !48, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !323, file: !45, line: 583, baseType: !48, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !323, file: !45, line: 584, baseType: !151, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !323, file: !45, line: 585, baseType: !12, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !323, file: !45, line: 586, baseType: !7, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !268, file: !45, line: 670, baseType: !337, size: 320)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !45, line: 620, size: 320, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344, !345, !346, !347}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !45, line: 621, baseType: !12, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !337, file: !45, line: 621, baseType: !57, size: 8, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !337, file: !45, line: 621, baseType: !57, size: 8, offset: 72)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !337, file: !45, line: 621, baseType: !61, size: 16, offset: 80)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !337, file: !45, line: 621, baseType: !61, size: 16, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !337, file: !45, line: 621, baseType: !57, size: 8, offset: 112)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !337, file: !45, line: 622, baseType: !151, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !337, file: !45, line: 623, baseType: !48, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !337, file: !45, line: 624, baseType: !78, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !268, file: !45, line: 671, baseType: !349, size: 640)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !45, line: 631, size: 640, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !45, line: 632, baseType: !12, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !349, file: !45, line: 632, baseType: !57, size: 8, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !349, file: !45, line: 632, baseType: !57, size: 8, offset: 72)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !349, file: !45, line: 632, baseType: !61, size: 16, offset: 80)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !349, file: !45, line: 632, baseType: !61, size: 16, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !349, file: !45, line: 633, baseType: !357, size: 512, offset: 128)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 512, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !268, file: !45, line: 672, baseType: !361, size: 320)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !45, line: 654, size: 320, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !361, file: !45, line: 655, baseType: !12, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !361, file: !45, line: 655, baseType: !57, size: 8, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !361, file: !45, line: 655, baseType: !57, size: 8, offset: 72)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !361, file: !45, line: 655, baseType: !61, size: 16, offset: 80)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !45, line: 655, baseType: !61, size: 16, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !361, file: !45, line: 655, baseType: !57, size: 8, offset: 112)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !361, file: !45, line: 656, baseType: !43, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !361, file: !45, line: 657, baseType: !48, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !361, file: !45, line: 658, baseType: !372, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !45, line: 645, size: 128, elements: !374)
!374 = !{!375, !381}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !373, file: !45, line: 646, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !14, line: 1052, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380, !7, !12}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !14, line: 424, baseType: !12)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !373, file: !45, line: 647, baseType: !12, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !177, file: !45, line: 902, baseType: !185, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !177, file: !45, line: 903, baseType: !7, size: 32, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !152, file: !40, line: 61, baseType: !7, size: 32, offset: 1088)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !152, file: !40, line: 62, baseType: !7, size: 32, offset: 1120)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !152, file: !40, line: 63, baseType: !61, size: 16, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !152, file: !40, line: 64, baseType: !57, size: 8, offset: 1168)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !152, file: !40, line: 66, baseType: !389, size: 2688, offset: 1216)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 2688, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 7)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !152, file: !40, line: 67, baseType: !393, size: 3072, offset: 3904)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 3072, elements: !358)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !152, file: !40, line: 68, baseType: !395, size: 576, offset: 6976)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 576, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 9)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !152, file: !40, line: 69, baseType: !116, size: 64, offset: 7552)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !152, file: !40, line: 71, baseType: !101, size: 64, offset: 7616)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !152, file: !40, line: 72, baseType: !116, size: 64, offset: 7680)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !152, file: !40, line: 73, baseType: !267, size: 64, offset: 7744)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !152, file: !40, line: 74, baseType: !43, size: 64, offset: 7808)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !152, file: !40, line: 75, baseType: !48, size: 64, offset: 7872)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !152, file: !40, line: 76, baseType: !43, size: 64, offset: 7936)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !152, file: !40, line: 77, baseType: !185, size: 64, offset: 8000)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !152, file: !40, line: 78, baseType: !48, size: 64, offset: 8064)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !152, file: !40, line: 79, baseType: !43, size: 64, offset: 8128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !152, file: !40, line: 80, baseType: !90, size: 64, offset: 8192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !152, file: !40, line: 81, baseType: !185, size: 64, offset: 8256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !152, file: !40, line: 82, baseType: !411, size: 64, offset: 8320)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !45, line: 702, size: 128, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !413, file: !45, line: 706, baseType: !7, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !413, file: !45, line: 707, baseType: !7, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !413, file: !45, line: 708, baseType: !61, size: 16, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !413, file: !45, line: 709, baseType: !57, size: 8, offset: 80)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !413, file: !45, line: 710, baseType: !57, size: 8, offset: 88)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !45, line: 711, baseType: !57, size: 8, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !152, file: !40, line: 83, baseType: !185, size: 64, offset: 8384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !152, file: !40, line: 84, baseType: !48, size: 64, offset: 8448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !152, file: !40, line: 85, baseType: !267, size: 64, offset: 8512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !152, file: !40, line: 86, baseType: !48, size: 64, offset: 8576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !152, file: !40, line: 87, baseType: !267, size: 64, offset: 8640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !152, file: !40, line: 88, baseType: !185, size: 64, offset: 8704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !152, file: !40, line: 89, baseType: !185, size: 64, offset: 8768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !152, file: !40, line: 90, baseType: !429, size: 64, offset: 8832)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !152, file: !40, line: 91, baseType: !431, size: 64, offset: 8896)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !45, line: 637, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!13, !151, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !152, file: !40, line: 92, baseType: !437, size: 64, offset: 8960)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !45, line: 641, baseType: !148)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !144, file: !50, line: 152, baseType: !48, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !130, file: !50, line: 155, baseType: !7, size: 32, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !130, file: !50, line: 156, baseType: !162, size: 16, offset: 416)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !130, file: !50, line: 157, baseType: !57, size: 8, offset: 432)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !49, file: !50, line: 375, baseType: !443, size: 576)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !50, line: 122, size: 576, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !443, file: !50, line: 123, baseType: !48, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !443, file: !50, line: 123, baseType: !57, size: 8, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !443, file: !50, line: 123, baseType: !57, size: 8, offset: 72)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !443, file: !50, line: 123, baseType: !61, size: 16, offset: 80)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !443, file: !50, line: 123, baseType: !57, size: 8, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !443, file: !50, line: 123, baseType: !57, size: 8, offset: 104)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !443, file: !50, line: 124, baseType: !61, size: 16, offset: 112)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !443, file: !50, line: 125, baseType: !12, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !443, file: !50, line: 126, baseType: !78, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !443, file: !50, line: 127, baseType: !429, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !50, line: 128, baseType: !48, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !50, line: 129, baseType: !48, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !443, file: !50, line: 130, baseType: !43, size: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !443, file: !50, line: 131, baseType: !57, size: 8, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !49, file: !50, line: 376, baseType: !460, size: 448)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !50, line: 134, size: 448, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !473}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !460, file: !50, line: 135, baseType: !48, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !460, file: !50, line: 135, baseType: !57, size: 8, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !50, line: 135, baseType: !57, size: 8, offset: 72)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !460, file: !50, line: 135, baseType: !61, size: 16, offset: 80)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !50, line: 135, baseType: !57, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !460, file: !50, line: 135, baseType: !57, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !50, line: 136, baseType: !43, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !460, file: !50, line: 137, baseType: !48, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !50, line: 138, baseType: !48, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !460, file: !50, line: 139, baseType: !472, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !14, line: 129, baseType: !78)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !460, file: !50, line: 140, baseType: !7, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !49, file: !50, line: 377, baseType: !475, size: 320)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !50, line: 184, size: 320, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !486}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !475, file: !50, line: 185, baseType: !48, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !475, file: !50, line: 185, baseType: !57, size: 8, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !50, line: 185, baseType: !57, size: 8, offset: 72)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !475, file: !50, line: 185, baseType: !61, size: 16, offset: 80)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !475, file: !50, line: 185, baseType: !57, size: 8, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !475, file: !50, line: 185, baseType: !483, size: 128, offset: 128)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 2)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !475, file: !50, line: 185, baseType: !48, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !49, file: !50, line: 378, baseType: !488, size: 384)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !50, line: 187, size: 384, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !488, file: !50, line: 188, baseType: !48, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !488, file: !50, line: 188, baseType: !57, size: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !50, line: 188, baseType: !57, size: 8, offset: 72)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !488, file: !50, line: 188, baseType: !61, size: 16, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !488, file: !50, line: 188, baseType: !57, size: 8, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !488, file: !50, line: 189, baseType: !483, size: 128, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !488, file: !50, line: 189, baseType: !48, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !488, file: !50, line: 189, baseType: !498, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !45, line: 480, size: 576, elements: !500)
!500 = !{!501, !502, !503, !504, !512, !527, !559, !560, !561, !562, !563, !564}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !499, file: !45, line: 481, baseType: !43, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !499, file: !45, line: 482, baseType: !498, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !499, file: !45, line: 483, baseType: !498, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !499, file: !45, line: 484, baseType: !505, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !45, line: 497, size: 256, elements: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !506, file: !45, line: 498, baseType: !505, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !45, line: 499, baseType: !505, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !506, file: !45, line: 500, baseType: !498, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !506, file: !45, line: 501, baseType: !7, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !499, file: !45, line: 485, baseType: !513, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !45, line: 466, size: 320, elements: !515)
!515 = !{!516, !521, !522, !523, !524, !525, !526}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !514, file: !45, line: 467, baseType: !517, size: 128)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !45, line: 459, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !517, file: !45, line: 460, baseType: !57, size: 8)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !517, file: !45, line: 461, baseType: !78, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !514, file: !45, line: 468, baseType: !517, size: 128, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !514, file: !45, line: 469, baseType: !61, size: 16, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !514, file: !45, line: 470, baseType: !57, size: 8, offset: 272)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !514, file: !45, line: 471, baseType: !57, size: 8, offset: 280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !514, file: !45, line: 472, baseType: !57, size: 8, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !514, file: !45, line: 473, baseType: !57, size: 8, offset: 296)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !499, file: !45, line: 486, baseType: !528, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !45, line: 448, size: 192, elements: !530)
!530 = !{!531, !554, !555, !556, !557, !558}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !529, file: !45, line: 449, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !45, line: 438, size: 64, elements: !533)
!533 = !{!534, !535, !548}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !532, file: !45, line: 439, baseType: !43, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !532, file: !45, line: 440, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !45, line: 419, size: 256, elements: !538)
!538 = !{!539, !544, !545, !546, !547}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !537, file: !45, line: 420, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !14, line: 1049, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!7, !380, !7, !12}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !537, file: !45, line: 421, baseType: !12, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !537, file: !45, line: 422, baseType: !43, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !537, file: !45, line: 423, baseType: !57, size: 8, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !537, file: !45, line: 424, baseType: !57, size: 8, offset: 200)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !532, file: !45, line: 441, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !45, line: 429, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !550, file: !45, line: 430, baseType: !43, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !550, file: !45, line: 431, baseType: !549, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !529, file: !45, line: 450, baseType: !513, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !45, line: 451, baseType: !57, size: 8, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !529, file: !45, line: 452, baseType: !57, size: 8, offset: 136)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !529, file: !45, line: 453, baseType: !57, size: 8, offset: 144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !529, file: !45, line: 454, baseType: !57, size: 8, offset: 152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !499, file: !45, line: 487, baseType: !78, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !499, file: !45, line: 488, baseType: !7, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !499, file: !45, line: 489, baseType: !61, size: 16, offset: 480)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !499, file: !45, line: 490, baseType: !61, size: 16, offset: 496)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !499, file: !45, line: 491, baseType: !57, size: 8, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !499, file: !45, line: 492, baseType: !57, size: 8, offset: 520)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !49, file: !50, line: 379, baseType: !566, size: 384)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !50, line: 192, size: 384, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !566, file: !50, line: 193, baseType: !48, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !566, file: !50, line: 193, baseType: !57, size: 8, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !566, file: !50, line: 193, baseType: !57, size: 8, offset: 72)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !566, file: !50, line: 193, baseType: !61, size: 16, offset: 80)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !566, file: !50, line: 193, baseType: !57, size: 8, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !566, file: !50, line: 193, baseType: !483, size: 128, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !566, file: !50, line: 193, baseType: !48, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !566, file: !50, line: 193, baseType: !7, size: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !566, file: !50, line: 194, baseType: !7, size: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !49, file: !50, line: 380, baseType: !578, size: 384)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !50, line: 197, size: 384, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !578, file: !50, line: 198, baseType: !48, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !578, file: !50, line: 198, baseType: !57, size: 8, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !50, line: 198, baseType: !57, size: 8, offset: 72)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !578, file: !50, line: 198, baseType: !61, size: 16, offset: 80)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !50, line: 198, baseType: !57, size: 8, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !578, file: !50, line: 200, baseType: !57, size: 8, offset: 104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !578, file: !50, line: 201, baseType: !57, size: 8, offset: 112)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !578, file: !50, line: 202, baseType: !483, size: 128, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !578, file: !50, line: 202, baseType: !48, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !578, file: !50, line: 202, baseType: !590, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !14, line: 128, baseType: !78)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !49, file: !50, line: 381, baseType: !592, size: 320)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !50, line: 205, size: 320, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !592, file: !50, line: 206, baseType: !48, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !592, file: !50, line: 206, baseType: !57, size: 8, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !50, line: 206, baseType: !57, size: 8, offset: 72)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !592, file: !50, line: 206, baseType: !61, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !50, line: 206, baseType: !57, size: 8, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !592, file: !50, line: 206, baseType: !483, size: 128, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !592, file: !50, line: 206, baseType: !48, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !49, file: !50, line: 382, baseType: !602, size: 384)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !50, line: 233, size: 384, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !602, file: !50, line: 234, baseType: !48, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 72)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !602, file: !50, line: 234, baseType: !61, size: 16, offset: 80)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 104)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 112)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 120)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !602, file: !50, line: 234, baseType: !43, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !602, file: !50, line: 234, baseType: !7, size: 32, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !602, file: !50, line: 234, baseType: !7, size: 32, offset: 224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !602, file: !50, line: 234, baseType: !7, size: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !602, file: !50, line: 234, baseType: !57, size: 8, offset: 296)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !602, file: !50, line: 234, baseType: !48, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !49, file: !50, line: 383, baseType: !620, size: 576)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !50, line: 237, size: 576, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !620, file: !50, line: 238, baseType: !48, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 72)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !620, file: !50, line: 238, baseType: !61, size: 16, offset: 80)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 104)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 112)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 120)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !620, file: !50, line: 238, baseType: !43, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !620, file: !50, line: 238, baseType: !7, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !620, file: !50, line: 238, baseType: !7, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !620, file: !50, line: 238, baseType: !7, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !620, file: !50, line: 238, baseType: !57, size: 8, offset: 296)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !620, file: !50, line: 238, baseType: !61, size: 16, offset: 304)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !620, file: !50, line: 239, baseType: !48, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !620, file: !50, line: 240, baseType: !101, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !620, file: !50, line: 241, baseType: !61, size: 16, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !620, file: !50, line: 242, baseType: !101, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !49, file: !50, line: 384, baseType: !642, size: 384)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !50, line: 262, size: 384, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !642, file: !50, line: 263, baseType: !48, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 72)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !642, file: !50, line: 263, baseType: !61, size: 16, offset: 80)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 104)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 112)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 120)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !642, file: !50, line: 263, baseType: !43, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !642, file: !50, line: 263, baseType: !7, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !642, file: !50, line: 263, baseType: !7, size: 32, offset: 224)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !642, file: !50, line: 263, baseType: !7, size: 32, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 288)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !642, file: !50, line: 263, baseType: !57, size: 8, offset: 304)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !642, file: !50, line: 264, baseType: !48, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !49, file: !50, line: 385, baseType: !661, size: 448)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !50, line: 245, size: 448, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !661, file: !50, line: 246, baseType: !48, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 72)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !661, file: !50, line: 246, baseType: !61, size: 16, offset: 80)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 104)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !661, file: !50, line: 246, baseType: !43, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !661, file: !50, line: 246, baseType: !7, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !661, file: !50, line: 246, baseType: !7, size: 32, offset: 224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !661, file: !50, line: 246, baseType: !7, size: 32, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !661, file: !50, line: 246, baseType: !57, size: 8, offset: 296)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !661, file: !50, line: 246, baseType: !48, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !661, file: !50, line: 247, baseType: !48, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !49, file: !50, line: 386, baseType: !680, size: 448)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !50, line: 250, size: 448, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !680, file: !50, line: 251, baseType: !48, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 72)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !680, file: !50, line: 251, baseType: !61, size: 16, offset: 80)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 104)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 112)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 120)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !680, file: !50, line: 251, baseType: !43, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !680, file: !50, line: 251, baseType: !7, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !680, file: !50, line: 251, baseType: !7, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !680, file: !50, line: 251, baseType: !7, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !680, file: !50, line: 251, baseType: !57, size: 8, offset: 296)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !680, file: !50, line: 256, baseType: !48, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !680, file: !50, line: 257, baseType: !48, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !49, file: !50, line: 387, baseType: !699, size: 512)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !50, line: 273, size: 512, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !699, file: !50, line: 274, baseType: !48, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !699, file: !50, line: 274, baseType: !57, size: 8, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !50, line: 274, baseType: !57, size: 8, offset: 72)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !699, file: !50, line: 274, baseType: !61, size: 16, offset: 80)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !699, file: !50, line: 274, baseType: !57, size: 8, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !699, file: !50, line: 274, baseType: !43, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !699, file: !50, line: 275, baseType: !7, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !699, file: !50, line: 276, baseType: !376, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !699, file: !50, line: 277, baseType: !12, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !50, line: 278, baseType: !483, size: 128, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !49, file: !50, line: 388, baseType: !712, size: 512)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !50, line: 281, size: 512, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !727, !728, !729, !735, !736}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !712, file: !50, line: 282, baseType: !48, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !712, file: !50, line: 282, baseType: !57, size: 8, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !50, line: 282, baseType: !57, size: 8, offset: 72)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !712, file: !50, line: 282, baseType: !61, size: 16, offset: 80)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !712, file: !50, line: 282, baseType: !57, size: 8, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !712, file: !50, line: 282, baseType: !57, size: 8, offset: 104)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !712, file: !50, line: 283, baseType: !57, size: 8, offset: 112)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !712, file: !50, line: 284, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !14, line: 1084, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!13, !7, !472, !7, !726, !12, !12}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !712, file: !50, line: 285, baseType: !43, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !712, file: !50, line: 286, baseType: !12, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !712, file: !50, line: 287, baseType: !730, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !14, line: 1102, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!13, !380, !7, !12, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !712, file: !50, line: 288, baseType: !48, size: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !50, line: 289, baseType: !48, size: 64, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !49, file: !50, line: 389, baseType: !738, size: 512)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !50, line: 307, size: 512, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !738, file: !50, line: 308, baseType: !48, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !738, file: !50, line: 308, baseType: !57, size: 8, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !50, line: 308, baseType: !57, size: 8, offset: 72)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !738, file: !50, line: 308, baseType: !61, size: 16, offset: 80)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !738, file: !50, line: 308, baseType: !57, size: 8, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !738, file: !50, line: 308, baseType: !57, size: 8, offset: 104)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !738, file: !50, line: 309, baseType: !57, size: 8, offset: 112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !738, file: !50, line: 310, baseType: !57, size: 8, offset: 120)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !738, file: !50, line: 311, baseType: !12, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !738, file: !50, line: 312, baseType: !43, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !738, file: !50, line: 313, baseType: !116, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !738, file: !50, line: 314, baseType: !101, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !738, file: !50, line: 315, baseType: !101, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !738, file: !50, line: 316, baseType: !7, size: 32, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !49, file: !50, line: 390, baseType: !755, size: 448)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !50, line: 340, size: 448, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !755, file: !50, line: 341, baseType: !48, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !755, file: !50, line: 341, baseType: !57, size: 8, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !50, line: 341, baseType: !57, size: 8, offset: 72)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !755, file: !50, line: 341, baseType: !61, size: 16, offset: 80)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !50, line: 341, baseType: !57, size: 8, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !755, file: !50, line: 341, baseType: !43, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !755, file: !50, line: 342, baseType: !43, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !755, file: !50, line: 343, baseType: !12, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !755, file: !50, line: 344, baseType: !101, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !755, file: !50, line: 345, baseType: !7, size: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !49, file: !50, line: 391, baseType: !768, size: 256)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !50, line: 350, size: 256, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !780}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !768, file: !50, line: 351, baseType: !48, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !768, file: !50, line: 351, baseType: !57, size: 8, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !50, line: 351, baseType: !57, size: 8, offset: 72)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !768, file: !50, line: 351, baseType: !61, size: 16, offset: 80)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !768, file: !50, line: 351, baseType: !57, size: 8, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !768, file: !50, line: 351, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !14, line: 1055, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !380, !12}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !768, file: !50, line: 352, baseType: !12, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !49, file: !50, line: 392, baseType: !782, size: 192)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !50, line: 357, size: 192, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !782, file: !50, line: 358, baseType: !48, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !782, file: !50, line: 358, baseType: !57, size: 8, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !50, line: 358, baseType: !57, size: 8, offset: 72)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !782, file: !50, line: 358, baseType: !61, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !50, line: 358, baseType: !57, size: 8, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !50, line: 358, baseType: !48, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !49, file: !50, line: 399, baseType: !44, size: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !44, file: !45, line: 135, baseType: !57, size: 8, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !45, line: 136, baseType: !57, size: 8, offset: 72)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !45, line: 137, baseType: !61, size: 16, offset: 80)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !45, line: 138, baseType: !795, size: 32, offset: 96)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !796, line: 327, size: 32, elements: !797)
!796 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !795, file: !796, line: 328, baseType: !7, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !795, file: !796, line: 329, baseType: !30, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !44, file: !45, line: 139, baseType: !43, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !44, file: !45, line: 140, baseType: !43, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !44, file: !45, line: 141, baseType: !43, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !44, file: !45, line: 142, baseType: !162, size: 16, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "relative_pathname", scope: !39, file: !40, line: 156, baseType: !805, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !39, file: !40, line: 157, baseType: !116, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !39, file: !40, line: 159, baseType: !43, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !39, file: !40, line: 160, baseType: !48, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "full_pathname", scope: !39, file: !40, line: 161, baseType: !90, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "predefined", scope: !39, file: !40, line: 163, baseType: !811, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_predefined_info", file: !45, line: 351, size: 56, elements: !814)
!814 = !{!815, !821, !830, !838, !847}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !813, file: !45, line: 352, baseType: !816, size: 56)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_name_info", file: !45, line: 295, size: 56, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !45, line: 296, baseType: !30, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "argument_list", scope: !816, file: !45, line: 297, baseType: !61, size: 16, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "expected_btypes", scope: !816, file: !45, line: 298, baseType: !57, size: 8, offset: 48)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ret_info", scope: !813, file: !45, line: 353, baseType: !822, size: 56)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_package_info", file: !45, line: 314, size: 56, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !822, file: !45, line: 315, baseType: !57, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "object_type1", scope: !822, file: !45, line: 316, baseType: !57, size: 8, offset: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "count1", scope: !822, file: !45, line: 317, baseType: !57, size: 8, offset: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "object_type2", scope: !822, file: !45, line: 318, baseType: !57, size: 8, offset: 24)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "count2", scope: !822, file: !45, line: 319, baseType: !57, size: 8, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !822, file: !45, line: 320, baseType: !61, size: 16, offset: 40)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ret_info2", scope: !813, file: !45, line: 354, baseType: !831, size: 56)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_package_info2", file: !45, line: 325, size: 56, elements: !832)
!832 = !{!833, !834, !835, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !831, file: !45, line: 326, baseType: !57, size: 8)
