; ModuleID = '../bcout/drivers/acpi/acpica/nsxfeval.llvm.bc'
source_filename = "drivers/acpi/acpica/nsxfeval.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_rw_lock = type { i8*, i8*, i32 }
%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !851, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !850, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsxfeval.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !20, !24, !65, !49, !80, !83, !64, !21, !16, !847, !849}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !15, line: 899, size: 192, elements: !26)
!26 = !{!27, !29, !34, !42, !52, !58, !66, !74}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !25, file: !15, line: 900, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !15, line: 635, baseType: !16)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !25, file: !15, line: 904, baseType: !30, size: 128)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 901, size: 128, elements: !31)
!31 = !{!32, !33}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !15, line: 902, baseType: !28, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !30, file: !15, line: 903, baseType: !21, size: 64, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !25, file: !15, line: 910, baseType: !35, size: 128)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 906, size: 128, elements: !36)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !35, file: !15, line: 907, baseType: !28, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !35, file: !15, line: 908, baseType: !16, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !35, file: !15, line: 909, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !25, file: !15, line: 916, baseType: !43, size: 128)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 912, size: 128, elements: !44)
!44 = !{!45, !46, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !15, line: 913, baseType: !28, size: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !43, file: !15, line: 914, baseType: !16, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !43, file: !15, line: 915, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !25, file: !15, line: 922, baseType: !53, size: 128)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 918, size: 128, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !15, line: 919, baseType: !28, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !53, file: !15, line: 920, baseType: !16, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !53, file: !15, line: 921, baseType: !24, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !25, file: !15, line: 928, baseType: !59, size: 128)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 924, size: 128, elements: !60)
!60 = !{!61, !62, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !15, line: 925, baseType: !28, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !59, file: !15, line: 926, baseType: !28, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !59, file: !15, line: 927, baseType: !64, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !25, file: !15, line: 935, baseType: !67, size: 192)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 930, size: 192, elements: !68)
!68 = !{!69, !70, !71, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !15, line: 931, baseType: !28, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !67, file: !15, line: 932, baseType: !16, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !67, file: !15, line: 933, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !21)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !67, file: !15, line: 934, baseType: !16, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !25, file: !15, line: 941, baseType: !75, size: 96)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !25, file: !15, line: 937, size: 96, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !75, file: !15, line: 938, baseType: !28, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !75, file: !15, line: 939, baseType: !16, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !75, file: !15, line: 940, baseType: !16, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !82)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_descriptor", file: !85, line: 432, size: 1600, elements: !86)
!85 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!86 = !{!87, !92, !845, !846}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !84, file: !85, line: 433, baseType: !88, size: 128)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_descriptor", file: !85, line: 427, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "common_pointer", scope: !88, file: !85, line: 428, baseType: !65, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !88, file: !85, line: 429, baseType: !49, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !84, file: !85, line: 434, baseType: !93, size: 576)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !85, line: 367, size: 576, elements: !94)
!94 = !{!95, !104, !117, !127, !162, !176, !185, !497, !514, !529, !542, !620, !632, !645, !655, !673, !695, !714, !733, !752, !765, !791, !808, !821, !835, !844}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !93, file: !85, line: 368, baseType: !96, size: 128)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !85, line: 73, size: 128, elements: !97)
!97 = !{!98, !100, !101, !102, !103}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !96, file: !85, line: 74, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !96, file: !85, line: 74, baseType: !49, size: 8, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !96, file: !85, line: 74, baseType: !49, size: 8, offset: 72)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !96, file: !85, line: 74, baseType: !80, size: 16, offset: 80)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !96, file: !85, line: 74, baseType: !49, size: 8, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !93, file: !85, line: 369, baseType: !105, size: 192)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !85, line: 76, size: 192, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !116}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !105, file: !85, line: 77, baseType: !99, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !105, file: !85, line: 77, baseType: !49, size: 8, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !85, line: 77, baseType: !49, size: 8, offset: 72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !105, file: !85, line: 77, baseType: !80, size: 16, offset: 80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !85, line: 77, baseType: !49, size: 8, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !105, file: !85, line: 77, baseType: !113, size: 24, offset: 104)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 24, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !85, line: 78, baseType: !21, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !93, file: !85, line: 370, baseType: !118, size: 256)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !85, line: 93, size: 256, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !118, file: !85, line: 94, baseType: !99, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !118, file: !85, line: 94, baseType: !49, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !85, line: 94, baseType: !49, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !118, file: !85, line: 94, baseType: !80, size: 16, offset: 80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !85, line: 94, baseType: !49, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !118, file: !85, line: 94, baseType: !40, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !85, line: 94, baseType: !16, size: 32, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !85, line: 371, baseType: !128, size: 384)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !85, line: 97, size: 384, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !128, file: !85, line: 98, baseType: !99, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !128, file: !85, line: 98, baseType: !49, size: 8, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !85, line: 98, baseType: !49, size: 8, offset: 72)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !128, file: !85, line: 98, baseType: !80, size: 16, offset: 80)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !128, file: !85, line: 98, baseType: !49, size: 8, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !128, file: !85, line: 98, baseType: !48, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !128, file: !85, line: 98, baseType: !16, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !128, file: !85, line: 99, baseType: !16, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !128, file: !85, line: 100, baseType: !48, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !128, file: !85, line: 101, baseType: !140, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !142, line: 133, size: 384, elements: !143)
!142 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!143 = !{!144, !145, !146, !147, !148, !157, !158, !159, !160}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !141, file: !142, line: 134, baseType: !99, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !141, file: !142, line: 135, baseType: !49, size: 8, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !142, line: 136, baseType: !49, size: 8, offset: 72)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !141, file: !142, line: 137, baseType: !80, size: 16, offset: 80)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !142, line: 138, baseType: !149, size: 32, offset: 96)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !150, line: 327, size: 32, elements: !151)
!150 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!151 = !{!152, !153}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !149, file: !150, line: 328, baseType: !16, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !149, file: !150, line: 329, baseType: !154, size: 32)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 32, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 4)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !141, file: !142, line: 139, baseType: !140, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !141, file: !142, line: 140, baseType: !140, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !141, file: !142, line: 141, baseType: !140, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !141, file: !142, line: 142, baseType: !161, size: 16, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !80)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !93, file: !85, line: 372, baseType: !163, size: 384)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !85, line: 104, size: 384, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !173, !174, !175}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !163, file: !85, line: 105, baseType: !99, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !163, file: !85, line: 105, baseType: !49, size: 8, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !85, line: 105, baseType: !49, size: 8, offset: 72)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !163, file: !85, line: 105, baseType: !80, size: 16, offset: 80)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !163, file: !85, line: 105, baseType: !49, size: 8, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !163, file: !85, line: 105, baseType: !140, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !163, file: !85, line: 106, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !163, file: !85, line: 107, baseType: !48, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !163, file: !85, line: 108, baseType: !16, size: 32, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !163, file: !85, line: 109, baseType: !16, size: 32, offset: 352)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !93, file: !85, line: 373, baseType: !177, size: 192)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !85, line: 118, size: 192, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !177, file: !85, line: 119, baseType: !99, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !177, file: !85, line: 119, baseType: !49, size: 8, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !177, file: !85, line: 119, baseType: !49, size: 8, offset: 72)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !177, file: !85, line: 119, baseType: !80, size: 16, offset: 80)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !85, line: 119, baseType: !49, size: 8, offset: 96)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !177, file: !85, line: 119, baseType: !65, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !93, file: !85, line: 374, baseType: !186, size: 448)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !85, line: 143, size: 448, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !494, !495, !496}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !186, file: !85, line: 144, baseType: !99, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !186, file: !85, line: 144, baseType: !49, size: 8, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !85, line: 144, baseType: !49, size: 8, offset: 72)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !186, file: !85, line: 144, baseType: !80, size: 16, offset: 80)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !85, line: 144, baseType: !49, size: 8, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !186, file: !85, line: 144, baseType: !49, size: 8, offset: 104)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !186, file: !85, line: 145, baseType: !49, size: 8, offset: 112)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !186, file: !85, line: 146, baseType: !49, size: 8, offset: 120)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !186, file: !85, line: 147, baseType: !99, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !85, line: 148, baseType: !99, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !186, file: !85, line: 149, baseType: !48, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !186, file: !85, line: 153, baseType: !200, size: 64, offset: 320)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !186, file: !85, line: 150, size: 64, elements: !201)
!201 = !{!202, !493}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !200, file: !85, line: 151, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !142, line: 248, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!14, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !209, line: 37, size: 9024, elements: !210)
!209 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !439, !440, !441, !442, !443, !447, !449, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !476, !477, !478, !479, !480, !481, !482, !483, !485, !491}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !209, line: 38, baseType: !207, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !208, file: !209, line: 39, baseType: !49, size: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !208, file: !209, line: 40, baseType: !49, size: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !208, file: !209, line: 41, baseType: !80, size: 16, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !208, file: !209, line: 42, baseType: !49, size: 8, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !208, file: !209, line: 43, baseType: !49, size: 8, offset: 104)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !208, file: !209, line: 44, baseType: !49, size: 8, offset: 112)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !208, file: !209, line: 45, baseType: !161, size: 16, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !208, file: !209, line: 46, baseType: !49, size: 8, offset: 144)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !208, file: !209, line: 47, baseType: !49, size: 8, offset: 152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !208, file: !209, line: 48, baseType: !49, size: 8, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !208, file: !209, line: 49, baseType: !49, size: 8, offset: 168)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !208, file: !209, line: 50, baseType: !49, size: 8, offset: 176)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !208, file: !209, line: 51, baseType: !49, size: 8, offset: 184)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !208, file: !209, line: 52, baseType: !49, size: 8, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !208, file: !209, line: 53, baseType: !49, size: 8, offset: 200)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !208, file: !209, line: 54, baseType: !48, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !208, file: !209, line: 55, baseType: !16, size: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !208, file: !209, line: 56, baseType: !16, size: 32, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !208, file: !209, line: 57, baseType: !16, size: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !208, file: !209, line: 58, baseType: !16, size: 32, offset: 416)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !208, file: !209, line: 60, baseType: !233, size: 640, offset: 448)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !142, line: 893, size: 640, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !321, !322, !437, !438}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !233, file: !142, line: 894, baseType: !48, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !233, file: !142, line: 895, baseType: !48, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !233, file: !142, line: 896, baseType: !48, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !233, file: !142, line: 897, baseType: !48, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !233, file: !142, line: 898, baseType: !48, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !233, file: !142, line: 899, baseType: !241, size: 64, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !142, line: 875, size: 1600, elements: !243)
!243 = !{!244, !264, !280}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !242, file: !142, line: 876, baseType: !245, size: 448)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !142, line: 828, size: 448, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !263}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !245, file: !142, line: 829, baseType: !241, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !245, file: !142, line: 829, baseType: !49, size: 8, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !245, file: !142, line: 829, baseType: !49, size: 8, offset: 72)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !245, file: !142, line: 829, baseType: !80, size: 16, offset: 80)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !245, file: !142, line: 829, baseType: !48, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !245, file: !142, line: 829, baseType: !241, size: 64, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !245, file: !142, line: 829, baseType: !140, size: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !245, file: !142, line: 829, baseType: !255, size: 64, offset: 320)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !142, line: 716, size: 64, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !262}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !255, file: !142, line: 717, baseType: !21, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !142, line: 718, baseType: !16, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !255, file: !142, line: 719, baseType: !40, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !255, file: !142, line: 720, baseType: !48, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !142, line: 721, baseType: !40, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !255, file: !142, line: 722, baseType: !241, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !245, file: !142, line: 829, baseType: !49, size: 8, offset: 384)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !242, file: !142, line: 877, baseType: !265, size: 640)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !142, line: 835, size: 640, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !265, file: !142, line: 836, baseType: !241, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !265, file: !142, line: 836, baseType: !49, size: 8, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !142, line: 836, baseType: !49, size: 8, offset: 72)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !265, file: !142, line: 836, baseType: !80, size: 16, offset: 80)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !265, file: !142, line: 836, baseType: !48, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !142, line: 836, baseType: !241, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !265, file: !142, line: 836, baseType: !140, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !142, line: 836, baseType: !255, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !265, file: !142, line: 836, baseType: !49, size: 8, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !265, file: !142, line: 836, baseType: !40, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !265, file: !142, line: 837, baseType: !48, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !265, file: !142, line: 838, baseType: !16, size: 32, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !142, line: 839, baseType: !16, size: 32, offset: 608)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !242, file: !142, line: 878, baseType: !281, size: 1600)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !142, line: 846, size: 1600, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !281, file: !142, line: 847, baseType: !241, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !281, file: !142, line: 847, baseType: !49, size: 8, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !142, line: 847, baseType: !49, size: 8, offset: 72)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !281, file: !142, line: 847, baseType: !80, size: 16, offset: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !281, file: !142, line: 847, baseType: !48, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !142, line: 847, baseType: !241, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !281, file: !142, line: 847, baseType: !140, size: 64, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !142, line: 847, baseType: !255, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !281, file: !142, line: 847, baseType: !49, size: 8, offset: 384)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !281, file: !142, line: 847, baseType: !241, size: 64, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !281, file: !142, line: 848, baseType: !241, size: 64, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !281, file: !142, line: 849, baseType: !40, size: 64, offset: 576)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !281, file: !142, line: 850, baseType: !49, size: 8, offset: 640)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !281, file: !142, line: 851, baseType: !40, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !281, file: !142, line: 852, baseType: !40, size: 64, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !281, file: !142, line: 853, baseType: !40, size: 64, offset: 832)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !281, file: !142, line: 854, baseType: !154, size: 32, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !281, file: !142, line: 855, baseType: !16, size: 32, offset: 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !281, file: !142, line: 856, baseType: !16, size: 32, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !281, file: !142, line: 857, baseType: !16, size: 32, offset: 992)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !281, file: !142, line: 858, baseType: !16, size: 32, offset: 1024)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !281, file: !142, line: 859, baseType: !16, size: 32, offset: 1056)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !281, file: !142, line: 860, baseType: !16, size: 32, offset: 1088)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !281, file: !142, line: 861, baseType: !16, size: 32, offset: 1120)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !281, file: !142, line: 862, baseType: !16, size: 32, offset: 1152)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !281, file: !142, line: 863, baseType: !16, size: 32, offset: 1184)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !281, file: !142, line: 864, baseType: !16, size: 32, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !281, file: !142, line: 865, baseType: !16, size: 32, offset: 1248)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !281, file: !142, line: 866, baseType: !16, size: 32, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !281, file: !142, line: 867, baseType: !16, size: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !281, file: !142, line: 868, baseType: !80, size: 16, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !281, file: !142, line: 869, baseType: !49, size: 8, offset: 1360)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !281, file: !142, line: 870, baseType: !49, size: 8, offset: 1368)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !281, file: !142, line: 871, baseType: !49, size: 8, offset: 1376)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !281, file: !142, line: 872, baseType: !318, size: 160, offset: 1384)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 160, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 20)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !233, file: !142, line: 900, baseType: !140, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !233, file: !142, line: 901, baseType: !323, size: 64, offset: 448)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !142, line: 663, size: 640, elements: !325)
!325 = !{!326, !334, !347, !356, !365, !378, !392, !404, !416}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !324, file: !142, line: 664, baseType: !327, size: 128)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !142, line: 567, size: 128, elements: !328)
!328 = !{!329, !330, !331, !332, !333}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !142, line: 568, baseType: !65, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !327, file: !142, line: 568, baseType: !49, size: 8, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !327, file: !142, line: 568, baseType: !49, size: 8, offset: 72)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !327, file: !142, line: 568, baseType: !80, size: 16, offset: 80)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !327, file: !142, line: 568, baseType: !80, size: 16, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !324, file: !142, line: 665, baseType: !335, size: 384)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !142, line: 593, size: 384, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !335, file: !142, line: 594, baseType: !65, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !335, file: !142, line: 594, baseType: !49, size: 8, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !335, file: !142, line: 594, baseType: !49, size: 8, offset: 72)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !335, file: !142, line: 594, baseType: !80, size: 16, offset: 80)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !142, line: 594, baseType: !80, size: 16, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !335, file: !142, line: 594, baseType: !80, size: 16, offset: 112)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !335, file: !142, line: 595, baseType: !241, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !335, file: !142, line: 596, baseType: !48, size: 64, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !335, file: !142, line: 597, baseType: !48, size: 64, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !335, file: !142, line: 598, baseType: !21, size: 64, offset: 320)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !324, file: !142, line: 666, baseType: !348, size: 192)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !142, line: 573, size: 192, elements: !349)
!349 = !{!350, !351, !352, !353, !354, !355}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !142, line: 574, baseType: !65, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !348, file: !142, line: 574, baseType: !49, size: 8, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !348, file: !142, line: 574, baseType: !49, size: 8, offset: 72)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !348, file: !142, line: 574, baseType: !80, size: 16, offset: 80)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !142, line: 574, baseType: !80, size: 16, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !348, file: !142, line: 574, baseType: !99, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !324, file: !142, line: 667, baseType: !357, size: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !142, line: 604, size: 192, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !142, line: 605, baseType: !65, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !357, file: !142, line: 605, baseType: !49, size: 8, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !357, file: !142, line: 605, baseType: !49, size: 8, offset: 72)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !357, file: !142, line: 605, baseType: !80, size: 16, offset: 80)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !357, file: !142, line: 605, baseType: !80, size: 16, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !357, file: !142, line: 605, baseType: !140, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !324, file: !142, line: 668, baseType: !366, size: 448)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !142, line: 608, size: 448, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !142, line: 609, baseType: !65, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !366, file: !142, line: 609, baseType: !49, size: 8, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !142, line: 609, baseType: !49, size: 8, offset: 72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !366, file: !142, line: 609, baseType: !80, size: 16, offset: 80)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !142, line: 609, baseType: !80, size: 16, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !366, file: !142, line: 609, baseType: !16, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !366, file: !142, line: 610, baseType: !241, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !366, file: !142, line: 611, baseType: !48, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !366, file: !142, line: 612, baseType: !48, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !366, file: !142, line: 613, baseType: !16, size: 32, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !324, file: !142, line: 669, baseType: !379, size: 512)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !142, line: 580, size: 512, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !142, line: 581, baseType: !65, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !379, file: !142, line: 581, baseType: !49, size: 8, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !379, file: !142, line: 581, baseType: !49, size: 8, offset: 72)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !379, file: !142, line: 581, baseType: !80, size: 16, offset: 80)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !379, file: !142, line: 581, baseType: !80, size: 16, offset: 96)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !379, file: !142, line: 581, baseType: !16, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !379, file: !142, line: 582, baseType: !99, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !379, file: !142, line: 583, baseType: !99, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !379, file: !142, line: 584, baseType: !207, size: 64, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !379, file: !142, line: 585, baseType: !65, size: 64, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !379, file: !142, line: 586, baseType: !16, size: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !324, file: !142, line: 670, baseType: !393, size: 320)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !142, line: 620, size: 320, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !142, line: 621, baseType: !65, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !393, file: !142, line: 621, baseType: !49, size: 8, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !142, line: 621, baseType: !49, size: 8, offset: 72)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !393, file: !142, line: 621, baseType: !80, size: 16, offset: 80)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !393, file: !142, line: 621, baseType: !80, size: 16, offset: 96)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !393, file: !142, line: 621, baseType: !49, size: 8, offset: 112)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !393, file: !142, line: 622, baseType: !207, size: 64, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !393, file: !142, line: 623, baseType: !99, size: 64, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !393, file: !142, line: 624, baseType: !21, size: 64, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !324, file: !142, line: 671, baseType: !405, size: 640)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !142, line: 631, size: 640, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !142, line: 632, baseType: !65, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !405, file: !142, line: 632, baseType: !49, size: 8, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !142, line: 632, baseType: !49, size: 8, offset: 72)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !405, file: !142, line: 632, baseType: !80, size: 16, offset: 80)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !405, file: !142, line: 632, baseType: !80, size: 16, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !405, file: !142, line: 633, baseType: !413, size: 512, offset: 128)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 512, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !324, file: !142, line: 672, baseType: !417, size: 320)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !142, line: 654, size: 320, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !142, line: 655, baseType: !65, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !417, file: !142, line: 655, baseType: !49, size: 8, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !142, line: 655, baseType: !49, size: 8, offset: 72)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !417, file: !142, line: 655, baseType: !80, size: 16, offset: 80)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !417, file: !142, line: 655, baseType: !80, size: 16, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !417, file: !142, line: 655, baseType: !49, size: 8, offset: 112)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !417, file: !142, line: 656, baseType: !140, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !417, file: !142, line: 657, baseType: !99, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !417, file: !142, line: 658, baseType: !428, size: 64, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !142, line: 645, size: 128, elements: !430)
!430 = !{!431, !436}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !429, file: !142, line: 646, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !64, !16, !65}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !429, file: !142, line: 647, baseType: !65, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !233, file: !142, line: 902, baseType: !241, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !233, file: !142, line: 903, baseType: !16, size: 32, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !208, file: !209, line: 61, baseType: !16, size: 32, offset: 1088)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !208, file: !209, line: 62, baseType: !16, size: 32, offset: 1120)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !208, file: !209, line: 63, baseType: !80, size: 16, offset: 1152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !208, file: !209, line: 64, baseType: !49, size: 8, offset: 1168)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !208, file: !209, line: 66, baseType: !444, size: 2688, offset: 1216)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 2688, elements: !445)
!445 = !{!446}
!446 = !DISubrange(count: 7)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !208, file: !209, line: 67, baseType: !448, size: 3072, offset: 3904)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 3072, elements: !414)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !208, file: !209, line: 68, baseType: !450, size: 576, offset: 6976)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 576, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 9)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !208, file: !209, line: 69, baseType: !172, size: 64, offset: 7552)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !208, file: !209, line: 71, baseType: !48, size: 64, offset: 7616)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !208, file: !209, line: 72, baseType: !172, size: 64, offset: 7680)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !208, file: !209, line: 73, baseType: !323, size: 64, offset: 7744)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !208, file: !209, line: 74, baseType: !140, size: 64, offset: 7808)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !208, file: !209, line: 75, baseType: !99, size: 64, offset: 7872)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !208, file: !209, line: 76, baseType: !140, size: 64, offset: 7936)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !208, file: !209, line: 77, baseType: !241, size: 64, offset: 8000)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !208, file: !209, line: 78, baseType: !99, size: 64, offset: 8064)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !208, file: !209, line: 79, baseType: !140, size: 64, offset: 8128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !208, file: !209, line: 80, baseType: !40, size: 64, offset: 8192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !208, file: !209, line: 81, baseType: !241, size: 64, offset: 8256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !208, file: !209, line: 82, baseType: !466, size: 64, offset: 8320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !142, line: 702, size: 128, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !468, file: !142, line: 706, baseType: !16, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !468, file: !142, line: 707, baseType: !16, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !468, file: !142, line: 708, baseType: !80, size: 16, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !468, file: !142, line: 709, baseType: !49, size: 8, offset: 80)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !468, file: !142, line: 710, baseType: !49, size: 8, offset: 88)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !468, file: !142, line: 711, baseType: !49, size: 8, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !208, file: !209, line: 83, baseType: !241, size: 64, offset: 8384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !208, file: !209, line: 84, baseType: !99, size: 64, offset: 8448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !208, file: !209, line: 85, baseType: !323, size: 64, offset: 8512)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !208, file: !209, line: 86, baseType: !99, size: 64, offset: 8576)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !208, file: !209, line: 87, baseType: !323, size: 64, offset: 8640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !208, file: !209, line: 88, baseType: !241, size: 64, offset: 8704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !208, file: !209, line: 89, baseType: !241, size: 64, offset: 8768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !208, file: !209, line: 90, baseType: !484, size: 64, offset: 8832)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !208, file: !209, line: 91, baseType: !486, size: 64, offset: 8896)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !142, line: 637, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{!14, !207, !490}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !208, file: !209, line: 92, baseType: !492, size: 64, offset: 8960)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !142, line: 641, baseType: !204)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !200, file: !85, line: 152, baseType: !99, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !186, file: !85, line: 155, baseType: !16, size: 32, offset: 384)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !186, file: !85, line: 156, baseType: !161, size: 16, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !186, file: !85, line: 157, baseType: !49, size: 8, offset: 432)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !93, file: !85, line: 375, baseType: !498, size: 576)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !85, line: 122, size: 576, elements: !499)
!499 = !{!500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !498, file: !85, line: 123, baseType: !99, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !498, file: !85, line: 123, baseType: !49, size: 8, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !498, file: !85, line: 123, baseType: !49, size: 8, offset: 72)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !498, file: !85, line: 123, baseType: !80, size: 16, offset: 80)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !498, file: !85, line: 123, baseType: !49, size: 8, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !498, file: !85, line: 123, baseType: !49, size: 8, offset: 104)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !498, file: !85, line: 124, baseType: !80, size: 16, offset: 112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !498, file: !85, line: 125, baseType: !65, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !498, file: !85, line: 126, baseType: !21, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !498, file: !85, line: 127, baseType: !484, size: 64, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !498, file: !85, line: 128, baseType: !99, size: 64, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !85, line: 129, baseType: !99, size: 64, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !85, line: 130, baseType: !140, size: 64, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !498, file: !85, line: 131, baseType: !49, size: 8, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !93, file: !85, line: 376, baseType: !515, size: 448)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !85, line: 134, size: 448, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !528}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !515, file: !85, line: 135, baseType: !99, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !515, file: !85, line: 135, baseType: !49, size: 8, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !515, file: !85, line: 135, baseType: !49, size: 8, offset: 72)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !515, file: !85, line: 135, baseType: !80, size: 16, offset: 80)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !515, file: !85, line: 135, baseType: !49, size: 8, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !515, file: !85, line: 135, baseType: !49, size: 8, offset: 104)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !515, file: !85, line: 136, baseType: !140, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !515, file: !85, line: 137, baseType: !99, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !515, file: !85, line: 138, baseType: !99, size: 64, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !515, file: !85, line: 139, baseType: !527, size: 64, offset: 320)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !21)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !515, file: !85, line: 140, baseType: !16, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !93, file: !85, line: 377, baseType: !530, size: 320)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !85, line: 184, size: 320, elements: !531)
!531 = !{!532, !533, !534, !535, !536, !537, !541}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !530, file: !85, line: 185, baseType: !99, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !530, file: !85, line: 185, baseType: !49, size: 8, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !85, line: 185, baseType: !49, size: 8, offset: 72)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !530, file: !85, line: 185, baseType: !80, size: 16, offset: 80)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !85, line: 185, baseType: !49, size: 8, offset: 96)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !530, file: !85, line: 185, baseType: !538, size: 128, offset: 128)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 2)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !530, file: !85, line: 185, baseType: !99, size: 64, offset: 256)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !93, file: !85, line: 378, baseType: !543, size: 384)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !85, line: 187, size: 384, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !543, file: !85, line: 188, baseType: !99, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !543, file: !85, line: 188, baseType: !49, size: 8, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !543, file: !85, line: 188, baseType: !49, size: 8, offset: 72)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !543, file: !85, line: 188, baseType: !80, size: 16, offset: 80)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !543, file: !85, line: 188, baseType: !49, size: 8, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !543, file: !85, line: 189, baseType: !538, size: 128, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !543, file: !85, line: 189, baseType: !99, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !543, file: !85, line: 189, baseType: !553, size: 64, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !142, line: 480, size: 576, elements: !555)
!555 = !{!556, !557, !558, !559, !567, !582, !614, !615, !616, !617, !618, !619}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !554, file: !142, line: 481, baseType: !140, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !554, file: !142, line: 482, baseType: !553, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !142, line: 483, baseType: !553, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !554, file: !142, line: 484, baseType: !560, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !142, line: 497, size: 256, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !561, file: !142, line: 498, baseType: !560, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !561, file: !142, line: 499, baseType: !560, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !561, file: !142, line: 500, baseType: !553, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !561, file: !142, line: 501, baseType: !16, size: 32, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !554, file: !142, line: 485, baseType: !568, size: 64, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !142, line: 466, size: 320, elements: !570)
!570 = !{!571, !576, !577, !578, !579, !580, !581}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !569, file: !142, line: 467, baseType: !572, size: 128)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !142, line: 459, size: 128, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !572, file: !142, line: 460, baseType: !49, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !572, file: !142, line: 461, baseType: !21, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !569, file: !142, line: 468, baseType: !572, size: 128, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !569, file: !142, line: 469, baseType: !80, size: 16, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !569, file: !142, line: 470, baseType: !49, size: 8, offset: 272)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !569, file: !142, line: 471, baseType: !49, size: 8, offset: 280)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !569, file: !142, line: 472, baseType: !49, size: 8, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !569, file: !142, line: 473, baseType: !49, size: 8, offset: 296)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !554, file: !142, line: 486, baseType: !583, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !142, line: 448, size: 192, elements: !585)
!585 = !{!586, !609, !610, !611, !612, !613}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !584, file: !142, line: 449, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !142, line: 438, size: 64, elements: !588)
!588 = !{!589, !590, !603}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !587, file: !142, line: 439, baseType: !140, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !587, file: !142, line: 440, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !142, line: 419, size: 256, elements: !593)
!593 = !{!594, !599, !600, !601, !602}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !592, file: !142, line: 420, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!16, !64, !16, !65}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !592, file: !142, line: 421, baseType: !65, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !592, file: !142, line: 422, baseType: !140, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !592, file: !142, line: 423, baseType: !49, size: 8, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !592, file: !142, line: 424, baseType: !49, size: 8, offset: 200)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !587, file: !142, line: 441, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !142, line: 429, size: 128, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !605, file: !142, line: 430, baseType: !140, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !605, file: !142, line: 431, baseType: !604, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !584, file: !142, line: 450, baseType: !568, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !142, line: 451, baseType: !49, size: 8, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !584, file: !142, line: 452, baseType: !49, size: 8, offset: 136)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !584, file: !142, line: 453, baseType: !49, size: 8, offset: 144)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !584, file: !142, line: 454, baseType: !49, size: 8, offset: 152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !554, file: !142, line: 487, baseType: !21, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !554, file: !142, line: 488, baseType: !16, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !554, file: !142, line: 489, baseType: !80, size: 16, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !554, file: !142, line: 490, baseType: !80, size: 16, offset: 496)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !554, file: !142, line: 491, baseType: !49, size: 8, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !554, file: !142, line: 492, baseType: !49, size: 8, offset: 520)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !93, file: !85, line: 379, baseType: !621, size: 384)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !85, line: 192, size: 384, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !621, file: !85, line: 193, baseType: !99, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !621, file: !85, line: 193, baseType: !49, size: 8, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !621, file: !85, line: 193, baseType: !49, size: 8, offset: 72)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !621, file: !85, line: 193, baseType: !80, size: 16, offset: 80)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !621, file: !85, line: 193, baseType: !49, size: 8, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !621, file: !85, line: 193, baseType: !538, size: 128, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !621, file: !85, line: 193, baseType: !99, size: 64, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !621, file: !85, line: 193, baseType: !16, size: 32, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !621, file: !85, line: 194, baseType: !16, size: 32, offset: 352)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !93, file: !85, line: 380, baseType: !633, size: 384)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !85, line: 197, size: 384, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !633, file: !85, line: 198, baseType: !99, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !633, file: !85, line: 198, baseType: !49, size: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !633, file: !85, line: 198, baseType: !49, size: 8, offset: 72)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !633, file: !85, line: 198, baseType: !80, size: 16, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !85, line: 198, baseType: !49, size: 8, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !633, file: !85, line: 200, baseType: !49, size: 8, offset: 104)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !633, file: !85, line: 201, baseType: !49, size: 8, offset: 112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !633, file: !85, line: 202, baseType: !538, size: 128, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !633, file: !85, line: 202, baseType: !99, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !633, file: !85, line: 202, baseType: !72, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !93, file: !85, line: 381, baseType: !646, size: 320)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !85, line: 205, size: 320, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !646, file: !85, line: 206, baseType: !99, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !646, file: !85, line: 206, baseType: !49, size: 8, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !646, file: !85, line: 206, baseType: !49, size: 8, offset: 72)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !646, file: !85, line: 206, baseType: !80, size: 16, offset: 80)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !646, file: !85, line: 206, baseType: !49, size: 8, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !646, file: !85, line: 206, baseType: !538, size: 128, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !646, file: !85, line: 206, baseType: !99, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !93, file: !85, line: 382, baseType: !656, size: 384)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !85, line: 233, size: 384, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !656, file: !85, line: 234, baseType: !99, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 72)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !656, file: !85, line: 234, baseType: !80, size: 16, offset: 80)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 104)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 120)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !656, file: !85, line: 234, baseType: !140, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !656, file: !85, line: 234, baseType: !16, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !656, file: !85, line: 234, baseType: !16, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !85, line: 234, baseType: !16, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !656, file: !85, line: 234, baseType: !49, size: 8, offset: 296)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !656, file: !85, line: 234, baseType: !99, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !93, file: !85, line: 383, baseType: !674, size: 576)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !85, line: 237, size: 576, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !674, file: !85, line: 238, baseType: !99, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 72)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !674, file: !85, line: 238, baseType: !80, size: 16, offset: 80)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 104)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 112)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 120)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !674, file: !85, line: 238, baseType: !140, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !674, file: !85, line: 238, baseType: !16, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !674, file: !85, line: 238, baseType: !16, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !674, file: !85, line: 238, baseType: !16, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 288)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !674, file: !85, line: 238, baseType: !49, size: 8, offset: 296)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !674, file: !85, line: 238, baseType: !80, size: 16, offset: 304)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !674, file: !85, line: 239, baseType: !99, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !674, file: !85, line: 240, baseType: !48, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !674, file: !85, line: 241, baseType: !80, size: 16, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !674, file: !85, line: 242, baseType: !48, size: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !93, file: !85, line: 384, baseType: !696, size: 384)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !85, line: 262, size: 384, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !696, file: !85, line: 263, baseType: !99, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 72)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !696, file: !85, line: 263, baseType: !80, size: 16, offset: 80)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 104)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !85, line: 263, baseType: !140, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !696, file: !85, line: 263, baseType: !16, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !696, file: !85, line: 263, baseType: !16, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !696, file: !85, line: 263, baseType: !16, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 296)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !696, file: !85, line: 263, baseType: !49, size: 8, offset: 304)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !696, file: !85, line: 264, baseType: !99, size: 64, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !93, file: !85, line: 385, baseType: !715, size: 448)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !85, line: 245, size: 448, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !715, file: !85, line: 246, baseType: !99, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !715, file: !85, line: 246, baseType: !80, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 104)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 120)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !85, line: 246, baseType: !140, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !715, file: !85, line: 246, baseType: !16, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !715, file: !85, line: 246, baseType: !16, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !85, line: 246, baseType: !16, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !715, file: !85, line: 246, baseType: !49, size: 8, offset: 296)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !715, file: !85, line: 246, baseType: !99, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !715, file: !85, line: 247, baseType: !99, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !93, file: !85, line: 386, baseType: !734, size: 448)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !85, line: 250, size: 448, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !734, file: !85, line: 251, baseType: !99, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 72)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !734, file: !85, line: 251, baseType: !80, size: 16, offset: 80)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 104)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 120)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !734, file: !85, line: 251, baseType: !140, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !734, file: !85, line: 251, baseType: !16, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !734, file: !85, line: 251, baseType: !16, size: 32, offset: 224)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !734, file: !85, line: 251, baseType: !16, size: 32, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 288)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !734, file: !85, line: 251, baseType: !49, size: 8, offset: 296)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !734, file: !85, line: 256, baseType: !99, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !734, file: !85, line: 257, baseType: !99, size: 64, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !93, file: !85, line: 387, baseType: !753, size: 512)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !85, line: 273, size: 512, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !753, file: !85, line: 274, baseType: !99, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !753, file: !85, line: 274, baseType: !49, size: 8, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !85, line: 274, baseType: !49, size: 8, offset: 72)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !753, file: !85, line: 274, baseType: !80, size: 16, offset: 80)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !753, file: !85, line: 274, baseType: !49, size: 8, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !753, file: !85, line: 274, baseType: !140, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !753, file: !85, line: 275, baseType: !16, size: 32, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !753, file: !85, line: 276, baseType: !432, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !753, file: !85, line: 277, baseType: !65, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !753, file: !85, line: 278, baseType: !538, size: 128, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !93, file: !85, line: 388, baseType: !766, size: 512)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !85, line: 281, size: 512, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !781, !782, !783, !789, !790}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !766, file: !85, line: 282, baseType: !99, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !766, file: !85, line: 282, baseType: !49, size: 8, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !766, file: !85, line: 282, baseType: !49, size: 8, offset: 72)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !766, file: !85, line: 282, baseType: !80, size: 16, offset: 80)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !766, file: !85, line: 282, baseType: !49, size: 8, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !766, file: !85, line: 282, baseType: !49, size: 8, offset: 104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !766, file: !85, line: 283, baseType: !49, size: 8, offset: 112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !766, file: !85, line: 284, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!14, !16, !527, !16, !780, !65, !65}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !766, file: !85, line: 285, baseType: !140, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !766, file: !85, line: 286, baseType: !65, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !766, file: !85, line: 287, baseType: !784, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{!14, !64, !16, !65, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !766, file: !85, line: 288, baseType: !99, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !85, line: 289, baseType: !99, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !93, file: !85, line: 389, baseType: !792, size: 512)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !85, line: 307, size: 512, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !792, file: !85, line: 308, baseType: !99, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !792, file: !85, line: 308, baseType: !49, size: 8, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !85, line: 308, baseType: !49, size: 8, offset: 72)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !792, file: !85, line: 308, baseType: !80, size: 16, offset: 80)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !792, file: !85, line: 308, baseType: !49, size: 8, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !792, file: !85, line: 308, baseType: !49, size: 8, offset: 104)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !792, file: !85, line: 309, baseType: !49, size: 8, offset: 112)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !792, file: !85, line: 310, baseType: !49, size: 8, offset: 120)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !792, file: !85, line: 311, baseType: !65, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !792, file: !85, line: 312, baseType: !140, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !792, file: !85, line: 313, baseType: !172, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !792, file: !85, line: 314, baseType: !48, size: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !792, file: !85, line: 315, baseType: !48, size: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !792, file: !85, line: 316, baseType: !16, size: 32, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !93, file: !85, line: 390, baseType: !809, size: 448)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !85, line: 340, size: 448, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !809, file: !85, line: 341, baseType: !99, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !809, file: !85, line: 341, baseType: !49, size: 8, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !809, file: !85, line: 341, baseType: !49, size: 8, offset: 72)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !809, file: !85, line: 341, baseType: !80, size: 16, offset: 80)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !809, file: !85, line: 341, baseType: !49, size: 8, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !809, file: !85, line: 341, baseType: !140, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !809, file: !85, line: 342, baseType: !140, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !809, file: !85, line: 343, baseType: !65, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !809, file: !85, line: 344, baseType: !48, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !809, file: !85, line: 345, baseType: !16, size: 32, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !85, line: 391, baseType: !822, size: 256)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !85, line: 350, size: 256, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !834}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !822, file: !85, line: 351, baseType: !99, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !822, file: !85, line: 351, baseType: !49, size: 8, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !822, file: !85, line: 351, baseType: !49, size: 8, offset: 72)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !822, file: !85, line: 351, baseType: !80, size: 16, offset: 80)
