; ModuleID = '../bcout/drivers/acpi/acpica/nsxfname.llvm.bc'
source_filename = "drivers/acpi/acpica/nsxfname.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 20, type: !69, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !68, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/nsxfname.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !12}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !13, line: 305, baseType: !7, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!19 = !{!20, !26, !29, !31, !32, !36, !38, !60, !61, !22, !64, !65, !67}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !21, line: 421, baseType: !22)
!21 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !23, line: 21, baseType: !24)
!23 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !25, line: 27, baseType: !7)
!25 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !23, line: 17, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !25, line: 21, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !21, line: 424, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !21, line: 127, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !23, line: 23, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !25, line: 31, baseType: !35)
!35 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !40, line: 68, size: 288, elements: !41)
!40 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!41 = !{!42, !46, !47, !48, !49, !53, !57, !58, !59}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !39, file: !40, line: 69, baseType: !43, size: 32)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 4)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !39, file: !40, line: 70, baseType: !22, size: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !39, file: !40, line: 71, baseType: !26, size: 8, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !39, file: !40, line: 72, baseType: !26, size: 8, offset: 72)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !39, file: !40, line: 73, baseType: !50, size: 48, offset: 80)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 48, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 6)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !39, file: !40, line: 74, baseType: !54, size: 64, offset: 128)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !39, file: !40, line: 75, baseType: !22, size: 32, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !39, file: !40, line: 76, baseType: !43, size: 32, offset: 224)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !39, file: !40, line: 77, baseType: !22, size: 32, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !23, line: 19, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !25, line: 24, baseType: !63)
!63 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !66, line: 148, baseType: !7)
!66 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!67 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!68 = !{!0}
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 72, elements: !71)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!71 = !{!72}
!72 = !DISubrange(count: 9)
!73 = !{!"rsp"}
!74 = !{i32 7, !"Dwarf Version", i32 4}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{i32 1, !"wchar_size", i32 2}
!77 = !{i32 1, !"Code Model", i32 2}
!78 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!79 = distinct !DISubprogram(name: "acpi_get_handle", scope: !3, file: !3, line: 46, type: !80, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !83)
!80 = !DISubroutineType(types: !81)
!81 = !{!20, !30, !82, !29}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_string", file: !21, line: 423, baseType: !36)
!83 = !{}
!84 = !DILocalVariable(name: "parent", arg: 1, scope: !79, file: !3, line: 46, type: !30)
!85 = !DILocation(line: 46, column: 29, scope: !79)
!86 = !DILocalVariable(name: "pathname", arg: 2, scope: !79, file: !3, line: 47, type: !82)
!87 = !DILocation(line: 47, column: 15, scope: !79)
!88 = !DILocalVariable(name: "ret_handle", arg: 3, scope: !79, file: !3, line: 47, type: !29)
!89 = !DILocation(line: 47, column: 38, scope: !79)
!90 = !DILocalVariable(name: "status", scope: !79, file: !3, line: 49, type: !20)
!91 = !DILocation(line: 49, column: 14, scope: !79)
!92 = !DILocalVariable(name: "node", scope: !79, file: !3, line: 50, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !95)
!95 = !{!96, !826, !827, !828, !829, !834, !835, !836, !837}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !94, file: !6, line: 134, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !99, line: 367, size: 576, elements: !100)
!99 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!100 = !{!101, !109, !122, !132, !145, !159, !168, !477, !494, !509, !522, !600, !612, !626, !636, !654, !676, !695, !714, !733, !746, !772, !789, !802, !816, !825}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !98, file: !99, line: 368, baseType: !102, size: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !99, line: 73, size: 128, elements: !103)
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !102, file: !99, line: 74, baseType: !97, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !102, file: !99, line: 74, baseType: !26, size: 8, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !99, line: 74, baseType: !26, size: 8, offset: 72)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !102, file: !99, line: 74, baseType: !61, size: 16, offset: 80)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !102, file: !99, line: 74, baseType: !26, size: 8, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !98, file: !99, line: 369, baseType: !110, size: 192)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !99, line: 76, size: 192, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !110, file: !99, line: 77, baseType: !97, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !110, file: !99, line: 77, baseType: !26, size: 8, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !99, line: 77, baseType: !26, size: 8, offset: 72)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !110, file: !99, line: 77, baseType: !61, size: 16, offset: 80)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !99, line: 77, baseType: !26, size: 8, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !110, file: !99, line: 77, baseType: !118, size: 24, offset: 104)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 24, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !110, file: !99, line: 78, baseType: !33, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !98, file: !99, line: 370, baseType: !123, size: 256)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !99, line: 93, size: 256, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !123, file: !99, line: 94, baseType: !97, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !123, file: !99, line: 94, baseType: !26, size: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !99, line: 94, baseType: !26, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !123, file: !99, line: 94, baseType: !61, size: 16, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !99, line: 94, baseType: !26, size: 8, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !99, line: 94, baseType: !36, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !123, file: !99, line: 94, baseType: !22, size: 32, offset: 192)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !98, file: !99, line: 371, baseType: !133, size: 384)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !99, line: 97, size: 384, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140, !141, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !133, file: !99, line: 98, baseType: !97, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !133, file: !99, line: 98, baseType: !26, size: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !99, line: 98, baseType: !26, size: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !133, file: !99, line: 98, baseType: !61, size: 16, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !99, line: 98, baseType: !26, size: 8, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !133, file: !99, line: 98, baseType: !64, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !133, file: !99, line: 98, baseType: !22, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !133, file: !99, line: 99, baseType: !22, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !133, file: !99, line: 100, baseType: !64, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !133, file: !99, line: 101, baseType: !93, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !98, file: !99, line: 372, baseType: !146, size: 384)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !99, line: 104, size: 384, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !156, !157, !158}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !146, file: !99, line: 105, baseType: !97, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !146, file: !99, line: 105, baseType: !26, size: 8, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !146, file: !99, line: 105, baseType: !26, size: 8, offset: 72)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !146, file: !99, line: 105, baseType: !61, size: 16, offset: 80)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !146, file: !99, line: 105, baseType: !26, size: 8, offset: 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !146, file: !99, line: 105, baseType: !93, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !146, file: !99, line: 106, baseType: !155, size: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !146, file: !99, line: 107, baseType: !64, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !146, file: !99, line: 108, baseType: !22, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !146, file: !99, line: 109, baseType: !22, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !98, file: !99, line: 373, baseType: !160, size: 192)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !99, line: 118, size: 192, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !160, file: !99, line: 119, baseType: !97, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !160, file: !99, line: 119, baseType: !26, size: 8, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !99, line: 119, baseType: !26, size: 8, offset: 72)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !160, file: !99, line: 119, baseType: !61, size: 16, offset: 80)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !160, file: !99, line: 119, baseType: !26, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !160, file: !99, line: 119, baseType: !31, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !98, file: !99, line: 374, baseType: !169, size: 448)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !99, line: 143, size: 448, elements: !170)
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !474, !475, !476}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !169, file: !99, line: 144, baseType: !97, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !169, file: !99, line: 144, baseType: !26, size: 8, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !169, file: !99, line: 144, baseType: !26, size: 8, offset: 72)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !169, file: !99, line: 144, baseType: !61, size: 16, offset: 80)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !169, file: !99, line: 144, baseType: !26, size: 8, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !169, file: !99, line: 144, baseType: !26, size: 8, offset: 104)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !169, file: !99, line: 145, baseType: !26, size: 8, offset: 112)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !169, file: !99, line: 146, baseType: !26, size: 8, offset: 120)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !169, file: !99, line: 147, baseType: !97, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !169, file: !99, line: 148, baseType: !97, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !169, file: !99, line: 149, baseType: !64, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !169, file: !99, line: 153, baseType: !183, size: 64, offset: 320)
!183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !99, line: 150, size: 64, elements: !184)
!184 = !{!185, !473}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !183, file: !99, line: 151, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!20, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !192, line: 37, size: 9024, elements: !193)
!192 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !421, !422, !423, !424, !425, !429, !431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !456, !457, !458, !459, !460, !461, !462, !463, !465, !471}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !192, line: 38, baseType: !190, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !191, file: !192, line: 39, baseType: !26, size: 8, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !191, file: !192, line: 40, baseType: !26, size: 8, offset: 72)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !191, file: !192, line: 41, baseType: !61, size: 16, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !191, file: !192, line: 42, baseType: !26, size: 8, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !191, file: !192, line: 43, baseType: !26, size: 8, offset: 104)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !191, file: !192, line: 44, baseType: !26, size: 8, offset: 112)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !191, file: !192, line: 45, baseType: !202, size: 16, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !21, line: 445, baseType: !61)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !191, file: !192, line: 46, baseType: !26, size: 8, offset: 144)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !191, file: !192, line: 47, baseType: !26, size: 8, offset: 152)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !191, file: !192, line: 48, baseType: !26, size: 8, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !191, file: !192, line: 49, baseType: !26, size: 8, offset: 168)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !191, file: !192, line: 50, baseType: !26, size: 8, offset: 176)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !191, file: !192, line: 51, baseType: !26, size: 8, offset: 184)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !191, file: !192, line: 52, baseType: !26, size: 8, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !191, file: !192, line: 53, baseType: !26, size: 8, offset: 200)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !191, file: !192, line: 54, baseType: !64, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !191, file: !192, line: 55, baseType: !22, size: 32, offset: 320)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !191, file: !192, line: 56, baseType: !22, size: 32, offset: 352)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !191, file: !192, line: 57, baseType: !22, size: 32, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !191, file: !192, line: 58, baseType: !22, size: 32, offset: 416)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !191, file: !192, line: 60, baseType: !217, size: 640, offset: 448)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !305, !306, !419, !420}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !217, file: !6, line: 894, baseType: !64, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !217, file: !6, line: 895, baseType: !64, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !217, file: !6, line: 896, baseType: !64, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !217, file: !6, line: 897, baseType: !64, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !217, file: !6, line: 898, baseType: !64, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !217, file: !6, line: 899, baseType: !225, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !227)
!227 = !{!228, !248, !264}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !226, file: !6, line: 876, baseType: !229, size: 448)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !229, file: !6, line: 829, baseType: !225, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !229, file: !6, line: 829, baseType: !26, size: 8, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !229, file: !6, line: 829, baseType: !26, size: 8, offset: 72)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !229, file: !6, line: 829, baseType: !61, size: 16, offset: 80)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !229, file: !6, line: 829, baseType: !64, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !229, file: !6, line: 829, baseType: !225, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !229, file: !6, line: 829, baseType: !93, size: 64, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !229, file: !6, line: 829, baseType: !239, size: 64, offset: 320)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !239, file: !6, line: 717, baseType: !33, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !239, file: !6, line: 718, baseType: !22, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !239, file: !6, line: 719, baseType: !36, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !6, line: 720, baseType: !64, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !6, line: 721, baseType: !36, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !239, file: !6, line: 722, baseType: !225, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !229, file: !6, line: 829, baseType: !26, size: 8, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !226, file: !6, line: 877, baseType: !249, size: 640)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !249, file: !6, line: 836, baseType: !225, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !249, file: !6, line: 836, baseType: !26, size: 8, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !249, file: !6, line: 836, baseType: !26, size: 8, offset: 72)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !249, file: !6, line: 836, baseType: !61, size: 16, offset: 80)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !249, file: !6, line: 836, baseType: !64, size: 64, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !6, line: 836, baseType: !225, size: 64, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !249, file: !6, line: 836, baseType: !93, size: 64, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !249, file: !6, line: 836, baseType: !239, size: 64, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !249, file: !6, line: 836, baseType: !26, size: 8, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !249, file: !6, line: 836, baseType: !36, size: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !249, file: !6, line: 837, baseType: !64, size: 64, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !249, file: !6, line: 838, baseType: !22, size: 32, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !6, line: 839, baseType: !22, size: 32, offset: 608)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !226, file: !6, line: 878, baseType: !265, size: 1600)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !265, file: !6, line: 847, baseType: !225, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !265, file: !6, line: 847, baseType: !26, size: 8, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !6, line: 847, baseType: !26, size: 8, offset: 72)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !265, file: !6, line: 847, baseType: !61, size: 16, offset: 80)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !265, file: !6, line: 847, baseType: !64, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !265, file: !6, line: 847, baseType: !225, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !265, file: !6, line: 847, baseType: !93, size: 64, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !265, file: !6, line: 847, baseType: !239, size: 64, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !265, file: !6, line: 847, baseType: !26, size: 8, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !265, file: !6, line: 847, baseType: !225, size: 64, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !265, file: !6, line: 848, baseType: !225, size: 64, offset: 512)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !265, file: !6, line: 849, baseType: !36, size: 64, offset: 576)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !265, file: !6, line: 850, baseType: !26, size: 8, offset: 640)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !265, file: !6, line: 851, baseType: !36, size: 64, offset: 704)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !265, file: !6, line: 852, baseType: !36, size: 64, offset: 768)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !265, file: !6, line: 853, baseType: !36, size: 64, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !265, file: !6, line: 854, baseType: !43, size: 32, offset: 896)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !265, file: !6, line: 855, baseType: !22, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !265, file: !6, line: 856, baseType: !22, size: 32, offset: 960)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !265, file: !6, line: 857, baseType: !22, size: 32, offset: 992)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !265, file: !6, line: 858, baseType: !22, size: 32, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !265, file: !6, line: 859, baseType: !22, size: 32, offset: 1056)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !265, file: !6, line: 860, baseType: !22, size: 32, offset: 1088)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !265, file: !6, line: 861, baseType: !22, size: 32, offset: 1120)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !265, file: !6, line: 862, baseType: !22, size: 32, offset: 1152)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !265, file: !6, line: 863, baseType: !22, size: 32, offset: 1184)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !265, file: !6, line: 864, baseType: !22, size: 32, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !265, file: !6, line: 865, baseType: !22, size: 32, offset: 1248)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !265, file: !6, line: 866, baseType: !22, size: 32, offset: 1280)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !265, file: !6, line: 867, baseType: !22, size: 32, offset: 1312)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !265, file: !6, line: 868, baseType: !61, size: 16, offset: 1344)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !265, file: !6, line: 869, baseType: !26, size: 8, offset: 1360)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !265, file: !6, line: 870, baseType: !26, size: 8, offset: 1368)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !265, file: !6, line: 871, baseType: !26, size: 8, offset: 1376)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !265, file: !6, line: 872, baseType: !302, size: 160, offset: 1384)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 160, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 20)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !217, file: !6, line: 900, baseType: !93, size: 64, offset: 384)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !217, file: !6, line: 901, baseType: !307, size: 64, offset: 448)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !309)
!309 = !{!310, !318, !331, !340, !349, !362, !376, !388, !398}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !308, file: !6, line: 664, baseType: !311, size: 128)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !6, line: 568, baseType: !31, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !311, file: !6, line: 568, baseType: !26, size: 8, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !311, file: !6, line: 568, baseType: !26, size: 8, offset: 72)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !311, file: !6, line: 568, baseType: !61, size: 16, offset: 80)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !311, file: !6, line: 568, baseType: !61, size: 16, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !308, file: !6, line: 665, baseType: !319, size: 384)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !6, line: 594, baseType: !31, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !319, file: !6, line: 594, baseType: !26, size: 8, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !6, line: 594, baseType: !26, size: 8, offset: 72)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !319, file: !6, line: 594, baseType: !61, size: 16, offset: 80)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !319, file: !6, line: 594, baseType: !61, size: 16, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !319, file: !6, line: 594, baseType: !61, size: 16, offset: 112)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !319, file: !6, line: 595, baseType: !225, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !319, file: !6, line: 596, baseType: !64, size: 64, offset: 192)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !319, file: !6, line: 597, baseType: !64, size: 64, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !319, file: !6, line: 598, baseType: !33, size: 64, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !308, file: !6, line: 666, baseType: !332, size: 192)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !6, line: 574, baseType: !31, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !332, file: !6, line: 574, baseType: !26, size: 8, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !332, file: !6, line: 574, baseType: !26, size: 8, offset: 72)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !6, line: 574, baseType: !61, size: 16, offset: 80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !332, file: !6, line: 574, baseType: !61, size: 16, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !332, file: !6, line: 574, baseType: !97, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !308, file: !6, line: 667, baseType: !341, size: 192)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !6, line: 605, baseType: !31, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !341, file: !6, line: 605, baseType: !26, size: 8, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !341, file: !6, line: 605, baseType: !26, size: 8, offset: 72)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !341, file: !6, line: 605, baseType: !61, size: 16, offset: 80)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !341, file: !6, line: 605, baseType: !61, size: 16, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !341, file: !6, line: 605, baseType: !93, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !308, file: !6, line: 668, baseType: !350, size: 448)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !6, line: 609, baseType: !31, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !350, file: !6, line: 609, baseType: !26, size: 8, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !350, file: !6, line: 609, baseType: !26, size: 8, offset: 72)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !6, line: 609, baseType: !61, size: 16, offset: 80)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !350, file: !6, line: 609, baseType: !61, size: 16, offset: 96)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !350, file: !6, line: 609, baseType: !22, size: 32, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !350, file: !6, line: 610, baseType: !225, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !350, file: !6, line: 611, baseType: !64, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !350, file: !6, line: 612, baseType: !64, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !350, file: !6, line: 613, baseType: !22, size: 32, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !308, file: !6, line: 669, baseType: !363, size: 512)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !6, line: 581, baseType: !31, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !363, file: !6, line: 581, baseType: !26, size: 8, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !363, file: !6, line: 581, baseType: !26, size: 8, offset: 72)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !363, file: !6, line: 581, baseType: !61, size: 16, offset: 80)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !363, file: !6, line: 581, baseType: !61, size: 16, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !363, file: !6, line: 581, baseType: !22, size: 32, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !363, file: !6, line: 582, baseType: !97, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !363, file: !6, line: 583, baseType: !97, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !363, file: !6, line: 584, baseType: !190, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !363, file: !6, line: 585, baseType: !31, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !363, file: !6, line: 586, baseType: !22, size: 32, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !308, file: !6, line: 670, baseType: !377, size: 320)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !6, line: 621, baseType: !31, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !377, file: !6, line: 621, baseType: !26, size: 8, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !377, file: !6, line: 621, baseType: !26, size: 8, offset: 72)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !377, file: !6, line: 621, baseType: !61, size: 16, offset: 80)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !377, file: !6, line: 621, baseType: !61, size: 16, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !377, file: !6, line: 621, baseType: !26, size: 8, offset: 112)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !377, file: !6, line: 622, baseType: !190, size: 64, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !377, file: !6, line: 623, baseType: !97, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !377, file: !6, line: 624, baseType: !33, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !308, file: !6, line: 671, baseType: !389, size: 640)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !6, line: 632, baseType: !31, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !389, file: !6, line: 632, baseType: !26, size: 8, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !389, file: !6, line: 632, baseType: !26, size: 8, offset: 72)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !389, file: !6, line: 632, baseType: !61, size: 16, offset: 80)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !389, file: !6, line: 632, baseType: !61, size: 16, offset: 96)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !389, file: !6, line: 633, baseType: !397, size: 512, offset: 128)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 512, elements: !55)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !308, file: !6, line: 672, baseType: !399, size: 320)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !407, !408, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !399, file: !6, line: 655, baseType: !31, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !399, file: !6, line: 655, baseType: !26, size: 8, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !6, line: 655, baseType: !26, size: 8, offset: 72)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !399, file: !6, line: 655, baseType: !61, size: 16, offset: 80)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !399, file: !6, line: 655, baseType: !61, size: 16, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !399, file: !6, line: 655, baseType: !26, size: 8, offset: 112)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !399, file: !6, line: 656, baseType: !93, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !399, file: !6, line: 657, baseType: !97, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !399, file: !6, line: 658, baseType: !410, size: 64, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !412)
!412 = !{!413, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !411, file: !6, line: 646, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !21, line: 1052, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !30, !22, !31}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !411, file: !6, line: 647, baseType: !31, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !217, file: !6, line: 902, baseType: !225, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !217, file: !6, line: 903, baseType: !22, size: 32, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !191, file: !192, line: 61, baseType: !22, size: 32, offset: 1088)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !191, file: !192, line: 62, baseType: !22, size: 32, offset: 1120)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !191, file: !192, line: 63, baseType: !61, size: 16, offset: 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !191, file: !192, line: 64, baseType: !26, size: 8, offset: 1168)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !191, file: !192, line: 66, baseType: !426, size: 2688, offset: 1216)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2688, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 7)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !191, file: !192, line: 67, baseType: !430, size: 3072, offset: 3904)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 3072, elements: !55)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !191, file: !192, line: 68, baseType: !432, size: 576, offset: 6976)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 576, elements: !71)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !191, file: !192, line: 69, baseType: !155, size: 64, offset: 7552)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !191, file: !192, line: 71, baseType: !64, size: 64, offset: 7616)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !191, file: !192, line: 72, baseType: !155, size: 64, offset: 7680)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !191, file: !192, line: 73, baseType: !307, size: 64, offset: 7744)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !191, file: !192, line: 74, baseType: !93, size: 64, offset: 7808)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !191, file: !192, line: 75, baseType: !97, size: 64, offset: 7872)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !191, file: !192, line: 76, baseType: !93, size: 64, offset: 7936)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !191, file: !192, line: 77, baseType: !225, size: 64, offset: 8000)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !191, file: !192, line: 78, baseType: !97, size: 64, offset: 8064)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !191, file: !192, line: 79, baseType: !93, size: 64, offset: 8128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !191, file: !192, line: 80, baseType: !36, size: 64, offset: 8192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !191, file: !192, line: 81, baseType: !225, size: 64, offset: 8256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !191, file: !192, line: 82, baseType: !446, size: 64, offset: 8320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !448, file: !6, line: 706, baseType: !22, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !448, file: !6, line: 707, baseType: !22, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !448, file: !6, line: 708, baseType: !61, size: 16, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !448, file: !6, line: 709, baseType: !26, size: 8, offset: 80)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !448, file: !6, line: 710, baseType: !26, size: 8, offset: 88)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !6, line: 711, baseType: !26, size: 8, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !191, file: !192, line: 83, baseType: !225, size: 64, offset: 8384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !191, file: !192, line: 84, baseType: !97, size: 64, offset: 8448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !191, file: !192, line: 85, baseType: !307, size: 64, offset: 8512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !191, file: !192, line: 86, baseType: !97, size: 64, offset: 8576)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !191, file: !192, line: 87, baseType: !307, size: 64, offset: 8640)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !191, file: !192, line: 88, baseType: !225, size: 64, offset: 8704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !191, file: !192, line: 89, baseType: !225, size: 64, offset: 8768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !191, file: !192, line: 90, baseType: !464, size: 64, offset: 8832)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !191, file: !192, line: 91, baseType: !466, size: 64, offset: 8896)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DISubroutineType(types: !469)
!469 = !{!20, !190, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !191, file: !192, line: 92, baseType: !472, size: 64, offset: 8960)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !187)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !183, file: !99, line: 152, baseType: !97, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !169, file: !99, line: 155, baseType: !22, size: 32, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !169, file: !99, line: 156, baseType: !202, size: 16, offset: 416)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !169, file: !99, line: 157, baseType: !26, size: 8, offset: 432)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !98, file: !99, line: 375, baseType: !478, size: 576)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !99, line: 122, size: 576, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !478, file: !99, line: 123, baseType: !97, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !478, file: !99, line: 123, baseType: !26, size: 8, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !99, line: 123, baseType: !26, size: 8, offset: 72)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !478, file: !99, line: 123, baseType: !61, size: 16, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !99, line: 123, baseType: !26, size: 8, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !478, file: !99, line: 123, baseType: !26, size: 8, offset: 104)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !478, file: !99, line: 124, baseType: !61, size: 16, offset: 112)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !478, file: !99, line: 125, baseType: !31, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !478, file: !99, line: 126, baseType: !33, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !478, file: !99, line: 127, baseType: !464, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !478, file: !99, line: 128, baseType: !97, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !99, line: 129, baseType: !97, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !478, file: !99, line: 130, baseType: !93, size: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !478, file: !99, line: 131, baseType: !26, size: 8, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !98, file: !99, line: 376, baseType: !495, size: 448)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !99, line: 134, size: 448, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !508}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !495, file: !99, line: 135, baseType: !97, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !495, file: !99, line: 135, baseType: !26, size: 8, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !99, line: 135, baseType: !26, size: 8, offset: 72)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !495, file: !99, line: 135, baseType: !61, size: 16, offset: 80)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !99, line: 135, baseType: !26, size: 8, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !495, file: !99, line: 135, baseType: !26, size: 8, offset: 104)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !495, file: !99, line: 136, baseType: !93, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !495, file: !99, line: 137, baseType: !97, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !99, line: 138, baseType: !97, size: 64, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !495, file: !99, line: 139, baseType: !507, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !21, line: 129, baseType: !33)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !495, file: !99, line: 140, baseType: !22, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !98, file: !99, line: 377, baseType: !510, size: 320)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !99, line: 184, size: 320, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !521}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !510, file: !99, line: 185, baseType: !97, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !510, file: !99, line: 185, baseType: !26, size: 8, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !510, file: !99, line: 185, baseType: !26, size: 8, offset: 72)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !510, file: !99, line: 185, baseType: !61, size: 16, offset: 80)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !510, file: !99, line: 185, baseType: !26, size: 8, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !510, file: !99, line: 185, baseType: !518, size: 128, offset: 128)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, elements: !519)
!519 = !{!520}
!520 = !DISubrange(count: 2)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !510, file: !99, line: 185, baseType: !97, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !98, file: !99, line: 378, baseType: !523, size: 384)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !99, line: 187, size: 384, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !523, file: !99, line: 188, baseType: !97, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !523, file: !99, line: 188, baseType: !26, size: 8, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !99, line: 188, baseType: !26, size: 8, offset: 72)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !523, file: !99, line: 188, baseType: !61, size: 16, offset: 80)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !523, file: !99, line: 188, baseType: !26, size: 8, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !523, file: !99, line: 189, baseType: !518, size: 128, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !523, file: !99, line: 189, baseType: !97, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !523, file: !99, line: 189, baseType: !533, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !535)
!535 = !{!536, !537, !538, !539, !547, !562, !594, !595, !596, !597, !598, !599}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !534, file: !6, line: 481, baseType: !93, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !534, file: !6, line: 482, baseType: !533, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !6, line: 483, baseType: !533, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !534, file: !6, line: 484, baseType: !540, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !542)
!542 = !{!543, !544, !545, !546}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !541, file: !6, line: 498, baseType: !540, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !6, line: 499, baseType: !540, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !541, file: !6, line: 500, baseType: !533, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !541, file: !6, line: 501, baseType: !22, size: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !534, file: !6, line: 485, baseType: !548, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !550)
!550 = !{!551, !556, !557, !558, !559, !560, !561}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !549, file: !6, line: 467, baseType: !552, size: 128)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !552, file: !6, line: 460, baseType: !26, size: 8)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !552, file: !6, line: 461, baseType: !33, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !549, file: !6, line: 468, baseType: !552, size: 128, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !549, file: !6, line: 469, baseType: !61, size: 16, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !549, file: !6, line: 470, baseType: !26, size: 8, offset: 272)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !549, file: !6, line: 471, baseType: !26, size: 8, offset: 280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !549, file: !6, line: 472, baseType: !26, size: 8, offset: 288)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !549, file: !6, line: 473, baseType: !26, size: 8, offset: 296)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !534, file: !6, line: 486, baseType: !563, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !565)
!565 = !{!566, !589, !590, !591, !592, !593}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !564, file: !6, line: 449, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !568)
!568 = !{!569, !570, !583}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !567, file: !6, line: 439, baseType: !93, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !567, file: !6, line: 440, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !573)
!573 = !{!574, !579, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !572, file: !6, line: 420, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !21, line: 1049, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!22, !30, !22, !31}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !572, file: !6, line: 421, baseType: !31, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !572, file: !6, line: 422, baseType: !93, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !572, file: !6, line: 423, baseType: !26, size: 8, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !572, file: !6, line: 424, baseType: !26, size: 8, offset: 200)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !567, file: !6, line: 441, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !585, file: !6, line: 430, baseType: !93, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !585, file: !6, line: 431, baseType: !584, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !564, file: !6, line: 450, baseType: !548, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !564, file: !6, line: 451, baseType: !26, size: 8, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !564, file: !6, line: 452, baseType: !26, size: 8, offset: 136)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !564, file: !6, line: 453, baseType: !26, size: 8, offset: 144)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !564, file: !6, line: 454, baseType: !26, size: 8, offset: 152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !534, file: !6, line: 487, baseType: !33, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !534, file: !6, line: 488, baseType: !22, size: 32, offset: 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !534, file: !6, line: 489, baseType: !61, size: 16, offset: 480)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !534, file: !6, line: 490, baseType: !61, size: 16, offset: 496)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !534, file: !6, line: 491, baseType: !26, size: 8, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !534, file: !6, line: 492, baseType: !26, size: 8, offset: 520)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !98, file: !99, line: 379, baseType: !601, size: 384)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !99, line: 192, size: 384, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !601, file: !99, line: 193, baseType: !97, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !601, file: !99, line: 193, baseType: !26, size: 8, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !601, file: !99, line: 193, baseType: !26, size: 8, offset: 72)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !601, file: !99, line: 193, baseType: !61, size: 16, offset: 80)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !601, file: !99, line: 193, baseType: !26, size: 8, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !601, file: !99, line: 193, baseType: !518, size: 128, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !601, file: !99, line: 193, baseType: !97, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !601, file: !99, line: 193, baseType: !22, size: 32, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !601, file: !99, line: 194, baseType: !22, size: 32, offset: 352)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !98, file: !99, line: 380, baseType: !613, size: 384)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !99, line: 197, size: 384, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !613, file: !99, line: 198, baseType: !97, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !613, file: !99, line: 198, baseType: !26, size: 8, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !613, file: !99, line: 198, baseType: !26, size: 8, offset: 72)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !613, file: !99, line: 198, baseType: !61, size: 16, offset: 80)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !613, file: !99, line: 198, baseType: !26, size: 8, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !613, file: !99, line: 200, baseType: !26, size: 8, offset: 104)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !613, file: !99, line: 201, baseType: !26, size: 8, offset: 112)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !613, file: !99, line: 202, baseType: !518, size: 128, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !613, file: !99, line: 202, baseType: !97, size: 64, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !613, file: !99, line: 202, baseType: !625, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !21, line: 128, baseType: !33)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !98, file: !99, line: 381, baseType: !627, size: 320)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !99, line: 205, size: 320, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !627, file: !99, line: 206, baseType: !97, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !627, file: !99, line: 206, baseType: !26, size: 8, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !99, line: 206, baseType: !26, size: 8, offset: 72)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !627, file: !99, line: 206, baseType: !61, size: 16, offset: 80)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !627, file: !99, line: 206, baseType: !26, size: 8, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !627, file: !99, line: 206, baseType: !518, size: 128, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !627, file: !99, line: 206, baseType: !97, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !98, file: !99, line: 382, baseType: !637, size: 384)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !99, line: 233, size: 384, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !637, file: !99, line: 234, baseType: !97, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 72)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !637, file: !99, line: 234, baseType: !61, size: 16, offset: 80)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 104)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 120)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !637, file: !99, line: 234, baseType: !93, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !637, file: !99, line: 234, baseType: !22, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !637, file: !99, line: 234, baseType: !22, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !637, file: !99, line: 234, baseType: !22, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !637, file: !99, line: 234, baseType: !26, size: 8, offset: 296)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !637, file: !99, line: 234, baseType: !97, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !98, file: !99, line: 383, baseType: !655, size: 576)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !99, line: 237, size: 576, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !655, file: !99, line: 238, baseType: !97, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 72)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !655, file: !99, line: 238, baseType: !61, size: 16, offset: 80)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 96)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 104)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 120)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !655, file: !99, line: 238, baseType: !93, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !655, file: !99, line: 238, baseType: !22, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !655, file: !99, line: 238, baseType: !22, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !655, file: !99, line: 238, baseType: !22, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !655, file: !99, line: 238, baseType: !26, size: 8, offset: 296)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !655, file: !99, line: 238, baseType: !61, size: 16, offset: 304)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !655, file: !99, line: 239, baseType: !97, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !655, file: !99, line: 240, baseType: !64, size: 64, offset: 384)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !655, file: !99, line: 241, baseType: !61, size: 16, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !655, file: !99, line: 242, baseType: !64, size: 64, offset: 512)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !98, file: !99, line: 384, baseType: !677, size: 384)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !99, line: 262, size: 384, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !677, file: !99, line: 263, baseType: !97, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 72)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !677, file: !99, line: 263, baseType: !61, size: 16, offset: 80)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 104)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 112)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 120)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !677, file: !99, line: 263, baseType: !93, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !677, file: !99, line: 263, baseType: !22, size: 32, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !677, file: !99, line: 263, baseType: !22, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !677, file: !99, line: 263, baseType: !22, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 296)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !677, file: !99, line: 263, baseType: !26, size: 8, offset: 304)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !677, file: !99, line: 264, baseType: !97, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !98, file: !99, line: 385, baseType: !696, size: 448)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !99, line: 245, size: 448, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !696, file: !99, line: 246, baseType: !97, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 72)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !696, file: !99, line: 246, baseType: !61, size: 16, offset: 80)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 104)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !696, file: !99, line: 246, baseType: !93, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !696, file: !99, line: 246, baseType: !22, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !696, file: !99, line: 246, baseType: !22, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !696, file: !99, line: 246, baseType: !22, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !696, file: !99, line: 246, baseType: !26, size: 8, offset: 296)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !696, file: !99, line: 246, baseType: !97, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !696, file: !99, line: 247, baseType: !97, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !98, file: !99, line: 386, baseType: !715, size: 448)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !99, line: 250, size: 448, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !715, file: !99, line: 251, baseType: !97, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !715, file: !99, line: 251, baseType: !61, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 104)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 120)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !99, line: 251, baseType: !93, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !715, file: !99, line: 251, baseType: !22, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !715, file: !99, line: 251, baseType: !22, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !99, line: 251, baseType: !22, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !715, file: !99, line: 251, baseType: !26, size: 8, offset: 296)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !715, file: !99, line: 256, baseType: !97, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !715, file: !99, line: 257, baseType: !97, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !98, file: !99, line: 387, baseType: !734, size: 512)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !99, line: 273, size: 512, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !734, file: !99, line: 274, baseType: !97, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !734, file: !99, line: 274, baseType: !26, size: 8, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !99, line: 274, baseType: !26, size: 8, offset: 72)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !734, file: !99, line: 274, baseType: !61, size: 16, offset: 80)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !734, file: !99, line: 274, baseType: !26, size: 8, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !734, file: !99, line: 274, baseType: !93, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !734, file: !99, line: 275, baseType: !22, size: 32, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !734, file: !99, line: 276, baseType: !414, size: 64, offset: 256)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !734, file: !99, line: 277, baseType: !31, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !734, file: !99, line: 278, baseType: !518, size: 128, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !98, file: !99, line: 388, baseType: !747, size: 512)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !99, line: 281, size: 512, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !762, !763, !764, !770, !771}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !747, file: !99, line: 282, baseType: !97, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !747, file: !99, line: 282, baseType: !26, size: 8, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !747, file: !99, line: 282, baseType: !26, size: 8, offset: 72)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !747, file: !99, line: 282, baseType: !61, size: 16, offset: 80)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !747, file: !99, line: 282, baseType: !26, size: 8, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !747, file: !99, line: 282, baseType: !26, size: 8, offset: 104)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !747, file: !99, line: 283, baseType: !26, size: 8, offset: 112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !747, file: !99, line: 284, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !21, line: 1084, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!20, !22, !507, !22, !761, !31, !31}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !747, file: !99, line: 285, baseType: !93, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !747, file: !99, line: 286, baseType: !31, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !747, file: !99, line: 287, baseType: !765, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !21, line: 1102, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!20, !30, !22, !31, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !747, file: !99, line: 288, baseType: !97, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !747, file: !99, line: 289, baseType: !97, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !98, file: !99, line: 389, baseType: !773, size: 512)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !99, line: 307, size: 512, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !773, file: !99, line: 308, baseType: !97, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !773, file: !99, line: 308, baseType: !26, size: 8, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !773, file: !99, line: 308, baseType: !26, size: 8, offset: 72)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !773, file: !99, line: 308, baseType: !61, size: 16, offset: 80)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !99, line: 308, baseType: !26, size: 8, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !773, file: !99, line: 308, baseType: !26, size: 8, offset: 104)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !773, file: !99, line: 309, baseType: !26, size: 8, offset: 112)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !773, file: !99, line: 310, baseType: !26, size: 8, offset: 120)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !773, file: !99, line: 311, baseType: !31, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !773, file: !99, line: 312, baseType: !93, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !773, file: !99, line: 313, baseType: !155, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !773, file: !99, line: 314, baseType: !64, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !773, file: !99, line: 315, baseType: !64, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !773, file: !99, line: 316, baseType: !22, size: 32, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !98, file: !99, line: 390, baseType: !790, size: 448)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !99, line: 340, size: 448, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !790, file: !99, line: 341, baseType: !97, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !790, file: !99, line: 341, baseType: !26, size: 8, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !790, file: !99, line: 341, baseType: !26, size: 8, offset: 72)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !790, file: !99, line: 341, baseType: !61, size: 16, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !99, line: 341, baseType: !26, size: 8, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !790, file: !99, line: 341, baseType: !93, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !790, file: !99, line: 342, baseType: !93, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !790, file: !99, line: 343, baseType: !31, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !790, file: !99, line: 344, baseType: !64, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !790, file: !99, line: 345, baseType: !22, size: 32, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !99, line: 391, baseType: !803, size: 256)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !99, line: 350, size: 256, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !815}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !803, file: !99, line: 351, baseType: !97, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !803, file: !99, line: 351, baseType: !26, size: 8, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !803, file: !99, line: 351, baseType: !26, size: 8, offset: 72)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !803, file: !99, line: 351, baseType: !61, size: 16, offset: 80)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !99, line: 351, baseType: !26, size: 8, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !803, file: !99, line: 351, baseType: !811, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !21, line: 1055, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !30, !31}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !803, file: !99, line: 352, baseType: !31, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !98, file: !99, line: 392, baseType: !817, size: 192)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !99, line: 357, size: 192, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !817, file: !99, line: 358, baseType: !97, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !817, file: !99, line: 358, baseType: !26, size: 8, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !817, file: !99, line: 358, baseType: !26, size: 8, offset: 72)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !817, file: !99, line: 358, baseType: !61, size: 16, offset: 80)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !817, file: !99, line: 358, baseType: !26, size: 8, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !817, file: !99, line: 358, baseType: !97, size: 64, offset: 128)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !98, file: !99, line: 399, baseType: !94, size: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !94, file: !6, line: 135, baseType: !26, size: 8, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !6, line: 136, baseType: !26, size: 8, offset: 72)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !6, line: 137, baseType: !61, size: 16, offset: 80)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !6, line: 138, baseType: !830, size: 32, offset: 96)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !40, line: 327, size: 32, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !830, file: !40, line: 328, baseType: !22, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !830, file: !40, line: 329, baseType: !43, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !94, file: !6, line: 139, baseType: !93, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !94, file: !6, line: 140, baseType: !93, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !94, file: !6, line: 141, baseType: !93, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !94, file: !6, line: 142, baseType: !202, size: 16, offset: 320)
!838 = !DILocation(line: 50, column: 30, scope: !79)
!839 = !DILocalVariable(name: "prefix_node", scope: !79, file: !3, line: 51, type: !93)
!840 = !DILocation(line: 51, column: 30, scope: !79)
!841 = !DILocation(line: 57, column: 7, scope: !842)
!842 = distinct !DILexicalBlock(scope: !79, file: !3, line: 57, column: 6)
!843 = !DILocation(line: 57, column: 18, scope: !842)
!844 = !DILocation(line: 57, column: 22, scope: !842)
!845 = !DILocation(line: 57, column: 6, scope: !79)
!846 = !DILocation(line: 58, column: 3, scope: !847)
!847 = distinct !DILexicalBlock(scope: !842, file: !3, line: 57, column: 32)
!848 = !DILocation(line: 63, column: 6, scope: !849)
!849 = distinct !DILexicalBlock(scope: !79, file: !3, line: 63, column: 6)
!850 = !DILocation(line: 63, column: 6, scope: !79)
!851 = !DILocation(line: 64, column: 41, scope: !852)
!852 = distinct !DILexicalBlock(scope: !849, file: !3, line: 63, column: 14)
!853 = !DILocation(line: 64, column: 17, scope: !852)
!854 = !DILocation(line: 64, column: 15, scope: !852)
!855 = !DILocation(line: 65, column: 8, scope: !856)
!856 = distinct !DILexicalBlock(scope: !852, file: !3, line: 65, column: 7)
