; ModuleID = '../bcout/drivers/acpi/acpica/psargs.llvm.bc'
source_filename = "drivers/acpi/acpica/psargs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_parse_state = type { i8*, i8*, i8*, i8*, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_generic_state*, %union.acpi_parse_object*, i32 }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 19, type: !37, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/psargs.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !{!13, !18, !20, !23, !25, !27, !30, !31, !32, !33, !34, !35}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !14, line: 17, baseType: !15)
!14 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !16, line: 21, baseType: !17)
!16 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !14, line: 19, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !16, line: 24, baseType: !22)
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !24, line: 421, baseType: !25)
!24 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !14, line: 21, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !16, line: 27, baseType: !7)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !14, line: 23, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !16, line: 31, baseType: !29)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !24, line: 127, baseType: !27)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!36 = !{!0}
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 56, elements: !39)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!39 = !{!40}
!40 = !DISubrange(count: 7)
!41 = !{i32 7, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 2}
!44 = !{i32 1, !"Code Model", i32 2}
!45 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!46 = distinct !DISubprogram(name: "acpi_ps_get_next_package_end", scope: !3, file: !3, line: 94, type: !47, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !801)
!47 = !DISubroutineType(types: !48)
!48 = !{!35, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !51)
!51 = !{!52, !53, !54, !55, !56, !57, !797, !798, !799, !800}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !50, file: !6, line: 894, baseType: !35, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !50, file: !6, line: 895, baseType: !35, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !50, file: !6, line: 896, baseType: !35, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !50, file: !6, line: 897, baseType: !35, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !50, file: !6, line: 898, baseType: !35, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !50, file: !6, line: 899, baseType: !58, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !60)
!60 = !{!61, !740, !756}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !59, file: !6, line: 876, baseType: !62, size: 448)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !730, !739}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !62, file: !6, line: 829, baseType: !58, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !62, file: !6, line: 829, baseType: !13, size: 8, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !62, file: !6, line: 829, baseType: !13, size: 8, offset: 72)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !62, file: !6, line: 829, baseType: !20, size: 16, offset: 80)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !62, file: !6, line: 829, baseType: !35, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !62, file: !6, line: 829, baseType: !58, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !62, file: !6, line: 829, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !73)
!73 = !{!74, !714, !715, !716, !717, !726, !727, !728, !729}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !72, file: !6, line: 134, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !77, line: 367, size: 576, elements: !78)
!77 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!78 = !{!79, !87, !100, !110, !123, !137, !146, !366, !383, !398, !411, !489, !501, !515, !525, !543, !565, !584, !603, !622, !635, !660, !677, !690, !704, !713}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !76, file: !77, line: 368, baseType: !80, size: 128)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !77, line: 73, size: 128, elements: !81)
!81 = !{!82, !83, !84, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !80, file: !77, line: 74, baseType: !75, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !80, file: !77, line: 74, baseType: !13, size: 8, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !77, line: 74, baseType: !13, size: 8, offset: 72)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !80, file: !77, line: 74, baseType: !20, size: 16, offset: 80)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !80, file: !77, line: 74, baseType: !13, size: 8, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !76, file: !77, line: 369, baseType: !88, size: 192)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !77, line: 76, size: 192, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !88, file: !77, line: 77, baseType: !75, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !88, file: !77, line: 77, baseType: !13, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !77, line: 77, baseType: !13, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !88, file: !77, line: 77, baseType: !20, size: 16, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !77, line: 77, baseType: !13, size: 8, offset: 96)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !88, file: !77, line: 77, baseType: !96, size: 24, offset: 104)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 24, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !88, file: !77, line: 78, baseType: !27, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !76, file: !77, line: 370, baseType: !101, size: 256)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !77, line: 93, size: 256, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !101, file: !77, line: 94, baseType: !75, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !101, file: !77, line: 94, baseType: !13, size: 8, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !77, line: 94, baseType: !13, size: 8, offset: 72)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !101, file: !77, line: 94, baseType: !20, size: 16, offset: 80)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !101, file: !77, line: 94, baseType: !13, size: 8, offset: 96)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !101, file: !77, line: 94, baseType: !18, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !101, file: !77, line: 94, baseType: !25, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !76, file: !77, line: 371, baseType: !111, size: 384)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !77, line: 97, size: 384, elements: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !111, file: !77, line: 98, baseType: !75, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !111, file: !77, line: 98, baseType: !13, size: 8, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !77, line: 98, baseType: !13, size: 8, offset: 72)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !111, file: !77, line: 98, baseType: !20, size: 16, offset: 80)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !77, line: 98, baseType: !13, size: 8, offset: 96)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !111, file: !77, line: 98, baseType: !35, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !111, file: !77, line: 98, baseType: !25, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !111, file: !77, line: 99, baseType: !25, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !111, file: !77, line: 100, baseType: !35, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !111, file: !77, line: 101, baseType: !71, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !76, file: !77, line: 372, baseType: !124, size: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !77, line: 104, size: 384, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !134, !135, !136}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !124, file: !77, line: 105, baseType: !75, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !124, file: !77, line: 105, baseType: !13, size: 8, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !77, line: 105, baseType: !13, size: 8, offset: 72)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !124, file: !77, line: 105, baseType: !20, size: 16, offset: 80)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !124, file: !77, line: 105, baseType: !13, size: 8, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !124, file: !77, line: 105, baseType: !71, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !124, file: !77, line: 106, baseType: !133, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !124, file: !77, line: 107, baseType: !35, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !124, file: !77, line: 108, baseType: !25, size: 32, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !124, file: !77, line: 109, baseType: !25, size: 32, offset: 352)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !76, file: !77, line: 373, baseType: !138, size: 192)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !77, line: 118, size: 192, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !138, file: !77, line: 119, baseType: !75, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !138, file: !77, line: 119, baseType: !13, size: 8, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !77, line: 119, baseType: !13, size: 8, offset: 72)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !138, file: !77, line: 119, baseType: !20, size: 16, offset: 80)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !138, file: !77, line: 119, baseType: !13, size: 8, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !138, file: !77, line: 119, baseType: !31, size: 64, offset: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !76, file: !77, line: 374, baseType: !147, size: 448)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !77, line: 143, size: 448, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !363, !364, !365}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !147, file: !77, line: 144, baseType: !75, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !147, file: !77, line: 144, baseType: !13, size: 8, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !77, line: 144, baseType: !13, size: 8, offset: 72)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !147, file: !77, line: 144, baseType: !20, size: 16, offset: 80)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !77, line: 144, baseType: !13, size: 8, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !147, file: !77, line: 144, baseType: !13, size: 8, offset: 104)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !147, file: !77, line: 145, baseType: !13, size: 8, offset: 112)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !147, file: !77, line: 146, baseType: !13, size: 8, offset: 120)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !147, file: !77, line: 147, baseType: !75, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !147, file: !77, line: 148, baseType: !75, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !147, file: !77, line: 149, baseType: !35, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !147, file: !77, line: 153, baseType: !161, size: 64, offset: 320)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !77, line: 150, size: 64, elements: !162)
!162 = !{!163, !362}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !161, file: !77, line: 151, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DISubroutineType(types: !167)
!167 = !{!23, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !170, line: 37, size: 9024, elements: !171)
!170 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !201, !205, !209, !210, !211, !212, !326, !327, !328, !329, !330, !331, !332, !333, !334, !345, !346, !347, !348, !349, !350, !351, !352, !354, !360}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !169, file: !170, line: 38, baseType: !168, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !169, file: !170, line: 39, baseType: !13, size: 8, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !169, file: !170, line: 40, baseType: !13, size: 8, offset: 72)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !169, file: !170, line: 41, baseType: !20, size: 16, offset: 80)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !169, file: !170, line: 42, baseType: !13, size: 8, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !169, file: !170, line: 43, baseType: !13, size: 8, offset: 104)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !169, file: !170, line: 44, baseType: !13, size: 8, offset: 112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !169, file: !170, line: 45, baseType: !180, size: 16, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !24, line: 445, baseType: !20)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !169, file: !170, line: 46, baseType: !13, size: 8, offset: 144)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !169, file: !170, line: 47, baseType: !13, size: 8, offset: 152)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !169, file: !170, line: 48, baseType: !13, size: 8, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !169, file: !170, line: 49, baseType: !13, size: 8, offset: 168)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !169, file: !170, line: 50, baseType: !13, size: 8, offset: 176)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !169, file: !170, line: 51, baseType: !13, size: 8, offset: 184)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !169, file: !170, line: 52, baseType: !13, size: 8, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !169, file: !170, line: 53, baseType: !13, size: 8, offset: 200)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !169, file: !170, line: 54, baseType: !35, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !169, file: !170, line: 55, baseType: !25, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !169, file: !170, line: 56, baseType: !25, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !169, file: !170, line: 57, baseType: !25, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !169, file: !170, line: 58, baseType: !25, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !169, file: !170, line: 60, baseType: !50, size: 640, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !169, file: !170, line: 61, baseType: !25, size: 32, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !169, file: !170, line: 62, baseType: !25, size: 32, offset: 1120)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !169, file: !170, line: 63, baseType: !20, size: 16, offset: 1152)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !169, file: !170, line: 64, baseType: !13, size: 8, offset: 1168)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !169, file: !170, line: 66, baseType: !200, size: 2688, offset: 1216)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2688, elements: !39)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !169, file: !170, line: 67, baseType: !202, size: 3072, offset: 3904)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 3072, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !169, file: !170, line: 68, baseType: !206, size: 576, offset: 6976)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 576, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 9)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !169, file: !170, line: 69, baseType: !133, size: 64, offset: 7552)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !169, file: !170, line: 71, baseType: !35, size: 64, offset: 7616)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !169, file: !170, line: 72, baseType: !133, size: 64, offset: 7680)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !169, file: !170, line: 73, baseType: !213, size: 64, offset: 7744)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !215)
!215 = !{!216, !224, !237, !246, !255, !268, !282, !294, !304}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !214, file: !6, line: 664, baseType: !217, size: 128)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !218)
!218 = !{!219, !220, !221, !222, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !6, line: 568, baseType: !31, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !217, file: !6, line: 568, baseType: !13, size: 8, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !217, file: !6, line: 568, baseType: !13, size: 8, offset: 72)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !217, file: !6, line: 568, baseType: !20, size: 16, offset: 80)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !217, file: !6, line: 568, baseType: !20, size: 16, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !214, file: !6, line: 665, baseType: !225, size: 384)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !6, line: 594, baseType: !31, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !225, file: !6, line: 594, baseType: !13, size: 8, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !225, file: !6, line: 594, baseType: !13, size: 8, offset: 72)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !225, file: !6, line: 594, baseType: !20, size: 16, offset: 80)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !225, file: !6, line: 594, baseType: !20, size: 16, offset: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !225, file: !6, line: 594, baseType: !20, size: 16, offset: 112)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !225, file: !6, line: 595, baseType: !58, size: 64, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !225, file: !6, line: 596, baseType: !35, size: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !225, file: !6, line: 597, baseType: !35, size: 64, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !225, file: !6, line: 598, baseType: !27, size: 64, offset: 320)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !214, file: !6, line: 666, baseType: !238, size: 192)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !6, line: 574, baseType: !31, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !238, file: !6, line: 574, baseType: !13, size: 8, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !6, line: 574, baseType: !13, size: 8, offset: 72)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !238, file: !6, line: 574, baseType: !20, size: 16, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !238, file: !6, line: 574, baseType: !20, size: 16, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !238, file: !6, line: 574, baseType: !75, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !214, file: !6, line: 667, baseType: !247, size: 192)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !6, line: 605, baseType: !31, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !247, file: !6, line: 605, baseType: !13, size: 8, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !247, file: !6, line: 605, baseType: !13, size: 8, offset: 72)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !247, file: !6, line: 605, baseType: !20, size: 16, offset: 80)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !247, file: !6, line: 605, baseType: !20, size: 16, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !247, file: !6, line: 605, baseType: !71, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !214, file: !6, line: 668, baseType: !256, size: 448)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !6, line: 609, baseType: !31, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !256, file: !6, line: 609, baseType: !13, size: 8, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !6, line: 609, baseType: !13, size: 8, offset: 72)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !6, line: 609, baseType: !20, size: 16, offset: 80)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !256, file: !6, line: 609, baseType: !20, size: 16, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !256, file: !6, line: 609, baseType: !25, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !256, file: !6, line: 610, baseType: !58, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !256, file: !6, line: 611, baseType: !35, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !256, file: !6, line: 612, baseType: !35, size: 64, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !256, file: !6, line: 613, baseType: !25, size: 32, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !214, file: !6, line: 669, baseType: !269, size: 512)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !6, line: 581, baseType: !31, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !269, file: !6, line: 581, baseType: !13, size: 8, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !269, file: !6, line: 581, baseType: !13, size: 8, offset: 72)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !269, file: !6, line: 581, baseType: !20, size: 16, offset: 80)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !6, line: 581, baseType: !20, size: 16, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !269, file: !6, line: 581, baseType: !25, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !269, file: !6, line: 582, baseType: !75, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !269, file: !6, line: 583, baseType: !75, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !269, file: !6, line: 584, baseType: !168, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !269, file: !6, line: 585, baseType: !31, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !269, file: !6, line: 586, baseType: !25, size: 32, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !214, file: !6, line: 670, baseType: !283, size: 320)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !6, line: 621, baseType: !31, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !283, file: !6, line: 621, baseType: !13, size: 8, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !6, line: 621, baseType: !13, size: 8, offset: 72)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !283, file: !6, line: 621, baseType: !20, size: 16, offset: 80)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !283, file: !6, line: 621, baseType: !20, size: 16, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !283, file: !6, line: 621, baseType: !13, size: 8, offset: 112)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !283, file: !6, line: 622, baseType: !168, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !283, file: !6, line: 623, baseType: !75, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !283, file: !6, line: 624, baseType: !27, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !214, file: !6, line: 671, baseType: !295, size: 640)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !6, line: 632, baseType: !31, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !295, file: !6, line: 632, baseType: !13, size: 8, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !295, file: !6, line: 632, baseType: !13, size: 8, offset: 72)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !6, line: 632, baseType: !20, size: 16, offset: 80)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !295, file: !6, line: 632, baseType: !20, size: 16, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !295, file: !6, line: 633, baseType: !303, size: 512, offset: 128)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !203)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !214, file: !6, line: 672, baseType: !305, size: 320)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !6, line: 655, baseType: !31, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !305, file: !6, line: 655, baseType: !13, size: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !6, line: 655, baseType: !13, size: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !6, line: 655, baseType: !20, size: 16, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !305, file: !6, line: 655, baseType: !20, size: 16, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !305, file: !6, line: 655, baseType: !13, size: 8, offset: 112)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !6, line: 656, baseType: !71, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !305, file: !6, line: 657, baseType: !75, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !305, file: !6, line: 658, baseType: !316, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !318)
!318 = !{!319, !325}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !317, file: !6, line: 646, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !24, line: 1052, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !324, !25, !31}
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !24, line: 424, baseType: !31)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !317, file: !6, line: 647, baseType: !31, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !169, file: !170, line: 74, baseType: !71, size: 64, offset: 7808)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !169, file: !170, line: 75, baseType: !75, size: 64, offset: 7872)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !169, file: !170, line: 76, baseType: !71, size: 64, offset: 7936)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !169, file: !170, line: 77, baseType: !58, size: 64, offset: 8000)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !169, file: !170, line: 78, baseType: !75, size: 64, offset: 8064)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !169, file: !170, line: 79, baseType: !71, size: 64, offset: 8128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !169, file: !170, line: 80, baseType: !18, size: 64, offset: 8192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !169, file: !170, line: 81, baseType: !58, size: 64, offset: 8256)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !169, file: !170, line: 82, baseType: !335, size: 64, offset: 8320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !338)
!338 = !{!339, !340, !341, !342, !343, !344}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !337, file: !6, line: 706, baseType: !25, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !337, file: !6, line: 707, baseType: !25, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !337, file: !6, line: 708, baseType: !20, size: 16, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !337, file: !6, line: 709, baseType: !13, size: 8, offset: 80)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !337, file: !6, line: 710, baseType: !13, size: 8, offset: 88)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !6, line: 711, baseType: !13, size: 8, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !169, file: !170, line: 83, baseType: !58, size: 64, offset: 8384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !169, file: !170, line: 84, baseType: !75, size: 64, offset: 8448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !169, file: !170, line: 85, baseType: !213, size: 64, offset: 8512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !169, file: !170, line: 86, baseType: !75, size: 64, offset: 8576)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !169, file: !170, line: 87, baseType: !213, size: 64, offset: 8640)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !169, file: !170, line: 88, baseType: !58, size: 64, offset: 8704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !169, file: !170, line: 89, baseType: !58, size: 64, offset: 8768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !169, file: !170, line: 90, baseType: !353, size: 64, offset: 8832)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !169, file: !170, line: 91, baseType: !355, size: 64, offset: 8896)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DISubroutineType(types: !358)
!358 = !{!23, !168, !359}
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !169, file: !170, line: 92, baseType: !361, size: 64, offset: 8960)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !165)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !161, file: !77, line: 152, baseType: !75, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !147, file: !77, line: 155, baseType: !25, size: 32, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !147, file: !77, line: 156, baseType: !180, size: 16, offset: 416)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !147, file: !77, line: 157, baseType: !13, size: 8, offset: 432)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !76, file: !77, line: 375, baseType: !367, size: 576)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !77, line: 122, size: 576, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !367, file: !77, line: 123, baseType: !75, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !367, file: !77, line: 123, baseType: !13, size: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !77, line: 123, baseType: !13, size: 8, offset: 72)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !367, file: !77, line: 123, baseType: !20, size: 16, offset: 80)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !367, file: !77, line: 123, baseType: !13, size: 8, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !367, file: !77, line: 123, baseType: !13, size: 8, offset: 104)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !367, file: !77, line: 124, baseType: !20, size: 16, offset: 112)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !367, file: !77, line: 125, baseType: !31, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !367, file: !77, line: 126, baseType: !27, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !367, file: !77, line: 127, baseType: !353, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !77, line: 128, baseType: !75, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !77, line: 129, baseType: !75, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !367, file: !77, line: 130, baseType: !71, size: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !367, file: !77, line: 131, baseType: !13, size: 8, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !76, file: !77, line: 376, baseType: !384, size: 448)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !77, line: 134, size: 448, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !397}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !384, file: !77, line: 135, baseType: !75, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !384, file: !77, line: 135, baseType: !13, size: 8, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !384, file: !77, line: 135, baseType: !13, size: 8, offset: 72)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !384, file: !77, line: 135, baseType: !20, size: 16, offset: 80)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !77, line: 135, baseType: !13, size: 8, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !384, file: !77, line: 135, baseType: !13, size: 8, offset: 104)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !384, file: !77, line: 136, baseType: !71, size: 64, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !384, file: !77, line: 137, baseType: !75, size: 64, offset: 192)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !77, line: 138, baseType: !75, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !384, file: !77, line: 139, baseType: !396, size: 64, offset: 320)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !24, line: 129, baseType: !27)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !384, file: !77, line: 140, baseType: !25, size: 32, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !76, file: !77, line: 377, baseType: !399, size: 320)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !77, line: 184, size: 320, elements: !400)
!400 = !{!401, !402, !403, !404, !405, !406, !410}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !399, file: !77, line: 185, baseType: !75, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !399, file: !77, line: 185, baseType: !13, size: 8, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !399, file: !77, line: 185, baseType: !13, size: 8, offset: 72)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !399, file: !77, line: 185, baseType: !20, size: 16, offset: 80)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !399, file: !77, line: 185, baseType: !13, size: 8, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !399, file: !77, line: 185, baseType: !407, size: 128, offset: 128)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 2)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !399, file: !77, line: 185, baseType: !75, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !76, file: !77, line: 378, baseType: !412, size: 384)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !77, line: 187, size: 384, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !412, file: !77, line: 188, baseType: !75, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !412, file: !77, line: 188, baseType: !13, size: 8, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !77, line: 188, baseType: !13, size: 8, offset: 72)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !412, file: !77, line: 188, baseType: !20, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !412, file: !77, line: 188, baseType: !13, size: 8, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !412, file: !77, line: 189, baseType: !407, size: 128, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !412, file: !77, line: 189, baseType: !75, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !412, file: !77, line: 189, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !424)
!424 = !{!425, !426, !427, !428, !436, !451, !483, !484, !485, !486, !487, !488}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !423, file: !6, line: 481, baseType: !71, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !423, file: !6, line: 482, baseType: !422, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !423, file: !6, line: 483, baseType: !422, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !423, file: !6, line: 484, baseType: !429, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !430, file: !6, line: 498, baseType: !429, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !430, file: !6, line: 499, baseType: !429, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !430, file: !6, line: 500, baseType: !422, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !430, file: !6, line: 501, baseType: !25, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !423, file: !6, line: 485, baseType: !437, size: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !439)
!439 = !{!440, !445, !446, !447, !448, !449, !450}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !438, file: !6, line: 467, baseType: !441, size: 128)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !441, file: !6, line: 460, baseType: !13, size: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !441, file: !6, line: 461, baseType: !27, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !438, file: !6, line: 468, baseType: !441, size: 128, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !438, file: !6, line: 469, baseType: !20, size: 16, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !438, file: !6, line: 470, baseType: !13, size: 8, offset: 272)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !438, file: !6, line: 471, baseType: !13, size: 8, offset: 280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !438, file: !6, line: 472, baseType: !13, size: 8, offset: 288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !438, file: !6, line: 473, baseType: !13, size: 8, offset: 296)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !423, file: !6, line: 486, baseType: !452, size: 64, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !454)
!454 = !{!455, !478, !479, !480, !481, !482}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !453, file: !6, line: 449, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !457)
!457 = !{!458, !459, !472}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !456, file: !6, line: 439, baseType: !71, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !456, file: !6, line: 440, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !462)
!462 = !{!463, !468, !469, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !461, file: !6, line: 420, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !24, line: 1049, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!25, !324, !25, !31}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !461, file: !6, line: 421, baseType: !31, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !461, file: !6, line: 422, baseType: !71, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !461, file: !6, line: 423, baseType: !13, size: 8, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !461, file: !6, line: 424, baseType: !13, size: 8, offset: 200)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !456, file: !6, line: 441, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !474, file: !6, line: 430, baseType: !71, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !6, line: 431, baseType: !473, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !453, file: !6, line: 450, baseType: !437, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !453, file: !6, line: 451, baseType: !13, size: 8, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !453, file: !6, line: 452, baseType: !13, size: 8, offset: 136)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !453, file: !6, line: 453, baseType: !13, size: 8, offset: 144)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !453, file: !6, line: 454, baseType: !13, size: 8, offset: 152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !423, file: !6, line: 487, baseType: !27, size: 64, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !423, file: !6, line: 488, baseType: !25, size: 32, offset: 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !423, file: !6, line: 489, baseType: !20, size: 16, offset: 480)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !423, file: !6, line: 490, baseType: !20, size: 16, offset: 496)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !423, file: !6, line: 491, baseType: !13, size: 8, offset: 512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !423, file: !6, line: 492, baseType: !13, size: 8, offset: 520)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !76, file: !77, line: 379, baseType: !490, size: 384)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !77, line: 192, size: 384, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !490, file: !77, line: 193, baseType: !75, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !490, file: !77, line: 193, baseType: !13, size: 8, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !490, file: !77, line: 193, baseType: !13, size: 8, offset: 72)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !490, file: !77, line: 193, baseType: !20, size: 16, offset: 80)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !490, file: !77, line: 193, baseType: !13, size: 8, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !490, file: !77, line: 193, baseType: !407, size: 128, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !490, file: !77, line: 193, baseType: !75, size: 64, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !490, file: !77, line: 193, baseType: !25, size: 32, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !490, file: !77, line: 194, baseType: !25, size: 32, offset: 352)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !76, file: !77, line: 380, baseType: !502, size: 384)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !77, line: 197, size: 384, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !502, file: !77, line: 198, baseType: !75, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !502, file: !77, line: 198, baseType: !13, size: 8, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !502, file: !77, line: 198, baseType: !13, size: 8, offset: 72)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !502, file: !77, line: 198, baseType: !20, size: 16, offset: 80)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !502, file: !77, line: 198, baseType: !13, size: 8, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !502, file: !77, line: 200, baseType: !13, size: 8, offset: 104)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !502, file: !77, line: 201, baseType: !13, size: 8, offset: 112)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !502, file: !77, line: 202, baseType: !407, size: 128, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !502, file: !77, line: 202, baseType: !75, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !502, file: !77, line: 202, baseType: !514, size: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !24, line: 128, baseType: !27)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !76, file: !77, line: 381, baseType: !516, size: 320)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !77, line: 205, size: 320, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !516, file: !77, line: 206, baseType: !75, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !516, file: !77, line: 206, baseType: !13, size: 8, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !516, file: !77, line: 206, baseType: !13, size: 8, offset: 72)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !516, file: !77, line: 206, baseType: !20, size: 16, offset: 80)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !516, file: !77, line: 206, baseType: !13, size: 8, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !516, file: !77, line: 206, baseType: !407, size: 128, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !516, file: !77, line: 206, baseType: !75, size: 64, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !76, file: !77, line: 382, baseType: !526, size: 384)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !77, line: 233, size: 384, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !526, file: !77, line: 234, baseType: !75, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 72)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !526, file: !77, line: 234, baseType: !20, size: 16, offset: 80)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 104)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 112)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 120)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !526, file: !77, line: 234, baseType: !71, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !526, file: !77, line: 234, baseType: !25, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !526, file: !77, line: 234, baseType: !25, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !526, file: !77, line: 234, baseType: !25, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !526, file: !77, line: 234, baseType: !13, size: 8, offset: 296)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !526, file: !77, line: 234, baseType: !75, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !76, file: !77, line: 383, baseType: !544, size: 576)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !77, line: 237, size: 576, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !544, file: !77, line: 238, baseType: !75, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 72)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !544, file: !77, line: 238, baseType: !20, size: 16, offset: 80)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 104)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 120)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !544, file: !77, line: 238, baseType: !71, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !544, file: !77, line: 238, baseType: !25, size: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !544, file: !77, line: 238, baseType: !25, size: 32, offset: 224)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !544, file: !77, line: 238, baseType: !25, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 288)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !544, file: !77, line: 238, baseType: !13, size: 8, offset: 296)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !544, file: !77, line: 238, baseType: !20, size: 16, offset: 304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !544, file: !77, line: 239, baseType: !75, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !544, file: !77, line: 240, baseType: !35, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !544, file: !77, line: 241, baseType: !20, size: 16, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !544, file: !77, line: 242, baseType: !35, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !76, file: !77, line: 384, baseType: !566, size: 384)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !77, line: 262, size: 384, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !566, file: !77, line: 263, baseType: !75, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 72)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !566, file: !77, line: 263, baseType: !20, size: 16, offset: 80)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 104)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 120)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !566, file: !77, line: 263, baseType: !71, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !566, file: !77, line: 263, baseType: !25, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !566, file: !77, line: 263, baseType: !25, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !566, file: !77, line: 263, baseType: !25, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 296)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !566, file: !77, line: 263, baseType: !13, size: 8, offset: 304)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !566, file: !77, line: 264, baseType: !75, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !76, file: !77, line: 385, baseType: !585, size: 448)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !77, line: 245, size: 448, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !585, file: !77, line: 246, baseType: !75, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 72)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !585, file: !77, line: 246, baseType: !20, size: 16, offset: 80)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 104)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 112)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 120)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !585, file: !77, line: 246, baseType: !71, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !585, file: !77, line: 246, baseType: !25, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !585, file: !77, line: 246, baseType: !25, size: 32, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !585, file: !77, line: 246, baseType: !25, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !585, file: !77, line: 246, baseType: !13, size: 8, offset: 296)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !585, file: !77, line: 246, baseType: !75, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !585, file: !77, line: 247, baseType: !75, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !76, file: !77, line: 386, baseType: !604, size: 448)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !77, line: 250, size: 448, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !604, file: !77, line: 251, baseType: !75, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 72)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !604, file: !77, line: 251, baseType: !20, size: 16, offset: 80)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 104)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 112)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 120)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !604, file: !77, line: 251, baseType: !71, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !604, file: !77, line: 251, baseType: !25, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !604, file: !77, line: 251, baseType: !25, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !604, file: !77, line: 251, baseType: !25, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !604, file: !77, line: 251, baseType: !13, size: 8, offset: 296)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !604, file: !77, line: 256, baseType: !75, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !604, file: !77, line: 257, baseType: !75, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !76, file: !77, line: 387, baseType: !623, size: 512)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !77, line: 273, size: 512, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !623, file: !77, line: 274, baseType: !75, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !623, file: !77, line: 274, baseType: !13, size: 8, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !77, line: 274, baseType: !13, size: 8, offset: 72)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !623, file: !77, line: 274, baseType: !20, size: 16, offset: 80)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !623, file: !77, line: 274, baseType: !13, size: 8, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !77, line: 274, baseType: !71, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !623, file: !77, line: 275, baseType: !25, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !623, file: !77, line: 276, baseType: !320, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !623, file: !77, line: 277, baseType: !31, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !77, line: 278, baseType: !407, size: 128, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !76, file: !77, line: 388, baseType: !636, size: 512)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !77, line: 281, size: 512, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !650, !651, !652, !658, !659}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !636, file: !77, line: 282, baseType: !75, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !636, file: !77, line: 282, baseType: !13, size: 8, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !636, file: !77, line: 282, baseType: !13, size: 8, offset: 72)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !636, file: !77, line: 282, baseType: !20, size: 16, offset: 80)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !636, file: !77, line: 282, baseType: !13, size: 8, offset: 96)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !636, file: !77, line: 282, baseType: !13, size: 8, offset: 104)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !636, file: !77, line: 283, baseType: !13, size: 8, offset: 112)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !636, file: !77, line: 284, baseType: !646, size: 64, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !24, line: 1084, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{!23, !25, !396, !25, !32, !31, !31}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !636, file: !77, line: 285, baseType: !71, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !636, file: !77, line: 286, baseType: !31, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !636, file: !77, line: 287, baseType: !653, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !24, line: 1102, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!23, !324, !25, !31, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !636, file: !77, line: 288, baseType: !75, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !636, file: !77, line: 289, baseType: !75, size: 64, offset: 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !76, file: !77, line: 389, baseType: !661, size: 512)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !77, line: 307, size: 512, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !661, file: !77, line: 308, baseType: !75, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !661, file: !77, line: 308, baseType: !13, size: 8, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !77, line: 308, baseType: !13, size: 8, offset: 72)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !661, file: !77, line: 308, baseType: !20, size: 16, offset: 80)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !77, line: 308, baseType: !13, size: 8, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !661, file: !77, line: 308, baseType: !13, size: 8, offset: 104)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !661, file: !77, line: 309, baseType: !13, size: 8, offset: 112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !661, file: !77, line: 310, baseType: !13, size: 8, offset: 120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !661, file: !77, line: 311, baseType: !31, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !661, file: !77, line: 312, baseType: !71, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !661, file: !77, line: 313, baseType: !133, size: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !661, file: !77, line: 314, baseType: !35, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !661, file: !77, line: 315, baseType: !35, size: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !661, file: !77, line: 316, baseType: !25, size: 32, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !76, file: !77, line: 390, baseType: !678, size: 448)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !77, line: 340, size: 448, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687, !688, !689}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !678, file: !77, line: 341, baseType: !75, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !678, file: !77, line: 341, baseType: !13, size: 8, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !77, line: 341, baseType: !13, size: 8, offset: 72)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !678, file: !77, line: 341, baseType: !20, size: 16, offset: 80)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !77, line: 341, baseType: !13, size: 8, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !678, file: !77, line: 341, baseType: !71, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !678, file: !77, line: 342, baseType: !71, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !678, file: !77, line: 343, baseType: !31, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !678, file: !77, line: 344, baseType: !35, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !678, file: !77, line: 345, baseType: !25, size: 32, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !77, line: 391, baseType: !691, size: 256)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !77, line: 350, size: 256, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !703}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !691, file: !77, line: 351, baseType: !75, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !691, file: !77, line: 351, baseType: !13, size: 8, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !77, line: 351, baseType: !13, size: 8, offset: 72)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !691, file: !77, line: 351, baseType: !20, size: 16, offset: 80)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !691, file: !77, line: 351, baseType: !13, size: 8, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !691, file: !77, line: 351, baseType: !699, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !24, line: 1055, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !324, !31}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !691, file: !77, line: 352, baseType: !31, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !76, file: !77, line: 392, baseType: !705, size: 192)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !77, line: 357, size: 192, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !705, file: !77, line: 358, baseType: !75, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !705, file: !77, line: 358, baseType: !13, size: 8, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !77, line: 358, baseType: !13, size: 8, offset: 72)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !705, file: !77, line: 358, baseType: !20, size: 16, offset: 80)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !705, file: !77, line: 358, baseType: !13, size: 8, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !77, line: 358, baseType: !75, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !76, file: !77, line: 399, baseType: !72, size: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !72, file: !6, line: 135, baseType: !13, size: 8, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !72, file: !6, line: 136, baseType: !13, size: 8, offset: 72)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !72, file: !6, line: 137, baseType: !20, size: 16, offset: 80)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !72, file: !6, line: 138, baseType: !718, size: 32, offset: 96)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !719, line: 327, size: 32, elements: !720)
!719 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !718, file: !719, line: 328, baseType: !25, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !718, file: !719, line: 329, baseType: !723, size: 32)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 4)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !72, file: !6, line: 139, baseType: !71, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !72, file: !6, line: 140, baseType: !71, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !72, file: !6, line: 141, baseType: !71, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !72, file: !6, line: 142, baseType: !180, size: 16, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !62, file: !6, line: 829, baseType: !731, size: 64, offset: 320)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !731, file: !6, line: 717, baseType: !27, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !731, file: !6, line: 718, baseType: !25, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !731, file: !6, line: 719, baseType: !18, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !731, file: !6, line: 720, baseType: !35, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !731, file: !6, line: 721, baseType: !18, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !731, file: !6, line: 722, baseType: !58, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !62, file: !6, line: 829, baseType: !13, size: 8, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !59, file: !6, line: 877, baseType: !741, size: 640)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !741, file: !6, line: 836, baseType: !58, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !741, file: !6, line: 836, baseType: !13, size: 8, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !741, file: !6, line: 836, baseType: !13, size: 8, offset: 72)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !741, file: !6, line: 836, baseType: !20, size: 16, offset: 80)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !741, file: !6, line: 836, baseType: !35, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !6, line: 836, baseType: !58, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !741, file: !6, line: 836, baseType: !71, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !741, file: !6, line: 836, baseType: !731, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !741, file: !6, line: 836, baseType: !13, size: 8, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !741, file: !6, line: 836, baseType: !18, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !741, file: !6, line: 837, baseType: !35, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !741, file: !6, line: 838, baseType: !25, size: 32, offset: 576)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !6, line: 839, baseType: !25, size: 32, offset: 608)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !59, file: !6, line: 878, baseType: !757, size: 1600)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !757, file: !6, line: 847, baseType: !58, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !757, file: !6, line: 847, baseType: !13, size: 8, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !757, file: !6, line: 847, baseType: !13, size: 8, offset: 72)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !757, file: !6, line: 847, baseType: !20, size: 16, offset: 80)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !757, file: !6, line: 847, baseType: !35, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !757, file: !6, line: 847, baseType: !58, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !757, file: !6, line: 847, baseType: !71, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !757, file: !6, line: 847, baseType: !731, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !757, file: !6, line: 847, baseType: !13, size: 8, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !757, file: !6, line: 847, baseType: !58, size: 64, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !757, file: !6, line: 848, baseType: !58, size: 64, offset: 512)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !757, file: !6, line: 849, baseType: !18, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !757, file: !6, line: 850, baseType: !13, size: 8, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !757, file: !6, line: 851, baseType: !18, size: 64, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !757, file: !6, line: 852, baseType: !18, size: 64, offset: 768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !757, file: !6, line: 853, baseType: !18, size: 64, offset: 832)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !757, file: !6, line: 854, baseType: !723, size: 32, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !757, file: !6, line: 855, baseType: !25, size: 32, offset: 928)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !757, file: !6, line: 856, baseType: !25, size: 32, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !757, file: !6, line: 857, baseType: !25, size: 32, offset: 992)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !757, file: !6, line: 858, baseType: !25, size: 32, offset: 1024)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !757, file: !6, line: 859, baseType: !25, size: 32, offset: 1056)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !757, file: !6, line: 860, baseType: !25, size: 32, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !757, file: !6, line: 861, baseType: !25, size: 32, offset: 1120)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !757, file: !6, line: 862, baseType: !25, size: 32, offset: 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !757, file: !6, line: 863, baseType: !25, size: 32, offset: 1184)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !757, file: !6, line: 864, baseType: !25, size: 32, offset: 1216)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !757, file: !6, line: 865, baseType: !25, size: 32, offset: 1248)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !757, file: !6, line: 866, baseType: !25, size: 32, offset: 1280)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !757, file: !6, line: 867, baseType: !25, size: 32, offset: 1312)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !757, file: !6, line: 868, baseType: !20, size: 16, offset: 1344)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !757, file: !6, line: 869, baseType: !13, size: 8, offset: 1360)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !757, file: !6, line: 870, baseType: !13, size: 8, offset: 1368)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !757, file: !6, line: 871, baseType: !13, size: 8, offset: 1376)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !757, file: !6, line: 872, baseType: !794, size: 160, offset: 1384)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 20)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !50, file: !6, line: 900, baseType: !71, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !50, file: !6, line: 901, baseType: !213, size: 64, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !50, file: !6, line: 902, baseType: !58, size: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !50, file: !6, line: 903, baseType: !25, size: 32, offset: 576)
!801 = !{}
!802 = !DILocalVariable(name: "parser_state", arg: 1, scope: !46, file: !3, line: 94, type: !49)
!803 = !DILocation(line: 94, column: 59, scope: !46)
!804 = !DILocalVariable(name: "start", scope: !46, file: !3, line: 96, type: !35)
!805 = !DILocation(line: 96, column: 6, scope: !46)
!806 = !DILocation(line: 96, column: 14, scope: !46)
!807 = !DILocation(line: 96, column: 28, scope: !46)
!808 = !DILocalVariable(name: "package_length", scope: !46, file: !3, line: 97, type: !25)
!809 = !DILocation(line: 97, column: 6, scope: !46)
!810 = !DILocation(line: 103, column: 51, scope: !46)
!811 = !DILocation(line: 103, column: 19, scope: !46)
!812 = !DILocation(line: 103, column: 17, scope: !46)
!813 = !DILocation(line: 105, column: 2, scope: !46)
!814 = distinct !DISubprogram(name: "acpi_ps_get_next_package_length", scope: !3, file: !3, line: 43, type: !815, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !801)
!815 = !DISubroutineType(types: !816)
!816 = !{!25, !49}
!817 = !DILocalVariable(name: "parser_state", arg: 1, scope: !814, file: !3, line: 43, type: !49)
!818 = !DILocation(line: 43, column: 58, scope: !814)
!819 = !DILocalVariable(name: "aml", scope: !814, file: !3, line: 45, type: !35)
!820 = !DILocation(line: 45, column: 6, scope: !814)
!821 = !DILocation(line: 45, column: 12, scope: !814)
!822 = !DILocation(line: 45, column: 26, scope: !814)
!823 = !DILocalVariable(name: "package_length", scope: !814, file: !3, line: 46, type: !25)
!824 = !DILocation(line: 46, column: 6, scope: !814)
!825 = !DILocalVariable(name: "byte_count", scope: !814, file: !3, line: 47, type: !25)
!826 = !DILocation(line: 47, column: 6, scope: !814)
!827 = !DILocalVariable(name: "byte_zero_mask", scope: !814, file: !3, line: 48, type: !13)
!828 = !DILocation(line: 48, column: 5, scope: !814)
!829 = !DILocation(line: 56, column: 16, scope: !814)
!830 = !DILocation(line: 56, column: 23, scope: !814)
!831 = !DILocation(line: 56, column: 13, scope: !814)
!832 = !DILocation(line: 57, column: 35, scope: !814)
!833 = !DILocation(line: 57, column: 24, scope: !814)
!834 = !DILocation(line: 57, column: 46, scope: !814)
!835 = !DILocation(line: 57, column: 2, scope: !814)
!836 = !DILocation(line: 57, column: 16, scope: !814)
!837 = !DILocation(line: 57, column: 20, scope: !814)
!838 = !DILocation(line: 61, column: 2, scope: !814)
!839 = !DILocation(line: 61, column: 9, scope: !814)
!840 = !DILocation(line: 69, column: 22, scope: !841)
!841 = distinct !DILexicalBlock(scope: !814, file: !3, line: 61, column: 21)
!842 = !DILocation(line: 69, column: 26, scope: !841)
!843 = !DILocation(line: 69, column: 43, scope: !841)
!844 = !DILocation(line: 69, column: 54, scope: !841)
!845 = !DILocation(line: 69, column: 60, scope: !841)
!846 = !DILocation(line: 69, column: 38, scope: !841)
!847 = !DILocation(line: 69, column: 18, scope: !841)
!848 = !DILocation(line: 71, column: 18, scope: !841)
!849 = !DILocation(line: 72, column: 13, scope: !841)
!850 = distinct !{!850, !838, !851}
!851 = !DILocation(line: 73, column: 2, scope: !814)
!852 = !DILocation(line: 77, column: 21, scope: !814)
!853 = !DILocation(line: 77, column: 30, scope: !814)
!854 = !DILocation(line: 77, column: 28, scope: !814)
!855 = !DILocation(line: 77, column: 17, scope: !814)
!856 = !DILocation(line: 78, column: 2, scope: !814)
!857 = distinct !DISubprogram(name: "acpi_ps_get_next_namestring", scope: !3, file: !3, line: 123, type: !858, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !801)
!858 = !DISubroutineType(types: !859)
!859 = !{!18, !49}
!860 = !DILocalVariable(name: "parser_state", arg: 1, scope: !857, file: !3, line: 123, type: !49)
!861 = !DILocation(line: 123, column: 60, scope: !857)
!862 = !DILocalVariable(name: "start", scope: !857, file: !3, line: 125, type: !35)
