; ModuleID = '../bcout/drivers/acpi/acpica/psloop.llvm.bc'
source_filename = "drivers/acpi/acpica/psloop.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_walk_state = type { %struct.acpi_walk_state*, i8, i8, i16, i8, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8*, i32, i32, i32, i32, %struct.acpi_parse_state, i32, i32, i16, i8, [7 x %struct.acpi_namespace_node], [8 x %struct.acpi_namespace_node], [9 x %union.acpi_operand_object*], %union.acpi_operand_object**, i8*, %union.acpi_operand_object**, %union.acpi_generic_state*, %struct.acpi_namespace_node*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, %union.acpi_parse_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8*, %union.acpi_parse_object*, %struct.acpi_opcode_info*, %union.acpi_parse_object*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_parse_object*, %union.acpi_parse_object*, %struct.acpi_thread_state*, i32 (%struct.acpi_walk_state*, %union.acpi_parse_object**)*, {}* }
%struct.acpi_parse_state = type { i8*, i8*, i8*, i8*, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_generic_state*, %union.acpi_parse_object*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 28, type: !28, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !27, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/psloop.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !{!13, !19, !20, !23, !15}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !14, line: 421, baseType: !15)
!14 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !16, line: 21, baseType: !17)
!16 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !18, line: 27, baseType: !7)
!18 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !16, line: 19, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !18, line: 24, baseType: !22)
!22 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !14, line: 127, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !16, line: 23, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !18, line: 31, baseType: !26)
!26 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !{!0}
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 56, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!31 = !{!32}
!32 = !DISubrange(count: 7)
!33 = !{i32 7, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 1, !"wchar_size", i32 2}
!36 = !{i32 1, !"Code Model", i32 2}
!37 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!38 = distinct !DISubprogram(name: "acpi_ps_parse_loop", scope: !3, file: !3, line: 221, type: !39, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !796)
!39 = !DISubroutineType(types: !40)
!40 = !{!13, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !43, line: 37, size: 9024, elements: !44)
!43 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!44 = !{!45, !46, !50, !51, !52, !53, !54, !55, !57, !58, !59, !60, !61, !62, !63, !64, !65, !67, !68, !69, !70, !71, !745, !746, !747, !748, !749, !751, !753, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !780, !781, !782, !783, !784, !785, !786, !787, !788, !794}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !43, line: 38, baseType: !41, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !42, file: !43, line: 39, baseType: !47, size: 8, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !16, line: 17, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !18, line: 21, baseType: !49)
!49 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !42, file: !43, line: 40, baseType: !47, size: 8, offset: 72)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !42, file: !43, line: 41, baseType: !20, size: 16, offset: 80)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !42, file: !43, line: 42, baseType: !47, size: 8, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !42, file: !43, line: 43, baseType: !47, size: 8, offset: 104)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !42, file: !43, line: 44, baseType: !47, size: 8, offset: 112)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !42, file: !43, line: 45, baseType: !56, size: 16, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !14, line: 445, baseType: !20)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !42, file: !43, line: 46, baseType: !47, size: 8, offset: 144)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !42, file: !43, line: 47, baseType: !47, size: 8, offset: 152)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !42, file: !43, line: 48, baseType: !47, size: 8, offset: 160)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !42, file: !43, line: 49, baseType: !47, size: 8, offset: 168)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !42, file: !43, line: 50, baseType: !47, size: 8, offset: 176)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !42, file: !43, line: 51, baseType: !47, size: 8, offset: 184)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !42, file: !43, line: 52, baseType: !47, size: 8, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !42, file: !43, line: 53, baseType: !47, size: 8, offset: 200)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !42, file: !43, line: 54, baseType: !66, size: 64, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !42, file: !43, line: 55, baseType: !15, size: 32, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !42, file: !43, line: 56, baseType: !15, size: 32, offset: 352)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !42, file: !43, line: 57, baseType: !15, size: 32, offset: 384)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !42, file: !43, line: 58, baseType: !15, size: 32, offset: 416)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !42, file: !43, line: 60, baseType: !72, size: 640, offset: 448)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !73)
!73 = !{!74, !75, !76, !77, !78, !79, !642, !643, !743, !744}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !72, file: !6, line: 894, baseType: !66, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !72, file: !6, line: 895, baseType: !66, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !72, file: !6, line: 896, baseType: !66, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !72, file: !6, line: 897, baseType: !66, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !72, file: !6, line: 898, baseType: !66, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !72, file: !6, line: 899, baseType: !80, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !82)
!82 = !{!83, !585, !601}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !81, file: !6, line: 876, baseType: !84, size: 448)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !575, !584}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !84, file: !6, line: 829, baseType: !80, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !84, file: !6, line: 829, baseType: !47, size: 8, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !84, file: !6, line: 829, baseType: !47, size: 8, offset: 72)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !84, file: !6, line: 829, baseType: !20, size: 16, offset: 80)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !84, file: !6, line: 829, baseType: !66, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !6, line: 829, baseType: !80, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !84, file: !6, line: 829, baseType: !93, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !95)
!95 = !{!96, !559, !560, !561, !562, !571, !572, !573, !574}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !94, file: !6, line: 134, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !99, line: 367, size: 576, elements: !100)
!99 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!100 = !{!101, !109, !122, !133, !146, !160, !169, !193, !222, !237, !250, !329, !341, !355, !365, !383, !405, !424, !443, !462, !479, !505, !522, !535, !549, !558}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !98, file: !99, line: 368, baseType: !102, size: 128)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !99, line: 73, size: 128, elements: !103)
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !102, file: !99, line: 74, baseType: !97, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !102, file: !99, line: 74, baseType: !47, size: 8, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !99, line: 74, baseType: !47, size: 8, offset: 72)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !102, file: !99, line: 74, baseType: !20, size: 16, offset: 80)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !102, file: !99, line: 74, baseType: !47, size: 8, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !98, file: !99, line: 369, baseType: !110, size: 192)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !99, line: 76, size: 192, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !121}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !110, file: !99, line: 77, baseType: !97, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !110, file: !99, line: 77, baseType: !47, size: 8, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !110, file: !99, line: 77, baseType: !47, size: 8, offset: 72)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !110, file: !99, line: 77, baseType: !20, size: 16, offset: 80)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !99, line: 77, baseType: !47, size: 8, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !110, file: !99, line: 77, baseType: !118, size: 24, offset: 104)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 24, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 3)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !110, file: !99, line: 78, baseType: !24, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !98, file: !99, line: 370, baseType: !123, size: 256)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !99, line: 93, size: 256, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !132}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !123, file: !99, line: 94, baseType: !97, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !123, file: !99, line: 94, baseType: !47, size: 8, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !99, line: 94, baseType: !47, size: 8, offset: 72)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !123, file: !99, line: 94, baseType: !20, size: 16, offset: 80)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !123, file: !99, line: 94, baseType: !47, size: 8, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !123, file: !99, line: 94, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !123, file: !99, line: 94, baseType: !15, size: 32, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !98, file: !99, line: 371, baseType: !134, size: 384)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !99, line: 97, size: 384, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !134, file: !99, line: 98, baseType: !97, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !134, file: !99, line: 98, baseType: !47, size: 8, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !134, file: !99, line: 98, baseType: !47, size: 8, offset: 72)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !134, file: !99, line: 98, baseType: !20, size: 16, offset: 80)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !99, line: 98, baseType: !47, size: 8, offset: 96)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !134, file: !99, line: 98, baseType: !66, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !134, file: !99, line: 98, baseType: !15, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !134, file: !99, line: 99, baseType: !15, size: 32, offset: 224)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !134, file: !99, line: 100, baseType: !66, size: 64, offset: 256)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !134, file: !99, line: 101, baseType: !93, size: 64, offset: 320)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !98, file: !99, line: 372, baseType: !147, size: 384)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !99, line: 104, size: 384, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !157, !158, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !147, file: !99, line: 105, baseType: !97, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !147, file: !99, line: 105, baseType: !47, size: 8, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !99, line: 105, baseType: !47, size: 8, offset: 72)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !147, file: !99, line: 105, baseType: !20, size: 16, offset: 80)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !99, line: 105, baseType: !47, size: 8, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !147, file: !99, line: 105, baseType: !93, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !147, file: !99, line: 106, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !147, file: !99, line: 107, baseType: !66, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !147, file: !99, line: 108, baseType: !15, size: 32, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !147, file: !99, line: 109, baseType: !15, size: 32, offset: 352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !98, file: !99, line: 373, baseType: !161, size: 192)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !99, line: 118, size: 192, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !161, file: !99, line: 119, baseType: !97, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !161, file: !99, line: 119, baseType: !47, size: 8, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !161, file: !99, line: 119, baseType: !47, size: 8, offset: 72)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !161, file: !99, line: 119, baseType: !20, size: 16, offset: 80)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !99, line: 119, baseType: !47, size: 8, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !161, file: !99, line: 119, baseType: !19, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !98, file: !99, line: 374, baseType: !170, size: 448)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !99, line: 143, size: 448, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !190, !191, !192}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !170, file: !99, line: 144, baseType: !97, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !170, file: !99, line: 144, baseType: !47, size: 8, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !99, line: 144, baseType: !47, size: 8, offset: 72)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !170, file: !99, line: 144, baseType: !20, size: 16, offset: 80)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !99, line: 144, baseType: !47, size: 8, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !170, file: !99, line: 144, baseType: !47, size: 8, offset: 104)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !170, file: !99, line: 145, baseType: !47, size: 8, offset: 112)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !170, file: !99, line: 146, baseType: !47, size: 8, offset: 120)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !170, file: !99, line: 147, baseType: !97, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !170, file: !99, line: 148, baseType: !97, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !170, file: !99, line: 149, baseType: !66, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !170, file: !99, line: 153, baseType: !184, size: 64, offset: 320)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !99, line: 150, size: 64, elements: !185)
!185 = !{!186, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !184, file: !99, line: 151, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !184, file: !99, line: 152, baseType: !97, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !170, file: !99, line: 155, baseType: !15, size: 32, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !170, file: !99, line: 156, baseType: !56, size: 16, offset: 416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !170, file: !99, line: 157, baseType: !47, size: 8, offset: 432)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !98, file: !99, line: 375, baseType: !194, size: 576)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !99, line: 122, size: 576, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !218, !219, !220, !221}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !194, file: !99, line: 123, baseType: !97, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !194, file: !99, line: 123, baseType: !47, size: 8, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !99, line: 123, baseType: !47, size: 8, offset: 72)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !194, file: !99, line: 123, baseType: !20, size: 16, offset: 80)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !194, file: !99, line: 123, baseType: !47, size: 8, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !194, file: !99, line: 123, baseType: !47, size: 8, offset: 104)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !194, file: !99, line: 124, baseType: !20, size: 16, offset: 112)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !194, file: !99, line: 125, baseType: !19, size: 64, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !194, file: !99, line: 126, baseType: !24, size: 64, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !194, file: !99, line: 127, baseType: !206, size: 64, offset: 256)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !208)
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216, !217}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !6, line: 621, baseType: !19, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !207, file: !6, line: 621, baseType: !47, size: 8, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !207, file: !6, line: 621, baseType: !47, size: 8, offset: 72)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !207, file: !6, line: 621, baseType: !20, size: 16, offset: 80)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !207, file: !6, line: 621, baseType: !20, size: 16, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !207, file: !6, line: 621, baseType: !47, size: 8, offset: 112)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !207, file: !6, line: 622, baseType: !41, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !207, file: !6, line: 623, baseType: !97, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !207, file: !6, line: 624, baseType: !24, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !99, line: 128, baseType: !97, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !99, line: 129, baseType: !97, size: 64, offset: 384)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !194, file: !99, line: 130, baseType: !93, size: 64, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !194, file: !99, line: 131, baseType: !47, size: 8, offset: 512)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !98, file: !99, line: 376, baseType: !223, size: 448)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !99, line: 134, size: 448, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !236}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !223, file: !99, line: 135, baseType: !97, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !223, file: !99, line: 135, baseType: !47, size: 8, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !99, line: 135, baseType: !47, size: 8, offset: 72)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !223, file: !99, line: 135, baseType: !20, size: 16, offset: 80)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !99, line: 135, baseType: !47, size: 8, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !223, file: !99, line: 135, baseType: !47, size: 8, offset: 104)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !223, file: !99, line: 136, baseType: !93, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !223, file: !99, line: 137, baseType: !97, size: 64, offset: 192)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !99, line: 138, baseType: !97, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !223, file: !99, line: 139, baseType: !235, size: 64, offset: 320)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !14, line: 129, baseType: !24)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !223, file: !99, line: 140, baseType: !15, size: 32, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !98, file: !99, line: 377, baseType: !238, size: 320)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !99, line: 184, size: 320, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !249}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !238, file: !99, line: 185, baseType: !97, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !238, file: !99, line: 185, baseType: !47, size: 8, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !99, line: 185, baseType: !47, size: 8, offset: 72)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !238, file: !99, line: 185, baseType: !20, size: 16, offset: 80)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !238, file: !99, line: 185, baseType: !47, size: 8, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !238, file: !99, line: 185, baseType: !246, size: 128, offset: 128)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 128, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 2)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !238, file: !99, line: 185, baseType: !97, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !98, file: !99, line: 378, baseType: !251, size: 384)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !99, line: 187, size: 384, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !251, file: !99, line: 188, baseType: !97, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !251, file: !99, line: 188, baseType: !47, size: 8, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !99, line: 188, baseType: !47, size: 8, offset: 72)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !251, file: !99, line: 188, baseType: !20, size: 16, offset: 80)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !251, file: !99, line: 188, baseType: !47, size: 8, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !251, file: !99, line: 189, baseType: !246, size: 128, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !251, file: !99, line: 189, baseType: !97, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !251, file: !99, line: 189, baseType: !261, size: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !263)
!263 = !{!264, !265, !266, !267, !275, !290, !323, !324, !325, !326, !327, !328}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !262, file: !6, line: 481, baseType: !93, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !262, file: !6, line: 482, baseType: !261, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !6, line: 483, baseType: !261, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !262, file: !6, line: 484, baseType: !268, size: 64, offset: 192)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !270)
!270 = !{!271, !272, !273, !274}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !269, file: !6, line: 498, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !6, line: 499, baseType: !268, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !269, file: !6, line: 500, baseType: !261, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !269, file: !6, line: 501, baseType: !15, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !262, file: !6, line: 485, baseType: !276, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !278)
!278 = !{!279, !284, !285, !286, !287, !288, !289}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !277, file: !6, line: 467, baseType: !280, size: 128)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !281)
!281 = !{!282, !283}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !280, file: !6, line: 460, baseType: !47, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !280, file: !6, line: 461, baseType: !24, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !277, file: !6, line: 468, baseType: !280, size: 128, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !277, file: !6, line: 469, baseType: !20, size: 16, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !277, file: !6, line: 470, baseType: !47, size: 8, offset: 272)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !277, file: !6, line: 471, baseType: !47, size: 8, offset: 280)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !277, file: !6, line: 472, baseType: !47, size: 8, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !277, file: !6, line: 473, baseType: !47, size: 8, offset: 296)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !262, file: !6, line: 486, baseType: !291, size: 64, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !293)
!293 = !{!294, !318, !319, !320, !321, !322}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !292, file: !6, line: 449, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !296)
!296 = !{!297, !298, !312}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !295, file: !6, line: 439, baseType: !93, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !295, file: !6, line: 440, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !301)
!301 = !{!302, !308, !309, !310, !311}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !300, file: !6, line: 420, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !14, line: 1049, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!15, !307, !15, !19}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !14, line: 424, baseType: !19)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !300, file: !6, line: 421, baseType: !19, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !300, file: !6, line: 422, baseType: !93, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !300, file: !6, line: 423, baseType: !47, size: 8, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !300, file: !6, line: 424, baseType: !47, size: 8, offset: 200)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !295, file: !6, line: 441, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !315)
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !314, file: !6, line: 430, baseType: !93, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !6, line: 431, baseType: !313, size: 64, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !292, file: !6, line: 450, baseType: !276, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !6, line: 451, baseType: !47, size: 8, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !292, file: !6, line: 452, baseType: !47, size: 8, offset: 136)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !292, file: !6, line: 453, baseType: !47, size: 8, offset: 144)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !292, file: !6, line: 454, baseType: !47, size: 8, offset: 152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !262, file: !6, line: 487, baseType: !24, size: 64, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !262, file: !6, line: 488, baseType: !15, size: 32, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !262, file: !6, line: 489, baseType: !20, size: 16, offset: 480)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !262, file: !6, line: 490, baseType: !20, size: 16, offset: 496)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !262, file: !6, line: 491, baseType: !47, size: 8, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !262, file: !6, line: 492, baseType: !47, size: 8, offset: 520)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !98, file: !99, line: 379, baseType: !330, size: 384)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !99, line: 192, size: 384, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !330, file: !99, line: 193, baseType: !97, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !330, file: !99, line: 193, baseType: !47, size: 8, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !99, line: 193, baseType: !47, size: 8, offset: 72)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !330, file: !99, line: 193, baseType: !20, size: 16, offset: 80)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !99, line: 193, baseType: !47, size: 8, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !330, file: !99, line: 193, baseType: !246, size: 128, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !330, file: !99, line: 193, baseType: !97, size: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !330, file: !99, line: 193, baseType: !15, size: 32, offset: 320)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !330, file: !99, line: 194, baseType: !15, size: 32, offset: 352)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !98, file: !99, line: 380, baseType: !342, size: 384)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !99, line: 197, size: 384, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !342, file: !99, line: 198, baseType: !97, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !342, file: !99, line: 198, baseType: !47, size: 8, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !99, line: 198, baseType: !47, size: 8, offset: 72)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !342, file: !99, line: 198, baseType: !20, size: 16, offset: 80)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !342, file: !99, line: 198, baseType: !47, size: 8, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !342, file: !99, line: 200, baseType: !47, size: 8, offset: 104)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !342, file: !99, line: 201, baseType: !47, size: 8, offset: 112)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !342, file: !99, line: 202, baseType: !246, size: 128, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !342, file: !99, line: 202, baseType: !97, size: 64, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !342, file: !99, line: 202, baseType: !354, size: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !14, line: 128, baseType: !24)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !98, file: !99, line: 381, baseType: !356, size: 320)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !99, line: 205, size: 320, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !356, file: !99, line: 206, baseType: !97, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !356, file: !99, line: 206, baseType: !47, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !356, file: !99, line: 206, baseType: !47, size: 8, offset: 72)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !356, file: !99, line: 206, baseType: !20, size: 16, offset: 80)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !99, line: 206, baseType: !47, size: 8, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !356, file: !99, line: 206, baseType: !246, size: 128, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !356, file: !99, line: 206, baseType: !97, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !98, file: !99, line: 382, baseType: !366, size: 384)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !99, line: 233, size: 384, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !366, file: !99, line: 234, baseType: !97, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 72)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !366, file: !99, line: 234, baseType: !20, size: 16, offset: 80)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 104)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 120)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !366, file: !99, line: 234, baseType: !93, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !366, file: !99, line: 234, baseType: !15, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !366, file: !99, line: 234, baseType: !15, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !366, file: !99, line: 234, baseType: !15, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 288)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !366, file: !99, line: 234, baseType: !47, size: 8, offset: 296)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !366, file: !99, line: 234, baseType: !97, size: 64, offset: 320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !98, file: !99, line: 383, baseType: !384, size: 576)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !99, line: 237, size: 576, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !384, file: !99, line: 238, baseType: !97, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 72)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !384, file: !99, line: 238, baseType: !20, size: 16, offset: 80)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 104)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 112)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 120)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !384, file: !99, line: 238, baseType: !93, size: 64, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !384, file: !99, line: 238, baseType: !15, size: 32, offset: 192)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !384, file: !99, line: 238, baseType: !15, size: 32, offset: 224)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !384, file: !99, line: 238, baseType: !15, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 288)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !384, file: !99, line: 238, baseType: !47, size: 8, offset: 296)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !384, file: !99, line: 238, baseType: !20, size: 16, offset: 304)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !384, file: !99, line: 239, baseType: !97, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !384, file: !99, line: 240, baseType: !66, size: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !384, file: !99, line: 241, baseType: !20, size: 16, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !384, file: !99, line: 242, baseType: !66, size: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !98, file: !99, line: 384, baseType: !406, size: 384)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !99, line: 262, size: 384, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !406, file: !99, line: 263, baseType: !97, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 72)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !406, file: !99, line: 263, baseType: !20, size: 16, offset: 80)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 104)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 112)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 120)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !406, file: !99, line: 263, baseType: !93, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !406, file: !99, line: 263, baseType: !15, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !406, file: !99, line: 263, baseType: !15, size: 32, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !406, file: !99, line: 263, baseType: !15, size: 32, offset: 256)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 296)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !406, file: !99, line: 263, baseType: !47, size: 8, offset: 304)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !406, file: !99, line: 264, baseType: !97, size: 64, offset: 320)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !98, file: !99, line: 385, baseType: !425, size: 448)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !99, line: 245, size: 448, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !425, file: !99, line: 246, baseType: !97, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 72)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !425, file: !99, line: 246, baseType: !20, size: 16, offset: 80)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 104)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 112)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 120)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !425, file: !99, line: 246, baseType: !93, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !425, file: !99, line: 246, baseType: !15, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !425, file: !99, line: 246, baseType: !15, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !425, file: !99, line: 246, baseType: !15, size: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !425, file: !99, line: 246, baseType: !47, size: 8, offset: 296)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !425, file: !99, line: 246, baseType: !97, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !425, file: !99, line: 247, baseType: !97, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !98, file: !99, line: 386, baseType: !444, size: 448)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !99, line: 250, size: 448, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !444, file: !99, line: 251, baseType: !97, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 72)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !444, file: !99, line: 251, baseType: !20, size: 16, offset: 80)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 104)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 120)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !444, file: !99, line: 251, baseType: !93, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !444, file: !99, line: 251, baseType: !15, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !444, file: !99, line: 251, baseType: !15, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !444, file: !99, line: 251, baseType: !15, size: 32, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !444, file: !99, line: 251, baseType: !47, size: 8, offset: 296)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !444, file: !99, line: 256, baseType: !97, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !444, file: !99, line: 257, baseType: !97, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !98, file: !99, line: 387, baseType: !463, size: 512)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !99, line: 273, size: 512, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !477, !478}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !463, file: !99, line: 274, baseType: !97, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !463, file: !99, line: 274, baseType: !47, size: 8, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !99, line: 274, baseType: !47, size: 8, offset: 72)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !463, file: !99, line: 274, baseType: !20, size: 16, offset: 80)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !463, file: !99, line: 274, baseType: !47, size: 8, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !463, file: !99, line: 274, baseType: !93, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !463, file: !99, line: 275, baseType: !15, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !463, file: !99, line: 276, baseType: !473, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !14, line: 1052, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !307, !15, !19}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !463, file: !99, line: 277, baseType: !19, size: 64, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !99, line: 278, baseType: !246, size: 128, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !98, file: !99, line: 388, baseType: !480, size: 512)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !99, line: 281, size: 512, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487, !488, !489, !495, !496, !497, !503, !504}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !480, file: !99, line: 282, baseType: !97, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !480, file: !99, line: 282, baseType: !47, size: 8, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !99, line: 282, baseType: !47, size: 8, offset: 72)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !480, file: !99, line: 282, baseType: !20, size: 16, offset: 80)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !480, file: !99, line: 282, baseType: !47, size: 8, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !480, file: !99, line: 282, baseType: !47, size: 8, offset: 104)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !480, file: !99, line: 283, baseType: !47, size: 8, offset: 112)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !480, file: !99, line: 284, baseType: !490, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !14, line: 1084, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DISubroutineType(types: !493)
!493 = !{!13, !15, !235, !15, !494, !19, !19}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !480, file: !99, line: 285, baseType: !93, size: 64, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !480, file: !99, line: 286, baseType: !19, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !480, file: !99, line: 287, baseType: !498, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !14, line: 1102, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!13, !307, !15, !19, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !480, file: !99, line: 288, baseType: !97, size: 64, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !99, line: 289, baseType: !97, size: 64, offset: 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !98, file: !99, line: 389, baseType: !506, size: 512)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !99, line: 307, size: 512, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !506, file: !99, line: 308, baseType: !97, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !506, file: !99, line: 308, baseType: !47, size: 8, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !99, line: 308, baseType: !47, size: 8, offset: 72)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !506, file: !99, line: 308, baseType: !20, size: 16, offset: 80)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !506, file: !99, line: 308, baseType: !47, size: 8, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !506, file: !99, line: 308, baseType: !47, size: 8, offset: 104)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !506, file: !99, line: 309, baseType: !47, size: 8, offset: 112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !506, file: !99, line: 310, baseType: !47, size: 8, offset: 120)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !506, file: !99, line: 311, baseType: !19, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !506, file: !99, line: 312, baseType: !93, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !506, file: !99, line: 313, baseType: !156, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !506, file: !99, line: 314, baseType: !66, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !506, file: !99, line: 315, baseType: !66, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !506, file: !99, line: 316, baseType: !15, size: 32, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !98, file: !99, line: 390, baseType: !523, size: 448)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !99, line: 340, size: 448, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !523, file: !99, line: 341, baseType: !97, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !523, file: !99, line: 341, baseType: !47, size: 8, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !99, line: 341, baseType: !47, size: 8, offset: 72)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !523, file: !99, line: 341, baseType: !20, size: 16, offset: 80)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !523, file: !99, line: 341, baseType: !47, size: 8, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !523, file: !99, line: 341, baseType: !93, size: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !523, file: !99, line: 342, baseType: !93, size: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !523, file: !99, line: 343, baseType: !19, size: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !523, file: !99, line: 344, baseType: !66, size: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !523, file: !99, line: 345, baseType: !15, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !98, file: !99, line: 391, baseType: !536, size: 256)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !99, line: 350, size: 256, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !548}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !536, file: !99, line: 351, baseType: !97, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !536, file: !99, line: 351, baseType: !47, size: 8, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !536, file: !99, line: 351, baseType: !47, size: 8, offset: 72)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !536, file: !99, line: 351, baseType: !20, size: 16, offset: 80)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !536, file: !99, line: 351, baseType: !47, size: 8, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !536, file: !99, line: 351, baseType: !544, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !14, line: 1055, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !307, !19}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !536, file: !99, line: 352, baseType: !19, size: 64, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !98, file: !99, line: 392, baseType: !550, size: 192)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !99, line: 357, size: 192, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !550, file: !99, line: 358, baseType: !97, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !550, file: !99, line: 358, baseType: !47, size: 8, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !99, line: 358, baseType: !47, size: 8, offset: 72)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !550, file: !99, line: 358, baseType: !20, size: 16, offset: 80)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !550, file: !99, line: 358, baseType: !47, size: 8, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !550, file: !99, line: 358, baseType: !97, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !98, file: !99, line: 399, baseType: !94, size: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !94, file: !6, line: 135, baseType: !47, size: 8, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !6, line: 136, baseType: !47, size: 8, offset: 72)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !6, line: 137, baseType: !20, size: 16, offset: 80)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !94, file: !6, line: 138, baseType: !563, size: 32, offset: 96)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !564, line: 327, size: 32, elements: !565)
!564 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !563, file: !564, line: 328, baseType: !15, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !563, file: !564, line: 329, baseType: !568, size: 32)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 4)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !94, file: !6, line: 139, baseType: !93, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !94, file: !6, line: 140, baseType: !93, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !94, file: !6, line: 141, baseType: !93, size: 64, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !94, file: !6, line: 142, baseType: !56, size: 16, offset: 320)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !84, file: !6, line: 829, baseType: !576, size: 64, offset: 320)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !576, file: !6, line: 717, baseType: !24, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !576, file: !6, line: 718, baseType: !15, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !576, file: !6, line: 719, baseType: !131, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !576, file: !6, line: 720, baseType: !66, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !576, file: !6, line: 721, baseType: !131, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !576, file: !6, line: 722, baseType: !80, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !84, file: !6, line: 829, baseType: !47, size: 8, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !81, file: !6, line: 877, baseType: !586, size: 640)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !586, file: !6, line: 836, baseType: !80, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !586, file: !6, line: 836, baseType: !47, size: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !6, line: 836, baseType: !47, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !586, file: !6, line: 836, baseType: !20, size: 16, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !586, file: !6, line: 836, baseType: !66, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !586, file: !6, line: 836, baseType: !80, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !586, file: !6, line: 836, baseType: !93, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !586, file: !6, line: 836, baseType: !576, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !586, file: !6, line: 836, baseType: !47, size: 8, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !586, file: !6, line: 836, baseType: !131, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !6, line: 837, baseType: !66, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !586, file: !6, line: 838, baseType: !15, size: 32, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !586, file: !6, line: 839, baseType: !15, size: 32, offset: 608)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !81, file: !6, line: 878, baseType: !602, size: 1600)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !602, file: !6, line: 847, baseType: !80, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !602, file: !6, line: 847, baseType: !47, size: 8, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !6, line: 847, baseType: !47, size: 8, offset: 72)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !602, file: !6, line: 847, baseType: !20, size: 16, offset: 80)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !602, file: !6, line: 847, baseType: !66, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !6, line: 847, baseType: !80, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !602, file: !6, line: 847, baseType: !93, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !602, file: !6, line: 847, baseType: !576, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !602, file: !6, line: 847, baseType: !47, size: 8, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !602, file: !6, line: 847, baseType: !80, size: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !602, file: !6, line: 848, baseType: !80, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !602, file: !6, line: 849, baseType: !131, size: 64, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !602, file: !6, line: 850, baseType: !47, size: 8, offset: 640)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !602, file: !6, line: 851, baseType: !131, size: 64, offset: 704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !602, file: !6, line: 852, baseType: !131, size: 64, offset: 768)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !602, file: !6, line: 853, baseType: !131, size: 64, offset: 832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !602, file: !6, line: 854, baseType: !568, size: 32, offset: 896)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !602, file: !6, line: 855, baseType: !15, size: 32, offset: 928)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !602, file: !6, line: 856, baseType: !15, size: 32, offset: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !602, file: !6, line: 857, baseType: !15, size: 32, offset: 992)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !602, file: !6, line: 858, baseType: !15, size: 32, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !602, file: !6, line: 859, baseType: !15, size: 32, offset: 1056)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !602, file: !6, line: 860, baseType: !15, size: 32, offset: 1088)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !602, file: !6, line: 861, baseType: !15, size: 32, offset: 1120)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !602, file: !6, line: 862, baseType: !15, size: 32, offset: 1152)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !602, file: !6, line: 863, baseType: !15, size: 32, offset: 1184)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !602, file: !6, line: 864, baseType: !15, size: 32, offset: 1216)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !602, file: !6, line: 865, baseType: !15, size: 32, offset: 1248)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !602, file: !6, line: 866, baseType: !15, size: 32, offset: 1280)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !602, file: !6, line: 867, baseType: !15, size: 32, offset: 1312)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !602, file: !6, line: 868, baseType: !20, size: 16, offset: 1344)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !602, file: !6, line: 869, baseType: !47, size: 8, offset: 1360)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !602, file: !6, line: 870, baseType: !47, size: 8, offset: 1368)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !602, file: !6, line: 871, baseType: !47, size: 8, offset: 1376)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !602, file: !6, line: 872, baseType: !639, size: 160, offset: 1384)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 160, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 20)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !72, file: !6, line: 900, baseType: !93, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !72, file: !6, line: 901, baseType: !644, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !646)
!646 = !{!647, !655, !668, !677, !686, !699, !713, !714, !726}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !645, file: !6, line: 664, baseType: !648, size: 128)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !649)
!649 = !{!650, !651, !652, !653, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !6, line: 568, baseType: !19, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !648, file: !6, line: 568, baseType: !47, size: 8, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !6, line: 568, baseType: !47, size: 8, offset: 72)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !648, file: !6, line: 568, baseType: !20, size: 16, offset: 80)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !648, file: !6, line: 568, baseType: !20, size: 16, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !645, file: !6, line: 665, baseType: !656, size: 384)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !6, line: 594, baseType: !19, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !656, file: !6, line: 594, baseType: !47, size: 8, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !6, line: 594, baseType: !47, size: 8, offset: 72)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !656, file: !6, line: 594, baseType: !20, size: 16, offset: 80)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !656, file: !6, line: 594, baseType: !20, size: 16, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !656, file: !6, line: 594, baseType: !20, size: 16, offset: 112)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !656, file: !6, line: 595, baseType: !80, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !656, file: !6, line: 596, baseType: !66, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !656, file: !6, line: 597, baseType: !66, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !656, file: !6, line: 598, baseType: !24, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !645, file: !6, line: 666, baseType: !669, size: 192)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !6, line: 574, baseType: !19, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !669, file: !6, line: 574, baseType: !47, size: 8, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !669, file: !6, line: 574, baseType: !47, size: 8, offset: 72)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !669, file: !6, line: 574, baseType: !20, size: 16, offset: 80)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !669, file: !6, line: 574, baseType: !20, size: 16, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !669, file: !6, line: 574, baseType: !97, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !645, file: !6, line: 667, baseType: !678, size: 192)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !678, file: !6, line: 605, baseType: !19, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !678, file: !6, line: 605, baseType: !47, size: 8, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !6, line: 605, baseType: !47, size: 8, offset: 72)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !678, file: !6, line: 605, baseType: !20, size: 16, offset: 80)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !678, file: !6, line: 605, baseType: !20, size: 16, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !678, file: !6, line: 605, baseType: !93, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !645, file: !6, line: 668, baseType: !687, size: 448)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !687, file: !6, line: 609, baseType: !19, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !687, file: !6, line: 609, baseType: !47, size: 8, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !687, file: !6, line: 609, baseType: !47, size: 8, offset: 72)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !687, file: !6, line: 609, baseType: !20, size: 16, offset: 80)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !687, file: !6, line: 609, baseType: !20, size: 16, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !687, file: !6, line: 609, baseType: !15, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !687, file: !6, line: 610, baseType: !80, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !687, file: !6, line: 611, baseType: !66, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !687, file: !6, line: 612, baseType: !66, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !687, file: !6, line: 613, baseType: !15, size: 32, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !645, file: !6, line: 669, baseType: !700, size: 512)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !6, line: 581, baseType: !19, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !700, file: !6, line: 581, baseType: !47, size: 8, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !700, file: !6, line: 581, baseType: !47, size: 8, offset: 72)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !700, file: !6, line: 581, baseType: !20, size: 16, offset: 80)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !700, file: !6, line: 581, baseType: !20, size: 16, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !700, file: !6, line: 581, baseType: !15, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !700, file: !6, line: 582, baseType: !97, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !700, file: !6, line: 583, baseType: !97, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !700, file: !6, line: 584, baseType: !41, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !700, file: !6, line: 585, baseType: !19, size: 64, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !700, file: !6, line: 586, baseType: !15, size: 32, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !645, file: !6, line: 670, baseType: !207, size: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !645, file: !6, line: 671, baseType: !715, size: 640)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !6, line: 632, baseType: !19, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !6, line: 632, baseType: !47, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !6, line: 632, baseType: !47, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !6, line: 632, baseType: !20, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !715, file: !6, line: 632, baseType: !20, size: 16, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !715, file: !6, line: 633, baseType: !723, size: 512, offset: 128)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 512, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !645, file: !6, line: 672, baseType: !727, size: 320)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !727, file: !6, line: 655, baseType: !19, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !727, file: !6, line: 655, baseType: !47, size: 8, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !727, file: !6, line: 655, baseType: !47, size: 8, offset: 72)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !727, file: !6, line: 655, baseType: !20, size: 16, offset: 80)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !727, file: !6, line: 655, baseType: !20, size: 16, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !727, file: !6, line: 655, baseType: !47, size: 8, offset: 112)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !727, file: !6, line: 656, baseType: !93, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !727, file: !6, line: 657, baseType: !97, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !727, file: !6, line: 658, baseType: !738, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !739, file: !6, line: 646, baseType: !473, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !739, file: !6, line: 647, baseType: !19, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !72, file: !6, line: 902, baseType: !80, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !72, file: !6, line: 903, baseType: !15, size: 32, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !42, file: !43, line: 61, baseType: !15, size: 32, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !42, file: !43, line: 62, baseType: !15, size: 32, offset: 1120)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !42, file: !43, line: 63, baseType: !20, size: 16, offset: 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !42, file: !43, line: 64, baseType: !47, size: 8, offset: 1168)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !42, file: !43, line: 66, baseType: !750, size: 2688, offset: 1216)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2688, elements: !31)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !42, file: !43, line: 67, baseType: !752, size: 3072, offset: 3904)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 3072, elements: !724)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !42, file: !43, line: 68, baseType: !754, size: 576, offset: 6976)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 576, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 9)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !42, file: !43, line: 69, baseType: !156, size: 64, offset: 7552)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !42, file: !43, line: 71, baseType: !66, size: 64, offset: 7616)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !42, file: !43, line: 72, baseType: !156, size: 64, offset: 7680)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !42, file: !43, line: 73, baseType: !644, size: 64, offset: 7744)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !42, file: !43, line: 74, baseType: !93, size: 64, offset: 7808)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !42, file: !43, line: 75, baseType: !97, size: 64, offset: 7872)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !42, file: !43, line: 76, baseType: !93, size: 64, offset: 7936)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !42, file: !43, line: 77, baseType: !80, size: 64, offset: 8000)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !42, file: !43, line: 78, baseType: !97, size: 64, offset: 8064)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !42, file: !43, line: 79, baseType: !93, size: 64, offset: 8128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !42, file: !43, line: 80, baseType: !131, size: 64, offset: 8192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !42, file: !43, line: 81, baseType: !80, size: 64, offset: 8256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !42, file: !43, line: 82, baseType: !770, size: 64, offset: 8320)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !773)
!773 = !{!774, !775, !776, !777, !778, !779}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !772, file: !6, line: 706, baseType: !15, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !772, file: !6, line: 707, baseType: !15, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !772, file: !6, line: 708, baseType: !20, size: 16, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !772, file: !6, line: 709, baseType: !47, size: 8, offset: 80)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !772, file: !6, line: 710, baseType: !47, size: 8, offset: 88)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !6, line: 711, baseType: !47, size: 8, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !42, file: !43, line: 83, baseType: !80, size: 64, offset: 8384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !42, file: !43, line: 84, baseType: !97, size: 64, offset: 8448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !42, file: !43, line: 85, baseType: !644, size: 64, offset: 8512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !42, file: !43, line: 86, baseType: !97, size: 64, offset: 8576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !42, file: !43, line: 87, baseType: !644, size: 64, offset: 8640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !42, file: !43, line: 88, baseType: !80, size: 64, offset: 8704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !42, file: !43, line: 89, baseType: !80, size: 64, offset: 8768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !42, file: !43, line: 90, baseType: !206, size: 64, offset: 8832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !42, file: !43, line: 91, baseType: !789, size: 64, offset: 8896)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!13, !41, !793}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !42, file: !43, line: 92, baseType: !795, size: 64, offset: 8960)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !188)
!796 = !{}
!797 = !DILocalVariable(name: "walk_state", arg: 1, scope: !38, file: !3, line: 221, type: !41)
!798 = !DILocation(line: 221, column: 56, scope: !38)
!799 = !DILocalVariable(name: "status", scope: !38, file: !3, line: 223, type: !13)
!800 = !DILocation(line: 223, column: 14, scope: !38)
!801 = !DILocalVariable(name: "op", scope: !38, file: !3, line: 224, type: !80)
!802 = !DILocation(line: 224, column: 27, scope: !38)
!803 = !DILocalVariable(name: "parser_state", scope: !38, file: !3, line: 225, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!805 = !DILocation(line: 225, column: 27, scope: !38)
!806 = !DILocalVariable(name: "aml_op_start", scope: !38, file: !3, line: 226, type: !66)
!807 = !DILocation(line: 226, column: 6, scope: !38)
!808 = !DILocalVariable(name: "opcode_length", scope: !38, file: !3, line: 227, type: !47)
!809 = !DILocation(line: 227, column: 5, scope: !38)
!810 = !DILocation(line: 231, column: 6, scope: !811)
!811 = distinct !DILexicalBlock(scope: !38, file: !3, line: 231, column: 6)
!812 = !DILocation(line: 231, column: 18, scope: !811)
!813 = !DILocation(line: 231, column: 38, scope: !811)
!814 = !DILocation(line: 231, column: 6, scope: !38)
!815 = !DILocation(line: 232, column: 3, scope: !816)
!816 = distinct !DILexicalBlock(scope: !811, file: !3, line: 231, column: 47)
!817 = !DILocation(line: 235, column: 18, scope: !38)
!818 = !DILocation(line: 235, column: 30, scope: !38)
!819 = !DILocation(line: 235, column: 15, scope: !38)
!820 = !DILocation(line: 236, column: 2, scope: !38)
!821 = !DILocation(line: 236, column: 14, scope: !38)
!822 = !DILocation(line: 236, column: 24, scope: !38)
!823 = !DILocation(line: 240, column: 6, scope: !824)
!824 = distinct !DILexicalBlock(scope: !38, file: !3, line: 240, column: 6)
!825 = !DILocation(line: 240, column: 18, scope: !824)
!826 = !DILocation(line: 240, column: 28, scope: !824)
!827 = !DILocation(line: 240, column: 6, scope: !38)
!828 = !DILocation(line: 244, column: 35, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !3, line: 244, column: 7)
!830 = distinct !DILexicalBlock(scope: !824, file: !3, line: 240, column: 56)
!831 = !DILocation(line: 244, column: 7, scope: !829)
!832 = !DILocation(line: 244, column: 7, scope: !830)
!833 = !DILocation(line: 249, column: 9, scope: !834)
!834 = distinct !DILexicalBlock(scope: !835, file: !3, line: 249, column: 8)
!835 = distinct !DILexicalBlock(scope: !829, file: !3, line: 244, column: 50)
!836 = !DILocation(line: 249, column: 23, scope: !834)
!837 = !DILocation(line: 249, column: 30, scope: !834)
!838 = !DILocation(line: 249, column: 42, scope: !834)
!839 = !DILocation(line: 249, column: 8, scope: !834)
!840 = !DILocation(line: 249, column: 46, scope: !834)
!841 = !DILocation(line: 250, column: 10, scope: !834)
!842 = !DILocation(line: 250, column: 24, scope: !834)
!843 = !DILocation(line: 250, column: 31, scope: !834)
!844 = !DILocation(line: 250, column: 43, scope: !834)
!845 = !DILocation(line: 250, column: 47, scope: !834)
!846 = !DILocation(line: 251, column: 10, scope: !834)
!847 = !DILocation(line: 251, column: 21, scope: !834)
!848 = !DILocation(line: 252, column: 9, scope: !834)
!849 = !DILocation(line: 252, column: 13, scope: !834)
!850 = !DILocation(line: 252, column: 27, scope: !834)
!851 = !DILocation(line: 252, column: 34, scope: !834)
!852 = !DILocation(line: 252, column: 46, scope: !834)
!853 = !DILocation(line: 252, column: 50, scope: !834)
!854 = !DILocation(line: 253, column: 6, scope: !834)
!855 = !DILocation(line: 253, column: 17, scope: !834)
!856 = !DILocation(line: 254, column: 8, scope: !834)
!857 = !DILocation(line: 254, column: 12, scope: !834)
!858 = !DILocation(line: 254, column: 24, scope: !834)
