; ModuleID = '../bcout/drivers/acpi/acpica/psobject.llvm.bc'
source_filename = "drivers/acpi/acpica/psobject.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_walk_state = type { %struct.acpi_walk_state*, i8, i8, i16, i8, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8*, i32, i32, i32, i32, %struct.acpi_parse_state, i32, i32, i16, i8, [7 x %struct.acpi_namespace_node], [8 x %struct.acpi_namespace_node], [9 x %union.acpi_operand_object*], %union.acpi_operand_object**, i8*, %union.acpi_operand_object**, %union.acpi_generic_state*, %struct.acpi_namespace_node*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, %union.acpi_parse_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8*, %union.acpi_parse_object*, %struct.acpi_opcode_info*, %union.acpi_parse_object*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_parse_object*, %union.acpi_parse_object*, %struct.acpi_thread_state*, i32 (%struct.acpi_walk_state*, %union.acpi_parse_object**)*, i32 (%struct.acpi_walk_state*)* }
%struct.acpi_parse_state = type { i8*, i8*, i8*, i8*, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_generic_state*, %union.acpi_parse_object*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 18, type: !26, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/psobject.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !8, !13, !16, !17, !21}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !15)
!15 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !7, line: 127, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !20)
!20 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !24)
!24 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!25 = !{!0}
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 72, elements: !29)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !{!30}
!30 = !DISubrange(count: 9)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 2}
!34 = !{i32 1, !"Code Model", i32 2}
!35 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!36 = distinct !DISubprogram(name: "acpi_ps_build_named_op", scope: !3, file: !3, line: 154, type: !37, scopeLine: 158, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!37 = !DISubroutineType(types: !38)
!38 = !{!6, !39, !21, !75, !790}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !41, line: 37, size: 9024, elements: !42)
!41 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !742, !743, !744, !745, !746, !750, !752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !777, !778, !779, !780, !781, !782, !783, !784, !785, !791}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !41, line: 38, baseType: !39, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !40, file: !41, line: 39, baseType: !22, size: 8, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !40, file: !41, line: 40, baseType: !22, size: 8, offset: 72)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !40, file: !41, line: 41, baseType: !13, size: 16, offset: 80)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !40, file: !41, line: 42, baseType: !22, size: 8, offset: 96)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !40, file: !41, line: 43, baseType: !22, size: 8, offset: 104)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !40, file: !41, line: 44, baseType: !22, size: 8, offset: 112)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !40, file: !41, line: 45, baseType: !51, size: 16, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !7, line: 445, baseType: !13)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !40, file: !41, line: 46, baseType: !22, size: 8, offset: 144)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !40, file: !41, line: 47, baseType: !22, size: 8, offset: 152)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !40, file: !41, line: 48, baseType: !22, size: 8, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !40, file: !41, line: 49, baseType: !22, size: 8, offset: 168)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !40, file: !41, line: 50, baseType: !22, size: 8, offset: 176)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !40, file: !41, line: 51, baseType: !22, size: 8, offset: 184)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !40, file: !41, line: 52, baseType: !22, size: 8, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !40, file: !41, line: 53, baseType: !22, size: 8, offset: 200)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !40, file: !41, line: 54, baseType: !21, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !40, file: !41, line: 55, baseType: !8, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !40, file: !41, line: 56, baseType: !8, size: 32, offset: 352)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !40, file: !41, line: 57, baseType: !8, size: 32, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !40, file: !41, line: 58, baseType: !8, size: 32, offset: 416)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !40, file: !41, line: 60, baseType: !66, size: 640, offset: 448)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !67, line: 893, size: 640, elements: !68)
!67 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !70, !71, !72, !73, !74, !639, !640, !740, !741}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !66, file: !67, line: 894, baseType: !21, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !66, file: !67, line: 895, baseType: !21, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !66, file: !67, line: 896, baseType: !21, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !66, file: !67, line: 897, baseType: !21, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !66, file: !67, line: 898, baseType: !21, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !66, file: !67, line: 899, baseType: !75, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !67, line: 875, size: 1600, elements: !77)
!77 = !{!78, !582, !598}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !76, file: !67, line: 876, baseType: !79, size: 448)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !67, line: 828, size: 448, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86, !87, !572, !581}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !79, file: !67, line: 829, baseType: !75, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !79, file: !67, line: 829, baseType: !22, size: 8, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !67, line: 829, baseType: !22, size: 8, offset: 72)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !79, file: !67, line: 829, baseType: !13, size: 16, offset: 80)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !79, file: !67, line: 829, baseType: !21, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !79, file: !67, line: 829, baseType: !75, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !79, file: !67, line: 829, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !67, line: 133, size: 384, elements: !90)
!90 = !{!91, !556, !557, !558, !559, !568, !569, !570, !571}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !89, file: !67, line: 134, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !94, line: 367, size: 576, elements: !95)
!94 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!95 = !{!96, !104, !117, !128, !141, !155, !164, !190, !219, !234, !247, !326, !338, !352, !362, !380, !402, !421, !440, !459, !476, !502, !519, !532, !546, !555}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !93, file: !94, line: 368, baseType: !97, size: 128)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !94, line: 73, size: 128, elements: !98)
!98 = !{!99, !100, !101, !102, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !97, file: !94, line: 74, baseType: !92, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !97, file: !94, line: 74, baseType: !22, size: 8, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !94, line: 74, baseType: !22, size: 8, offset: 72)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !97, file: !94, line: 74, baseType: !13, size: 16, offset: 80)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !97, file: !94, line: 74, baseType: !22, size: 8, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !93, file: !94, line: 369, baseType: !105, size: 192)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !94, line: 76, size: 192, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !116}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !105, file: !94, line: 77, baseType: !92, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !105, file: !94, line: 77, baseType: !22, size: 8, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !94, line: 77, baseType: !22, size: 8, offset: 72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !105, file: !94, line: 77, baseType: !13, size: 16, offset: 80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !94, line: 77, baseType: !22, size: 8, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !105, file: !94, line: 77, baseType: !113, size: 24, offset: 104)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 24, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !94, line: 78, baseType: !18, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !93, file: !94, line: 370, baseType: !118, size: 256)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !94, line: 93, size: 256, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !118, file: !94, line: 94, baseType: !92, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !118, file: !94, line: 94, baseType: !22, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !94, line: 94, baseType: !22, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !118, file: !94, line: 94, baseType: !13, size: 16, offset: 80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !94, line: 94, baseType: !22, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !118, file: !94, line: 94, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !94, line: 94, baseType: !8, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !93, file: !94, line: 371, baseType: !129, size: 384)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !94, line: 97, size: 384, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !129, file: !94, line: 98, baseType: !92, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !129, file: !94, line: 98, baseType: !22, size: 8, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !129, file: !94, line: 98, baseType: !22, size: 8, offset: 72)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !129, file: !94, line: 98, baseType: !13, size: 16, offset: 80)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !129, file: !94, line: 98, baseType: !22, size: 8, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !129, file: !94, line: 98, baseType: !21, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !129, file: !94, line: 98, baseType: !8, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !129, file: !94, line: 99, baseType: !8, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !129, file: !94, line: 100, baseType: !21, size: 64, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !129, file: !94, line: 101, baseType: !88, size: 64, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !93, file: !94, line: 372, baseType: !142, size: 384)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !94, line: 104, size: 384, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !152, !153, !154}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !142, file: !94, line: 105, baseType: !92, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !142, file: !94, line: 105, baseType: !22, size: 8, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !94, line: 105, baseType: !22, size: 8, offset: 72)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !142, file: !94, line: 105, baseType: !13, size: 16, offset: 80)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !94, line: 105, baseType: !22, size: 8, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !142, file: !94, line: 105, baseType: !88, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !142, file: !94, line: 106, baseType: !151, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !142, file: !94, line: 107, baseType: !21, size: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !142, file: !94, line: 108, baseType: !8, size: 32, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !142, file: !94, line: 109, baseType: !8, size: 32, offset: 352)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !93, file: !94, line: 373, baseType: !156, size: 192)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !94, line: 118, size: 192, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !156, file: !94, line: 119, baseType: !92, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !156, file: !94, line: 119, baseType: !22, size: 8, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !94, line: 119, baseType: !22, size: 8, offset: 72)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !156, file: !94, line: 119, baseType: !13, size: 16, offset: 80)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !156, file: !94, line: 119, baseType: !22, size: 8, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !156, file: !94, line: 119, baseType: !16, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !93, file: !94, line: 374, baseType: !165, size: 448)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !94, line: 143, size: 448, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !187, !188, !189}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !165, file: !94, line: 144, baseType: !92, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !165, file: !94, line: 144, baseType: !22, size: 8, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !165, file: !94, line: 144, baseType: !22, size: 8, offset: 72)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !165, file: !94, line: 144, baseType: !13, size: 16, offset: 80)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !165, file: !94, line: 144, baseType: !22, size: 8, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !165, file: !94, line: 144, baseType: !22, size: 8, offset: 104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !165, file: !94, line: 145, baseType: !22, size: 8, offset: 112)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !165, file: !94, line: 146, baseType: !22, size: 8, offset: 120)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !165, file: !94, line: 147, baseType: !92, size: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !165, file: !94, line: 148, baseType: !92, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !165, file: !94, line: 149, baseType: !21, size: 64, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !165, file: !94, line: 153, baseType: !179, size: 64, offset: 320)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !165, file: !94, line: 150, size: 64, elements: !180)
!180 = !{!181, !186}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !179, file: !94, line: 151, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !67, line: 248, baseType: !183)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!6, !39}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !179, file: !94, line: 152, baseType: !92, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !165, file: !94, line: 155, baseType: !8, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !165, file: !94, line: 156, baseType: !51, size: 16, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !165, file: !94, line: 157, baseType: !22, size: 8, offset: 432)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !93, file: !94, line: 375, baseType: !191, size: 576)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !94, line: 122, size: 576, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !215, !216, !217, !218}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !191, file: !94, line: 123, baseType: !92, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !191, file: !94, line: 123, baseType: !22, size: 8, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !191, file: !94, line: 123, baseType: !22, size: 8, offset: 72)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !191, file: !94, line: 123, baseType: !13, size: 16, offset: 80)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !191, file: !94, line: 123, baseType: !22, size: 8, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !191, file: !94, line: 123, baseType: !22, size: 8, offset: 104)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !191, file: !94, line: 124, baseType: !13, size: 16, offset: 112)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !191, file: !94, line: 125, baseType: !16, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !191, file: !94, line: 126, baseType: !18, size: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !191, file: !94, line: 127, baseType: !203, size: 64, offset: 256)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !67, line: 620, size: 320, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !67, line: 621, baseType: !16, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !204, file: !67, line: 621, baseType: !22, size: 8, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !204, file: !67, line: 621, baseType: !22, size: 8, offset: 72)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !204, file: !67, line: 621, baseType: !13, size: 16, offset: 80)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !204, file: !67, line: 621, baseType: !13, size: 16, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !204, file: !67, line: 621, baseType: !22, size: 8, offset: 112)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !204, file: !67, line: 622, baseType: !39, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !204, file: !67, line: 623, baseType: !92, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !204, file: !67, line: 624, baseType: !18, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !191, file: !94, line: 128, baseType: !92, size: 64, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !191, file: !94, line: 129, baseType: !92, size: 64, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !191, file: !94, line: 130, baseType: !88, size: 64, offset: 448)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !191, file: !94, line: 131, baseType: !22, size: 8, offset: 512)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !93, file: !94, line: 376, baseType: !220, size: 448)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !94, line: 134, size: 448, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !233}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !220, file: !94, line: 135, baseType: !92, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !220, file: !94, line: 135, baseType: !22, size: 8, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !220, file: !94, line: 135, baseType: !22, size: 8, offset: 72)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !220, file: !94, line: 135, baseType: !13, size: 16, offset: 80)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !220, file: !94, line: 135, baseType: !22, size: 8, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !220, file: !94, line: 135, baseType: !22, size: 8, offset: 104)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !94, line: 136, baseType: !88, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !220, file: !94, line: 137, baseType: !92, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !94, line: 138, baseType: !92, size: 64, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !220, file: !94, line: 139, baseType: !232, size: 64, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !18)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !220, file: !94, line: 140, baseType: !8, size: 32, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !93, file: !94, line: 377, baseType: !235, size: 320)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !94, line: 184, size: 320, elements: !236)
!236 = !{!237, !238, !239, !240, !241, !242, !246}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !235, file: !94, line: 185, baseType: !92, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !235, file: !94, line: 185, baseType: !22, size: 8, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !235, file: !94, line: 185, baseType: !22, size: 8, offset: 72)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !235, file: !94, line: 185, baseType: !13, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !235, file: !94, line: 185, baseType: !22, size: 8, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !235, file: !94, line: 185, baseType: !243, size: 128, offset: 128)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 128, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 2)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !235, file: !94, line: 185, baseType: !92, size: 64, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !93, file: !94, line: 378, baseType: !248, size: 384)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !94, line: 187, size: 384, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !248, file: !94, line: 188, baseType: !92, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !248, file: !94, line: 188, baseType: !22, size: 8, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !94, line: 188, baseType: !22, size: 8, offset: 72)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !248, file: !94, line: 188, baseType: !13, size: 16, offset: 80)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !94, line: 188, baseType: !22, size: 8, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !248, file: !94, line: 189, baseType: !243, size: 128, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !248, file: !94, line: 189, baseType: !92, size: 64, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !248, file: !94, line: 189, baseType: !258, size: 64, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !67, line: 480, size: 576, elements: !260)
!260 = !{!261, !262, !263, !264, !272, !287, !320, !321, !322, !323, !324, !325}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !259, file: !67, line: 481, baseType: !88, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !259, file: !67, line: 482, baseType: !258, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !67, line: 483, baseType: !258, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !259, file: !67, line: 484, baseType: !265, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !67, line: 497, size: 256, elements: !267)
!267 = !{!268, !269, !270, !271}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !266, file: !67, line: 498, baseType: !265, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !67, line: 499, baseType: !265, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !266, file: !67, line: 500, baseType: !258, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !266, file: !67, line: 501, baseType: !8, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !259, file: !67, line: 485, baseType: !273, size: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !67, line: 466, size: 320, elements: !275)
!275 = !{!276, !281, !282, !283, !284, !285, !286}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !274, file: !67, line: 467, baseType: !277, size: 128)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !67, line: 459, size: 128, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !277, file: !67, line: 460, baseType: !22, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !277, file: !67, line: 461, baseType: !18, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !274, file: !67, line: 468, baseType: !277, size: 128, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !274, file: !67, line: 469, baseType: !13, size: 16, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !274, file: !67, line: 470, baseType: !22, size: 8, offset: 272)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !274, file: !67, line: 471, baseType: !22, size: 8, offset: 280)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !274, file: !67, line: 472, baseType: !22, size: 8, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !274, file: !67, line: 473, baseType: !22, size: 8, offset: 296)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !259, file: !67, line: 486, baseType: !288, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !67, line: 448, size: 192, elements: !290)
!290 = !{!291, !315, !316, !317, !318, !319}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !289, file: !67, line: 449, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !67, line: 438, size: 64, elements: !293)
!293 = !{!294, !295, !309}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !292, file: !67, line: 439, baseType: !88, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !292, file: !67, line: 440, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !67, line: 419, size: 256, elements: !298)
!298 = !{!299, !305, !306, !307, !308}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !297, file: !67, line: 420, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !7, line: 1049, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!8, !304, !8, !16}
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !7, line: 424, baseType: !16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !297, file: !67, line: 421, baseType: !16, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !297, file: !67, line: 422, baseType: !88, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !297, file: !67, line: 423, baseType: !22, size: 8, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !297, file: !67, line: 424, baseType: !22, size: 8, offset: 200)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !292, file: !67, line: 441, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !67, line: 429, size: 128, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !311, file: !67, line: 430, baseType: !88, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !67, line: 431, baseType: !310, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !289, file: !67, line: 450, baseType: !273, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !67, line: 451, baseType: !22, size: 8, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !289, file: !67, line: 452, baseType: !22, size: 8, offset: 136)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !289, file: !67, line: 453, baseType: !22, size: 8, offset: 144)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !289, file: !67, line: 454, baseType: !22, size: 8, offset: 152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !259, file: !67, line: 487, baseType: !18, size: 64, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !259, file: !67, line: 488, baseType: !8, size: 32, offset: 448)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !259, file: !67, line: 489, baseType: !13, size: 16, offset: 480)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !259, file: !67, line: 490, baseType: !13, size: 16, offset: 496)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !259, file: !67, line: 491, baseType: !22, size: 8, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !259, file: !67, line: 492, baseType: !22, size: 8, offset: 520)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !93, file: !94, line: 379, baseType: !327, size: 384)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !94, line: 192, size: 384, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !327, file: !94, line: 193, baseType: !92, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !327, file: !94, line: 193, baseType: !22, size: 8, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !327, file: !94, line: 193, baseType: !22, size: 8, offset: 72)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !327, file: !94, line: 193, baseType: !13, size: 16, offset: 80)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !327, file: !94, line: 193, baseType: !22, size: 8, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !327, file: !94, line: 193, baseType: !243, size: 128, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !327, file: !94, line: 193, baseType: !92, size: 64, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !327, file: !94, line: 193, baseType: !8, size: 32, offset: 320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !327, file: !94, line: 194, baseType: !8, size: 32, offset: 352)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !93, file: !94, line: 380, baseType: !339, size: 384)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !94, line: 197, size: 384, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !339, file: !94, line: 198, baseType: !92, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !339, file: !94, line: 198, baseType: !22, size: 8, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !339, file: !94, line: 198, baseType: !22, size: 8, offset: 72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !339, file: !94, line: 198, baseType: !13, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !94, line: 198, baseType: !22, size: 8, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !339, file: !94, line: 200, baseType: !22, size: 8, offset: 104)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !339, file: !94, line: 201, baseType: !22, size: 8, offset: 112)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !339, file: !94, line: 202, baseType: !243, size: 128, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !339, file: !94, line: 202, baseType: !92, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !339, file: !94, line: 202, baseType: !351, size: 64, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !7, line: 128, baseType: !18)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !93, file: !94, line: 381, baseType: !353, size: 320)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !94, line: 205, size: 320, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !361}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !353, file: !94, line: 206, baseType: !92, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !353, file: !94, line: 206, baseType: !22, size: 8, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !353, file: !94, line: 206, baseType: !22, size: 8, offset: 72)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !353, file: !94, line: 206, baseType: !13, size: 16, offset: 80)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !353, file: !94, line: 206, baseType: !22, size: 8, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !353, file: !94, line: 206, baseType: !243, size: 128, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !353, file: !94, line: 206, baseType: !92, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !93, file: !94, line: 382, baseType: !363, size: 384)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !94, line: 233, size: 384, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !363, file: !94, line: 234, baseType: !92, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 72)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !363, file: !94, line: 234, baseType: !13, size: 16, offset: 80)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 104)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 112)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 120)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !363, file: !94, line: 234, baseType: !88, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !363, file: !94, line: 234, baseType: !8, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !363, file: !94, line: 234, baseType: !8, size: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !363, file: !94, line: 234, baseType: !8, size: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !363, file: !94, line: 234, baseType: !22, size: 8, offset: 296)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !363, file: !94, line: 234, baseType: !92, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !93, file: !94, line: 383, baseType: !381, size: 576)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !94, line: 237, size: 576, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !381, file: !94, line: 238, baseType: !92, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 72)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !381, file: !94, line: 238, baseType: !13, size: 16, offset: 80)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 104)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 112)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 120)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !381, file: !94, line: 238, baseType: !88, size: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !381, file: !94, line: 238, baseType: !8, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !381, file: !94, line: 238, baseType: !8, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !381, file: !94, line: 238, baseType: !8, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !381, file: !94, line: 238, baseType: !22, size: 8, offset: 296)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !381, file: !94, line: 238, baseType: !13, size: 16, offset: 304)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !381, file: !94, line: 239, baseType: !92, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !381, file: !94, line: 240, baseType: !21, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !381, file: !94, line: 241, baseType: !13, size: 16, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !381, file: !94, line: 242, baseType: !21, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !93, file: !94, line: 384, baseType: !403, size: 384)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !94, line: 262, size: 384, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !403, file: !94, line: 263, baseType: !92, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 72)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !403, file: !94, line: 263, baseType: !13, size: 16, offset: 80)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 104)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 112)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 120)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !403, file: !94, line: 263, baseType: !88, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !403, file: !94, line: 263, baseType: !8, size: 32, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !403, file: !94, line: 263, baseType: !8, size: 32, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !403, file: !94, line: 263, baseType: !8, size: 32, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 288)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 296)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !403, file: !94, line: 263, baseType: !22, size: 8, offset: 304)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !403, file: !94, line: 264, baseType: !92, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !93, file: !94, line: 385, baseType: !422, size: 448)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !94, line: 245, size: 448, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !422, file: !94, line: 246, baseType: !92, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 72)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !422, file: !94, line: 246, baseType: !13, size: 16, offset: 80)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 104)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 112)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 120)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !422, file: !94, line: 246, baseType: !88, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !422, file: !94, line: 246, baseType: !8, size: 32, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !422, file: !94, line: 246, baseType: !8, size: 32, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !422, file: !94, line: 246, baseType: !8, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 288)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !422, file: !94, line: 246, baseType: !22, size: 8, offset: 296)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !422, file: !94, line: 246, baseType: !92, size: 64, offset: 320)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !422, file: !94, line: 247, baseType: !92, size: 64, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !93, file: !94, line: 386, baseType: !441, size: 448)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !94, line: 250, size: 448, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !441, file: !94, line: 251, baseType: !92, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 72)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !441, file: !94, line: 251, baseType: !13, size: 16, offset: 80)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 104)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 112)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !441, file: !94, line: 251, baseType: !88, size: 64, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !441, file: !94, line: 251, baseType: !8, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !441, file: !94, line: 251, baseType: !8, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !441, file: !94, line: 251, baseType: !8, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !441, file: !94, line: 251, baseType: !22, size: 8, offset: 296)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !441, file: !94, line: 256, baseType: !92, size: 64, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !441, file: !94, line: 257, baseType: !92, size: 64, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !93, file: !94, line: 387, baseType: !460, size: 512)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !94, line: 273, size: 512, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !474, !475}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !460, file: !94, line: 274, baseType: !92, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !460, file: !94, line: 274, baseType: !22, size: 8, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !94, line: 274, baseType: !22, size: 8, offset: 72)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !460, file: !94, line: 274, baseType: !13, size: 16, offset: 80)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !94, line: 274, baseType: !22, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !94, line: 274, baseType: !88, size: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !460, file: !94, line: 275, baseType: !8, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !460, file: !94, line: 276, baseType: !470, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !7, line: 1052, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !304, !8, !16}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !460, file: !94, line: 277, baseType: !16, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !94, line: 278, baseType: !243, size: 128, offset: 384)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !93, file: !94, line: 388, baseType: !477, size: 512)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !94, line: 281, size: 512, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !492, !493, !494, !500, !501}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !477, file: !94, line: 282, baseType: !92, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !477, file: !94, line: 282, baseType: !22, size: 8, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !477, file: !94, line: 282, baseType: !22, size: 8, offset: 72)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !477, file: !94, line: 282, baseType: !13, size: 16, offset: 80)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !477, file: !94, line: 282, baseType: !22, size: 8, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !477, file: !94, line: 282, baseType: !22, size: 8, offset: 104)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !477, file: !94, line: 283, baseType: !22, size: 8, offset: 112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !477, file: !94, line: 284, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !7, line: 1084, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!6, !8, !232, !8, !491, !16, !16}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !477, file: !94, line: 285, baseType: !88, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !477, file: !94, line: 286, baseType: !16, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !477, file: !94, line: 287, baseType: !495, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !7, line: 1102, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{!6, !304, !8, !16, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !477, file: !94, line: 288, baseType: !92, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !94, line: 289, baseType: !92, size: 64, offset: 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !93, file: !94, line: 389, baseType: !503, size: 512)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !94, line: 307, size: 512, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !503, file: !94, line: 308, baseType: !92, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !503, file: !94, line: 308, baseType: !22, size: 8, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !94, line: 308, baseType: !22, size: 8, offset: 72)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !503, file: !94, line: 308, baseType: !13, size: 16, offset: 80)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !503, file: !94, line: 308, baseType: !22, size: 8, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !503, file: !94, line: 308, baseType: !22, size: 8, offset: 104)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !503, file: !94, line: 309, baseType: !22, size: 8, offset: 112)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !503, file: !94, line: 310, baseType: !22, size: 8, offset: 120)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !503, file: !94, line: 311, baseType: !16, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !503, file: !94, line: 312, baseType: !88, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !503, file: !94, line: 313, baseType: !151, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !503, file: !94, line: 314, baseType: !21, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !503, file: !94, line: 315, baseType: !21, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !503, file: !94, line: 316, baseType: !8, size: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !93, file: !94, line: 390, baseType: !520, size: 448)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !94, line: 340, size: 448, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !520, file: !94, line: 341, baseType: !92, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !520, file: !94, line: 341, baseType: !22, size: 8, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !520, file: !94, line: 341, baseType: !22, size: 8, offset: 72)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !520, file: !94, line: 341, baseType: !13, size: 16, offset: 80)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !520, file: !94, line: 341, baseType: !22, size: 8, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !520, file: !94, line: 341, baseType: !88, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !520, file: !94, line: 342, baseType: !88, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !520, file: !94, line: 343, baseType: !16, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !520, file: !94, line: 344, baseType: !21, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !520, file: !94, line: 345, baseType: !8, size: 32, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !94, line: 391, baseType: !533, size: 256)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !94, line: 350, size: 256, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !545}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !533, file: !94, line: 351, baseType: !92, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !533, file: !94, line: 351, baseType: !22, size: 8, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !533, file: !94, line: 351, baseType: !22, size: 8, offset: 72)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !533, file: !94, line: 351, baseType: !13, size: 16, offset: 80)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !533, file: !94, line: 351, baseType: !22, size: 8, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !533, file: !94, line: 351, baseType: !541, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !7, line: 1055, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !304, !16}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !533, file: !94, line: 352, baseType: !16, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !93, file: !94, line: 392, baseType: !547, size: 192)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !94, line: 357, size: 192, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !547, file: !94, line: 358, baseType: !92, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !547, file: !94, line: 358, baseType: !22, size: 8, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !547, file: !94, line: 358, baseType: !22, size: 8, offset: 72)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !547, file: !94, line: 358, baseType: !13, size: 16, offset: 80)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !547, file: !94, line: 358, baseType: !22, size: 8, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !94, line: 358, baseType: !92, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !93, file: !94, line: 399, baseType: !89, size: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !89, file: !67, line: 135, baseType: !22, size: 8, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !67, line: 136, baseType: !22, size: 8, offset: 72)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !89, file: !67, line: 137, baseType: !13, size: 16, offset: 80)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !89, file: !67, line: 138, baseType: !560, size: 32, offset: 96)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !561, line: 327, size: 32, elements: !562)
!561 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !560, file: !561, line: 328, baseType: !8, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !560, file: !561, line: 329, baseType: !565, size: 32)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 4)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !89, file: !67, line: 139, baseType: !88, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !89, file: !67, line: 140, baseType: !88, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !89, file: !67, line: 141, baseType: !88, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !89, file: !67, line: 142, baseType: !51, size: 16, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !79, file: !67, line: 829, baseType: !573, size: 64, offset: 320)
!573 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !67, line: 716, size: 64, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !573, file: !67, line: 717, baseType: !18, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !573, file: !67, line: 718, baseType: !8, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !573, file: !67, line: 719, baseType: !126, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !573, file: !67, line: 720, baseType: !21, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !573, file: !67, line: 721, baseType: !126, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !573, file: !67, line: 722, baseType: !75, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !79, file: !67, line: 829, baseType: !22, size: 8, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !76, file: !67, line: 877, baseType: !583, size: 640)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !67, line: 835, size: 640, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !583, file: !67, line: 836, baseType: !75, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !583, file: !67, line: 836, baseType: !22, size: 8, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !67, line: 836, baseType: !22, size: 8, offset: 72)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !583, file: !67, line: 836, baseType: !13, size: 16, offset: 80)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !583, file: !67, line: 836, baseType: !21, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !67, line: 836, baseType: !75, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !583, file: !67, line: 836, baseType: !88, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !583, file: !67, line: 836, baseType: !573, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !583, file: !67, line: 836, baseType: !22, size: 8, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !583, file: !67, line: 836, baseType: !126, size: 64, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !583, file: !67, line: 837, baseType: !21, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !583, file: !67, line: 838, baseType: !8, size: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !583, file: !67, line: 839, baseType: !8, size: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !76, file: !67, line: 878, baseType: !599, size: 1600)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !67, line: 846, size: 1600, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !599, file: !67, line: 847, baseType: !75, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !599, file: !67, line: 847, baseType: !22, size: 8, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !67, line: 847, baseType: !22, size: 8, offset: 72)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !599, file: !67, line: 847, baseType: !13, size: 16, offset: 80)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !599, file: !67, line: 847, baseType: !21, size: 64, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !67, line: 847, baseType: !75, size: 64, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !599, file: !67, line: 847, baseType: !88, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !599, file: !67, line: 847, baseType: !573, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !599, file: !67, line: 847, baseType: !22, size: 8, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !599, file: !67, line: 847, baseType: !75, size: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !599, file: !67, line: 848, baseType: !75, size: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !599, file: !67, line: 849, baseType: !126, size: 64, offset: 576)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !599, file: !67, line: 850, baseType: !22, size: 8, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !599, file: !67, line: 851, baseType: !126, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !599, file: !67, line: 852, baseType: !126, size: 64, offset: 768)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !599, file: !67, line: 853, baseType: !126, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !599, file: !67, line: 854, baseType: !565, size: 32, offset: 896)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !599, file: !67, line: 855, baseType: !8, size: 32, offset: 928)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !599, file: !67, line: 856, baseType: !8, size: 32, offset: 960)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !599, file: !67, line: 857, baseType: !8, size: 32, offset: 992)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !599, file: !67, line: 858, baseType: !8, size: 32, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !599, file: !67, line: 859, baseType: !8, size: 32, offset: 1056)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !599, file: !67, line: 860, baseType: !8, size: 32, offset: 1088)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !599, file: !67, line: 861, baseType: !8, size: 32, offset: 1120)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !599, file: !67, line: 862, baseType: !8, size: 32, offset: 1152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !599, file: !67, line: 863, baseType: !8, size: 32, offset: 1184)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !599, file: !67, line: 864, baseType: !8, size: 32, offset: 1216)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !599, file: !67, line: 865, baseType: !8, size: 32, offset: 1248)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !599, file: !67, line: 866, baseType: !8, size: 32, offset: 1280)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !599, file: !67, line: 867, baseType: !8, size: 32, offset: 1312)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !599, file: !67, line: 868, baseType: !13, size: 16, offset: 1344)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !599, file: !67, line: 869, baseType: !22, size: 8, offset: 1360)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !599, file: !67, line: 870, baseType: !22, size: 8, offset: 1368)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !599, file: !67, line: 871, baseType: !22, size: 8, offset: 1376)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !599, file: !67, line: 872, baseType: !636, size: 160, offset: 1384)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 160, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 20)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !66, file: !67, line: 900, baseType: !88, size: 64, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !66, file: !67, line: 901, baseType: !641, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !67, line: 663, size: 640, elements: !643)
!643 = !{!644, !652, !665, !674, !683, !696, !710, !711, !723}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !642, file: !67, line: 664, baseType: !645, size: 128)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !67, line: 567, size: 128, elements: !646)
!646 = !{!647, !648, !649, !650, !651}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !67, line: 568, baseType: !16, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !645, file: !67, line: 568, baseType: !22, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !67, line: 568, baseType: !22, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !67, line: 568, baseType: !13, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !645, file: !67, line: 568, baseType: !13, size: 16, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !642, file: !67, line: 665, baseType: !653, size: 384)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !67, line: 593, size: 384, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !67, line: 594, baseType: !16, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !653, file: !67, line: 594, baseType: !22, size: 8, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !653, file: !67, line: 594, baseType: !22, size: 8, offset: 72)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !653, file: !67, line: 594, baseType: !13, size: 16, offset: 80)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !653, file: !67, line: 594, baseType: !13, size: 16, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !653, file: !67, line: 594, baseType: !13, size: 16, offset: 112)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !653, file: !67, line: 595, baseType: !75, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !653, file: !67, line: 596, baseType: !21, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !653, file: !67, line: 597, baseType: !21, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !653, file: !67, line: 598, baseType: !18, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !642, file: !67, line: 666, baseType: !666, size: 192)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !67, line: 573, size: 192, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !666, file: !67, line: 574, baseType: !16, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !666, file: !67, line: 574, baseType: !22, size: 8, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !666, file: !67, line: 574, baseType: !22, size: 8, offset: 72)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !666, file: !67, line: 574, baseType: !13, size: 16, offset: 80)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !666, file: !67, line: 574, baseType: !13, size: 16, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !666, file: !67, line: 574, baseType: !92, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !642, file: !67, line: 667, baseType: !675, size: 192)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !67, line: 604, size: 192, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !67, line: 605, baseType: !16, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !675, file: !67, line: 605, baseType: !22, size: 8, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !675, file: !67, line: 605, baseType: !22, size: 8, offset: 72)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !675, file: !67, line: 605, baseType: !13, size: 16, offset: 80)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !675, file: !67, line: 605, baseType: !13, size: 16, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !675, file: !67, line: 605, baseType: !88, size: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !642, file: !67, line: 668, baseType: !684, size: 448)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !67, line: 608, size: 448, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !684, file: !67, line: 609, baseType: !16, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !684, file: !67, line: 609, baseType: !22, size: 8, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !684, file: !67, line: 609, baseType: !22, size: 8, offset: 72)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !684, file: !67, line: 609, baseType: !13, size: 16, offset: 80)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !684, file: !67, line: 609, baseType: !13, size: 16, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !684, file: !67, line: 609, baseType: !8, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !684, file: !67, line: 610, baseType: !75, size: 64, offset: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !684, file: !67, line: 611, baseType: !21, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !684, file: !67, line: 612, baseType: !21, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !684, file: !67, line: 613, baseType: !8, size: 32, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !642, file: !67, line: 669, baseType: !697, size: 512)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !67, line: 580, size: 512, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !697, file: !67, line: 581, baseType: !16, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !697, file: !67, line: 581, baseType: !22, size: 8, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !697, file: !67, line: 581, baseType: !22, size: 8, offset: 72)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !697, file: !67, line: 581, baseType: !13, size: 16, offset: 80)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !697, file: !67, line: 581, baseType: !13, size: 16, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !697, file: !67, line: 581, baseType: !8, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !697, file: !67, line: 582, baseType: !92, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !697, file: !67, line: 583, baseType: !92, size: 64, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !697, file: !67, line: 584, baseType: !39, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !697, file: !67, line: 585, baseType: !16, size: 64, offset: 384)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !697, file: !67, line: 586, baseType: !8, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !642, file: !67, line: 670, baseType: !204, size: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !642, file: !67, line: 671, baseType: !712, size: 640)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !67, line: 631, size: 640, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !67, line: 632, baseType: !16, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !712, file: !67, line: 632, baseType: !22, size: 8, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !712, file: !67, line: 632, baseType: !22, size: 8, offset: 72)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !712, file: !67, line: 632, baseType: !13, size: 16, offset: 80)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !712, file: !67, line: 632, baseType: !13, size: 16, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !712, file: !67, line: 633, baseType: !720, size: 512, offset: 128)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 512, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 8)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !642, file: !67, line: 672, baseType: !724, size: 320)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !67, line: 654, size: 320, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !67, line: 655, baseType: !16, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !724, file: !67, line: 655, baseType: !22, size: 8, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !724, file: !67, line: 655, baseType: !22, size: 8, offset: 72)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !724, file: !67, line: 655, baseType: !13, size: 16, offset: 80)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !724, file: !67, line: 655, baseType: !13, size: 16, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !724, file: !67, line: 655, baseType: !22, size: 8, offset: 112)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !724, file: !67, line: 656, baseType: !88, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !724, file: !67, line: 657, baseType: !92, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !724, file: !67, line: 658, baseType: !735, size: 64, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !67, line: 645, size: 128, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !736, file: !67, line: 646, baseType: !470, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !736, file: !67, line: 647, baseType: !16, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !66, file: !67, line: 902, baseType: !75, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !66, file: !67, line: 903, baseType: !8, size: 32, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !40, file: !41, line: 61, baseType: !8, size: 32, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !40, file: !41, line: 62, baseType: !8, size: 32, offset: 1120)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !40, file: !41, line: 63, baseType: !13, size: 16, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !40, file: !41, line: 64, baseType: !22, size: 8, offset: 1168)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !40, file: !41, line: 66, baseType: !747, size: 2688, offset: 1216)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 2688, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 7)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !40, file: !41, line: 67, baseType: !751, size: 3072, offset: 3904)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 3072, elements: !721)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !40, file: !41, line: 68, baseType: !753, size: 576, offset: 6976)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 576, elements: !29)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !40, file: !41, line: 69, baseType: !151, size: 64, offset: 7552)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !40, file: !41, line: 71, baseType: !21, size: 64, offset: 7616)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !40, file: !41, line: 72, baseType: !151, size: 64, offset: 7680)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !40, file: !41, line: 73, baseType: !641, size: 64, offset: 7744)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !40, file: !41, line: 74, baseType: !88, size: 64, offset: 7808)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !40, file: !41, line: 75, baseType: !92, size: 64, offset: 7872)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !40, file: !41, line: 76, baseType: !88, size: 64, offset: 7936)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !40, file: !41, line: 77, baseType: !75, size: 64, offset: 8000)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !40, file: !41, line: 78, baseType: !92, size: 64, offset: 8064)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !40, file: !41, line: 79, baseType: !88, size: 64, offset: 8128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !40, file: !41, line: 80, baseType: !126, size: 64, offset: 8192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !40, file: !41, line: 81, baseType: !75, size: 64, offset: 8256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !40, file: !41, line: 82, baseType: !767, size: 64, offset: 8320)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !67, line: 702, size: 128, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !769, file: !67, line: 706, baseType: !8, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !769, file: !67, line: 707, baseType: !8, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !769, file: !67, line: 708, baseType: !13, size: 16, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !769, file: !67, line: 709, baseType: !22, size: 8, offset: 80)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !769, file: !67, line: 710, baseType: !22, size: 8, offset: 88)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !769, file: !67, line: 711, baseType: !22, size: 8, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !40, file: !41, line: 83, baseType: !75, size: 64, offset: 8384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !40, file: !41, line: 84, baseType: !92, size: 64, offset: 8448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !40, file: !41, line: 85, baseType: !641, size: 64, offset: 8512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !40, file: !41, line: 86, baseType: !92, size: 64, offset: 8576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !40, file: !41, line: 87, baseType: !641, size: 64, offset: 8640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !40, file: !41, line: 88, baseType: !75, size: 64, offset: 8704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !40, file: !41, line: 89, baseType: !75, size: 64, offset: 8768)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !40, file: !41, line: 90, baseType: !203, size: 64, offset: 8832)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !40, file: !41, line: 91, baseType: !786, size: 64, offset: 8896)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !67, line: 637, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!6, !39, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !40, file: !41, line: 92, baseType: !792, size: 64, offset: 8960)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !67, line: 641, baseType: !183)
!793 = !DILocalVariable(name: "walk_state", arg: 1, scope: !36, file: !3, line: 154, type: !39)
!794 = !DILocation(line: 154, column: 48, scope: !36)
!795 = !DILocalVariable(name: "aml_op_start", arg: 2, scope: !36, file: !3, line: 155, type: !21)
!796 = !DILocation(line: 155, column: 14, scope: !36)
!797 = !DILocalVariable(name: "unnamed_op", arg: 3, scope: !36, file: !3, line: 156, type: !75)
!798 = !DILocation(line: 156, column: 35, scope: !36)
!799 = !DILocalVariable(name: "op", arg: 4, scope: !36, file: !3, line: 157, type: !790)
!800 = !DILocation(line: 157, column: 36, scope: !36)
!801 = !DILocalVariable(name: "status", scope: !36, file: !3, line: 159, type: !6)
!802 = !DILocation(line: 159, column: 14, scope: !36)
!803 = !DILocalVariable(name: "arg", scope: !36, file: !3, line: 160, type: !75)
!804 = !DILocation(line: 160, column: 27, scope: !36)
!805 = !DILocation(line: 164, column: 2, scope: !36)
!806 = !DILocation(line: 164, column: 14, scope: !36)
!807 = !DILocation(line: 164, column: 21, scope: !36)
!808 = !DILocation(line: 164, column: 27, scope: !36)
!809 = !DILocation(line: 164, column: 31, scope: !36)
!810 = !DILocation(line: 165, column: 2, scope: !36)
!811 = !DILocation(line: 165, column: 14, scope: !36)
!812 = !DILocation(line: 165, column: 21, scope: !36)
!813 = !DILocation(line: 165, column: 37, scope: !36)
!814 = !DILocation(line: 166, column: 34, scope: !36)
!815 = !DILocation(line: 166, column: 46, scope: !36)
!816 = !DILocation(line: 166, column: 2, scope: !36)
!817 = !DILocation(line: 166, column: 14, scope: !36)
!818 = !DILocation(line: 166, column: 21, scope: !36)
!819 = !DILocation(line: 166, column: 32, scope: !36)
!820 = !DILocation(line: 172, column: 2, scope: !36)
!821 = !DILocation(line: 172, column: 9, scope: !36)
!822 = !DILocation(line: 172, column: 53, scope: !36)
!823 = !DILocation(line: 173, column: 10, scope: !36)
!824 = !DILocation(line: 173, column: 54, scope: !36)
!825 = !DILocation(line: 0, scope: !36)
!826 = !DILocation(line: 176, column: 28, scope: !827)
!827 = distinct !DILexicalBlock(scope: !36, file: !3, line: 173, column: 69)
!828 = !DILocation(line: 177, column: 9, scope: !827)
!829 = !DILocation(line: 177, column: 21, scope: !827)
!830 = !DILocation(line: 178, column: 7, scope: !827)
!831 = !DILocation(line: 176, column: 7, scope: !827)
!832 = !DILocation(line: 175, column: 10, scope: !827)
!833 = !DILocation(line: 180, column: 7, scope: !834)
!834 = distinct !DILexicalBlock(scope: !827, file: !3, line: 180, column: 7)
!835 = !DILocation(line: 180, column: 7, scope: !827)
!836 = !DILocation(line: 181, column: 4, scope: !837)
!837 = distinct !DILexicalBlock(scope: !834, file: !3, line: 180, column: 29)
!838 = !DILocation(line: 184, column: 22, scope: !827)
!839 = !DILocation(line: 184, column: 34, scope: !827)
!840 = !DILocation(line: 184, column: 3, scope: !827)
!841 = !DILocation(line: 185, column: 3, scope: !827)
!842 = distinct !{!842, !820, !843}
!843 = !DILocation(line: 186, column: 2, scope: !36)
!844 = !DILocation(line: 203, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !36, file: !3, line: 203, column: 6)
!846 = !DILocation(line: 203, column: 6, scope: !36)
!847 = !DILocation(line: 204, column: 3, scope: !848)
!848 = distinct !DILexicalBlock(scope: !845, file: !3, line: 203, column: 52)
!849 = !DILocation(line: 209, column: 2, scope: !36)
!850 = !DILocation(line: 215, column: 2, scope: !36)
!851 = !DILocation(line: 215, column: 14, scope: !36)
!852 = !DILocation(line: 215, column: 17, scope: !36)
!853 = !DILocation(line: 217, column: 11, scope: !36)
!854 = !DILocation(line: 217, column: 23, scope: !36)
!855 = !DILocation(line: 217, column: 43, scope: !36)
!856 = !DILocation(line: 217, column: 55, scope: !36)
