; ModuleID = '../bcout/drivers/acpi/acpica/psparse.llvm.bc'
source_filename = "drivers/acpi/acpica/psparse.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }
%struct.acpi_walk_state = type { %struct.acpi_walk_state*, i8, i8, i16, i8, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8*, i32, i32, i32, i32, %struct.acpi_parse_state, i32, i32, i16, i8, [7 x %struct.acpi_namespace_node], [8 x %struct.acpi_namespace_node], [9 x %union.acpi_operand_object*], %union.acpi_operand_object**, i8*, %union.acpi_operand_object**, %union.acpi_generic_state*, %struct.acpi_namespace_node*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, %union.acpi_parse_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8*, %union.acpi_parse_object*, %struct.acpi_opcode_info*, %union.acpi_parse_object*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_parse_object*, %union.acpi_parse_object*, %struct.acpi_thread_state*, i32 (%struct.acpi_walk_state*, %union.acpi_parse_object**)*, i32 (%struct.acpi_walk_state*)* }
%struct.acpi_parse_state = type { i8*, i8*, i8*, i8*, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_generic_state*, %union.acpi_parse_object*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 28, type: !787, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !12, globals: !786, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/psparse.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 116, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS1", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_IMODE_LOAD_PASS2", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_IMODE_EXECUTE", value: 3, isUnsigned: true)
!12 = !{!13, !18, !22, !23, !27, !30}
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !14, line: 19, baseType: !15)
!14 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !16, line: 24, baseType: !17)
!16 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !14, line: 17, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !16, line: 21, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !24, line: 421, baseType: !25)
!24 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !14, line: 21, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !16, line: 27, baseType: !7)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !14, line: 23, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !16, line: 31, baseType: !29)
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !6, line: 663, size: 640, elements: !32)
!32 = !{!33, !41, !713, !722, !731, !744, !758, !759, !769}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !31, file: !6, line: 664, baseType: !34, size: 128)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !6, line: 567, size: 128, elements: !35)
!35 = !{!36, !37, !38, !39, !40}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !6, line: 568, baseType: !22, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !34, file: !6, line: 568, baseType: !19, size: 8, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !6, line: 568, baseType: !19, size: 8, offset: 72)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !34, file: !6, line: 568, baseType: !13, size: 16, offset: 80)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !34, file: !6, line: 568, baseType: !13, size: 16, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !31, file: !6, line: 665, baseType: !42, size: 384)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !6, line: 593, size: 384, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !710, !711, !712}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !42, file: !6, line: 594, baseType: !22, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !42, file: !6, line: 594, baseType: !19, size: 8, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !6, line: 594, baseType: !19, size: 8, offset: 72)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !42, file: !6, line: 594, baseType: !13, size: 16, offset: 80)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !42, file: !6, line: 594, baseType: !13, size: 16, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !42, file: !6, line: 594, baseType: !13, size: 16, offset: 112)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !42, file: !6, line: 595, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !6, line: 875, size: 1600, elements: !53)
!53 = !{!54, !653, !669}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !52, file: !6, line: 876, baseType: !55, size: 448)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !6, line: 828, size: 448, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62, !63, !643, !652}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !55, file: !6, line: 829, baseType: !51, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !55, file: !6, line: 829, baseType: !19, size: 8, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !6, line: 829, baseType: !19, size: 8, offset: 72)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !55, file: !6, line: 829, baseType: !13, size: 16, offset: 80)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !55, file: !6, line: 829, baseType: !18, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !6, line: 829, baseType: !51, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !55, file: !6, line: 829, baseType: !64, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !6, line: 133, size: 384, elements: !66)
!66 = !{!67, !627, !628, !629, !630, !639, !640, !641, !642}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !65, file: !6, line: 134, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !70, line: 367, size: 576, elements: !71)
!70 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!71 = !{!72, !80, !93, !105, !118, !132, !141, !273, !290, !305, !318, !397, !409, !423, !433, !451, !473, !492, !511, !530, !547, !573, !590, !603, !617, !626}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !69, file: !70, line: 368, baseType: !73, size: 128)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !70, line: 73, size: 128, elements: !74)
!74 = !{!75, !76, !77, !78, !79}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !73, file: !70, line: 74, baseType: !68, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !73, file: !70, line: 74, baseType: !19, size: 8, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !73, file: !70, line: 74, baseType: !19, size: 8, offset: 72)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !73, file: !70, line: 74, baseType: !13, size: 16, offset: 80)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !73, file: !70, line: 74, baseType: !19, size: 8, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !69, file: !70, line: 369, baseType: !81, size: 192)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !70, line: 76, size: 192, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !92}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !81, file: !70, line: 77, baseType: !68, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !81, file: !70, line: 77, baseType: !19, size: 8, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !70, line: 77, baseType: !19, size: 8, offset: 72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !81, file: !70, line: 77, baseType: !13, size: 16, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !70, line: 77, baseType: !19, size: 8, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !81, file: !70, line: 77, baseType: !89, size: 24, offset: 104)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 3)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !81, file: !70, line: 78, baseType: !27, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !69, file: !70, line: 370, baseType: !94, size: 256)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !70, line: 93, size: 256, elements: !95)
!95 = !{!96, !97, !98, !99, !100, !101, !104}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !94, file: !70, line: 94, baseType: !68, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !94, file: !70, line: 94, baseType: !19, size: 8, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !70, line: 94, baseType: !19, size: 8, offset: 72)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !94, file: !70, line: 94, baseType: !13, size: 16, offset: 80)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !70, line: 94, baseType: !19, size: 8, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !94, file: !70, line: 94, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !94, file: !70, line: 94, baseType: !25, size: 32, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !69, file: !70, line: 371, baseType: !106, size: 384)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !70, line: 97, size: 384, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !106, file: !70, line: 98, baseType: !68, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !106, file: !70, line: 98, baseType: !19, size: 8, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !106, file: !70, line: 98, baseType: !19, size: 8, offset: 72)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !106, file: !70, line: 98, baseType: !13, size: 16, offset: 80)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !106, file: !70, line: 98, baseType: !19, size: 8, offset: 96)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !106, file: !70, line: 98, baseType: !18, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !106, file: !70, line: 98, baseType: !25, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !106, file: !70, line: 99, baseType: !25, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !106, file: !70, line: 100, baseType: !18, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !106, file: !70, line: 101, baseType: !64, size: 64, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !69, file: !70, line: 372, baseType: !119, size: 384)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !70, line: 104, size: 384, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !129, !130, !131}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !119, file: !70, line: 105, baseType: !68, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !119, file: !70, line: 105, baseType: !19, size: 8, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !70, line: 105, baseType: !19, size: 8, offset: 72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !119, file: !70, line: 105, baseType: !13, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !70, line: 105, baseType: !19, size: 8, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !119, file: !70, line: 105, baseType: !64, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !119, file: !70, line: 106, baseType: !128, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !119, file: !70, line: 107, baseType: !18, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !119, file: !70, line: 108, baseType: !25, size: 32, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !119, file: !70, line: 109, baseType: !25, size: 32, offset: 352)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !69, file: !70, line: 373, baseType: !133, size: 192)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !70, line: 118, size: 192, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !140}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !133, file: !70, line: 119, baseType: !68, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !133, file: !70, line: 119, baseType: !19, size: 8, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !133, file: !70, line: 119, baseType: !19, size: 8, offset: 72)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !133, file: !70, line: 119, baseType: !13, size: 16, offset: 80)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !133, file: !70, line: 119, baseType: !19, size: 8, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !133, file: !70, line: 119, baseType: !22, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !69, file: !70, line: 374, baseType: !142, size: 448)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !70, line: 143, size: 448, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !270, !271, !272}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !142, file: !70, line: 144, baseType: !68, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !142, file: !70, line: 144, baseType: !19, size: 8, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !142, file: !70, line: 144, baseType: !19, size: 8, offset: 72)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !142, file: !70, line: 144, baseType: !13, size: 16, offset: 80)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !142, file: !70, line: 144, baseType: !19, size: 8, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !142, file: !70, line: 144, baseType: !19, size: 8, offset: 104)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !142, file: !70, line: 145, baseType: !19, size: 8, offset: 112)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !142, file: !70, line: 146, baseType: !19, size: 8, offset: 120)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !142, file: !70, line: 147, baseType: !68, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !142, file: !70, line: 148, baseType: !68, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !142, file: !70, line: 149, baseType: !18, size: 64, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !142, file: !70, line: 153, baseType: !156, size: 64, offset: 320)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !142, file: !70, line: 150, size: 64, elements: !157)
!157 = !{!158, !269}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !156, file: !70, line: 151, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !6, line: 248, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{!23, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !165, line: 37, size: 9024, elements: !166)
!165 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !202, !203, !204, !205, !206, !210, !214, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !241, !242, !243, !244, !245, !246, !247, !248, !261, !267}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !165, line: 38, baseType: !163, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !164, file: !165, line: 39, baseType: !19, size: 8, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !164, file: !165, line: 40, baseType: !19, size: 8, offset: 72)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !164, file: !165, line: 41, baseType: !13, size: 16, offset: 80)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !164, file: !165, line: 42, baseType: !19, size: 8, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !164, file: !165, line: 43, baseType: !19, size: 8, offset: 104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !164, file: !165, line: 44, baseType: !19, size: 8, offset: 112)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !164, file: !165, line: 45, baseType: !175, size: 16, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !24, line: 445, baseType: !13)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !164, file: !165, line: 46, baseType: !19, size: 8, offset: 144)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !164, file: !165, line: 47, baseType: !19, size: 8, offset: 152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !164, file: !165, line: 48, baseType: !19, size: 8, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !164, file: !165, line: 49, baseType: !19, size: 8, offset: 168)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !164, file: !165, line: 50, baseType: !19, size: 8, offset: 176)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !164, file: !165, line: 51, baseType: !19, size: 8, offset: 184)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !164, file: !165, line: 52, baseType: !19, size: 8, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !164, file: !165, line: 53, baseType: !19, size: 8, offset: 200)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !164, file: !165, line: 54, baseType: !18, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !164, file: !165, line: 55, baseType: !25, size: 32, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !164, file: !165, line: 56, baseType: !25, size: 32, offset: 352)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !164, file: !165, line: 57, baseType: !25, size: 32, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !164, file: !165, line: 58, baseType: !25, size: 32, offset: 416)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !164, file: !165, line: 60, baseType: !190, size: 640, offset: 448)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !6, line: 893, size: 640, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !201}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !190, file: !6, line: 894, baseType: !18, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !190, file: !6, line: 895, baseType: !18, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !190, file: !6, line: 896, baseType: !18, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !190, file: !6, line: 897, baseType: !18, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !190, file: !6, line: 898, baseType: !18, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !190, file: !6, line: 899, baseType: !51, size: 64, offset: 320)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !190, file: !6, line: 900, baseType: !64, size: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !190, file: !6, line: 901, baseType: !30, size: 64, offset: 448)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !190, file: !6, line: 902, baseType: !51, size: 64, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !190, file: !6, line: 903, baseType: !25, size: 32, offset: 576)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !164, file: !165, line: 61, baseType: !25, size: 32, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !164, file: !165, line: 62, baseType: !25, size: 32, offset: 1120)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !164, file: !165, line: 63, baseType: !13, size: 16, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !164, file: !165, line: 64, baseType: !19, size: 8, offset: 1168)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !164, file: !165, line: 66, baseType: !207, size: 2688, offset: 1216)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2688, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 7)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !164, file: !165, line: 67, baseType: !211, size: 3072, offset: 3904)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 3072, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !164, file: !165, line: 68, baseType: !215, size: 576, offset: 6976)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 576, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 9)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !164, file: !165, line: 69, baseType: !128, size: 64, offset: 7552)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !164, file: !165, line: 71, baseType: !18, size: 64, offset: 7616)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !164, file: !165, line: 72, baseType: !128, size: 64, offset: 7680)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !164, file: !165, line: 73, baseType: !30, size: 64, offset: 7744)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !164, file: !165, line: 74, baseType: !64, size: 64, offset: 7808)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !164, file: !165, line: 75, baseType: !68, size: 64, offset: 7872)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !164, file: !165, line: 76, baseType: !64, size: 64, offset: 7936)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !164, file: !165, line: 77, baseType: !51, size: 64, offset: 8000)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !164, file: !165, line: 78, baseType: !68, size: 64, offset: 8064)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !164, file: !165, line: 79, baseType: !64, size: 64, offset: 8128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !164, file: !165, line: 80, baseType: !102, size: 64, offset: 8192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !164, file: !165, line: 81, baseType: !51, size: 64, offset: 8256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !164, file: !165, line: 82, baseType: !231, size: 64, offset: 8320)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !6, line: 702, size: 128, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !233, file: !6, line: 706, baseType: !25, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !233, file: !6, line: 707, baseType: !25, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !233, file: !6, line: 708, baseType: !13, size: 16, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !233, file: !6, line: 709, baseType: !19, size: 8, offset: 80)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !233, file: !6, line: 710, baseType: !19, size: 8, offset: 88)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !6, line: 711, baseType: !19, size: 8, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !164, file: !165, line: 83, baseType: !51, size: 64, offset: 8384)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !164, file: !165, line: 84, baseType: !68, size: 64, offset: 8448)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !164, file: !165, line: 85, baseType: !30, size: 64, offset: 8512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !164, file: !165, line: 86, baseType: !68, size: 64, offset: 8576)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !164, file: !165, line: 87, baseType: !30, size: 64, offset: 8640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !164, file: !165, line: 88, baseType: !51, size: 64, offset: 8704)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !164, file: !165, line: 89, baseType: !51, size: 64, offset: 8768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !164, file: !165, line: 90, baseType: !249, size: 64, offset: 8832)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !6, line: 620, size: 320, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !6, line: 621, baseType: !22, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !250, file: !6, line: 621, baseType: !19, size: 8, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !250, file: !6, line: 621, baseType: !19, size: 8, offset: 72)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !250, file: !6, line: 621, baseType: !13, size: 16, offset: 80)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !250, file: !6, line: 621, baseType: !13, size: 16, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !250, file: !6, line: 621, baseType: !19, size: 8, offset: 112)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !250, file: !6, line: 622, baseType: !163, size: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !250, file: !6, line: 623, baseType: !68, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !250, file: !6, line: 624, baseType: !27, size: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !164, file: !165, line: 91, baseType: !262, size: 64, offset: 8896)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !6, line: 637, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{!23, !163, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !164, file: !165, line: 92, baseType: !268, size: 64, offset: 8960)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !6, line: 641, baseType: !160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !156, file: !70, line: 152, baseType: !68, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !142, file: !70, line: 155, baseType: !25, size: 32, offset: 384)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !142, file: !70, line: 156, baseType: !175, size: 16, offset: 416)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !142, file: !70, line: 157, baseType: !19, size: 8, offset: 432)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !69, file: !70, line: 375, baseType: !274, size: 576)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !70, line: 122, size: 576, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !274, file: !70, line: 123, baseType: !68, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !274, file: !70, line: 123, baseType: !19, size: 8, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !274, file: !70, line: 123, baseType: !19, size: 8, offset: 72)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !274, file: !70, line: 123, baseType: !13, size: 16, offset: 80)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !274, file: !70, line: 123, baseType: !19, size: 8, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !274, file: !70, line: 123, baseType: !19, size: 8, offset: 104)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !274, file: !70, line: 124, baseType: !13, size: 16, offset: 112)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !274, file: !70, line: 125, baseType: !22, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !274, file: !70, line: 126, baseType: !27, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !274, file: !70, line: 127, baseType: !249, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !274, file: !70, line: 128, baseType: !68, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !274, file: !70, line: 129, baseType: !68, size: 64, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !274, file: !70, line: 130, baseType: !64, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !274, file: !70, line: 131, baseType: !19, size: 8, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !69, file: !70, line: 376, baseType: !291, size: 448)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !70, line: 134, size: 448, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !304}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !291, file: !70, line: 135, baseType: !68, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !291, file: !70, line: 135, baseType: !19, size: 8, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !70, line: 135, baseType: !19, size: 8, offset: 72)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !291, file: !70, line: 135, baseType: !13, size: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !291, file: !70, line: 135, baseType: !19, size: 8, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !291, file: !70, line: 135, baseType: !19, size: 8, offset: 104)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !291, file: !70, line: 136, baseType: !64, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !291, file: !70, line: 137, baseType: !68, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !70, line: 138, baseType: !68, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !291, file: !70, line: 139, baseType: !303, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !24, line: 129, baseType: !27)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !291, file: !70, line: 140, baseType: !25, size: 32, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !69, file: !70, line: 377, baseType: !306, size: 320)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !70, line: 184, size: 320, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !317}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !306, file: !70, line: 185, baseType: !68, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !306, file: !70, line: 185, baseType: !19, size: 8, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !70, line: 185, baseType: !19, size: 8, offset: 72)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !306, file: !70, line: 185, baseType: !13, size: 16, offset: 80)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !306, file: !70, line: 185, baseType: !19, size: 8, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !306, file: !70, line: 185, baseType: !314, size: 128, offset: 128)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 2)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !306, file: !70, line: 185, baseType: !68, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !69, file: !70, line: 378, baseType: !319, size: 384)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !70, line: 187, size: 384, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !319, file: !70, line: 188, baseType: !68, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !319, file: !70, line: 188, baseType: !19, size: 8, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !319, file: !70, line: 188, baseType: !19, size: 8, offset: 72)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !319, file: !70, line: 188, baseType: !13, size: 16, offset: 80)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !70, line: 188, baseType: !19, size: 8, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !319, file: !70, line: 189, baseType: !314, size: 128, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !319, file: !70, line: 189, baseType: !68, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !319, file: !70, line: 189, baseType: !329, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !6, line: 480, size: 576, elements: !331)
!331 = !{!332, !333, !334, !335, !343, !358, !391, !392, !393, !394, !395, !396}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !330, file: !6, line: 481, baseType: !64, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !330, file: !6, line: 482, baseType: !329, size: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !6, line: 483, baseType: !329, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !330, file: !6, line: 484, baseType: !336, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !6, line: 497, size: 256, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !337, file: !6, line: 498, baseType: !336, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !6, line: 499, baseType: !336, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !337, file: !6, line: 500, baseType: !329, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !337, file: !6, line: 501, baseType: !25, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !330, file: !6, line: 485, baseType: !344, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !6, line: 466, size: 320, elements: !346)
!346 = !{!347, !352, !353, !354, !355, !356, !357}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !345, file: !6, line: 467, baseType: !348, size: 128)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !6, line: 459, size: 128, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !348, file: !6, line: 460, baseType: !19, size: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !348, file: !6, line: 461, baseType: !27, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !345, file: !6, line: 468, baseType: !348, size: 128, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !345, file: !6, line: 469, baseType: !13, size: 16, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !345, file: !6, line: 470, baseType: !19, size: 8, offset: 272)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !345, file: !6, line: 471, baseType: !19, size: 8, offset: 280)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !345, file: !6, line: 472, baseType: !19, size: 8, offset: 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !345, file: !6, line: 473, baseType: !19, size: 8, offset: 296)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !330, file: !6, line: 486, baseType: !359, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !6, line: 448, size: 192, elements: !361)
!361 = !{!362, !386, !387, !388, !389, !390}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !360, file: !6, line: 449, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !6, line: 438, size: 64, elements: !364)
!364 = !{!365, !366, !380}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !363, file: !6, line: 439, baseType: !64, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !363, file: !6, line: 440, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !6, line: 419, size: 256, elements: !369)
!369 = !{!370, !376, !377, !378, !379}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !368, file: !6, line: 420, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !24, line: 1049, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!25, !375, !25, !22}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !24, line: 424, baseType: !22)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !368, file: !6, line: 421, baseType: !22, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !368, file: !6, line: 422, baseType: !64, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !368, file: !6, line: 423, baseType: !19, size: 8, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !368, file: !6, line: 424, baseType: !19, size: 8, offset: 200)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !363, file: !6, line: 441, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !6, line: 429, size: 128, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !382, file: !6, line: 430, baseType: !64, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !382, file: !6, line: 431, baseType: !381, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !360, file: !6, line: 450, baseType: !344, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !360, file: !6, line: 451, baseType: !19, size: 8, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !360, file: !6, line: 452, baseType: !19, size: 8, offset: 136)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !360, file: !6, line: 453, baseType: !19, size: 8, offset: 144)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !360, file: !6, line: 454, baseType: !19, size: 8, offset: 152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !330, file: !6, line: 487, baseType: !27, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !330, file: !6, line: 488, baseType: !25, size: 32, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !330, file: !6, line: 489, baseType: !13, size: 16, offset: 480)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !330, file: !6, line: 490, baseType: !13, size: 16, offset: 496)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !330, file: !6, line: 491, baseType: !19, size: 8, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !330, file: !6, line: 492, baseType: !19, size: 8, offset: 520)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !69, file: !70, line: 379, baseType: !398, size: 384)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !70, line: 192, size: 384, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !398, file: !70, line: 193, baseType: !68, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !398, file: !70, line: 193, baseType: !19, size: 8, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !398, file: !70, line: 193, baseType: !19, size: 8, offset: 72)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !398, file: !70, line: 193, baseType: !13, size: 16, offset: 80)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !70, line: 193, baseType: !19, size: 8, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !398, file: !70, line: 193, baseType: !314, size: 128, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !398, file: !70, line: 193, baseType: !68, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !398, file: !70, line: 193, baseType: !25, size: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !398, file: !70, line: 194, baseType: !25, size: 32, offset: 352)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !69, file: !70, line: 380, baseType: !410, size: 384)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !70, line: 197, size: 384, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !410, file: !70, line: 198, baseType: !68, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !410, file: !70, line: 198, baseType: !19, size: 8, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !70, line: 198, baseType: !19, size: 8, offset: 72)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !410, file: !70, line: 198, baseType: !13, size: 16, offset: 80)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !410, file: !70, line: 198, baseType: !19, size: 8, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !410, file: !70, line: 200, baseType: !19, size: 8, offset: 104)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !410, file: !70, line: 201, baseType: !19, size: 8, offset: 112)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !410, file: !70, line: 202, baseType: !314, size: 128, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !410, file: !70, line: 202, baseType: !68, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !410, file: !70, line: 202, baseType: !422, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !24, line: 128, baseType: !27)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !69, file: !70, line: 381, baseType: !424, size: 320)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !70, line: 205, size: 320, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !424, file: !70, line: 206, baseType: !68, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !424, file: !70, line: 206, baseType: !19, size: 8, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !70, line: 206, baseType: !19, size: 8, offset: 72)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !424, file: !70, line: 206, baseType: !13, size: 16, offset: 80)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !424, file: !70, line: 206, baseType: !19, size: 8, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !424, file: !70, line: 206, baseType: !314, size: 128, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !424, file: !70, line: 206, baseType: !68, size: 64, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !69, file: !70, line: 382, baseType: !434, size: 384)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !70, line: 233, size: 384, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !434, file: !70, line: 234, baseType: !68, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 72)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !434, file: !70, line: 234, baseType: !13, size: 16, offset: 80)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 104)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 112)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 120)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !434, file: !70, line: 234, baseType: !64, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !434, file: !70, line: 234, baseType: !25, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !434, file: !70, line: 234, baseType: !25, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !434, file: !70, line: 234, baseType: !25, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !434, file: !70, line: 234, baseType: !19, size: 8, offset: 296)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !434, file: !70, line: 234, baseType: !68, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !69, file: !70, line: 383, baseType: !452, size: 576)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !70, line: 237, size: 576, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !452, file: !70, line: 238, baseType: !68, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 72)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !452, file: !70, line: 238, baseType: !13, size: 16, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 104)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 120)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !452, file: !70, line: 238, baseType: !64, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !452, file: !70, line: 238, baseType: !25, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !452, file: !70, line: 238, baseType: !25, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !452, file: !70, line: 238, baseType: !25, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !452, file: !70, line: 238, baseType: !19, size: 8, offset: 296)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !452, file: !70, line: 238, baseType: !13, size: 16, offset: 304)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !452, file: !70, line: 239, baseType: !68, size: 64, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !452, file: !70, line: 240, baseType: !18, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !452, file: !70, line: 241, baseType: !13, size: 16, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !452, file: !70, line: 242, baseType: !18, size: 64, offset: 512)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !69, file: !70, line: 384, baseType: !474, size: 384)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !70, line: 262, size: 384, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !474, file: !70, line: 263, baseType: !68, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 72)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !474, file: !70, line: 263, baseType: !13, size: 16, offset: 80)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 104)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 112)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 120)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !70, line: 263, baseType: !64, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !474, file: !70, line: 263, baseType: !25, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !474, file: !70, line: 263, baseType: !25, size: 32, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !474, file: !70, line: 263, baseType: !25, size: 32, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 288)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 296)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !474, file: !70, line: 263, baseType: !19, size: 8, offset: 304)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !474, file: !70, line: 264, baseType: !68, size: 64, offset: 320)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !69, file: !70, line: 385, baseType: !493, size: 448)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !70, line: 245, size: 448, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !493, file: !70, line: 246, baseType: !68, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 72)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !493, file: !70, line: 246, baseType: !13, size: 16, offset: 80)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 104)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 120)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !493, file: !70, line: 246, baseType: !64, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !493, file: !70, line: 246, baseType: !25, size: 32, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !493, file: !70, line: 246, baseType: !25, size: 32, offset: 224)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !493, file: !70, line: 246, baseType: !25, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 288)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !493, file: !70, line: 246, baseType: !19, size: 8, offset: 296)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !493, file: !70, line: 246, baseType: !68, size: 64, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !493, file: !70, line: 247, baseType: !68, size: 64, offset: 384)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !69, file: !70, line: 386, baseType: !512, size: 448)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !70, line: 250, size: 448, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !512, file: !70, line: 251, baseType: !68, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 72)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !512, file: !70, line: 251, baseType: !13, size: 16, offset: 80)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 104)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 112)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 120)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !512, file: !70, line: 251, baseType: !64, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !512, file: !70, line: 251, baseType: !25, size: 32, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !512, file: !70, line: 251, baseType: !25, size: 32, offset: 224)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !512, file: !70, line: 251, baseType: !25, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !512, file: !70, line: 251, baseType: !19, size: 8, offset: 296)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !512, file: !70, line: 256, baseType: !68, size: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !512, file: !70, line: 257, baseType: !68, size: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !69, file: !70, line: 387, baseType: !531, size: 512)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !70, line: 273, size: 512, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !545, !546}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !531, file: !70, line: 274, baseType: !68, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !531, file: !70, line: 274, baseType: !19, size: 8, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !531, file: !70, line: 274, baseType: !19, size: 8, offset: 72)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !531, file: !70, line: 274, baseType: !13, size: 16, offset: 80)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !531, file: !70, line: 274, baseType: !19, size: 8, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !531, file: !70, line: 274, baseType: !64, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !531, file: !70, line: 275, baseType: !25, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !531, file: !70, line: 276, baseType: !541, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !24, line: 1052, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !375, !25, !22}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !531, file: !70, line: 277, baseType: !22, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !531, file: !70, line: 278, baseType: !314, size: 128, offset: 384)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !69, file: !70, line: 388, baseType: !548, size: 512)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !70, line: 281, size: 512, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !563, !564, !565, !571, !572}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !548, file: !70, line: 282, baseType: !68, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !548, file: !70, line: 282, baseType: !19, size: 8, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !548, file: !70, line: 282, baseType: !19, size: 8, offset: 72)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !548, file: !70, line: 282, baseType: !13, size: 16, offset: 80)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !548, file: !70, line: 282, baseType: !19, size: 8, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !548, file: !70, line: 282, baseType: !19, size: 8, offset: 104)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !548, file: !70, line: 283, baseType: !19, size: 8, offset: 112)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !548, file: !70, line: 284, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !24, line: 1084, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!23, !25, !303, !25, !562, !22, !22}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !548, file: !70, line: 285, baseType: !64, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !548, file: !70, line: 286, baseType: !22, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !548, file: !70, line: 287, baseType: !566, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !24, line: 1102, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{!23, !375, !25, !22, !570}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !548, file: !70, line: 288, baseType: !68, size: 64, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !70, line: 289, baseType: !68, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !69, file: !70, line: 389, baseType: !574, size: 512)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !70, line: 307, size: 512, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !574, file: !70, line: 308, baseType: !68, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !574, file: !70, line: 308, baseType: !19, size: 8, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !574, file: !70, line: 308, baseType: !19, size: 8, offset: 72)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !574, file: !70, line: 308, baseType: !13, size: 16, offset: 80)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !70, line: 308, baseType: !19, size: 8, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !574, file: !70, line: 308, baseType: !19, size: 8, offset: 104)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !574, file: !70, line: 309, baseType: !19, size: 8, offset: 112)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !574, file: !70, line: 310, baseType: !19, size: 8, offset: 120)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !574, file: !70, line: 311, baseType: !22, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !574, file: !70, line: 312, baseType: !64, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !574, file: !70, line: 313, baseType: !128, size: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !574, file: !70, line: 314, baseType: !18, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !574, file: !70, line: 315, baseType: !18, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !574, file: !70, line: 316, baseType: !25, size: 32, offset: 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !69, file: !70, line: 390, baseType: !591, size: 448)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !70, line: 340, size: 448, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !591, file: !70, line: 341, baseType: !68, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !591, file: !70, line: 341, baseType: !19, size: 8, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !591, file: !70, line: 341, baseType: !19, size: 8, offset: 72)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !591, file: !70, line: 341, baseType: !13, size: 16, offset: 80)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !591, file: !70, line: 341, baseType: !19, size: 8, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !591, file: !70, line: 341, baseType: !64, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !591, file: !70, line: 342, baseType: !64, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !591, file: !70, line: 343, baseType: !22, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !591, file: !70, line: 344, baseType: !18, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !591, file: !70, line: 345, baseType: !25, size: 32, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !70, line: 391, baseType: !604, size: 256)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !70, line: 350, size: 256, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !611, !616}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !604, file: !70, line: 351, baseType: !68, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !604, file: !70, line: 351, baseType: !19, size: 8, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !604, file: !70, line: 351, baseType: !19, size: 8, offset: 72)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !604, file: !70, line: 351, baseType: !13, size: 16, offset: 80)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !604, file: !70, line: 351, baseType: !19, size: 8, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !604, file: !70, line: 351, baseType: !612, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !24, line: 1055, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !375, !22}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !604, file: !70, line: 352, baseType: !22, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !69, file: !70, line: 392, baseType: !618, size: 192)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !70, line: 357, size: 192, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !618, file: !70, line: 358, baseType: !68, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !618, file: !70, line: 358, baseType: !19, size: 8, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !618, file: !70, line: 358, baseType: !19, size: 8, offset: 72)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !618, file: !70, line: 358, baseType: !13, size: 16, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !70, line: 358, baseType: !19, size: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !618, file: !70, line: 358, baseType: !68, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !69, file: !70, line: 399, baseType: !65, size: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !65, file: !6, line: 135, baseType: !19, size: 8, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !6, line: 136, baseType: !19, size: 8, offset: 72)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !6, line: 137, baseType: !13, size: 16, offset: 80)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !6, line: 138, baseType: !631, size: 32, offset: 96)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !632, line: 327, size: 32, elements: !633)
!632 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !631, file: !632, line: 328, baseType: !25, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !631, file: !632, line: 329, baseType: !636, size: 32)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 32, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 4)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !65, file: !6, line: 139, baseType: !64, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !65, file: !6, line: 140, baseType: !64, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !65, file: !6, line: 141, baseType: !64, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !65, file: !6, line: 142, baseType: !175, size: 16, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !55, file: !6, line: 829, baseType: !644, size: 64, offset: 320)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !6, line: 716, size: 64, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !644, file: !6, line: 717, baseType: !27, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !644, file: !6, line: 718, baseType: !25, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !644, file: !6, line: 719, baseType: !102, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !644, file: !6, line: 720, baseType: !18, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !6, line: 721, baseType: !102, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !644, file: !6, line: 722, baseType: !51, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !55, file: !6, line: 829, baseType: !19, size: 8, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !52, file: !6, line: 877, baseType: !654, size: 640)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !6, line: 835, size: 640, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !654, file: !6, line: 836, baseType: !51, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !654, file: !6, line: 836, baseType: !19, size: 8, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !654, file: !6, line: 836, baseType: !19, size: 8, offset: 72)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !654, file: !6, line: 836, baseType: !13, size: 16, offset: 80)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !654, file: !6, line: 836, baseType: !18, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !6, line: 836, baseType: !51, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !654, file: !6, line: 836, baseType: !64, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !654, file: !6, line: 836, baseType: !644, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !654, file: !6, line: 836, baseType: !19, size: 8, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !654, file: !6, line: 836, baseType: !102, size: 64, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !654, file: !6, line: 837, baseType: !18, size: 64, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !654, file: !6, line: 838, baseType: !25, size: 32, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !654, file: !6, line: 839, baseType: !25, size: 32, offset: 608)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !52, file: !6, line: 878, baseType: !670, size: 1600)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !6, line: 846, size: 1600, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !670, file: !6, line: 847, baseType: !51, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !670, file: !6, line: 847, baseType: !19, size: 8, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !670, file: !6, line: 847, baseType: !19, size: 8, offset: 72)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !670, file: !6, line: 847, baseType: !13, size: 16, offset: 80)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !670, file: !6, line: 847, baseType: !18, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !6, line: 847, baseType: !51, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !670, file: !6, line: 847, baseType: !64, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !670, file: !6, line: 847, baseType: !644, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !670, file: !6, line: 847, baseType: !19, size: 8, offset: 384)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !670, file: !6, line: 847, baseType: !51, size: 64, offset: 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !670, file: !6, line: 848, baseType: !51, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !670, file: !6, line: 849, baseType: !102, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !670, file: !6, line: 850, baseType: !19, size: 8, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !670, file: !6, line: 851, baseType: !102, size: 64, offset: 704)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !670, file: !6, line: 852, baseType: !102, size: 64, offset: 768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !670, file: !6, line: 853, baseType: !102, size: 64, offset: 832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !670, file: !6, line: 854, baseType: !636, size: 32, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !670, file: !6, line: 855, baseType: !25, size: 32, offset: 928)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !670, file: !6, line: 856, baseType: !25, size: 32, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !670, file: !6, line: 857, baseType: !25, size: 32, offset: 992)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !670, file: !6, line: 858, baseType: !25, size: 32, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !670, file: !6, line: 859, baseType: !25, size: 32, offset: 1056)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !670, file: !6, line: 860, baseType: !25, size: 32, offset: 1088)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !670, file: !6, line: 861, baseType: !25, size: 32, offset: 1120)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !670, file: !6, line: 862, baseType: !25, size: 32, offset: 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !670, file: !6, line: 863, baseType: !25, size: 32, offset: 1184)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !670, file: !6, line: 864, baseType: !25, size: 32, offset: 1216)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !670, file: !6, line: 865, baseType: !25, size: 32, offset: 1248)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !670, file: !6, line: 866, baseType: !25, size: 32, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !670, file: !6, line: 867, baseType: !25, size: 32, offset: 1312)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !670, file: !6, line: 868, baseType: !13, size: 16, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !670, file: !6, line: 869, baseType: !19, size: 8, offset: 1360)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !670, file: !6, line: 870, baseType: !19, size: 8, offset: 1368)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !670, file: !6, line: 871, baseType: !19, size: 8, offset: 1376)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !670, file: !6, line: 872, baseType: !707, size: 160, offset: 1384)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 160, elements: !708)
!708 = !{!709}
!709 = !DISubrange(count: 20)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !42, file: !6, line: 596, baseType: !18, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !42, file: !6, line: 597, baseType: !18, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !42, file: !6, line: 598, baseType: !27, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !31, file: !6, line: 666, baseType: !714, size: 192)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !6, line: 573, size: 192, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !6, line: 574, baseType: !22, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !714, file: !6, line: 574, baseType: !19, size: 8, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !714, file: !6, line: 574, baseType: !19, size: 8, offset: 72)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !714, file: !6, line: 574, baseType: !13, size: 16, offset: 80)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !714, file: !6, line: 574, baseType: !13, size: 16, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !714, file: !6, line: 574, baseType: !68, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !31, file: !6, line: 667, baseType: !723, size: 192)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !6, line: 604, size: 192, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !6, line: 605, baseType: !22, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !723, file: !6, line: 605, baseType: !19, size: 8, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !723, file: !6, line: 605, baseType: !19, size: 8, offset: 72)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !723, file: !6, line: 605, baseType: !13, size: 16, offset: 80)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !723, file: !6, line: 605, baseType: !13, size: 16, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !723, file: !6, line: 605, baseType: !64, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !31, file: !6, line: 668, baseType: !732, size: 448)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !6, line: 608, size: 448, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !732, file: !6, line: 609, baseType: !22, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !732, file: !6, line: 609, baseType: !19, size: 8, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !6, line: 609, baseType: !19, size: 8, offset: 72)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !732, file: !6, line: 609, baseType: !13, size: 16, offset: 80)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !732, file: !6, line: 609, baseType: !13, size: 16, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !732, file: !6, line: 609, baseType: !25, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !732, file: !6, line: 610, baseType: !51, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !732, file: !6, line: 611, baseType: !18, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !732, file: !6, line: 612, baseType: !18, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !732, file: !6, line: 613, baseType: !25, size: 32, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !31, file: !6, line: 669, baseType: !745, size: 512)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !6, line: 580, size: 512, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !6, line: 581, baseType: !22, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !745, file: !6, line: 581, baseType: !19, size: 8, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !6, line: 581, baseType: !19, size: 8, offset: 72)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !745, file: !6, line: 581, baseType: !13, size: 16, offset: 80)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !745, file: !6, line: 581, baseType: !13, size: 16, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !745, file: !6, line: 581, baseType: !25, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !745, file: !6, line: 582, baseType: !68, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !745, file: !6, line: 583, baseType: !68, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !745, file: !6, line: 584, baseType: !163, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !745, file: !6, line: 585, baseType: !22, size: 64, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !745, file: !6, line: 586, baseType: !25, size: 32, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !31, file: !6, line: 670, baseType: !250, size: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !31, file: !6, line: 671, baseType: !760, size: 640)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !6, line: 631, size: 640, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !6, line: 632, baseType: !22, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !760, file: !6, line: 632, baseType: !19, size: 8, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !760, file: !6, line: 632, baseType: !19, size: 8, offset: 72)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !760, file: !6, line: 632, baseType: !13, size: 16, offset: 80)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !760, file: !6, line: 632, baseType: !13, size: 16, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !760, file: !6, line: 633, baseType: !768, size: 512, offset: 128)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 512, elements: !212)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !31, file: !6, line: 672, baseType: !770, size: 320)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !6, line: 654, size: 320, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !770, file: !6, line: 655, baseType: !22, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !770, file: !6, line: 655, baseType: !19, size: 8, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !6, line: 655, baseType: !19, size: 8, offset: 72)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !770, file: !6, line: 655, baseType: !13, size: 16, offset: 80)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !770, file: !6, line: 655, baseType: !13, size: 16, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !770, file: !6, line: 655, baseType: !19, size: 8, offset: 112)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !770, file: !6, line: 656, baseType: !64, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !770, file: !6, line: 657, baseType: !68, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !770, file: !6, line: 658, baseType: !781, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !6, line: 645, size: 128, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !782, file: !6, line: 646, baseType: !541, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !782, file: !6, line: 647, baseType: !22, size: 64, offset: 64)
!786 = !{!0}
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 64, elements: !212)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!789 = !{i32 7, !"Dwarf Version", i32 4}
!790 = !{i32 2, !"Debug Info Version", i32 3}
!791 = !{i32 1, !"wchar_size", i32 2}
!792 = !{i32 1, !"Code Model", i32 2}
!793 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!794 = distinct !DISubprogram(name: "acpi_ps_get_opcode_size", scope: !3, file: !3, line: 41, type: !795, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!25, !25}
!797 = !{}
!798 = !DILocalVariable(name: "opcode", arg: 1, scope: !794, file: !3, line: 41, type: !25)
!799 = !DILocation(line: 41, column: 33, scope: !794)
!800 = !DILocation(line: 46, column: 6, scope: !801)
!801 = distinct !DILexicalBlock(scope: !794, file: !3, line: 46, column: 6)
!802 = !DILocation(line: 46, column: 13, scope: !801)
!803 = !DILocation(line: 46, column: 6, scope: !794)
!804 = !DILocation(line: 47, column: 3, scope: !805)
!805 = distinct !DILexicalBlock(scope: !801, file: !3, line: 46, column: 23)
!806 = !DILocation(line: 52, column: 2, scope: !794)
!807 = !DILocation(line: 53, column: 1, scope: !794)
!808 = distinct !DISubprogram(name: "acpi_ps_peek_opcode", scope: !3, file: !3, line: 67, type: !809, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !797)
!809 = !DISubroutineType(types: !810)
!810 = !{!13, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!812 = !DILocalVariable(name: "parser_state", arg: 1, scope: !808, file: !3, line: 67, type: !811)
!813 = !DILocation(line: 67, column: 51, scope: !808)
!814 = !DILocalVariable(name: "aml", scope: !808, file: !3, line: 69, type: !18)
!815 = !DILocation(line: 69, column: 6, scope: !808)
!816 = !DILocalVariable(name: "opcode", scope: !808, file: !3, line: 70, type: !13)
!817 = !DILocation(line: 70, column: 6, scope: !808)
!818 = !DILocation(line: 72, column: 8, scope: !808)
!819 = !DILocation(line: 72, column: 22, scope: !808)
!820 = !DILocation(line: 72, column: 6, scope: !808)
!821 = !DILocation(line: 73, column: 17, scope: !808)
!822 = !DILocation(line: 73, column: 11, scope: !808)
!823 = !DILocation(line: 73, column: 9, scope: !808)
!824 = !DILocation(line: 75, column: 6, scope: !825)
!825 = distinct !DILexicalBlock(scope: !808, file: !3, line: 75, column: 6)
!826 = !DILocation(line: 75, column: 13, scope: !825)
!827 = !DILocation(line: 75, column: 6, scope: !808)
!828 = !DILocation(line: 79, column: 6, scope: !829)
!829 = distinct !DILexicalBlock(scope: !825, file: !3, line: 75, column: 37)
!830 = !DILocation(line: 80, column: 20, scope: !829)
!831 = !DILocation(line: 80, column: 27, scope: !829)
!832 = !DILocation(line: 80, column: 35, scope: !829)
!833 = !DILocation(line: 80, column: 33, scope: !829)
!834 = !DILocation(line: 80, column: 12, scope: !829)
!835 = !DILocation(line: 80, column: 10, scope: !829)
!836 = !DILocation(line: 81, column: 2, scope: !829)
!837 = !DILocation(line: 83, column: 10, scope: !808)
!838 = !DILocation(line: 83, column: 2, scope: !808)
!839 = distinct !DISubprogram(name: "acpi_ps_complete_this_op", scope: !3, file: !3, line: 100, type: !840, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !797)
!840 = !DISubroutineType(types: !841)
!841 = !{!23, !163, !51}
!842 = !DILocalVariable(name: "walk_state", arg: 1, scope: !839, file: !3, line: 100, type: !163)
!843 = !DILocation(line: 100, column: 50, scope: !839)
!844 = !DILocalVariable(name: "op", arg: 2, scope: !839, file: !3, line: 101, type: !51)
!845 = !DILocation(line: 101, column: 30, scope: !839)
