; ModuleID = '../bcout/drivers/acpi/acpica/rscalc.llvm.bc'
source_filename = "drivers/acpi/acpica/rscalc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_resource = type { i32, i32, %union.acpi_resource_data }
%union.acpi_resource_data = type { %struct.acpi_resource_vendor_typed, [40 x i8] }
%struct.acpi_resource_vendor_typed = type { i16, i8, [16 x i8], [1 x i8] }
%struct.acpi_resource_irq = type { i8, i8, i8, i8, i8, i8, [1 x i8] }
%struct.acpi_resource_vendor = type <{ i16, [1 x i8] }>
%struct.acpi_resource_address16 = type <{ i8, i8, i8, i8, i8, %union.acpi_resource_attribute, %struct.acpi_address16_attribute, %struct.acpi_resource_source }>
%union.acpi_resource_attribute = type { %struct.acpi_memory_attribute }
%struct.acpi_memory_attribute = type { i8, i8, i8, i8 }
%struct.acpi_address16_attribute = type { i16, i16, i16, i16, i16 }
%struct.acpi_resource_source = type <{ i8, i16, i8* }>
%struct.acpi_resource_address32 = type <{ i8, i8, i8, i8, i8, %union.acpi_resource_attribute, %struct.acpi_address32_attribute, %struct.acpi_resource_source }>
%struct.acpi_address32_attribute = type { i32, i32, i32, i32, i32 }
%struct.acpi_resource_address64 = type <{ i8, i8, i8, i8, i8, %union.acpi_resource_attribute, %struct.acpi_address64_attribute, %struct.acpi_resource_source }>
%struct.acpi_address64_attribute = type { i64, i64, i64, i64, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/acpi/acpica/rscalc.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 321, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14}
!7 = !DIEnumerator(name: "ACPI_REFCLASS_LOCAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "ACPI_REFCLASS_ARG", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "ACPI_REFCLASS_REFOF", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_REFCLASS_INDEX", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_REFCLASS_TABLE", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "ACPI_REFCLASS_NAME", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "ACPI_REFCLASS_DEBUG", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "ACPI_REFCLASS_MAX", value: 6, isUnsigned: true)
!15 = !{!16, !398, !255, !399, !401, !402, !21, !253, !66}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource", file: !18, line: 651, size: 544, elements: !19)
!18 = !DIFile(filename: "./include/acpi/acrestyp.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !25, !26}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !18, line: 652, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !22, line: 21, baseType: !23)
!22 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !24, line: 27, baseType: !5)
!24 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!25 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !17, file: !18, line: 653, baseType: !21, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !17, file: !18, line: 654, baseType: !27, size: 480, offset: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_data", file: !18, line: 614, size: 480, elements: !28)
!28 = !{!29, !45, !53, !59, !70, !75, !81, !86, !96, !100, !108, !116, !122, !164, !182, !203, !215, !227, !235, !256, !272, !292, !314, !327, !339, !352, !366, !377, !389}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !27, file: !18, line: 615, baseType: !30, size: 56)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_irq", file: !18, line: 138, size: 56, elements: !31)
!31 = !{!32, !36, !37, !38, !39, !40, !41}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !30, file: !18, line: 139, baseType: !33, size: 8)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !22, line: 17, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !24, line: 21, baseType: !35)
!35 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !30, file: !18, line: 140, baseType: !33, size: 8, offset: 8)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !30, file: !18, line: 141, baseType: !33, size: 8, offset: 16)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !30, file: !18, line: 142, baseType: !33, size: 8, offset: 24)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !30, file: !18, line: 143, baseType: !33, size: 8, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !30, file: !18, line: 144, baseType: !33, size: 8, offset: 40)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !30, file: !18, line: 145, baseType: !42, size: 8, offset: 48)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 1)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !27, file: !18, line: 616, baseType: !46, size: 40)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_dma", file: !18, line: 148, size: 40, elements: !47)
!47 = !{!48, !49, !50, !51, !52}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !18, line: 149, baseType: !33, size: 8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bus_master", scope: !46, file: !18, line: 150, baseType: !33, size: 8, offset: 8)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !46, file: !18, line: 151, baseType: !33, size: 8, offset: 16)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "channel_count", scope: !46, file: !18, line: 152, baseType: !33, size: 8, offset: 24)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !46, file: !18, line: 153, baseType: !42, size: 8, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !27, file: !18, line: 617, baseType: !54, size: 24)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_start_dependent", file: !18, line: 156, size: 24, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !54, file: !18, line: 157, baseType: !33, size: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility_priority", scope: !54, file: !18, line: 158, baseType: !33, size: 8, offset: 8)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "performance_robustness", scope: !54, file: !18, line: 159, baseType: !33, size: 8, offset: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !27, file: !18, line: 618, baseType: !60, size: 56)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_io", file: !18, line: 167, size: 56, elements: !61)
!61 = !{!62, !63, !64, !65, !69}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "io_decode", scope: !60, file: !18, line: 168, baseType: !33, size: 8)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !60, file: !18, line: 169, baseType: !33, size: 8, offset: 8)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !60, file: !18, line: 170, baseType: !33, size: 8, offset: 16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !60, file: !18, line: 171, baseType: !66, size: 16, offset: 24)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !22, line: 19, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !24, line: 24, baseType: !68)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !60, file: !18, line: 172, baseType: !66, size: 16, offset: 40)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !27, file: !18, line: 619, baseType: !71, size: 24)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_io", file: !18, line: 175, size: 24, elements: !72)
!72 = !{!73, !74}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !71, file: !18, line: 176, baseType: !66, size: 16)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !71, file: !18, line: 177, baseType: !33, size: 8, offset: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !27, file: !18, line: 620, baseType: !76, size: 40)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_dma", file: !18, line: 180, size: 40, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !76, file: !18, line: 181, baseType: !66, size: 16)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !76, file: !18, line: 182, baseType: !66, size: 16, offset: 16)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !76, file: !18, line: 183, baseType: !33, size: 8, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !27, file: !18, line: 621, baseType: !82, size: 24)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor", file: !18, line: 195, size: 24, elements: !83)
!83 = !{!84, !85}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !82, file: !18, line: 196, baseType: !66, size: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !82, file: !18, line: 197, baseType: !42, size: 8, offset: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_typed", scope: !27, file: !18, line: 622, baseType: !87, size: 160)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor_typed", file: !18, line: 202, size: 160, elements: !88)
!88 = !{!89, !90, !91, !95}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !87, file: !18, line: 203, baseType: !66, size: 16)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_subtype", scope: !87, file: !18, line: 204, baseType: !33, size: 8, offset: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !87, file: !18, line: 205, baseType: !92, size: 128, offset: 24)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 128, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !87, file: !18, line: 206, baseType: !42, size: 8, offset: 152)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !27, file: !18, line: 623, baseType: !97, size: 8)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_end_tag", file: !18, line: 209, size: 8, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !97, file: !18, line: 210, baseType: !33, size: 8)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !27, file: !18, line: 624, baseType: !101, size: 72)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory24", file: !18, line: 213, size: 72, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !101, file: !18, line: 214, baseType: !33, size: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !101, file: !18, line: 215, baseType: !66, size: 16, offset: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !101, file: !18, line: 216, baseType: !66, size: 16, offset: 24)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !101, file: !18, line: 217, baseType: !66, size: 16, offset: 40)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !101, file: !18, line: 218, baseType: !66, size: 16, offset: 56)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !27, file: !18, line: 625, baseType: !109, size: 136)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory32", file: !18, line: 221, size: 136, elements: !110)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !109, file: !18, line: 222, baseType: !33, size: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !109, file: !18, line: 223, baseType: !21, size: 32, offset: 8)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !109, file: !18, line: 224, baseType: !21, size: 32, offset: 40)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !109, file: !18, line: 225, baseType: !21, size: 32, offset: 72)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !109, file: !18, line: 226, baseType: !21, size: 32, offset: 104)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !27, file: !18, line: 626, baseType: !117, size: 72)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_memory32", file: !18, line: 229, size: 72, elements: !118)
!118 = !{!119, !120, !121}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !117, file: !18, line: 230, baseType: !33, size: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !117, file: !18, line: 231, baseType: !21, size: 32, offset: 8)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !117, file: !18, line: 232, baseType: !21, size: 32, offset: 40)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !27, file: !18, line: 627, baseType: !123, size: 240)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address16", file: !18, line: 306, size: 240, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !148, !156}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !123, file: !18, line: 307, baseType: !33, size: 8)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !123, file: !18, line: 307, baseType: !33, size: 8, offset: 8)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !123, file: !18, line: 307, baseType: !33, size: 8, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !123, file: !18, line: 307, baseType: !33, size: 8, offset: 24)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !123, file: !18, line: 307, baseType: !33, size: 8, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !123, file: !18, line: 307, baseType: !131, size: 32, offset: 40)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_attribute", file: !18, line: 249, size: 32, elements: !132)
!132 = !{!133, !140, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !131, file: !18, line: 250, baseType: !134, size: 32)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_memory_attribute", file: !18, line: 235, size: 32, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !134, file: !18, line: 236, baseType: !33, size: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !134, file: !18, line: 237, baseType: !33, size: 8, offset: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !134, file: !18, line: 238, baseType: !33, size: 8, offset: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !134, file: !18, line: 239, baseType: !33, size: 8, offset: 24)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !131, file: !18, line: 251, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_io_attribute", file: !18, line: 242, size: 32, elements: !142)
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !141, file: !18, line: 243, baseType: !33, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !141, file: !18, line: 244, baseType: !33, size: 8, offset: 8)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "translation_type", scope: !141, file: !18, line: 245, baseType: !33, size: 8, offset: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !141, file: !18, line: 246, baseType: !33, size: 8, offset: 24)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !131, file: !18, line: 255, baseType: !33, size: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !123, file: !18, line: 307, baseType: !149, size: 80, offset: 72)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address16_attribute", file: !18, line: 279, size: 80, elements: !150)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !149, file: !18, line: 280, baseType: !66, size: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !149, file: !18, line: 281, baseType: !66, size: 16, offset: 16)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !149, file: !18, line: 282, baseType: !66, size: 16, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !149, file: !18, line: 283, baseType: !66, size: 16, offset: 48)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !149, file: !18, line: 284, baseType: !66, size: 16, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !123, file: !18, line: 308, baseType: !157, size: 88, offset: 152)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_source", file: !18, line: 263, size: 88, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !157, file: !18, line: 264, baseType: !33, size: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !157, file: !18, line: 265, baseType: !66, size: 16, offset: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !157, file: !18, line: 266, baseType: !162, size: 64, offset: 24)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !27, file: !18, line: 628, baseType: !165, size: 320)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address32", file: !18, line: 311, size: 320, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !181}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !165, file: !18, line: 312, baseType: !33, size: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !165, file: !18, line: 312, baseType: !33, size: 8, offset: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !165, file: !18, line: 312, baseType: !33, size: 8, offset: 16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !165, file: !18, line: 312, baseType: !33, size: 8, offset: 24)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !165, file: !18, line: 312, baseType: !33, size: 8, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !165, file: !18, line: 312, baseType: !131, size: 32, offset: 40)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !165, file: !18, line: 312, baseType: !174, size: 160, offset: 72)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address32_attribute", file: !18, line: 287, size: 160, elements: !175)
!175 = !{!176, !177, !178, !179, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !174, file: !18, line: 288, baseType: !21, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !174, file: !18, line: 289, baseType: !21, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !174, file: !18, line: 290, baseType: !21, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !174, file: !18, line: 291, baseType: !21, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !174, file: !18, line: 292, baseType: !21, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !165, file: !18, line: 313, baseType: !157, size: 88, offset: 232)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !27, file: !18, line: 629, baseType: !183, size: 480)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address64", file: !18, line: 316, size: 480, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !202}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !183, file: !18, line: 317, baseType: !33, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !183, file: !18, line: 317, baseType: !33, size: 8, offset: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !183, file: !18, line: 317, baseType: !33, size: 8, offset: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !183, file: !18, line: 317, baseType: !33, size: 8, offset: 24)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !183, file: !18, line: 317, baseType: !33, size: 8, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !183, file: !18, line: 317, baseType: !131, size: 32, offset: 40)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !183, file: !18, line: 317, baseType: !192, size: 320, offset: 72)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address64_attribute", file: !18, line: 295, size: 320, elements: !193)
!193 = !{!194, !198, !199, !200, !201}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !192, file: !18, line: 296, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !22, line: 23, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !24, line: 31, baseType: !197)
!197 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !192, file: !18, line: 297, baseType: !195, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !192, file: !18, line: 298, baseType: !195, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !192, file: !18, line: 299, baseType: !195, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !192, file: !18, line: 300, baseType: !195, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !183, file: !18, line: 318, baseType: !157, size: 88, offset: 392)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !27, file: !18, line: 630, baseType: !204, size: 464)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_address64", file: !18, line: 321, size: 464, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !204, file: !18, line: 322, baseType: !33, size: 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !204, file: !18, line: 322, baseType: !33, size: 8, offset: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !204, file: !18, line: 322, baseType: !33, size: 8, offset: 16)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !204, file: !18, line: 322, baseType: !33, size: 8, offset: 24)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !204, file: !18, line: 322, baseType: !33, size: 8, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !204, file: !18, line: 322, baseType: !131, size: 32, offset: 40)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !204, file: !18, line: 322, baseType: !33, size: 8, offset: 72)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !204, file: !18, line: 323, baseType: !192, size: 320, offset: 80)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !204, file: !18, line: 324, baseType: !195, size: 64, offset: 400)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !27, file: !18, line: 631, baseType: !216, size: 168)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_irq", file: !18, line: 327, size: 168, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !216, file: !18, line: 328, baseType: !33, size: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !216, file: !18, line: 329, baseType: !33, size: 8, offset: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !216, file: !18, line: 330, baseType: !33, size: 8, offset: 16)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !216, file: !18, line: 331, baseType: !33, size: 8, offset: 24)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !216, file: !18, line: 332, baseType: !33, size: 8, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !216, file: !18, line: 333, baseType: !33, size: 8, offset: 40)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !216, file: !18, line: 334, baseType: !157, size: 88, offset: 48)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !216, file: !18, line: 335, baseType: !226, size: 32, offset: 136)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, elements: !43)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !27, file: !18, line: 632, baseType: !228, size: 96)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_generic_register", file: !18, line: 338, size: 96, elements: !229)
!229 = !{!230, !231, !232, !233, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !228, file: !18, line: 339, baseType: !33, size: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !228, file: !18, line: 340, baseType: !33, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !228, file: !18, line: 341, baseType: !33, size: 8, offset: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !228, file: !18, line: 342, baseType: !33, size: 8, offset: 24)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !228, file: !18, line: 343, baseType: !195, size: 64, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !27, file: !18, line: 633, baseType: !236, size: 352)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_gpio", file: !18, line: 346, size: 352, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !236, file: !18, line: 347, baseType: !33, size: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !236, file: !18, line: 348, baseType: !33, size: 8, offset: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !236, file: !18, line: 349, baseType: !33, size: 8, offset: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !236, file: !18, line: 350, baseType: !33, size: 8, offset: 24)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !236, file: !18, line: 351, baseType: !33, size: 8, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !236, file: !18, line: 352, baseType: !33, size: 8, offset: 40)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "io_restriction", scope: !236, file: !18, line: 353, baseType: !33, size: 8, offset: 48)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !236, file: !18, line: 354, baseType: !33, size: 8, offset: 56)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !236, file: !18, line: 355, baseType: !33, size: 8, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !236, file: !18, line: 356, baseType: !66, size: 16, offset: 72)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !236, file: !18, line: 357, baseType: !66, size: 16, offset: 88)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !236, file: !18, line: 358, baseType: !66, size: 16, offset: 104)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !236, file: !18, line: 359, baseType: !66, size: 16, offset: 120)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !236, file: !18, line: 360, baseType: !157, size: 88, offset: 136)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !236, file: !18, line: 361, baseType: !253, size: 64, offset: 224)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !236, file: !18, line: 362, baseType: !255, size: 64, offset: 288)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !27, file: !18, line: 634, baseType: !257, size: 288)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_i2c_serialbus", file: !18, line: 412, size: 288, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !257, file: !18, line: 413, baseType: !33, size: 8)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !257, file: !18, line: 413, baseType: !33, size: 8, offset: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !257, file: !18, line: 413, baseType: !33, size: 8, offset: 16)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !257, file: !18, line: 413, baseType: !33, size: 8, offset: 24)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !257, file: !18, line: 413, baseType: !33, size: 8, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !257, file: !18, line: 413, baseType: !33, size: 8, offset: 40)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !257, file: !18, line: 413, baseType: !66, size: 16, offset: 48)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !257, file: !18, line: 413, baseType: !66, size: 16, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !257, file: !18, line: 413, baseType: !157, size: 88, offset: 80)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !257, file: !18, line: 413, baseType: !255, size: 64, offset: 168)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "access_mode", scope: !257, file: !18, line: 413, baseType: !33, size: 8, offset: 232)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !257, file: !18, line: 414, baseType: !66, size: 16, offset: 240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !257, file: !18, line: 415, baseType: !21, size: 32, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !27, file: !18, line: 635, baseType: !273, size: 320)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_spi_serialbus", file: !18, line: 423, size: 320, elements: !274)
!274 = !{!275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !273, file: !18, line: 424, baseType: !33, size: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !273, file: !18, line: 424, baseType: !33, size: 8, offset: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !273, file: !18, line: 424, baseType: !33, size: 8, offset: 16)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !273, file: !18, line: 424, baseType: !33, size: 8, offset: 24)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !273, file: !18, line: 424, baseType: !33, size: 8, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !273, file: !18, line: 424, baseType: !33, size: 8, offset: 40)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !273, file: !18, line: 424, baseType: !66, size: 16, offset: 48)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !273, file: !18, line: 424, baseType: !66, size: 16, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !273, file: !18, line: 424, baseType: !157, size: 88, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !273, file: !18, line: 424, baseType: !255, size: 64, offset: 168)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "wire_mode", scope: !273, file: !18, line: 424, baseType: !33, size: 8, offset: 232)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "device_polarity", scope: !273, file: !18, line: 425, baseType: !33, size: 8, offset: 240)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !273, file: !18, line: 426, baseType: !33, size: 8, offset: 248)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !273, file: !18, line: 427, baseType: !33, size: 8, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !273, file: !18, line: 428, baseType: !33, size: 8, offset: 264)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !273, file: !18, line: 429, baseType: !66, size: 16, offset: 272)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !273, file: !18, line: 430, baseType: !21, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !27, file: !18, line: 636, baseType: !293, size: 344)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_uart_serialbus", file: !18, line: 453, size: 344, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !293, file: !18, line: 454, baseType: !33, size: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !293, file: !18, line: 454, baseType: !33, size: 8, offset: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !293, file: !18, line: 454, baseType: !33, size: 8, offset: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !293, file: !18, line: 454, baseType: !33, size: 8, offset: 24)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !293, file: !18, line: 454, baseType: !33, size: 8, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !293, file: !18, line: 454, baseType: !33, size: 8, offset: 40)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !293, file: !18, line: 454, baseType: !66, size: 16, offset: 48)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !293, file: !18, line: 454, baseType: !66, size: 16, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !293, file: !18, line: 454, baseType: !157, size: 88, offset: 80)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !293, file: !18, line: 454, baseType: !255, size: 64, offset: 168)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !293, file: !18, line: 454, baseType: !33, size: 8, offset: 232)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !293, file: !18, line: 455, baseType: !33, size: 8, offset: 240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !293, file: !18, line: 456, baseType: !33, size: 8, offset: 248)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !293, file: !18, line: 457, baseType: !33, size: 8, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !293, file: !18, line: 458, baseType: !33, size: 8, offset: 264)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !293, file: !18, line: 459, baseType: !33, size: 8, offset: 272)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !293, file: !18, line: 460, baseType: !66, size: 16, offset: 280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !293, file: !18, line: 461, baseType: !66, size: 16, offset: 296)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !293, file: !18, line: 462, baseType: !21, size: 32, offset: 312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !27, file: !18, line: 637, baseType: !315, size: 232)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_common_serialbus", file: !18, line: 398, size: 232, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !315, file: !18, line: 399, baseType: !33, size: 8)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !315, file: !18, line: 399, baseType: !33, size: 8, offset: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !315, file: !18, line: 399, baseType: !33, size: 8, offset: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !315, file: !18, line: 399, baseType: !33, size: 8, offset: 24)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !315, file: !18, line: 399, baseType: !33, size: 8, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !315, file: !18, line: 399, baseType: !33, size: 8, offset: 40)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !315, file: !18, line: 399, baseType: !66, size: 16, offset: 48)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !315, file: !18, line: 399, baseType: !66, size: 16, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !315, file: !18, line: 399, baseType: !157, size: 88, offset: 80)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !315, file: !18, line: 399, baseType: !255, size: 64, offset: 168)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pin_function", scope: !27, file: !18, line: 638, baseType: !328, size: 288)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_function", file: !18, line: 508, size: 288, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !328, file: !18, line: 509, baseType: !33, size: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !328, file: !18, line: 510, baseType: !33, size: 8, offset: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !328, file: !18, line: 511, baseType: !33, size: 8, offset: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !328, file: !18, line: 512, baseType: !66, size: 16, offset: 24)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !328, file: !18, line: 513, baseType: !66, size: 16, offset: 40)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !328, file: !18, line: 514, baseType: !66, size: 16, offset: 56)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !328, file: !18, line: 515, baseType: !157, size: 88, offset: 72)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !328, file: !18, line: 516, baseType: !253, size: 64, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !328, file: !18, line: 517, baseType: !255, size: 64, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !27, file: !18, line: 639, baseType: !340, size: 312)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_config", file: !18, line: 520, size: 312, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !340, file: !18, line: 521, baseType: !33, size: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !340, file: !18, line: 522, baseType: !33, size: 8, offset: 8)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !340, file: !18, line: 523, baseType: !33, size: 8, offset: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !340, file: !18, line: 524, baseType: !33, size: 8, offset: 24)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !340, file: !18, line: 525, baseType: !21, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !340, file: !18, line: 526, baseType: !66, size: 16, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !340, file: !18, line: 527, baseType: !66, size: 16, offset: 80)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !340, file: !18, line: 528, baseType: !157, size: 88, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !340, file: !18, line: 529, baseType: !253, size: 64, offset: 184)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !340, file: !18, line: 530, baseType: !255, size: 64, offset: 248)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group", scope: !27, file: !18, line: 640, baseType: !353, size: 256)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group", file: !18, line: 550, size: 256, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360, !365}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !353, file: !18, line: 551, baseType: !33, size: 8)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !353, file: !18, line: 552, baseType: !33, size: 8, offset: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !353, file: !18, line: 553, baseType: !66, size: 16, offset: 16)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !353, file: !18, line: 554, baseType: !66, size: 16, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !353, file: !18, line: 555, baseType: !253, size: 64, offset: 48)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "resource_label", scope: !353, file: !18, line: 556, baseType: !361, size: 80, offset: 112)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_label", file: !18, line: 258, size: 80, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !361, file: !18, line: 259, baseType: !66, size: 16)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !361, file: !18, line: 260, baseType: !162, size: 64, offset: 16)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !353, file: !18, line: 557, baseType: !255, size: 64, offset: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_function", scope: !27, file: !18, line: 641, baseType: !367, size: 288)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_function", file: !18, line: 560, size: 288, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !367, file: !18, line: 561, baseType: !33, size: 8)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !367, file: !18, line: 562, baseType: !33, size: 8, offset: 8)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !367, file: !18, line: 563, baseType: !33, size: 8, offset: 16)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !367, file: !18, line: 564, baseType: !66, size: 16, offset: 24)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !367, file: !18, line: 565, baseType: !66, size: 16, offset: 40)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !367, file: !18, line: 566, baseType: !157, size: 88, offset: 56)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !367, file: !18, line: 567, baseType: !361, size: 80, offset: 144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !367, file: !18, line: 568, baseType: !255, size: 64, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_config", scope: !27, file: !18, line: 642, baseType: !378, size: 312)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_config", file: !18, line: 571, size: 312, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !378, file: !18, line: 572, baseType: !33, size: 8)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !378, file: !18, line: 573, baseType: !33, size: 8, offset: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !378, file: !18, line: 574, baseType: !33, size: 8, offset: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !378, file: !18, line: 575, baseType: !33, size: 8, offset: 24)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !378, file: !18, line: 576, baseType: !21, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !378, file: !18, line: 577, baseType: !66, size: 16, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !378, file: !18, line: 578, baseType: !157, size: 88, offset: 80)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !378, file: !18, line: 579, baseType: !361, size: 80, offset: 168)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !378, file: !18, line: 580, baseType: !255, size: 64, offset: 248)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !27, file: !18, line: 646, baseType: !390, size: 72)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address", file: !18, line: 303, size: 72, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !390, file: !18, line: 304, baseType: !33, size: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !390, file: !18, line: 304, baseType: !33, size: 8, offset: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !390, file: !18, line: 304, baseType: !33, size: 8, offset: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !390, file: !18, line: 304, baseType: !33, size: 8, offset: 24)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !390, file: !18, line: 304, baseType: !33, size: 8, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !390, file: !18, line: 304, baseType: !131, size: 32, offset: 40)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !400, line: 127, baseType: !195)
!400 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !400, line: 421, baseType: !21)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_rs_length", file: !18, line: 16, baseType: !66)
!403 = !{i32 7, !"Dwarf Version", i32 4}
!404 = !{i32 2, !"Debug Info Version", i32 3}
!405 = !{i32 1, !"wchar_size", i32 2}
!406 = !{i32 1, !"Code Model", i32 2}
!407 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!408 = distinct !DISubprogram(name: "acpi_rs_get_aml_length", scope: !1, file: !1, line: 154, type: !409, scopeLine: 156, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !412)
!409 = !DISubroutineType(types: !410)
!410 = !{!401, !16, !399, !411}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!412 = !{}
!413 = !DILocalVariable(name: "resource", arg: 1, scope: !408, file: !1, line: 154, type: !16)
!414 = !DILocation(line: 154, column: 46, scope: !408)
!415 = !DILocalVariable(name: "resource_list_size", arg: 2, scope: !408, file: !1, line: 155, type: !399)
!416 = !DILocation(line: 155, column: 20, scope: !408)
!417 = !DILocalVariable(name: "size_needed", arg: 3, scope: !408, file: !1, line: 155, type: !411)
!418 = !DILocation(line: 155, column: 51, scope: !408)
!419 = !DILocalVariable(name: "aml_size_needed", scope: !408, file: !1, line: 157, type: !399)
!420 = !DILocation(line: 157, column: 12, scope: !408)
!421 = !DILocalVariable(name: "resource_end", scope: !408, file: !1, line: 158, type: !16)
!422 = !DILocation(line: 158, column: 24, scope: !408)
!423 = !DILocalVariable(name: "total_size", scope: !408, file: !1, line: 159, type: !402)
!424 = !DILocation(line: 159, column: 17, scope: !408)
!425 = !DILocation(line: 166, column: 6, scope: !408)
!426 = !DILocation(line: 165, column: 15, scope: !408)
!427 = !DILocation(line: 167, column: 2, scope: !408)
!428 = !DILocation(line: 167, column: 9, scope: !408)
!429 = !DILocation(line: 167, column: 20, scope: !408)
!430 = !DILocation(line: 167, column: 18, scope: !408)
!431 = !DILocation(line: 171, column: 7, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !1, line: 171, column: 7)
!433 = distinct !DILexicalBlock(scope: !408, file: !1, line: 167, column: 34)
!434 = !DILocation(line: 171, column: 17, scope: !432)
!435 = !DILocation(line: 171, column: 22, scope: !432)
!436 = !DILocation(line: 171, column: 7, scope: !433)
!437 = !DILocation(line: 172, column: 4, scope: !438)
!438 = distinct !DILexicalBlock(scope: !432, file: !1, line: 171, column: 48)
!439 = !DILocation(line: 177, column: 8, scope: !440)
!440 = distinct !DILexicalBlock(scope: !433, file: !1, line: 177, column: 7)
!441 = !DILocation(line: 177, column: 18, scope: !440)
!442 = !DILocation(line: 177, column: 7, scope: !433)
!443 = !DILocation(line: 178, column: 4, scope: !444)
!444 = distinct !DILexicalBlock(scope: !440, file: !1, line: 177, column: 26)
!445 = !DILocation(line: 183, column: 44, scope: !433)
!446 = !DILocation(line: 183, column: 54, scope: !433)
!447 = !DILocation(line: 183, column: 16, scope: !433)
!448 = !DILocation(line: 183, column: 14, scope: !433)
!449 = !DILocation(line: 189, column: 11, scope: !433)
!450 = !DILocation(line: 189, column: 21, scope: !433)
!451 = !DILocation(line: 189, column: 3, scope: !433)
!452 = !DILocation(line: 194, column: 8, scope: !453)
!453 = distinct !DILexicalBlock(scope: !454, file: !1, line: 194, column: 8)
!454 = distinct !DILexicalBlock(scope: !433, file: !1, line: 189, column: 27)
!455 = !DILocation(line: 194, column: 18, scope: !453)
!456 = !DILocation(line: 194, column: 23, scope: !453)
!457 = !DILocation(line: 194, column: 27, scope: !453)
!458 = !DILocation(line: 194, column: 45, scope: !453)
!459 = !DILocation(line: 194, column: 8, scope: !454)
!460 = !DILocation(line: 195, column: 15, scope: !461)
!461 = distinct !DILexicalBlock(scope: !453, file: !1, line: 194, column: 51)
!462 = !DILocation(line: 196, column: 4, scope: !461)
!463 = !DILocation(line: 197, column: 4, scope: !454)
!464 = !DILocation(line: 203, column: 8, scope: !465)
!465 = distinct !DILexicalBlock(scope: !454, file: !1, line: 203, column: 8)
!466 = !DILocation(line: 203, column: 18, scope: !465)
!467 = !DILocation(line: 203, column: 23, scope: !465)
!468 = !DILocation(line: 203, column: 27, scope: !465)
!469 = !DILocation(line: 203, column: 45, scope: !465)
!470 = !DILocation(line: 203, column: 8, scope: !454)
!471 = !DILocation(line: 204, column: 15, scope: !472)
!472 = distinct !DILexicalBlock(scope: !465, file: !1, line: 203, column: 51)
!473 = !DILocation(line: 205, column: 4, scope: !472)
!474 = !DILocation(line: 206, column: 4, scope: !454)
!475 = !DILocation(line: 215, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !454, file: !1, line: 215, column: 8)
!477 = !DILocation(line: 215, column: 18, scope: !476)
!478 = !DILocation(line: 215, column: 23, scope: !476)
!479 = !DILocation(line: 215, column: 30, scope: !476)
!480 = !DILocation(line: 215, column: 42, scope: !476)
!481 = !DILocation(line: 215, column: 8, scope: !454)
!482 = !DILocation(line: 219, column: 16, scope: !483)
!483 = distinct !DILexicalBlock(scope: !476, file: !1, line: 215, column: 47)
!484 = !DILocation(line: 221, column: 4, scope: !483)
!485 = !DILocation(line: 226, column: 9, scope: !454)
!486 = !DILocation(line: 226, column: 22, scope: !454)
!487 = !DILocation(line: 226, column: 32, scope: !454)
!488 = !DILocation(line: 226, column: 37, scope: !454)
!489 = !DILocation(line: 226, column: 44, scope: !454)
!490 = !DILocation(line: 226, column: 20, scope: !454)
!491 = !DILocation(line: 225, column: 17, scope: !454)
!492 = !DILocation(line: 225, column: 15, scope: !454)
!493 = !DILocation(line: 227, column: 4, scope: !454)
!494 = !DILocation(line: 234, column: 19, scope: !454)
!495 = !DILocation(line: 234, column: 37, scope: !454)
!496 = !DILocation(line: 234, column: 35, scope: !454)
!497 = !DILocation(line: 234, column: 5, scope: !454)
!498 = !DILocation(line: 234, column: 17, scope: !454)
!499 = !DILocation(line: 238, column: 4, scope: !454)
!500 = !DILocation(line: 245, column: 34, scope: !454)
!501 = !DILocation(line: 247, column: 15, scope: !454)
!502 = !DILocation(line: 247, column: 25, scope: !454)
!503 = !DILocation(line: 248, column: 14, scope: !454)
!504 = !DILocation(line: 249, column: 14, scope: !454)
!505 = !DILocation(line: 246, column: 13, scope: !454)
!506 = !DILocation(line: 245, column: 45, scope: !454)
!507 = !DILocation(line: 245, column: 17, scope: !454)
!508 = !DILocation(line: 245, column: 15, scope: !454)
!509 = !DILocation(line: 250, column: 4, scope: !454)
!510 = !DILocation(line: 257, column: 34, scope: !454)
!511 = !DILocation(line: 259, column: 15, scope: !454)
!512 = !DILocation(line: 259, column: 25, scope: !454)
!513 = !DILocation(line: 260, column: 14, scope: !454)
!514 = !DILocation(line: 261, column: 14, scope: !454)
!515 = !DILocation(line: 258, column: 13, scope: !454)
!516 = !DILocation(line: 257, column: 45, scope: !454)
!517 = !DILocation(line: 257, column: 17, scope: !454)
!518 = !DILocation(line: 257, column: 15, scope: !454)
!519 = !DILocation(line: 262, column: 4, scope: !454)
!520 = !DILocation(line: 269, column: 34, scope: !454)
!521 = !DILocation(line: 271, column: 15, scope: !454)
!522 = !DILocation(line: 271, column: 25, scope: !454)
!523 = !DILocation(line: 272, column: 14, scope: !454)
!524 = !DILocation(line: 273, column: 14, scope: !454)
!525 = !DILocation(line: 270, column: 13, scope: !454)
!526 = !DILocation(line: 269, column: 45, scope: !454)
!527 = !DILocation(line: 269, column: 17, scope: !454)
!528 = !DILocation(line: 269, column: 15, scope: !454)
!529 = !DILocation(line: 274, column: 4, scope: !454)
!530 = !DILocation(line: 282, column: 34, scope: !454)
!531 = !DILocation(line: 283, column: 15, scope: !454)
!532 = !DILocation(line: 283, column: 25, scope: !454)
!533 = !DILocation(line: 284, column: 8, scope: !454)
!534 = !DILocation(line: 285, column: 8, scope: !454)
!535 = !DILocation(line: 285, column: 24, scope: !454)
!536 = !DILocation(line: 286, column: 11, scope: !454)
!537 = !DILocation(line: 282, column: 45, scope: !454)
!538 = !DILocation(line: 289, column: 15, scope: !454)
!539 = !DILocation(line: 289, column: 25, scope: !454)
!540 = !DILocation(line: 290, column: 14, scope: !454)
!541 = !DILocation(line: 291, column: 14, scope: !454)
!542 = !DILocation(line: 288, column: 13, scope: !454)
!543 = !DILocation(line: 286, column: 16, scope: !454)
!544 = !DILocation(line: 282, column: 17, scope: !454)
!545 = !DILocation(line: 282, column: 15, scope: !454)
!546 = !DILocation(line: 292, column: 4, scope: !454)
!547 = !DILocation(line: 296, column: 34, scope: !454)
!548 = !DILocation(line: 297, column: 14, scope: !454)
!549 = !DILocation(line: 297, column: 24, scope: !454)
!550 = !DILocation(line: 297, column: 29, scope: !454)
!551 = !DILocation(line: 298, column: 14, scope: !454)
!552 = !DILocation(line: 298, column: 31, scope: !454)
!553 = !DILocation(line: 296, column: 45, scope: !454)
!554 = !DILocation(line: 299, column: 13, scope: !454)
!555 = !DILocation(line: 299, column: 23, scope: !454)
!556 = !DILocation(line: 299, column: 28, scope: !454)
!557 = !DILocation(line: 300, column: 13, scope: !454)
!558 = !DILocation(line: 301, column: 13, scope: !454)
!559 = !DILocation(line: 298, column: 36, scope: !454)
!560 = !DILocation(line: 302, column: 13, scope: !454)
!561 = !DILocation(line: 302, column: 23, scope: !454)
!562 = !DILocation(line: 302, column: 28, scope: !454)
!563 = !DILocation(line: 303, column: 13, scope: !454)
!564 = !DILocation(line: 301, column: 27, scope: !454)
!565 = !DILocation(line: 296, column: 17, scope: !454)
!566 = !DILocation(line: 296, column: 15, scope: !454)
!567 = !DILocation(line: 305, column: 4, scope: !454)
!568 = !DILocation(line: 309, column: 34, scope: !454)
!569 = !DILocation(line: 310, column: 14, scope: !454)
!570 = !DILocation(line: 310, column: 24, scope: !454)
!571 = !DILocation(line: 311, column: 14, scope: !454)
!572 = !DILocation(line: 312, column: 14, scope: !454)
!573 = !DILocation(line: 312, column: 31, scope: !454)
!574 = !DILocation(line: 309, column: 45, scope: !454)
!575 = !DILocation(line: 313, column: 13, scope: !454)
!576 = !DILocation(line: 313, column: 23, scope: !454)
!577 = !DILocation(line: 314, column: 13, scope: !454)
!578 = !DILocation(line: 315, column: 13, scope: !454)
!579 = !DILocation(line: 316, column: 13, scope: !454)
!580 = !DILocation(line: 312, column: 36, scope: !454)
!581 = !DILocation(line: 317, column: 13, scope: !454)
!582 = !DILocation(line: 317, column: 23, scope: !454)
!583 = !DILocation(line: 318, column: 13, scope: !454)
!584 = !DILocation(line: 319, column: 13, scope: !454)
!585 = !DILocation(line: 316, column: 27, scope: !454)
!586 = !DILocation(line: 309, column: 17, scope: !454)
!587 = !DILocation(line: 309, column: 15, scope: !454)
!588 = !DILocation(line: 321, column: 4, scope: !454)
!589 = !DILocation(line: 326, column: 47, scope: !454)
!590 = !DILocation(line: 327, column: 12, scope: !454)
!591 = !DILocation(line: 328, column: 12, scope: !454)
!592 = !DILocation(line: 329, column: 12, scope: !454)
!593 = !DILocation(line: 326, column: 8, scope: !454)
!594 = !DILocation(line: 325, column: 15, scope: !454)
!595 = !DILocation(line: 331, column: 34, scope: !454)
!596 = !DILocation(line: 332, column: 13, scope: !454)
!597 = !DILocation(line: 332, column: 23, scope: !454)
!598 = !DILocation(line: 333, column: 13, scope: !454)
!599 = !DILocation(line: 334, column: 13, scope: !454)
!600 = !DILocation(line: 335, column: 13, scope: !454)
!601 = !DILocation(line: 331, column: 45, scope: !454)
!602 = !DILocation(line: 336, column: 13, scope: !454)
!603 = !DILocation(line: 336, column: 23, scope: !454)
!604 = !DILocation(line: 337, column: 13, scope: !454)
!605 = !DILocation(line: 338, column: 13, scope: !454)
!606 = !DILocation(line: 335, column: 27, scope: !454)
!607 = !DILocation(line: 331, column: 17, scope: !454)
!608 = !DILocation(line: 331, column: 15, scope: !454)
!609 = !DILocation(line: 340, column: 4, scope: !454)
!610 = !DILocation(line: 344, column: 34, scope: !454)
!611 = !DILocation(line: 345, column: 14, scope: !454)
!612 = !DILocation(line: 345, column: 24, scope: !454)
!613 = !DILocation(line: 346, column: 14, scope: !454)
!614 = !DILocation(line: 347, column: 14, scope: !454)
!615 = !DILocation(line: 347, column: 31, scope: !454)
!616 = !DILocation(line: 344, column: 45, scope: !454)
!617 = !DILocation(line: 348, column: 13, scope: !454)
!618 = !DILocation(line: 348, column: 23, scope: !454)
!619 = !DILocation(line: 348, column: 28, scope: !454)
!620 = !DILocation(line: 349, column: 13, scope: !454)
!621 = !DILocation(line: 350, column: 13, scope: !454)
!622 = !DILocation(line: 347, column: 36, scope: !454)
!623 = !DILocation(line: 351, column: 13, scope: !454)
!624 = !DILocation(line: 351, column: 23, scope: !454)
!625 = !DILocation(line: 351, column: 28, scope: !454)
!626 = !DILocation(line: 352, column: 13, scope: !454)
!627 = !DILocation(line: 350, column: 27, scope: !454)
!628 = !DILocation(line: 344, column: 17, scope: !454)
!629 = !DILocation(line: 344, column: 15, scope: !454)
!630 = !DILocation(line: 354, column: 4, scope: !454)
!631 = !DILocation(line: 358, column: 34, scope: !454)
!632 = !DILocation(line: 359, column: 14, scope: !454)
!633 = !DILocation(line: 359, column: 24, scope: !454)
!634 = !DILocation(line: 359, column: 29, scope: !454)
!635 = !DILocation(line: 360, column: 14, scope: !454)
!636 = !DILocation(line: 360, column: 31, scope: !454)
!637 = !DILocation(line: 358, column: 45, scope: !454)
!638 = !DILocation(line: 361, column: 13, scope: !454)
!639 = !DILocation(line: 361, column: 23, scope: !454)
!640 = !DILocation(line: 361, column: 28, scope: !454)
!641 = !DILocation(line: 362, column: 13, scope: !454)
!642 = !DILocation(line: 363, column: 13, scope: !454)
!643 = !DILocation(line: 360, column: 36, scope: !454)
!644 = !DILocation(line: 364, column: 13, scope: !454)
!645 = !DILocation(line: 364, column: 23, scope: !454)
!646 = !DILocation(line: 364, column: 28, scope: !454)
!647 = !DILocation(line: 365, column: 13, scope: !454)
!648 = !DILocation(line: 363, column: 27, scope: !454)
!649 = !DILocation(line: 358, column: 17, scope: !454)
!650 = !DILocation(line: 358, column: 15, scope: !454)
!651 = !DILocation(line: 367, column: 4, scope: !454)
!652 = !DILocation(line: 371, column: 34, scope: !454)
!653 = !DILocation(line: 372, column: 13, scope: !454)
!654 = !DILocation(line: 372, column: 23, scope: !454)
!655 = !DILocation(line: 373, column: 13, scope: !454)
!656 = !DILocation(line: 374, column: 13, scope: !454)
!657 = !DILocation(line: 375, column: 13, scope: !454)
!658 = !DILocation(line: 371, column: 45, scope: !454)
!659 = !DILocation(line: 376, column: 13, scope: !454)
!660 = !DILocation(line: 376, column: 23, scope: !454)
!661 = !DILocation(line: 377, column: 13, scope: !454)
!662 = !DILocation(line: 378, column: 13, scope: !454)
!663 = !DILocation(line: 379, column: 13, scope: !454)
!664 = !DILocation(line: 375, column: 27, scope: !454)
!665 = !DILocation(line: 380, column: 13, scope: !454)
!666 = !DILocation(line: 380, column: 23, scope: !454)
!667 = !DILocation(line: 381, column: 13, scope: !454)
!668 = !DILocation(line: 382, column: 13, scope: !454)
!669 = !DILocation(line: 379, column: 27, scope: !454)
!670 = !DILocation(line: 371, column: 17, scope: !454)
!671 = !DILocation(line: 371, column: 15, scope: !454)
!672 = !DILocation(line: 384, column: 4, scope: !454)
!673 = !DILocation(line: 388, column: 34, scope: !454)
!674 = !DILocation(line: 389, column: 13, scope: !454)
!675 = !DILocation(line: 389, column: 23, scope: !454)
!676 = !DILocation(line: 390, column: 13, scope: !454)
!677 = !DILocation(line: 391, column: 13, scope: !454)
!678 = !DILocation(line: 392, column: 13, scope: !454)
!679 = !DILocation(line: 388, column: 45, scope: !454)
!680 = !DILocation(line: 393, column: 13, scope: !454)
!681 = !DILocation(line: 393, column: 23, scope: !454)
!682 = !DILocation(line: 394, column: 13, scope: !454)
!683 = !DILocation(line: 395, column: 13, scope: !454)
!684 = !DILocation(line: 396, column: 13, scope: !454)
!685 = !DILocation(line: 392, column: 27, scope: !454)
!686 = !DILocation(line: 397, column: 13, scope: !454)
!687 = !DILocation(line: 397, column: 23, scope: !454)
!688 = !DILocation(line: 398, column: 13, scope: !454)
!689 = !DILocation(line: 399, column: 13, scope: !454)
!690 = !DILocation(line: 396, column: 27, scope: !454)
!691 = !DILocation(line: 388, column: 17, scope: !454)
!692 = !DILocation(line: 388, column: 15, scope: !454)
!693 = !DILocation(line: 401, column: 4, scope: !454)
!694 = !DILocation(line: 405, column: 4, scope: !454)
!695 = !DILocation(line: 410, column: 22, scope: !433)
!696 = !DILocation(line: 410, column: 19, scope: !433)
!697 = !DILocation(line: 415, column: 7, scope: !433)
!698 = !DILocation(line: 414, column: 12, scope: !433)
!699 = distinct !{!699, !427, !700}
!700 = !DILocation(line: 417, column: 2, scope: !408)
!701 = !DILocation(line: 421, column: 2, scope: !408)
!702 = !DILocation(line: 422, column: 1, scope: !408)
!703 = distinct !DISubprogram(name: "acpi_rs_struct_option_length", scope: !1, file: !1, line: 69, type: !704, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !412)
!704 = !DISubroutineType(types: !705)
!705 = !{!402, !706}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!707 = !DILocalVariable(name: "resource_source", arg: 1, scope: !703, file: !1, line: 69, type: !706)
!708 = !DILocation(line: 69, column: 59, scope: !703)
!709 = !DILocation(line: 78, column: 6, scope: !710)
!710 = distinct !DILexicalBlock(scope: !703, file: !1, line: 78, column: 6)
!711 = !DILocation(line: 78, column: 23, scope: !710)
!712 = !DILocation(line: 78, column: 6, scope: !703)
!713 = !DILocation(line: 79, column: 28, scope: !714)
!714 = distinct !DILexicalBlock(scope: !710, file: !1, line: 78, column: 35)
!715 = !DILocation(line: 79, column: 45, scope: !714)
!716 = !DILocation(line: 79, column: 59, scope: !714)
!717 = !DILocation(line: 79, column: 11, scope: !714)
!718 = !DILocation(line: 79, column: 3, scope: !714)
!719 = !DILocation(line: 82, column: 2, scope: !703)
!720 = !DILocation(line: 83, column: 1, scope: !703)
!721 = distinct !DISubprogram(name: "acpi_rs_get_list_length", scope: !1, file: !1, line: 441, type: !722, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !412)
!722 = !DISubroutineType(types: !723)
!723 = !{!401, !255, !21, !411}
!724 = !DILocalVariable(name: "aml_buffer", arg: 1, scope: !721, file: !1, line: 441, type: !255)
!725 = !DILocation(line: 441, column: 29, scope: !721)
!726 = !DILocalVariable(name: "aml_buffer_length", arg: 2, scope: !721, file: !1, line: 442, type: !21)
!727 = !DILocation(line: 442, column: 8, scope: !721)
!728 = !DILocalVariable(name: "size_needed", arg: 3, scope: !721, file: !1, line: 442, type: !411)
!729 = !DILocation(line: 442, column: 38, scope: !721)
!730 = !DILocalVariable(name: "status", scope: !721, file: !1, line: 444, type: !401)
!731 = !DILocation(line: 444, column: 14, scope: !721)
!732 = !DILocalVariable(name: "end_aml", scope: !721, file: !1, line: 445, type: !255)
!733 = !DILocation(line: 445, column: 6, scope: !721)
!734 = !DILocalVariable(name: "buffer", scope: !721, file: !1, line: 446, type: !255)
!735 = !DILocation(line: 446, column: 6, scope: !721)
!736 = !DILocalVariable(name: "buffer_size", scope: !721, file: !1, line: 447, type: !21)
!737 = !DILocation(line: 447, column: 6, scope: !721)
!738 = !DILocalVariable(name: "temp16", scope: !721, file: !1, line: 448, type: !66)
!739 = !DILocation(line: 448, column: 6, scope: !721)
!740 = !DILocalVariable(name: "resource_length", scope: !721, file: !1, line: 449, type: !66)
!741 = !DILocation(line: 449, column: 6, scope: !721)
!742 = !DILocalVariable(name: "extra_struct_bytes", scope: !721, file: !1, line: 450, type: !21)
!743 = !DILocation(line: 450, column: 6, scope: !721)
!744 = !DILocalVariable(name: "resource_index", scope: !721, file: !1, line: 451, type: !33)
!745 = !DILocation(line: 451, column: 5, scope: !721)
!746 = !DILocalVariable(name: "minimum_aml_resource_length", scope: !721, file: !1, line: 452, type: !33)
!747 = !DILocation(line: 452, column: 5, scope: !721)
!748 = !DILocalVariable(name: "aml_resource", scope: !721, file: !1, line: 453, type: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "aml_resource", file: !751, line: 478, size: 448, elements: !752)
!751 = !DIFile(filename: "drivers/acpi/acpica/amlresrc.h", directory: "/home/lizy2001/genbc/linux")
!752 = !{!753, !754, !758, !763, !769, !775, !780, !784, !793, !799, !806, !810, !815, !825, !835, !840, !850, !858, !871, !884, !897, !913, !921, !938, !952, !969, !986, !998, !1012, !1026, !1037, !1050, !1064, !1072, !1073, !1074}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !750, file: !751, line: 481, baseType: !33, size: 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "small_header", scope: !750, file: !751, line: 482, baseType: !755, size: 8)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_small_header", file: !751, line: 114, size: 8, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !755, file: !751, line: 115, baseType: !33, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "large_header", scope: !750, file: !751, line: 483, baseType: !759, size: 24)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_large_header", file: !751, line: 174, size: 24, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !759, file: !751, line: 175, baseType: !33, size: 8)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !759, file: !751, line: 175, baseType: !66, size: 16, offset: 8)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !750, file: !751, line: 487, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_irq", file: !751, line: 117, size: 32, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !764, file: !751, line: 118, baseType: !33, size: 8)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "irq_mask", scope: !764, file: !751, line: 118, baseType: !66, size: 16, offset: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !751, line: 119, baseType: !33, size: 8, offset: 24)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !750, file: !751, line: 488, baseType: !770, size: 24)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_dma", file: !751, line: 126, size: 24, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !770, file: !751, line: 127, baseType: !33, size: 8)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dma_channel_mask", scope: !770, file: !751, line: 127, baseType: !33, size: 8, offset: 8)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !751, line: 128, baseType: !33, size: 8, offset: 16)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !750, file: !751, line: 489, baseType: !776, size: 16)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_start_dependent", file: !751, line: 131, size: 16, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !776, file: !751, line: 132, baseType: !33, size: 8)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !751, line: 132, baseType: !33, size: 8, offset: 8)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "end_dpf", scope: !750, file: !751, line: 490, baseType: !781, size: 8)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_end_dependent", file: !751, line: 138, size: 8, elements: !782)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !781, file: !751, line: 139, baseType: !33, size: 8)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !750, file: !751, line: 491, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_io", file: !751, line: 141, size: 64, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !785, file: !751, line: 142, baseType: !33, size: 8)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !785, file: !751, line: 142, baseType: !33, size: 8, offset: 8)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !785, file: !751, line: 143, baseType: !66, size: 16, offset: 16)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !785, file: !751, line: 144, baseType: !66, size: 16, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !785, file: !751, line: 145, baseType: !33, size: 8, offset: 48)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !785, file: !751, line: 146, baseType: !33, size: 8, offset: 56)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !750, file: !751, line: 492, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_io", file: !751, line: 149, size: 32, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !794, file: !751, line: 150, baseType: !33, size: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !794, file: !751, line: 150, baseType: !66, size: 16, offset: 8)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !794, file: !751, line: 151, baseType: !33, size: 8, offset: 24)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !750, file: !751, line: 493, baseType: !800, size: 48)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_dma", file: !751, line: 161, size: 48, elements: !801)
!801 = !{!802, !803, !804, !805}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !800, file: !751, line: 162, baseType: !33, size: 8)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !800, file: !751, line: 162, baseType: !66, size: 16, offset: 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !800, file: !751, line: 163, baseType: !66, size: 16, offset: 24)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !800, file: !751, line: 164, baseType: !33, size: 8, offset: 40)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_small", scope: !750, file: !751, line: 494, baseType: !807, size: 8)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_vendor_small", file: !751, line: 154, size: 8, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !807, file: !751, line: 155, baseType: !33, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !750, file: !751, line: 495, baseType: !811, size: 16)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_end_tag", file: !751, line: 157, size: 16, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !811, file: !751, line: 158, baseType: !33, size: 8)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !811, file: !751, line: 158, baseType: !33, size: 8, offset: 8)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !750, file: !751, line: 499, baseType: !816, size: 96)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_memory24", file: !751, line: 183, size: 96, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !816, file: !751, line: 184, baseType: !33, size: 8)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !816, file: !751, line: 184, baseType: !66, size: 16, offset: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !816, file: !751, line: 184, baseType: !33, size: 8, offset: 24)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !816, file: !751, line: 185, baseType: !66, size: 16, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !816, file: !751, line: 186, baseType: !66, size: 16, offset: 48)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !816, file: !751, line: 187, baseType: !66, size: 16, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !816, file: !751, line: 188, baseType: !66, size: 16, offset: 80)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !750, file: !751, line: 500, baseType: !826, size: 120)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_generic_register", file: !751, line: 264, size: 120, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !826, file: !751, line: 265, baseType: !33, size: 8)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !826, file: !751, line: 265, baseType: !66, size: 16, offset: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "address_space_id", scope: !826, file: !751, line: 265, baseType: !33, size: 8, offset: 24)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !826, file: !751, line: 266, baseType: !33, size: 8, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !826, file: !751, line: 267, baseType: !33, size: 8, offset: 40)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !826, file: !751, line: 268, baseType: !33, size: 8, offset: 48)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !826, file: !751, line: 269, baseType: !195, size: 64, offset: 56)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_large", scope: !750, file: !751, line: 501, baseType: !836, size: 24)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_vendor_large", file: !751, line: 191, size: 24, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !836, file: !751, line: 192, baseType: !33, size: 8)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !836, file: !751, line: 192, baseType: !66, size: 16, offset: 8)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !750, file: !751, line: 502, baseType: !841, size: 160)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_memory32", file: !751, line: 194, size: 160, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !841, file: !751, line: 195, baseType: !33, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !841, file: !751, line: 195, baseType: !66, size: 16, offset: 8)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !841, file: !751, line: 195, baseType: !33, size: 8, offset: 24)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !841, file: !751, line: 196, baseType: !21, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !841, file: !751, line: 197, baseType: !21, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !841, file: !751, line: 198, baseType: !21, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !841, file: !751, line: 199, baseType: !21, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !750, file: !751, line: 503, baseType: !851, size: 96)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_memory32", file: !751, line: 202, size: 96, elements: !852)
!852 = !{!853, !854, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !851, file: !751, line: 203, baseType: !33, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !851, file: !751, line: 203, baseType: !66, size: 16, offset: 8)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !751, line: 203, baseType: !33, size: 8, offset: 24)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !851, file: !751, line: 204, baseType: !21, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !851, file: !751, line: 205, baseType: !21, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !750, file: !751, line: 504, baseType: !859, size: 128)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address16", file: !751, line: 248, size: 128, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !859, file: !751, line: 249, baseType: !33, size: 8)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !859, file: !751, line: 249, baseType: !66, size: 16, offset: 8)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !859, file: !751, line: 250, baseType: !33, size: 8, offset: 24)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !859, file: !751, line: 250, baseType: !33, size: 8, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !859, file: !751, line: 250, baseType: !33, size: 8, offset: 40)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !859, file: !751, line: 250, baseType: !66, size: 16, offset: 48)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !859, file: !751, line: 251, baseType: !66, size: 16, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !859, file: !751, line: 252, baseType: !66, size: 16, offset: 80)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !859, file: !751, line: 253, baseType: !66, size: 16, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !859, file: !751, line: 254, baseType: !66, size: 16, offset: 112)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !750, file: !751, line: 505, baseType: !872, size: 208)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address32", file: !751, line: 239, size: 208, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !872, file: !751, line: 240, baseType: !33, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !872, file: !751, line: 240, baseType: !66, size: 16, offset: 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !872, file: !751, line: 241, baseType: !33, size: 8, offset: 24)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !751, line: 241, baseType: !33, size: 8, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !872, file: !751, line: 241, baseType: !33, size: 8, offset: 40)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !872, file: !751, line: 241, baseType: !21, size: 32, offset: 48)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !872, file: !751, line: 242, baseType: !21, size: 32, offset: 80)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !872, file: !751, line: 243, baseType: !21, size: 32, offset: 112)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !872, file: !751, line: 244, baseType: !21, size: 32, offset: 144)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !872, file: !751, line: 245, baseType: !21, size: 32, offset: 176)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !750, file: !751, line: 506, baseType: !885, size: 368)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address64", file: !751, line: 230, size: 368, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !885, file: !751, line: 231, baseType: !33, size: 8)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !885, file: !751, line: 231, baseType: !66, size: 16, offset: 8)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !885, file: !751, line: 232, baseType: !33, size: 8, offset: 24)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !885, file: !751, line: 232, baseType: !33, size: 8, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !885, file: !751, line: 232, baseType: !33, size: 8, offset: 40)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !885, file: !751, line: 232, baseType: !195, size: 64, offset: 48)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !885, file: !751, line: 233, baseType: !195, size: 64, offset: 112)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !885, file: !751, line: 234, baseType: !195, size: 64, offset: 176)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !885, file: !751, line: 235, baseType: !195, size: 64, offset: 240)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !885, file: !751, line: 236, baseType: !195, size: 64, offset: 304)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !750, file: !751, line: 507, baseType: !898, size: 448)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_extended_address64", file: !751, line: 216, size: 448, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !898, file: !751, line: 217, baseType: !33, size: 8)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !898, file: !751, line: 217, baseType: !66, size: 16, offset: 8)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !898, file: !751, line: 218, baseType: !33, size: 8, offset: 24)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !898, file: !751, line: 218, baseType: !33, size: 8, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !898, file: !751, line: 218, baseType: !33, size: 8, offset: 40)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !898, file: !751, line: 218, baseType: !33, size: 8, offset: 48)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !898, file: !751, line: 219, baseType: !33, size: 8, offset: 56)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !898, file: !751, line: 220, baseType: !195, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !898, file: !751, line: 221, baseType: !195, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !898, file: !751, line: 222, baseType: !195, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !898, file: !751, line: 223, baseType: !195, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !898, file: !751, line: 224, baseType: !195, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !898, file: !751, line: 225, baseType: !195, size: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !750, file: !751, line: 508, baseType: !914, size: 72)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_extended_irq", file: !751, line: 257, size: 72, elements: !915)
!915 = !{!916, !917, !918, !919, !920}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !914, file: !751, line: 258, baseType: !33, size: 8)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !914, file: !751, line: 258, baseType: !66, size: 16, offset: 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !914, file: !751, line: 258, baseType: !33, size: 8, offset: 24)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !914, file: !751, line: 259, baseType: !33, size: 8, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !914, file: !751, line: 260, baseType: !226, size: 32, offset: 40)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !750, file: !751, line: 509, baseType: !922, size: 184)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_gpio", file: !751, line: 274, size: 184, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !922, file: !751, line: 275, baseType: !33, size: 8)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !922, file: !751, line: 275, baseType: !66, size: 16, offset: 8)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !922, file: !751, line: 275, baseType: !33, size: 8, offset: 24)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !922, file: !751, line: 276, baseType: !33, size: 8, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !922, file: !751, line: 277, baseType: !66, size: 16, offset: 40)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "int_flags", scope: !922, file: !751, line: 278, baseType: !66, size: 16, offset: 56)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !922, file: !751, line: 279, baseType: !33, size: 8, offset: 72)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !922, file: !751, line: 280, baseType: !66, size: 16, offset: 80)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !922, file: !751, line: 281, baseType: !66, size: 16, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !922, file: !751, line: 282, baseType: !66, size: 16, offset: 112)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !922, file: !751, line: 283, baseType: !33, size: 8, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !922, file: !751, line: 284, baseType: !66, size: 16, offset: 136)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !922, file: !751, line: 285, baseType: !66, size: 16, offset: 152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !922, file: !751, line: 286, baseType: !66, size: 16, offset: 168)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !750, file: !751, line: 510, baseType: !939, size: 144)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_i2c_serialbus", file: !751, line: 325, size: 144, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !939, file: !751, line: 326, baseType: !33, size: 8)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !939, file: !751, line: 326, baseType: !66, size: 16, offset: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !939, file: !751, line: 327, baseType: !33, size: 8, offset: 24)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !939, file: !751, line: 327, baseType: !33, size: 8, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !939, file: !751, line: 327, baseType: !33, size: 8, offset: 40)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !939, file: !751, line: 327, baseType: !33, size: 8, offset: 48)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !939, file: !751, line: 327, baseType: !66, size: 16, offset: 56)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !939, file: !751, line: 327, baseType: !33, size: 8, offset: 72)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !939, file: !751, line: 327, baseType: !66, size: 16, offset: 80)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !939, file: !751, line: 327, baseType: !21, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !939, file: !751, line: 328, baseType: !66, size: 16, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !750, file: !751, line: 511, baseType: !953, size: 168)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_spi_serialbus", file: !751, line: 340, size: 168, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !953, file: !751, line: 341, baseType: !33, size: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !953, file: !751, line: 341, baseType: !66, size: 16, offset: 8)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !953, file: !751, line: 342, baseType: !33, size: 8, offset: 24)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !953, file: !751, line: 342, baseType: !33, size: 8, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !751, line: 342, baseType: !33, size: 8, offset: 40)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !953, file: !751, line: 342, baseType: !33, size: 8, offset: 48)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !953, file: !751, line: 342, baseType: !66, size: 16, offset: 56)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !953, file: !751, line: 342, baseType: !33, size: 8, offset: 72)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !953, file: !751, line: 342, baseType: !66, size: 16, offset: 80)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !953, file: !751, line: 342, baseType: !21, size: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !953, file: !751, line: 343, baseType: !33, size: 8, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !953, file: !751, line: 344, baseType: !33, size: 8, offset: 136)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !953, file: !751, line: 345, baseType: !33, size: 8, offset: 144)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !953, file: !751, line: 346, baseType: !66, size: 16, offset: 152)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !750, file: !751, line: 512, baseType: !970, size: 176)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_uart_serialbus", file: !751, line: 358, size: 176, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !970, file: !751, line: 359, baseType: !33, size: 8)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !970, file: !751, line: 359, baseType: !66, size: 16, offset: 8)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !970, file: !751, line: 360, baseType: !33, size: 8, offset: 24)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !970, file: !751, line: 360, baseType: !33, size: 8, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !970, file: !751, line: 360, baseType: !33, size: 8, offset: 40)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !751, line: 360, baseType: !33, size: 8, offset: 48)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !970, file: !751, line: 360, baseType: !66, size: 16, offset: 56)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !970, file: !751, line: 360, baseType: !33, size: 8, offset: 72)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !970, file: !751, line: 360, baseType: !66, size: 16, offset: 80)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !970, file: !751, line: 360, baseType: !21, size: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !970, file: !751, line: 361, baseType: !66, size: 16, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !970, file: !751, line: 362, baseType: !66, size: 16, offset: 144)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !970, file: !751, line: 363, baseType: !33, size: 8, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !970, file: !751, line: 364, baseType: !33, size: 8, offset: 168)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !750, file: !751, line: 513, baseType: !987, size: 96)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_common_serialbus", file: !751, line: 322, size: 96, elements: !988)
