; ModuleID = '../bcout/drivers/acpi/acpica/rscreate.llvm.bc'
source_filename = "drivers/acpi/acpica/rscreate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 14, type: !58, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !57, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/rscreate.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 321, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "ACPI_REFCLASS_LOCAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_REFCLASS_ARG", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_REFCLASS_REFOF", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "ACPI_REFCLASS_INDEX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "ACPI_REFCLASS_TABLE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "ACPI_REFCLASS_NAME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "ACPI_REFCLASS_DEBUG", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "ACPI_REFCLASS_MAX", value: 6, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !18, line: 305, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!24 = !{!25, !31, !35, !48, !27, !49, !53, !54, !56}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !26, line: 421, baseType: !27)
!26 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !28, line: 21, baseType: !29)
!28 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !30, line: 27, baseType: !7)
!30 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !26, line: 127, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !28, line: 23, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !30, line: 31, baseType: !34)
!34 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pci_routing_table", file: !37, line: 670, size: 192, elements: !38)
!37 = !DIFile(filename: "./include/acpi/acrestyp.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !36, file: !37, line: 671, baseType: !27, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !36, file: !37, line: 672, baseType: !27, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !36, file: !37, line: 673, baseType: !32, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "source_index", scope: !36, file: !37, line: 674, baseType: !27, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !36, file: !37, line: 675, baseType: !44, size: 32, offset: 160)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !46)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !{!47}
!47 = !DISubrange(count: 4)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !28, line: 17, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !30, line: 21, baseType: !52)
!52 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !26, line: 424, baseType: !48)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !55, line: 148, baseType: !7)
!55 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!56 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !{!0}
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 72, elements: !60)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!60 = !{!61}
!61 = !DISubrange(count: 9)
!62 = !{!"rsp"}
!63 = !{i32 7, !"Dwarf Version", i32 4}
!64 = !{i32 2, !"Debug Info Version", i32 3}
!65 = !{i32 1, !"wchar_size", i32 2}
!66 = !{i32 1, !"Code Model", i32 2}
!67 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!68 = distinct !DISubprogram(name: "acpi_buffer_to_resource", scope: !3, file: !3, line: 30, type: !69, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !441)
!69 = !DISubroutineType(types: !70)
!70 = !{!25, !49, !71, !74}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !28, line: 19, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !30, line: 24, baseType: !73)
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource", file: !37, line: 651, size: 544, elements: !77)
!77 = !{!78, !79, !80}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !37, line: 652, baseType: !27, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !76, file: !37, line: 653, baseType: !27, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !37, line: 654, baseType: !81, size: 480, offset: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_data", file: !37, line: 614, size: 480, elements: !82)
!82 = !{!83, !96, !104, !110, !118, !123, !129, !134, !144, !148, !156, !164, !170, !211, !229, !247, !259, !271, !279, !299, !315, !335, !357, !370, !382, !395, !409, !420, !432}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !81, file: !37, line: 615, baseType: !84, size: 56)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_irq", file: !37, line: 138, size: 56, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !84, file: !37, line: 139, baseType: !50, size: 8)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !84, file: !37, line: 140, baseType: !50, size: 8, offset: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !84, file: !37, line: 141, baseType: !50, size: 8, offset: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !84, file: !37, line: 142, baseType: !50, size: 8, offset: 24)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !84, file: !37, line: 143, baseType: !50, size: 8, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !84, file: !37, line: 144, baseType: !50, size: 8, offset: 40)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !84, file: !37, line: 145, baseType: !93, size: 8, offset: 48)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 1)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !81, file: !37, line: 616, baseType: !97, size: 40)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_dma", file: !37, line: 148, size: 40, elements: !98)
!98 = !{!99, !100, !101, !102, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !97, file: !37, line: 149, baseType: !50, size: 8)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bus_master", scope: !97, file: !37, line: 150, baseType: !50, size: 8, offset: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !97, file: !37, line: 151, baseType: !50, size: 8, offset: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "channel_count", scope: !97, file: !37, line: 152, baseType: !50, size: 8, offset: 24)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !97, file: !37, line: 153, baseType: !93, size: 8, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !81, file: !37, line: 617, baseType: !105, size: 24)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_start_dependent", file: !37, line: 156, size: 24, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !105, file: !37, line: 157, baseType: !50, size: 8)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility_priority", scope: !105, file: !37, line: 158, baseType: !50, size: 8, offset: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "performance_robustness", scope: !105, file: !37, line: 159, baseType: !50, size: 8, offset: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !81, file: !37, line: 618, baseType: !111, size: 56)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_io", file: !37, line: 167, size: 56, elements: !112)
!112 = !{!113, !114, !115, !116, !117}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "io_decode", scope: !111, file: !37, line: 168, baseType: !50, size: 8)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !111, file: !37, line: 169, baseType: !50, size: 8, offset: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !111, file: !37, line: 170, baseType: !50, size: 8, offset: 16)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !111, file: !37, line: 171, baseType: !71, size: 16, offset: 24)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !111, file: !37, line: 172, baseType: !71, size: 16, offset: 40)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !81, file: !37, line: 619, baseType: !119, size: 24)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_io", file: !37, line: 175, size: 24, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !119, file: !37, line: 176, baseType: !71, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !119, file: !37, line: 177, baseType: !50, size: 8, offset: 16)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !81, file: !37, line: 620, baseType: !124, size: 40)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_dma", file: !37, line: 180, size: 40, elements: !125)
!125 = !{!126, !127, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !124, file: !37, line: 181, baseType: !71, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !124, file: !37, line: 182, baseType: !71, size: 16, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !124, file: !37, line: 183, baseType: !50, size: 8, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !81, file: !37, line: 621, baseType: !130, size: 24)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor", file: !37, line: 195, size: 24, elements: !131)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !130, file: !37, line: 196, baseType: !71, size: 16)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !130, file: !37, line: 197, baseType: !93, size: 8, offset: 16)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_typed", scope: !81, file: !37, line: 622, baseType: !135, size: 160)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor_typed", file: !37, line: 202, size: 160, elements: !136)
!136 = !{!137, !138, !139, !143}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !135, file: !37, line: 203, baseType: !71, size: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_subtype", scope: !135, file: !37, line: 204, baseType: !50, size: 8, offset: 16)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !135, file: !37, line: 205, baseType: !140, size: 128, offset: 24)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !135, file: !37, line: 206, baseType: !93, size: 8, offset: 152)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !81, file: !37, line: 623, baseType: !145, size: 8)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_end_tag", file: !37, line: 209, size: 8, elements: !146)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !145, file: !37, line: 210, baseType: !50, size: 8)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !81, file: !37, line: 624, baseType: !149, size: 72)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory24", file: !37, line: 213, size: 72, elements: !150)
!150 = !{!151, !152, !153, !154, !155}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !149, file: !37, line: 214, baseType: !50, size: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !149, file: !37, line: 215, baseType: !71, size: 16, offset: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !149, file: !37, line: 216, baseType: !71, size: 16, offset: 24)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !149, file: !37, line: 217, baseType: !71, size: 16, offset: 40)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !149, file: !37, line: 218, baseType: !71, size: 16, offset: 56)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !81, file: !37, line: 625, baseType: !157, size: 136)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory32", file: !37, line: 221, size: 136, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !157, file: !37, line: 222, baseType: !50, size: 8)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !157, file: !37, line: 223, baseType: !27, size: 32, offset: 8)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !157, file: !37, line: 224, baseType: !27, size: 32, offset: 40)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !157, file: !37, line: 225, baseType: !27, size: 32, offset: 72)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !157, file: !37, line: 226, baseType: !27, size: 32, offset: 104)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !81, file: !37, line: 626, baseType: !165, size: 72)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_memory32", file: !37, line: 229, size: 72, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !165, file: !37, line: 230, baseType: !50, size: 8)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !165, file: !37, line: 231, baseType: !27, size: 32, offset: 8)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !165, file: !37, line: 232, baseType: !27, size: 32, offset: 40)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !81, file: !37, line: 627, baseType: !171, size: 240)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address16", file: !37, line: 306, size: 240, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !196, !204}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !171, file: !37, line: 307, baseType: !50, size: 8)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !171, file: !37, line: 307, baseType: !50, size: 8, offset: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !171, file: !37, line: 307, baseType: !50, size: 8, offset: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !171, file: !37, line: 307, baseType: !50, size: 8, offset: 24)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !171, file: !37, line: 307, baseType: !50, size: 8, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !171, file: !37, line: 307, baseType: !179, size: 32, offset: 40)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_attribute", file: !37, line: 249, size: 32, elements: !180)
!180 = !{!181, !188, !195}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !179, file: !37, line: 250, baseType: !182, size: 32)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_memory_attribute", file: !37, line: 235, size: 32, elements: !183)
!183 = !{!184, !185, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !182, file: !37, line: 236, baseType: !50, size: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !182, file: !37, line: 237, baseType: !50, size: 8, offset: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !182, file: !37, line: 238, baseType: !50, size: 8, offset: 16)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !182, file: !37, line: 239, baseType: !50, size: 8, offset: 24)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !179, file: !37, line: 251, baseType: !189, size: 32)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_io_attribute", file: !37, line: 242, size: 32, elements: !190)
!190 = !{!191, !192, !193, !194}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !189, file: !37, line: 243, baseType: !50, size: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !189, file: !37, line: 244, baseType: !50, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "translation_type", scope: !189, file: !37, line: 245, baseType: !50, size: 8, offset: 16)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !189, file: !37, line: 246, baseType: !50, size: 8, offset: 24)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !179, file: !37, line: 255, baseType: !50, size: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !171, file: !37, line: 307, baseType: !197, size: 80, offset: 72)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address16_attribute", file: !37, line: 279, size: 80, elements: !198)
!198 = !{!199, !200, !201, !202, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !197, file: !37, line: 280, baseType: !71, size: 16)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !197, file: !37, line: 281, baseType: !71, size: 16, offset: 16)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !197, file: !37, line: 282, baseType: !71, size: 16, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !197, file: !37, line: 283, baseType: !71, size: 16, offset: 48)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !197, file: !37, line: 284, baseType: !71, size: 16, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !171, file: !37, line: 308, baseType: !205, size: 88, offset: 152)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_source", file: !37, line: 263, size: 88, elements: !206)
!206 = !{!207, !208, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !205, file: !37, line: 264, baseType: !50, size: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !205, file: !37, line: 265, baseType: !71, size: 16, offset: 8)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !205, file: !37, line: 266, baseType: !210, size: 64, offset: 24)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !81, file: !37, line: 628, baseType: !212, size: 320)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address32", file: !37, line: 311, size: 320, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !228}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !212, file: !37, line: 312, baseType: !50, size: 8)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !212, file: !37, line: 312, baseType: !50, size: 8, offset: 8)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !212, file: !37, line: 312, baseType: !50, size: 8, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !212, file: !37, line: 312, baseType: !50, size: 8, offset: 24)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !212, file: !37, line: 312, baseType: !50, size: 8, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !212, file: !37, line: 312, baseType: !179, size: 32, offset: 40)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !212, file: !37, line: 312, baseType: !221, size: 160, offset: 72)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address32_attribute", file: !37, line: 287, size: 160, elements: !222)
!222 = !{!223, !224, !225, !226, !227}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !221, file: !37, line: 288, baseType: !27, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !221, file: !37, line: 289, baseType: !27, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !221, file: !37, line: 290, baseType: !27, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !221, file: !37, line: 291, baseType: !27, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !221, file: !37, line: 292, baseType: !27, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !212, file: !37, line: 313, baseType: !205, size: 88, offset: 232)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !81, file: !37, line: 629, baseType: !230, size: 480)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address64", file: !37, line: 316, size: 480, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !246}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !230, file: !37, line: 317, baseType: !50, size: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !230, file: !37, line: 317, baseType: !50, size: 8, offset: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !230, file: !37, line: 317, baseType: !50, size: 8, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !230, file: !37, line: 317, baseType: !50, size: 8, offset: 24)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !230, file: !37, line: 317, baseType: !50, size: 8, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !230, file: !37, line: 317, baseType: !179, size: 32, offset: 40)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !230, file: !37, line: 317, baseType: !239, size: 320, offset: 72)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address64_attribute", file: !37, line: 295, size: 320, elements: !240)
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !239, file: !37, line: 296, baseType: !32, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !239, file: !37, line: 297, baseType: !32, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !239, file: !37, line: 298, baseType: !32, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !239, file: !37, line: 299, baseType: !32, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !239, file: !37, line: 300, baseType: !32, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !230, file: !37, line: 318, baseType: !205, size: 88, offset: 392)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !81, file: !37, line: 630, baseType: !248, size: 464)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_address64", file: !37, line: 321, size: 464, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !248, file: !37, line: 322, baseType: !50, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !248, file: !37, line: 322, baseType: !50, size: 8, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !248, file: !37, line: 322, baseType: !50, size: 8, offset: 16)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !248, file: !37, line: 322, baseType: !50, size: 8, offset: 24)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !248, file: !37, line: 322, baseType: !50, size: 8, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !248, file: !37, line: 322, baseType: !179, size: 32, offset: 40)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !248, file: !37, line: 322, baseType: !50, size: 8, offset: 72)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !248, file: !37, line: 323, baseType: !239, size: 320, offset: 80)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !248, file: !37, line: 324, baseType: !32, size: 64, offset: 400)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !81, file: !37, line: 631, baseType: !260, size: 168)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_irq", file: !37, line: 327, size: 168, elements: !261)
!261 = !{!262, !263, !264, !265, !266, !267, !268, !269}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !260, file: !37, line: 328, baseType: !50, size: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !260, file: !37, line: 329, baseType: !50, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !260, file: !37, line: 330, baseType: !50, size: 8, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !260, file: !37, line: 331, baseType: !50, size: 8, offset: 24)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !260, file: !37, line: 332, baseType: !50, size: 8, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !260, file: !37, line: 333, baseType: !50, size: 8, offset: 40)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !260, file: !37, line: 334, baseType: !205, size: 88, offset: 48)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !260, file: !37, line: 335, baseType: !270, size: 32, offset: 136)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !94)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !81, file: !37, line: 632, baseType: !272, size: 96)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_generic_register", file: !37, line: 338, size: 96, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !272, file: !37, line: 339, baseType: !50, size: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !272, file: !37, line: 340, baseType: !50, size: 8, offset: 8)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !272, file: !37, line: 341, baseType: !50, size: 8, offset: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !272, file: !37, line: 342, baseType: !50, size: 8, offset: 24)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !272, file: !37, line: 343, baseType: !32, size: 64, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !81, file: !37, line: 633, baseType: !280, size: 352)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_gpio", file: !37, line: 346, size: 352, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !298}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !280, file: !37, line: 347, baseType: !50, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !280, file: !37, line: 348, baseType: !50, size: 8, offset: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !280, file: !37, line: 349, baseType: !50, size: 8, offset: 16)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !280, file: !37, line: 350, baseType: !50, size: 8, offset: 24)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !280, file: !37, line: 351, baseType: !50, size: 8, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !280, file: !37, line: 352, baseType: !50, size: 8, offset: 40)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "io_restriction", scope: !280, file: !37, line: 353, baseType: !50, size: 8, offset: 48)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !280, file: !37, line: 354, baseType: !50, size: 8, offset: 56)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !280, file: !37, line: 355, baseType: !50, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !280, file: !37, line: 356, baseType: !71, size: 16, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !280, file: !37, line: 357, baseType: !71, size: 16, offset: 88)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !280, file: !37, line: 358, baseType: !71, size: 16, offset: 104)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !280, file: !37, line: 359, baseType: !71, size: 16, offset: 120)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !280, file: !37, line: 360, baseType: !205, size: 88, offset: 136)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !280, file: !37, line: 361, baseType: !297, size: 64, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !280, file: !37, line: 362, baseType: !49, size: 64, offset: 288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !81, file: !37, line: 634, baseType: !300, size: 288)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_i2c_serialbus", file: !37, line: 412, size: 288, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !300, file: !37, line: 413, baseType: !50, size: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !300, file: !37, line: 413, baseType: !50, size: 8, offset: 8)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !300, file: !37, line: 413, baseType: !50, size: 8, offset: 16)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !300, file: !37, line: 413, baseType: !50, size: 8, offset: 24)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !300, file: !37, line: 413, baseType: !50, size: 8, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !300, file: !37, line: 413, baseType: !50, size: 8, offset: 40)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !300, file: !37, line: 413, baseType: !71, size: 16, offset: 48)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !300, file: !37, line: 413, baseType: !71, size: 16, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !300, file: !37, line: 413, baseType: !205, size: 88, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !300, file: !37, line: 413, baseType: !49, size: 64, offset: 168)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "access_mode", scope: !300, file: !37, line: 413, baseType: !50, size: 8, offset: 232)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !300, file: !37, line: 414, baseType: !71, size: 16, offset: 240)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !300, file: !37, line: 415, baseType: !27, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !81, file: !37, line: 635, baseType: !316, size: 320)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_spi_serialbus", file: !37, line: 423, size: 320, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !316, file: !37, line: 424, baseType: !50, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !316, file: !37, line: 424, baseType: !50, size: 8, offset: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !316, file: !37, line: 424, baseType: !50, size: 8, offset: 16)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !316, file: !37, line: 424, baseType: !50, size: 8, offset: 24)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !316, file: !37, line: 424, baseType: !50, size: 8, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !316, file: !37, line: 424, baseType: !50, size: 8, offset: 40)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !316, file: !37, line: 424, baseType: !71, size: 16, offset: 48)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !316, file: !37, line: 424, baseType: !71, size: 16, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !316, file: !37, line: 424, baseType: !205, size: 88, offset: 80)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !316, file: !37, line: 424, baseType: !49, size: 64, offset: 168)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "wire_mode", scope: !316, file: !37, line: 424, baseType: !50, size: 8, offset: 232)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "device_polarity", scope: !316, file: !37, line: 425, baseType: !50, size: 8, offset: 240)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !316, file: !37, line: 426, baseType: !50, size: 8, offset: 248)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !316, file: !37, line: 427, baseType: !50, size: 8, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !316, file: !37, line: 428, baseType: !50, size: 8, offset: 264)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !316, file: !37, line: 429, baseType: !71, size: 16, offset: 272)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !316, file: !37, line: 430, baseType: !27, size: 32, offset: 288)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !81, file: !37, line: 636, baseType: !336, size: 344)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_uart_serialbus", file: !37, line: 453, size: 344, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !336, file: !37, line: 454, baseType: !50, size: 8)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !336, file: !37, line: 454, baseType: !50, size: 8, offset: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !336, file: !37, line: 454, baseType: !50, size: 8, offset: 16)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !336, file: !37, line: 454, baseType: !50, size: 8, offset: 24)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !336, file: !37, line: 454, baseType: !50, size: 8, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !336, file: !37, line: 454, baseType: !50, size: 8, offset: 40)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !336, file: !37, line: 454, baseType: !71, size: 16, offset: 48)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !336, file: !37, line: 454, baseType: !71, size: 16, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !336, file: !37, line: 454, baseType: !205, size: 88, offset: 80)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !336, file: !37, line: 454, baseType: !49, size: 64, offset: 168)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !336, file: !37, line: 454, baseType: !50, size: 8, offset: 232)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !336, file: !37, line: 455, baseType: !50, size: 8, offset: 240)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !336, file: !37, line: 456, baseType: !50, size: 8, offset: 248)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !336, file: !37, line: 457, baseType: !50, size: 8, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !336, file: !37, line: 458, baseType: !50, size: 8, offset: 264)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !336, file: !37, line: 459, baseType: !50, size: 8, offset: 272)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !336, file: !37, line: 460, baseType: !71, size: 16, offset: 280)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !336, file: !37, line: 461, baseType: !71, size: 16, offset: 296)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !336, file: !37, line: 462, baseType: !27, size: 32, offset: 312)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !81, file: !37, line: 637, baseType: !358, size: 232)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_common_serialbus", file: !37, line: 398, size: 232, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !358, file: !37, line: 399, baseType: !50, size: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !37, line: 399, baseType: !50, size: 8, offset: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !358, file: !37, line: 399, baseType: !50, size: 8, offset: 16)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !358, file: !37, line: 399, baseType: !50, size: 8, offset: 24)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !358, file: !37, line: 399, baseType: !50, size: 8, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !358, file: !37, line: 399, baseType: !50, size: 8, offset: 40)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !358, file: !37, line: 399, baseType: !71, size: 16, offset: 48)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !358, file: !37, line: 399, baseType: !71, size: 16, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !358, file: !37, line: 399, baseType: !205, size: 88, offset: 80)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !358, file: !37, line: 399, baseType: !49, size: 64, offset: 168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pin_function", scope: !81, file: !37, line: 638, baseType: !371, size: 288)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_function", file: !37, line: 508, size: 288, elements: !372)
!372 = !{!373, !374, !375, !376, !377, !378, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !371, file: !37, line: 509, baseType: !50, size: 8)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !371, file: !37, line: 510, baseType: !50, size: 8, offset: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !371, file: !37, line: 511, baseType: !50, size: 8, offset: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !371, file: !37, line: 512, baseType: !71, size: 16, offset: 24)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !371, file: !37, line: 513, baseType: !71, size: 16, offset: 40)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !371, file: !37, line: 514, baseType: !71, size: 16, offset: 56)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !371, file: !37, line: 515, baseType: !205, size: 88, offset: 72)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !371, file: !37, line: 516, baseType: !297, size: 64, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !371, file: !37, line: 517, baseType: !49, size: 64, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !81, file: !37, line: 639, baseType: !383, size: 312)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_config", file: !37, line: 520, size: 312, elements: !384)
!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !383, file: !37, line: 521, baseType: !50, size: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !383, file: !37, line: 522, baseType: !50, size: 8, offset: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !383, file: !37, line: 523, baseType: !50, size: 8, offset: 16)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !383, file: !37, line: 524, baseType: !50, size: 8, offset: 24)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !383, file: !37, line: 525, baseType: !27, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !383, file: !37, line: 526, baseType: !71, size: 16, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !383, file: !37, line: 527, baseType: !71, size: 16, offset: 80)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !383, file: !37, line: 528, baseType: !205, size: 88, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !383, file: !37, line: 529, baseType: !297, size: 64, offset: 184)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !383, file: !37, line: 530, baseType: !49, size: 64, offset: 248)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group", scope: !81, file: !37, line: 640, baseType: !396, size: 256)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group", file: !37, line: 550, size: 256, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403, !408}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !396, file: !37, line: 551, baseType: !50, size: 8)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !396, file: !37, line: 552, baseType: !50, size: 8, offset: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !396, file: !37, line: 553, baseType: !71, size: 16, offset: 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !396, file: !37, line: 554, baseType: !71, size: 16, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !396, file: !37, line: 555, baseType: !297, size: 64, offset: 48)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "resource_label", scope: !396, file: !37, line: 556, baseType: !404, size: 80, offset: 112)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_label", file: !37, line: 258, size: 80, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !404, file: !37, line: 259, baseType: !71, size: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !404, file: !37, line: 260, baseType: !210, size: 64, offset: 16)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !396, file: !37, line: 557, baseType: !49, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_function", scope: !81, file: !37, line: 641, baseType: !410, size: 288)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_function", file: !37, line: 560, size: 288, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !410, file: !37, line: 561, baseType: !50, size: 8)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !410, file: !37, line: 562, baseType: !50, size: 8, offset: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !410, file: !37, line: 563, baseType: !50, size: 8, offset: 16)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !410, file: !37, line: 564, baseType: !71, size: 16, offset: 24)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !410, file: !37, line: 565, baseType: !71, size: 16, offset: 40)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !410, file: !37, line: 566, baseType: !205, size: 88, offset: 56)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !410, file: !37, line: 567, baseType: !404, size: 80, offset: 144)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !410, file: !37, line: 568, baseType: !49, size: 64, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_config", scope: !81, file: !37, line: 642, baseType: !421, size: 312)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_config", file: !37, line: 571, size: 312, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !421, file: !37, line: 572, baseType: !50, size: 8)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !421, file: !37, line: 573, baseType: !50, size: 8, offset: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !421, file: !37, line: 574, baseType: !50, size: 8, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !421, file: !37, line: 575, baseType: !50, size: 8, offset: 24)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !421, file: !37, line: 576, baseType: !27, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !421, file: !37, line: 577, baseType: !71, size: 16, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !421, file: !37, line: 578, baseType: !205, size: 88, offset: 80)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !421, file: !37, line: 579, baseType: !404, size: 80, offset: 168)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !421, file: !37, line: 580, baseType: !49, size: 64, offset: 248)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !81, file: !37, line: 646, baseType: !433, size: 72)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address", file: !37, line: 303, size: 72, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !433, file: !37, line: 304, baseType: !50, size: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !433, file: !37, line: 304, baseType: !50, size: 8, offset: 8)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !433, file: !37, line: 304, baseType: !50, size: 8, offset: 16)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !433, file: !37, line: 304, baseType: !50, size: 8, offset: 24)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !433, file: !37, line: 304, baseType: !50, size: 8, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !433, file: !37, line: 304, baseType: !179, size: 32, offset: 40)
!441 = !{}
!442 = !DILocalVariable(name: "aml_buffer", arg: 1, scope: !68, file: !3, line: 30, type: !49)
!443 = !DILocation(line: 30, column: 29, scope: !68)
!444 = !DILocalVariable(name: "aml_buffer_length", arg: 2, scope: !68, file: !3, line: 31, type: !71)
!445 = !DILocation(line: 31, column: 8, scope: !68)
!446 = !DILocalVariable(name: "resource_ptr", arg: 3, scope: !68, file: !3, line: 32, type: !74)
!447 = !DILocation(line: 32, column: 27, scope: !68)
!448 = !DILocalVariable(name: "status", scope: !68, file: !3, line: 34, type: !25)
!449 = !DILocation(line: 34, column: 14, scope: !68)
!450 = !DILocalVariable(name: "list_size_needed", scope: !68, file: !3, line: 35, type: !31)
!451 = !DILocation(line: 35, column: 12, scope: !68)
!452 = !DILocalVariable(name: "resource", scope: !68, file: !3, line: 36, type: !48)
!453 = !DILocation(line: 36, column: 8, scope: !68)
!454 = !DILocalVariable(name: "current_resource_ptr", scope: !68, file: !3, line: 37, type: !48)
!455 = !DILocation(line: 37, column: 8, scope: !68)
!456 = !DILocation(line: 49, column: 30, scope: !68)
!457 = !DILocation(line: 49, column: 42, scope: !68)
!458 = !DILocation(line: 49, column: 6, scope: !68)
!459 = !DILocation(line: 48, column: 9, scope: !68)
!460 = !DILocation(line: 51, column: 6, scope: !461)
!461 = distinct !DILexicalBlock(scope: !68, file: !3, line: 51, column: 6)
!462 = !DILocation(line: 51, column: 13, scope: !461)
!463 = !DILocation(line: 51, column: 6, scope: !68)
!464 = !DILocation(line: 52, column: 10, scope: !465)
!465 = distinct !DILexicalBlock(scope: !461, file: !3, line: 51, column: 44)
!466 = !DILocation(line: 53, column: 2, scope: !465)
!467 = !DILocation(line: 54, column: 6, scope: !468)
!468 = distinct !DILexicalBlock(scope: !68, file: !3, line: 54, column: 6)
!469 = !DILocation(line: 54, column: 6, scope: !68)
!470 = !DILocation(line: 55, column: 3, scope: !471)
!471 = distinct !DILexicalBlock(scope: !468, file: !3, line: 54, column: 28)
!472 = !DILocation(line: 60, column: 13, scope: !68)
!473 = !DILocation(line: 60, column: 11, scope: !68)
!474 = !DILocation(line: 61, column: 25, scope: !68)
!475 = !DILocation(line: 61, column: 23, scope: !68)
!476 = !DILocation(line: 62, column: 7, scope: !477)
!477 = distinct !DILexicalBlock(scope: !68, file: !3, line: 62, column: 6)
!478 = !DILocation(line: 62, column: 6, scope: !68)
!479 = !DILocation(line: 63, column: 3, scope: !480)
!480 = distinct !DILexicalBlock(scope: !477, file: !3, line: 62, column: 17)
!481 = !DILocation(line: 68, column: 44, scope: !68)
!482 = !DILocation(line: 68, column: 56, scope: !68)
!483 = !DILocation(line: 68, column: 11, scope: !68)
!484 = !DILocation(line: 68, column: 9, scope: !68)
!485 = !DILocation(line: 71, column: 6, scope: !486)
!486 = distinct !DILexicalBlock(scope: !68, file: !3, line: 71, column: 6)
!487 = !DILocation(line: 71, column: 13, scope: !486)
!488 = !DILocation(line: 71, column: 6, scope: !68)
!489 = !DILocation(line: 72, column: 10, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !3, line: 71, column: 44)
!491 = !DILocation(line: 73, column: 2, scope: !490)
!492 = !DILocation(line: 74, column: 6, scope: !493)
!493 = distinct !DILexicalBlock(scope: !68, file: !3, line: 74, column: 6)
!494 = !DILocation(line: 74, column: 6, scope: !68)
!495 = !DILocation(line: 75, column: 3, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !3, line: 74, column: 28)
!497 = !DILocation(line: 76, column: 2, scope: !496)
!498 = !DILocation(line: 77, column: 19, scope: !499)
!499 = distinct !DILexicalBlock(scope: !493, file: !3, line: 76, column: 9)
!500 = !DILocation(line: 77, column: 4, scope: !499)
!501 = !DILocation(line: 77, column: 17, scope: !499)
!502 = !DILocation(line: 80, column: 2, scope: !68)
!503 = !DILocation(line: 81, column: 1, scope: !68)
!504 = distinct !DISubprogram(name: "acpi_os_allocate_zeroed", scope: !505, file: !505, line: 55, type: !506, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !441)
!505 = !DIFile(filename: "./include/acpi/platform/aclinuxex.h", directory: "/home/lizy2001/genbc/linux")
!506 = !DISubroutineType(types: !507)
!507 = !{!48, !31}
!508 = !DILocalVariable(name: "flags", arg: 1, scope: !509, file: !510, line: 162, type: !56)
!509 = distinct !DISubprogram(name: "arch_irqs_disabled_flags", scope: !510, file: !510, line: 162, type: !511, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !441)
!510 = !DIFile(filename: "./arch/x86/include/asm/irqflags.h", directory: "/home/lizy2001/genbc/linux")
!511 = !DISubroutineType(types: !512)
!512 = !{!513, !56}
!513 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!514 = !DILocation(line: 162, column: 67, scope: !509, inlinedAt: !515)
!515 = distinct !DILocation(line: 57, column: 23, scope: !516)
!516 = distinct !DILexicalBlock(scope: !517, file: !505, line: 57, column: 23)
!517 = distinct !DILexicalBlock(scope: !504, file: !505, line: 57, column: 23)
!518 = !DILocalVariable(name: "size", arg: 1, scope: !504, file: !505, line: 55, type: !31)
!519 = !DILocation(line: 55, column: 55, scope: !504)
!520 = !DILocation(line: 57, column: 17, scope: !504)
!521 = !DILocalVariable(name: "_flags", scope: !517, file: !505, line: 57, type: !56)
!522 = !DILocation(line: 57, column: 23, scope: !517)
!523 = !DILocalVariable(name: "__dummy", scope: !524, file: !505, line: 57, type: !56)
!524 = distinct !DILexicalBlock(scope: !525, file: !505, line: 57, column: 23)
!525 = distinct !DILexicalBlock(scope: !517, file: !505, line: 57, column: 23)
!526 = !DILocation(line: 57, column: 23, scope: !524)
!527 = !DILocalVariable(name: "__dummy2", scope: !524, file: !505, line: 57, type: !56)
!528 = !DILocation(line: 57, column: 23, scope: !525)
!529 = !DILocalVariable(name: "__dummy", scope: !530, file: !505, line: 57, type: !56)
!530 = distinct !DILexicalBlock(scope: !516, file: !505, line: 57, column: 23)
!531 = !DILocation(line: 57, column: 23, scope: !530)
!532 = !DILocalVariable(name: "__dummy2", scope: !530, file: !505, line: 57, type: !56)
!533 = !DILocation(line: 57, column: 23, scope: !516)
!534 = !DILocation(line: 164, column: 11, scope: !509, inlinedAt: !515)
!535 = !DILocation(line: 164, column: 17, scope: !509, inlinedAt: !515)
!536 = !DILocation(line: 164, column: 9, scope: !509, inlinedAt: !515)
!537 = !DILocation(line: 57, column: 23, scope: !504)
!538 = !DILocation(line: 57, column: 9, scope: !504)
!539 = !DILocation(line: 57, column: 2, scope: !504)
!540 = distinct !DISubprogram(name: "acpi_os_free", scope: !505, file: !505, line: 60, type: !541, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !441)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !48}
!543 = !DILocalVariable(name: "memory", arg: 1, scope: !540, file: !505, line: 60, type: !48)
!544 = !DILocation(line: 60, column: 39, scope: !540)
!545 = !DILocation(line: 62, column: 8, scope: !540)
!546 = !DILocation(line: 62, column: 2, scope: !540)
!547 = !DILocation(line: 63, column: 1, scope: !540)
!548 = distinct !DISubprogram(name: "acpi_rs_create_resource_list", scope: !3, file: !3, line: 103, type: !549, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !441)
!549 = !DISubroutineType(types: !550)
!550 = !{!25, !551, !1299}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !6, line: 367, size: 576, elements: !553)
!553 = !{!554, !562, !575, !585, !617, !631, !640, !950, !967, !982, !995, !1073, !1085, !1099, !1109, !1127, !1149, !1168, !1187, !1206, !1219, !1245, !1262, !1275, !1289, !1298}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !6, line: 368, baseType: !555, size: 128)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !6, line: 73, size: 128, elements: !556)
!556 = !{!557, !558, !559, !560, !561}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !555, file: !6, line: 74, baseType: !551, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !555, file: !6, line: 74, baseType: !50, size: 8, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !6, line: 74, baseType: !50, size: 8, offset: 72)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !555, file: !6, line: 74, baseType: !71, size: 16, offset: 80)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !555, file: !6, line: 74, baseType: !50, size: 8, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !552, file: !6, line: 369, baseType: !563, size: 192)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !6, line: 76, size: 192, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !574}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !563, file: !6, line: 77, baseType: !551, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !563, file: !6, line: 77, baseType: !50, size: 8, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !563, file: !6, line: 77, baseType: !50, size: 8, offset: 72)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !563, file: !6, line: 77, baseType: !71, size: 16, offset: 80)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !563, file: !6, line: 77, baseType: !50, size: 8, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !563, file: !6, line: 77, baseType: !571, size: 24, offset: 104)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 24, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 3)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !563, file: !6, line: 78, baseType: !32, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !552, file: !6, line: 370, baseType: !576, size: 256)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !6, line: 93, size: 256, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !576, file: !6, line: 94, baseType: !551, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !576, file: !6, line: 94, baseType: !50, size: 8, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !576, file: !6, line: 94, baseType: !50, size: 8, offset: 72)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !576, file: !6, line: 94, baseType: !71, size: 16, offset: 80)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !576, file: !6, line: 94, baseType: !50, size: 8, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !576, file: !6, line: 94, baseType: !210, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !576, file: !6, line: 94, baseType: !27, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !552, file: !6, line: 371, baseType: !586, size: 384)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !6, line: 97, size: 384, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !586, file: !6, line: 98, baseType: !551, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !586, file: !6, line: 98, baseType: !50, size: 8, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !6, line: 98, baseType: !50, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !586, file: !6, line: 98, baseType: !71, size: 16, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !586, file: !6, line: 98, baseType: !50, size: 8, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !586, file: !6, line: 98, baseType: !49, size: 64, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !586, file: !6, line: 98, baseType: !27, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !586, file: !6, line: 99, baseType: !27, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !586, file: !6, line: 100, baseType: !49, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !586, file: !6, line: 101, baseType: !598, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !600, line: 133, size: 384, elements: !601)
!600 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!601 = !{!602, !603, !604, !605, !606, !612, !613, !614, !615}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !599, file: !600, line: 134, baseType: !551, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !599, file: !600, line: 135, baseType: !50, size: 8, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !600, line: 136, baseType: !50, size: 8, offset: 72)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !600, line: 137, baseType: !71, size: 16, offset: 80)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !600, line: 138, baseType: !607, size: 32, offset: 96)
!607 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !608, line: 327, size: 32, elements: !609)
!608 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !607, file: !608, line: 328, baseType: !27, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !607, file: !608, line: 329, baseType: !44, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !599, file: !600, line: 139, baseType: !598, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !599, file: !600, line: 140, baseType: !598, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !599, file: !600, line: 141, baseType: !598, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !599, file: !600, line: 142, baseType: !616, size: 16, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !26, line: 445, baseType: !71)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !552, file: !6, line: 372, baseType: !618, size: 384)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !6, line: 104, size: 384, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !628, !629, !630}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !618, file: !6, line: 105, baseType: !551, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !618, file: !6, line: 105, baseType: !50, size: 8, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !618, file: !6, line: 105, baseType: !50, size: 8, offset: 72)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !618, file: !6, line: 105, baseType: !71, size: 16, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !618, file: !6, line: 105, baseType: !50, size: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !618, file: !6, line: 105, baseType: !598, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !618, file: !6, line: 106, baseType: !627, size: 64, offset: 192)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !618, file: !6, line: 107, baseType: !49, size: 64, offset: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !618, file: !6, line: 108, baseType: !27, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !618, file: !6, line: 109, baseType: !27, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !552, file: !6, line: 373, baseType: !632, size: 192)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !6, line: 118, size: 192, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !632, file: !6, line: 119, baseType: !551, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !632, file: !6, line: 119, baseType: !50, size: 8, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !632, file: !6, line: 119, baseType: !50, size: 8, offset: 72)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !632, file: !6, line: 119, baseType: !71, size: 16, offset: 80)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !6, line: 119, baseType: !50, size: 8, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !632, file: !6, line: 119, baseType: !48, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !552, file: !6, line: 374, baseType: !641, size: 448)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !6, line: 143, size: 448, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !947, !948, !949}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !641, file: !6, line: 144, baseType: !551, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !641, file: !6, line: 144, baseType: !50, size: 8, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !6, line: 144, baseType: !50, size: 8, offset: 72)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !641, file: !6, line: 144, baseType: !71, size: 16, offset: 80)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !641, file: !6, line: 144, baseType: !50, size: 8, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !641, file: !6, line: 144, baseType: !50, size: 8, offset: 104)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !641, file: !6, line: 145, baseType: !50, size: 8, offset: 112)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !641, file: !6, line: 146, baseType: !50, size: 8, offset: 120)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !641, file: !6, line: 147, baseType: !551, size: 64, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !641, file: !6, line: 148, baseType: !551, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !641, file: !6, line: 149, baseType: !49, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !641, file: !6, line: 153, baseType: !655, size: 64, offset: 320)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !6, line: 150, size: 64, elements: !656)
!656 = !{!657, !946}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !655, file: !6, line: 151, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !600, line: 248, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!25, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !664, line: 37, size: 9024, elements: !665)
!664 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !894, !895, !896, !897, !898, !902, !904, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !929, !930, !931, !932, !933, !934, !935, !936, !938, !944}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !663, file: !664, line: 38, baseType: !662, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !663, file: !664, line: 39, baseType: !50, size: 8, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !663, file: !664, line: 40, baseType: !50, size: 8, offset: 72)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !663, file: !664, line: 41, baseType: !71, size: 16, offset: 80)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !663, file: !664, line: 42, baseType: !50, size: 8, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !663, file: !664, line: 43, baseType: !50, size: 8, offset: 104)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !663, file: !664, line: 44, baseType: !50, size: 8, offset: 112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !663, file: !664, line: 45, baseType: !616, size: 16, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !663, file: !664, line: 46, baseType: !50, size: 8, offset: 144)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !663, file: !664, line: 47, baseType: !50, size: 8, offset: 152)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !663, file: !664, line: 48, baseType: !50, size: 8, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !663, file: !664, line: 49, baseType: !50, size: 8, offset: 168)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !663, file: !664, line: 50, baseType: !50, size: 8, offset: 176)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !663, file: !664, line: 51, baseType: !50, size: 8, offset: 184)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !663, file: !664, line: 52, baseType: !50, size: 8, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !663, file: !664, line: 53, baseType: !50, size: 8, offset: 200)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !663, file: !664, line: 54, baseType: !49, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !663, file: !664, line: 55, baseType: !27, size: 32, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !663, file: !664, line: 56, baseType: !27, size: 32, offset: 352)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !663, file: !664, line: 57, baseType: !27, size: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !663, file: !664, line: 58, baseType: !27, size: 32, offset: 416)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !663, file: !664, line: 60, baseType: !688, size: 640, offset: 448)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !600, line: 893, size: 640, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !776, !777, !892, !893}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !688, file: !600, line: 894, baseType: !49, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !688, file: !600, line: 895, baseType: !49, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !688, file: !600, line: 896, baseType: !49, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !688, file: !600, line: 897, baseType: !49, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !688, file: !600, line: 898, baseType: !49, size: 64, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !688, file: !600, line: 899, baseType: !696, size: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !600, line: 875, size: 1600, elements: !698)
!698 = !{!699, !719, !735}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !600, line: 876, baseType: !700, size: 448)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !600, line: 828, size: 448, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !718}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !700, file: !600, line: 829, baseType: !696, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !700, file: !600, line: 829, baseType: !50, size: 8, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !700, file: !600, line: 829, baseType: !50, size: 8, offset: 72)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !700, file: !600, line: 829, baseType: !71, size: 16, offset: 80)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !700, file: !600, line: 829, baseType: !49, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !700, file: !600, line: 829, baseType: !696, size: 64, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !700, file: !600, line: 829, baseType: !598, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !700, file: !600, line: 829, baseType: !710, size: 64, offset: 320)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !600, line: 716, size: 64, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !710, file: !600, line: 717, baseType: !32, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !710, file: !600, line: 718, baseType: !27, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !710, file: !600, line: 719, baseType: !210, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !710, file: !600, line: 720, baseType: !49, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !600, line: 721, baseType: !210, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !710, file: !600, line: 722, baseType: !696, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !700, file: !600, line: 829, baseType: !50, size: 8, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !697, file: !600, line: 877, baseType: !720, size: 640)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !600, line: 835, size: 640, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !720, file: !600, line: 836, baseType: !696, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !720, file: !600, line: 836, baseType: !50, size: 8, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !720, file: !600, line: 836, baseType: !50, size: 8, offset: 72)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !720, file: !600, line: 836, baseType: !71, size: 16, offset: 80)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !720, file: !600, line: 836, baseType: !49, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !600, line: 836, baseType: !696, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !720, file: !600, line: 836, baseType: !598, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !720, file: !600, line: 836, baseType: !710, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !720, file: !600, line: 836, baseType: !50, size: 8, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !720, file: !600, line: 836, baseType: !210, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !720, file: !600, line: 837, baseType: !49, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !720, file: !600, line: 838, baseType: !27, size: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !600, line: 839, baseType: !27, size: 32, offset: 608)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !697, file: !600, line: 878, baseType: !736, size: 1600)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !600, line: 846, size: 1600, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !736, file: !600, line: 847, baseType: !696, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !736, file: !600, line: 847, baseType: !50, size: 8, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !736, file: !600, line: 847, baseType: !50, size: 8, offset: 72)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !736, file: !600, line: 847, baseType: !71, size: 16, offset: 80)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !736, file: !600, line: 847, baseType: !49, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !736, file: !600, line: 847, baseType: !696, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !736, file: !600, line: 847, baseType: !598, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !736, file: !600, line: 847, baseType: !710, size: 64, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !736, file: !600, line: 847, baseType: !50, size: 8, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !736, file: !600, line: 847, baseType: !696, size: 64, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !736, file: !600, line: 848, baseType: !696, size: 64, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !736, file: !600, line: 849, baseType: !210, size: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !736, file: !600, line: 850, baseType: !50, size: 8, offset: 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !736, file: !600, line: 851, baseType: !210, size: 64, offset: 704)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !736, file: !600, line: 852, baseType: !210, size: 64, offset: 768)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !736, file: !600, line: 853, baseType: !210, size: 64, offset: 832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !736, file: !600, line: 854, baseType: !44, size: 32, offset: 896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !736, file: !600, line: 855, baseType: !27, size: 32, offset: 928)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !736, file: !600, line: 856, baseType: !27, size: 32, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !736, file: !600, line: 857, baseType: !27, size: 32, offset: 992)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !736, file: !600, line: 858, baseType: !27, size: 32, offset: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !736, file: !600, line: 859, baseType: !27, size: 32, offset: 1056)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !736, file: !600, line: 860, baseType: !27, size: 32, offset: 1088)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !736, file: !600, line: 861, baseType: !27, size: 32, offset: 1120)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !736, file: !600, line: 862, baseType: !27, size: 32, offset: 1152)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !736, file: !600, line: 863, baseType: !27, size: 32, offset: 1184)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !736, file: !600, line: 864, baseType: !27, size: 32, offset: 1216)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !736, file: !600, line: 865, baseType: !27, size: 32, offset: 1248)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !736, file: !600, line: 866, baseType: !27, size: 32, offset: 1280)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !736, file: !600, line: 867, baseType: !27, size: 32, offset: 1312)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !736, file: !600, line: 868, baseType: !71, size: 16, offset: 1344)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !736, file: !600, line: 869, baseType: !50, size: 8, offset: 1360)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !736, file: !600, line: 870, baseType: !50, size: 8, offset: 1368)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !736, file: !600, line: 871, baseType: !50, size: 8, offset: 1376)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !736, file: !600, line: 872, baseType: !773, size: 160, offset: 1384)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 160, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 20)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !688, file: !600, line: 900, baseType: !598, size: 64, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !688, file: !600, line: 901, baseType: !778, size: 64, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !600, line: 663, size: 640, elements: !780)
!780 = !{!781, !789, !802, !811, !820, !833, !847, !859, !871}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !600, line: 664, baseType: !782, size: 128)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !600, line: 567, size: 128, elements: !783)
!783 = !{!784, !785, !786, !787, !788}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !600, line: 568, baseType: !48, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !782, file: !600, line: 568, baseType: !50, size: 8, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !600, line: 568, baseType: !50, size: 8, offset: 72)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !782, file: !600, line: 568, baseType: !71, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !782, file: !600, line: 568, baseType: !71, size: 16, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !779, file: !600, line: 665, baseType: !790, size: 384)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !600, line: 593, size: 384, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !790, file: !600, line: 594, baseType: !48, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !790, file: !600, line: 594, baseType: !50, size: 8, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !600, line: 594, baseType: !50, size: 8, offset: 72)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !790, file: !600, line: 594, baseType: !71, size: 16, offset: 80)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !790, file: !600, line: 594, baseType: !71, size: 16, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !790, file: !600, line: 594, baseType: !71, size: 16, offset: 112)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !790, file: !600, line: 595, baseType: !696, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !790, file: !600, line: 596, baseType: !49, size: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !790, file: !600, line: 597, baseType: !49, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !790, file: !600, line: 598, baseType: !32, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !779, file: !600, line: 666, baseType: !803, size: 192)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !600, line: 573, size: 192, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !600, line: 574, baseType: !48, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !803, file: !600, line: 574, baseType: !50, size: 8, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !803, file: !600, line: 574, baseType: !50, size: 8, offset: 72)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !803, file: !600, line: 574, baseType: !71, size: 16, offset: 80)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !803, file: !600, line: 574, baseType: !71, size: 16, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !803, file: !600, line: 574, baseType: !551, size: 64, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !779, file: !600, line: 667, baseType: !812, size: 192)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !600, line: 604, size: 192, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !600, line: 605, baseType: !48, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !812, file: !600, line: 605, baseType: !50, size: 8, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !812, file: !600, line: 605, baseType: !50, size: 8, offset: 72)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !812, file: !600, line: 605, baseType: !71, size: 16, offset: 80)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !812, file: !600, line: 605, baseType: !71, size: 16, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !812, file: !600, line: 605, baseType: !598, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !779, file: !600, line: 668, baseType: !821, size: 448)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !600, line: 608, size: 448, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !821, file: !600, line: 609, baseType: !48, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !821, file: !600, line: 609, baseType: !50, size: 8, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !821, file: !600, line: 609, baseType: !50, size: 8, offset: 72)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !821, file: !600, line: 609, baseType: !71, size: 16, offset: 80)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !821, file: !600, line: 609, baseType: !71, size: 16, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !821, file: !600, line: 609, baseType: !27, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !821, file: !600, line: 610, baseType: !696, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !821, file: !600, line: 611, baseType: !49, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !821, file: !600, line: 612, baseType: !49, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !821, file: !600, line: 613, baseType: !27, size: 32, offset: 384)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !779, file: !600, line: 669, baseType: !834, size: 512)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !600, line: 580, size: 512, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !834, file: !600, line: 581, baseType: !48, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !834, file: !600, line: 581, baseType: !50, size: 8, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !834, file: !600, line: 581, baseType: !50, size: 8, offset: 72)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !834, file: !600, line: 581, baseType: !71, size: 16, offset: 80)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !834, file: !600, line: 581, baseType: !71, size: 16, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !834, file: !600, line: 581, baseType: !27, size: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !834, file: !600, line: 582, baseType: !551, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !834, file: !600, line: 583, baseType: !551, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !834, file: !600, line: 584, baseType: !662, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !834, file: !600, line: 585, baseType: !48, size: 64, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !834, file: !600, line: 586, baseType: !27, size: 32, offset: 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !779, file: !600, line: 670, baseType: !848, size: 320)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !600, line: 620, size: 320, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !600, line: 621, baseType: !48, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !848, file: !600, line: 621, baseType: !50, size: 8, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !848, file: !600, line: 621, baseType: !50, size: 8, offset: 72)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !848, file: !600, line: 621, baseType: !71, size: 16, offset: 80)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !848, file: !600, line: 621, baseType: !71, size: 16, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !848, file: !600, line: 621, baseType: !50, size: 8, offset: 112)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !848, file: !600, line: 622, baseType: !662, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !848, file: !600, line: 623, baseType: !551, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !848, file: !600, line: 624, baseType: !32, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !779, file: !600, line: 671, baseType: !860, size: 640)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !600, line: 631, size: 640, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !860, file: !600, line: 632, baseType: !48, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !860, file: !600, line: 632, baseType: !50, size: 8, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !860, file: !600, line: 632, baseType: !50, size: 8, offset: 72)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !860, file: !600, line: 632, baseType: !71, size: 16, offset: 80)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !860, file: !600, line: 632, baseType: !71, size: 16, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !860, file: !600, line: 633, baseType: !868, size: 512, offset: 128)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 512, elements: !869)
!869 = !{!870}
!870 = !DISubrange(count: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !779, file: !600, line: 672, baseType: !872, size: 320)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !600, line: 654, size: 320, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !600, line: 655, baseType: !48, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !872, file: !600, line: 655, baseType: !50, size: 8, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !872, file: !600, line: 655, baseType: !50, size: 8, offset: 72)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !872, file: !600, line: 655, baseType: !71, size: 16, offset: 80)
