; ModuleID = '../bcout/drivers/acpi/acpica/rsmisc.llvm.bc'
source_filename = "drivers/acpi/acpica/rsmisc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_resource = type { i32, i32, %union.acpi_resource_data }
%union.acpi_resource_data = type { %struct.acpi_resource_vendor_typed, [40 x i8] }
%struct.acpi_resource_vendor_typed = type { i16, i8, [16 x i8], [1 x i8] }
%union.aml_resource = type { i32, [52 x i8] }
%struct.acpi_rsconvert_info = type { i8, i8, i8, i8 }
%struct.aml_resource_large_header = type <{ i8, i16 }>
%struct.acpi_resource_source = type <{ i8, i16, i8* }>

@_acpi_module_name = internal constant [7 x i8] c"rsmisc\00", align 1, !dbg !0
@.str = private unnamed_addr constant [61 x i8] c"Misaligned resource pointer (get): %p Type 0x%2.2X Length %u\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Invalid conversion sub-opcode\00", align 1
@.str.2 = private unnamed_addr constant [26 x i8] c"Invalid conversion opcode\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @acpi_rs_convert_aml_to_resource(%struct.acpi_resource* %resource, %union.aml_resource* %aml, %struct.acpi_rsconvert_info* %info) #0 !dbg !42 {
entry:
  %retval = alloca i32, align 4
  %resource.addr = alloca %struct.acpi_resource*, align 8
  %aml.addr = alloca %union.aml_resource*, align 8
  %info.addr = alloca %struct.acpi_rsconvert_info*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 13, type: !33, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !32, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/rsmisc.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !13, !17, !18, !19, !22, !25, !26, !28, !29, !30, !8}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !7, line: 127, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !16)
!16 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !21)
!21 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !24)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_rs_length", file: !31, line: 16, baseType: !22)
!31 = !DIFile(filename: "./include/acpi/acrestyp.h", directory: "/home/lizy2001/genbc/linux")
!32 = !{!0}
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 56, elements: !35)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!35 = !{!36}
!36 = !DISubrange(count: 7)
!37 = !{i32 7, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{i32 1, !"wchar_size", i32 2}
!40 = !{i32 1, !"Code Model", i32 2}
!41 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!42 = distinct !DISubprogram(name: "acpi_rs_convert_aml_to_resource", scope: !3, file: !3, line: 35, type: !43, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{!6, !45, !409, !735}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource", file: !31, line: 651, size: 544, elements: !47)
!47 = !{!48, !49, !50}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !46, file: !31, line: 652, baseType: !8, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !46, file: !31, line: 653, baseType: !8, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !46, file: !31, line: 654, baseType: !51, size: 480, offset: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_data", file: !31, line: 614, size: 480, elements: !52)
!52 = !{!53, !66, !74, !80, !88, !93, !99, !104, !114, !118, !126, !134, !140, !180, !198, !216, !228, !240, !248, !267, !283, !303, !325, !338, !350, !363, !377, !388, !400}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !51, file: !31, line: 615, baseType: !54, size: 56)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_irq", file: !31, line: 138, size: 56, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !54, file: !31, line: 139, baseType: !19, size: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !54, file: !31, line: 140, baseType: !19, size: 8, offset: 8)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !54, file: !31, line: 141, baseType: !19, size: 8, offset: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !54, file: !31, line: 142, baseType: !19, size: 8, offset: 24)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !54, file: !31, line: 143, baseType: !19, size: 8, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !54, file: !31, line: 144, baseType: !19, size: 8, offset: 40)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !54, file: !31, line: 145, baseType: !63, size: 8, offset: 48)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 1)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !51, file: !31, line: 616, baseType: !67, size: 40)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_dma", file: !31, line: 148, size: 40, elements: !68)
!68 = !{!69, !70, !71, !72, !73}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !67, file: !31, line: 149, baseType: !19, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "bus_master", scope: !67, file: !31, line: 150, baseType: !19, size: 8, offset: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !67, file: !31, line: 151, baseType: !19, size: 8, offset: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "channel_count", scope: !67, file: !31, line: 152, baseType: !19, size: 8, offset: 24)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !67, file: !31, line: 153, baseType: !63, size: 8, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !51, file: !31, line: 617, baseType: !75, size: 24)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_start_dependent", file: !31, line: 156, size: 24, elements: !76)
!76 = !{!77, !78, !79}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !75, file: !31, line: 157, baseType: !19, size: 8)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility_priority", scope: !75, file: !31, line: 158, baseType: !19, size: 8, offset: 8)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "performance_robustness", scope: !75, file: !31, line: 159, baseType: !19, size: 8, offset: 16)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !51, file: !31, line: 618, baseType: !81, size: 56)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_io", file: !31, line: 167, size: 56, elements: !82)
!82 = !{!83, !84, !85, !86, !87}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "io_decode", scope: !81, file: !31, line: 168, baseType: !19, size: 8)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !81, file: !31, line: 169, baseType: !19, size: 8, offset: 8)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !81, file: !31, line: 170, baseType: !19, size: 8, offset: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !81, file: !31, line: 171, baseType: !22, size: 16, offset: 24)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !81, file: !31, line: 172, baseType: !22, size: 16, offset: 40)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !51, file: !31, line: 619, baseType: !89, size: 24)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_io", file: !31, line: 175, size: 24, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !89, file: !31, line: 176, baseType: !22, size: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !89, file: !31, line: 177, baseType: !19, size: 8, offset: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !51, file: !31, line: 620, baseType: !94, size: 40)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_dma", file: !31, line: 180, size: 40, elements: !95)
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !94, file: !31, line: 181, baseType: !22, size: 16)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !94, file: !31, line: 182, baseType: !22, size: 16, offset: 16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !94, file: !31, line: 183, baseType: !19, size: 8, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !51, file: !31, line: 621, baseType: !100, size: 24)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor", file: !31, line: 195, size: 24, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !100, file: !31, line: 196, baseType: !22, size: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !100, file: !31, line: 197, baseType: !63, size: 8, offset: 16)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_typed", scope: !51, file: !31, line: 622, baseType: !105, size: 160)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor_typed", file: !31, line: 202, size: 160, elements: !106)
!106 = !{!107, !108, !109, !113}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !105, file: !31, line: 203, baseType: !22, size: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_subtype", scope: !105, file: !31, line: 204, baseType: !19, size: 8, offset: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !105, file: !31, line: 205, baseType: !110, size: 128, offset: 24)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 128, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !105, file: !31, line: 206, baseType: !63, size: 8, offset: 152)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !51, file: !31, line: 623, baseType: !115, size: 8)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_end_tag", file: !31, line: 209, size: 8, elements: !116)
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !115, file: !31, line: 210, baseType: !19, size: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !51, file: !31, line: 624, baseType: !119, size: 72)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory24", file: !31, line: 213, size: 72, elements: !120)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !119, file: !31, line: 214, baseType: !19, size: 8)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !119, file: !31, line: 215, baseType: !22, size: 16, offset: 8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !119, file: !31, line: 216, baseType: !22, size: 16, offset: 24)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !119, file: !31, line: 217, baseType: !22, size: 16, offset: 40)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !119, file: !31, line: 218, baseType: !22, size: 16, offset: 56)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !51, file: !31, line: 625, baseType: !127, size: 136)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory32", file: !31, line: 221, size: 136, elements: !128)
!128 = !{!129, !130, !131, !132, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !127, file: !31, line: 222, baseType: !19, size: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !127, file: !31, line: 223, baseType: !8, size: 32, offset: 8)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !127, file: !31, line: 224, baseType: !8, size: 32, offset: 40)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !127, file: !31, line: 225, baseType: !8, size: 32, offset: 72)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !127, file: !31, line: 226, baseType: !8, size: 32, offset: 104)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !51, file: !31, line: 626, baseType: !135, size: 72)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_memory32", file: !31, line: 229, size: 72, elements: !136)
!136 = !{!137, !138, !139}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !135, file: !31, line: 230, baseType: !19, size: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !135, file: !31, line: 231, baseType: !8, size: 32, offset: 8)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !135, file: !31, line: 232, baseType: !8, size: 32, offset: 40)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !51, file: !31, line: 627, baseType: !141, size: 240)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address16", file: !31, line: 306, size: 240, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !166, !174}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !141, file: !31, line: 307, baseType: !19, size: 8)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !141, file: !31, line: 307, baseType: !19, size: 8, offset: 8)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !141, file: !31, line: 307, baseType: !19, size: 8, offset: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !141, file: !31, line: 307, baseType: !19, size: 8, offset: 24)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !141, file: !31, line: 307, baseType: !19, size: 8, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !141, file: !31, line: 307, baseType: !149, size: 32, offset: 40)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_attribute", file: !31, line: 249, size: 32, elements: !150)
!150 = !{!151, !158, !165}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !149, file: !31, line: 250, baseType: !152, size: 32)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_memory_attribute", file: !31, line: 235, size: 32, elements: !153)
!153 = !{!154, !155, !156, !157}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !152, file: !31, line: 236, baseType: !19, size: 8)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !152, file: !31, line: 237, baseType: !19, size: 8, offset: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !152, file: !31, line: 238, baseType: !19, size: 8, offset: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !152, file: !31, line: 239, baseType: !19, size: 8, offset: 24)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !149, file: !31, line: 251, baseType: !159, size: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_io_attribute", file: !31, line: 242, size: 32, elements: !160)
!160 = !{!161, !162, !163, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !159, file: !31, line: 243, baseType: !19, size: 8)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !159, file: !31, line: 244, baseType: !19, size: 8, offset: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "translation_type", scope: !159, file: !31, line: 245, baseType: !19, size: 8, offset: 16)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !159, file: !31, line: 246, baseType: !19, size: 8, offset: 24)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !149, file: !31, line: 255, baseType: !19, size: 8)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !141, file: !31, line: 307, baseType: !167, size: 80, offset: 72)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address16_attribute", file: !31, line: 279, size: 80, elements: !168)
!168 = !{!169, !170, !171, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !167, file: !31, line: 280, baseType: !22, size: 16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !167, file: !31, line: 281, baseType: !22, size: 16, offset: 16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !167, file: !31, line: 282, baseType: !22, size: 16, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !167, file: !31, line: 283, baseType: !22, size: 16, offset: 48)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !167, file: !31, line: 284, baseType: !22, size: 16, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !141, file: !31, line: 308, baseType: !175, size: 88, offset: 152)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_source", file: !31, line: 263, size: 88, elements: !176)
!176 = !{!177, !178, !179}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !175, file: !31, line: 264, baseType: !19, size: 8)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !175, file: !31, line: 265, baseType: !22, size: 16, offset: 8)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !175, file: !31, line: 266, baseType: !26, size: 64, offset: 24)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !51, file: !31, line: 628, baseType: !181, size: 320)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address32", file: !31, line: 311, size: 320, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !197}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !181, file: !31, line: 312, baseType: !19, size: 8)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !181, file: !31, line: 312, baseType: !19, size: 8, offset: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !181, file: !31, line: 312, baseType: !19, size: 8, offset: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !181, file: !31, line: 312, baseType: !19, size: 8, offset: 24)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !181, file: !31, line: 312, baseType: !19, size: 8, offset: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !181, file: !31, line: 312, baseType: !149, size: 32, offset: 40)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !181, file: !31, line: 312, baseType: !190, size: 160, offset: 72)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address32_attribute", file: !31, line: 287, size: 160, elements: !191)
!191 = !{!192, !193, !194, !195, !196}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !190, file: !31, line: 288, baseType: !8, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !190, file: !31, line: 289, baseType: !8, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !190, file: !31, line: 290, baseType: !8, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !190, file: !31, line: 291, baseType: !8, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !190, file: !31, line: 292, baseType: !8, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !181, file: !31, line: 313, baseType: !175, size: 88, offset: 232)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !51, file: !31, line: 629, baseType: !199, size: 480)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address64", file: !31, line: 316, size: 480, elements: !200)
!200 = !{!201, !202, !203, !204, !205, !206, !207, !215}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !199, file: !31, line: 317, baseType: !19, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !199, file: !31, line: 317, baseType: !19, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !199, file: !31, line: 317, baseType: !19, size: 8, offset: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !199, file: !31, line: 317, baseType: !19, size: 8, offset: 24)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !199, file: !31, line: 317, baseType: !19, size: 8, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !199, file: !31, line: 317, baseType: !149, size: 32, offset: 40)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !199, file: !31, line: 317, baseType: !208, size: 320, offset: 72)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address64_attribute", file: !31, line: 295, size: 320, elements: !209)
!209 = !{!210, !211, !212, !213, !214}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !208, file: !31, line: 296, baseType: !14, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !208, file: !31, line: 297, baseType: !14, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !208, file: !31, line: 298, baseType: !14, size: 64, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !208, file: !31, line: 299, baseType: !14, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !208, file: !31, line: 300, baseType: !14, size: 64, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !199, file: !31, line: 318, baseType: !175, size: 88, offset: 392)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !51, file: !31, line: 630, baseType: !217, size: 464)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_address64", file: !31, line: 321, size: 464, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !217, file: !31, line: 322, baseType: !19, size: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !217, file: !31, line: 322, baseType: !19, size: 8, offset: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !217, file: !31, line: 322, baseType: !19, size: 8, offset: 16)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !217, file: !31, line: 322, baseType: !19, size: 8, offset: 24)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !217, file: !31, line: 322, baseType: !19, size: 8, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !217, file: !31, line: 322, baseType: !149, size: 32, offset: 40)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !217, file: !31, line: 322, baseType: !19, size: 8, offset: 72)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !217, file: !31, line: 323, baseType: !208, size: 320, offset: 80)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !217, file: !31, line: 324, baseType: !14, size: 64, offset: 400)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !51, file: !31, line: 631, baseType: !229, size: 168)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_irq", file: !31, line: 327, size: 168, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !229, file: !31, line: 328, baseType: !19, size: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !229, file: !31, line: 329, baseType: !19, size: 8, offset: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !229, file: !31, line: 330, baseType: !19, size: 8, offset: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !229, file: !31, line: 331, baseType: !19, size: 8, offset: 24)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !229, file: !31, line: 332, baseType: !19, size: 8, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !229, file: !31, line: 333, baseType: !19, size: 8, offset: 40)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !229, file: !31, line: 334, baseType: !175, size: 88, offset: 48)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !229, file: !31, line: 335, baseType: !239, size: 32, offset: 136)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !51, file: !31, line: 632, baseType: !241, size: 96)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_generic_register", file: !31, line: 338, size: 96, elements: !242)
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !241, file: !31, line: 339, baseType: !19, size: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !241, file: !31, line: 340, baseType: !19, size: 8, offset: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !241, file: !31, line: 341, baseType: !19, size: 8, offset: 16)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !241, file: !31, line: 342, baseType: !19, size: 8, offset: 24)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !241, file: !31, line: 343, baseType: !14, size: 64, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !51, file: !31, line: 633, baseType: !249, size: 352)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_gpio", file: !31, line: 346, size: 352, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !249, file: !31, line: 347, baseType: !19, size: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !249, file: !31, line: 348, baseType: !19, size: 8, offset: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !249, file: !31, line: 349, baseType: !19, size: 8, offset: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !249, file: !31, line: 350, baseType: !19, size: 8, offset: 24)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !249, file: !31, line: 351, baseType: !19, size: 8, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !249, file: !31, line: 352, baseType: !19, size: 8, offset: 40)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "io_restriction", scope: !249, file: !31, line: 353, baseType: !19, size: 8, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !249, file: !31, line: 354, baseType: !19, size: 8, offset: 56)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !249, file: !31, line: 355, baseType: !19, size: 8, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !249, file: !31, line: 356, baseType: !22, size: 16, offset: 72)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !249, file: !31, line: 357, baseType: !22, size: 16, offset: 88)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !249, file: !31, line: 358, baseType: !22, size: 16, offset: 104)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !249, file: !31, line: 359, baseType: !22, size: 16, offset: 120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !249, file: !31, line: 360, baseType: !175, size: 88, offset: 136)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !249, file: !31, line: 361, baseType: !25, size: 64, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !249, file: !31, line: 362, baseType: !18, size: 64, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !51, file: !31, line: 634, baseType: !268, size: 288)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_i2c_serialbus", file: !31, line: 412, size: 288, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !268, file: !31, line: 413, baseType: !19, size: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !31, line: 413, baseType: !19, size: 8, offset: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !268, file: !31, line: 413, baseType: !19, size: 8, offset: 16)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !268, file: !31, line: 413, baseType: !19, size: 8, offset: 24)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !268, file: !31, line: 413, baseType: !19, size: 8, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !268, file: !31, line: 413, baseType: !19, size: 8, offset: 40)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !268, file: !31, line: 413, baseType: !22, size: 16, offset: 48)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !268, file: !31, line: 413, baseType: !22, size: 16, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !268, file: !31, line: 413, baseType: !175, size: 88, offset: 80)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !268, file: !31, line: 413, baseType: !18, size: 64, offset: 168)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "access_mode", scope: !268, file: !31, line: 413, baseType: !19, size: 8, offset: 232)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !268, file: !31, line: 414, baseType: !22, size: 16, offset: 240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !268, file: !31, line: 415, baseType: !8, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !51, file: !31, line: 635, baseType: !284, size: 320)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_spi_serialbus", file: !31, line: 423, size: 320, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !284, file: !31, line: 424, baseType: !19, size: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !284, file: !31, line: 424, baseType: !19, size: 8, offset: 8)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !284, file: !31, line: 424, baseType: !19, size: 8, offset: 16)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !284, file: !31, line: 424, baseType: !19, size: 8, offset: 24)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !284, file: !31, line: 424, baseType: !19, size: 8, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !284, file: !31, line: 424, baseType: !19, size: 8, offset: 40)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !284, file: !31, line: 424, baseType: !22, size: 16, offset: 48)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !284, file: !31, line: 424, baseType: !22, size: 16, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !284, file: !31, line: 424, baseType: !175, size: 88, offset: 80)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !284, file: !31, line: 424, baseType: !18, size: 64, offset: 168)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "wire_mode", scope: !284, file: !31, line: 424, baseType: !19, size: 8, offset: 232)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "device_polarity", scope: !284, file: !31, line: 425, baseType: !19, size: 8, offset: 240)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !284, file: !31, line: 426, baseType: !19, size: 8, offset: 248)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !284, file: !31, line: 427, baseType: !19, size: 8, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !284, file: !31, line: 428, baseType: !19, size: 8, offset: 264)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !284, file: !31, line: 429, baseType: !22, size: 16, offset: 272)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !284, file: !31, line: 430, baseType: !8, size: 32, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !51, file: !31, line: 636, baseType: !304, size: 344)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_uart_serialbus", file: !31, line: 453, size: 344, elements: !305)
!305 = !{!306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !304, file: !31, line: 454, baseType: !19, size: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !31, line: 454, baseType: !19, size: 8, offset: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !304, file: !31, line: 454, baseType: !19, size: 8, offset: 16)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !304, file: !31, line: 454, baseType: !19, size: 8, offset: 24)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !304, file: !31, line: 454, baseType: !19, size: 8, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !304, file: !31, line: 454, baseType: !19, size: 8, offset: 40)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !304, file: !31, line: 454, baseType: !22, size: 16, offset: 48)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !304, file: !31, line: 454, baseType: !22, size: 16, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !304, file: !31, line: 454, baseType: !175, size: 88, offset: 80)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !304, file: !31, line: 454, baseType: !18, size: 64, offset: 168)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !304, file: !31, line: 454, baseType: !19, size: 8, offset: 232)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !304, file: !31, line: 455, baseType: !19, size: 8, offset: 240)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !304, file: !31, line: 456, baseType: !19, size: 8, offset: 248)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !304, file: !31, line: 457, baseType: !19, size: 8, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !304, file: !31, line: 458, baseType: !19, size: 8, offset: 264)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !304, file: !31, line: 459, baseType: !19, size: 8, offset: 272)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !304, file: !31, line: 460, baseType: !22, size: 16, offset: 280)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !304, file: !31, line: 461, baseType: !22, size: 16, offset: 296)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !304, file: !31, line: 462, baseType: !8, size: 32, offset: 312)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !51, file: !31, line: 637, baseType: !326, size: 232)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_common_serialbus", file: !31, line: 398, size: 232, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !326, file: !31, line: 399, baseType: !19, size: 8)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !31, line: 399, baseType: !19, size: 8, offset: 8)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !326, file: !31, line: 399, baseType: !19, size: 8, offset: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !326, file: !31, line: 399, baseType: !19, size: 8, offset: 24)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !326, file: !31, line: 399, baseType: !19, size: 8, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !326, file: !31, line: 399, baseType: !19, size: 8, offset: 40)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !326, file: !31, line: 399, baseType: !22, size: 16, offset: 48)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !326, file: !31, line: 399, baseType: !22, size: 16, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !326, file: !31, line: 399, baseType: !175, size: 88, offset: 80)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !326, file: !31, line: 399, baseType: !18, size: 64, offset: 168)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pin_function", scope: !51, file: !31, line: 638, baseType: !339, size: 288)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_function", file: !31, line: 508, size: 288, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !339, file: !31, line: 509, baseType: !19, size: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !339, file: !31, line: 510, baseType: !19, size: 8, offset: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !339, file: !31, line: 511, baseType: !19, size: 8, offset: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !339, file: !31, line: 512, baseType: !22, size: 16, offset: 24)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !339, file: !31, line: 513, baseType: !22, size: 16, offset: 40)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !339, file: !31, line: 514, baseType: !22, size: 16, offset: 56)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !339, file: !31, line: 515, baseType: !175, size: 88, offset: 72)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !339, file: !31, line: 516, baseType: !25, size: 64, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !339, file: !31, line: 517, baseType: !18, size: 64, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !51, file: !31, line: 639, baseType: !351, size: 312)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_config", file: !31, line: 520, size: 312, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !351, file: !31, line: 521, baseType: !19, size: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !351, file: !31, line: 522, baseType: !19, size: 8, offset: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !351, file: !31, line: 523, baseType: !19, size: 8, offset: 16)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !351, file: !31, line: 524, baseType: !19, size: 8, offset: 24)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !351, file: !31, line: 525, baseType: !8, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !351, file: !31, line: 526, baseType: !22, size: 16, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !351, file: !31, line: 527, baseType: !22, size: 16, offset: 80)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !351, file: !31, line: 528, baseType: !175, size: 88, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !351, file: !31, line: 529, baseType: !25, size: 64, offset: 184)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !351, file: !31, line: 530, baseType: !18, size: 64, offset: 248)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group", scope: !51, file: !31, line: 640, baseType: !364, size: 256)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group", file: !31, line: 550, size: 256, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !376}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !364, file: !31, line: 551, baseType: !19, size: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !364, file: !31, line: 552, baseType: !19, size: 8, offset: 8)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !364, file: !31, line: 553, baseType: !22, size: 16, offset: 16)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !364, file: !31, line: 554, baseType: !22, size: 16, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !364, file: !31, line: 555, baseType: !25, size: 64, offset: 48)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "resource_label", scope: !364, file: !31, line: 556, baseType: !372, size: 80, offset: 112)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_label", file: !31, line: 258, size: 80, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !372, file: !31, line: 259, baseType: !22, size: 16)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !372, file: !31, line: 260, baseType: !26, size: 64, offset: 16)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !364, file: !31, line: 557, baseType: !18, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_function", scope: !51, file: !31, line: 641, baseType: !378, size: 288)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_function", file: !31, line: 560, size: 288, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !378, file: !31, line: 561, baseType: !19, size: 8)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !378, file: !31, line: 562, baseType: !19, size: 8, offset: 8)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !378, file: !31, line: 563, baseType: !19, size: 8, offset: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !378, file: !31, line: 564, baseType: !22, size: 16, offset: 24)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !378, file: !31, line: 565, baseType: !22, size: 16, offset: 40)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !378, file: !31, line: 566, baseType: !175, size: 88, offset: 56)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !378, file: !31, line: 567, baseType: !372, size: 80, offset: 144)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !378, file: !31, line: 568, baseType: !18, size: 64, offset: 224)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_config", scope: !51, file: !31, line: 642, baseType: !389, size: 312)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_config", file: !31, line: 571, size: 312, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !389, file: !31, line: 572, baseType: !19, size: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !389, file: !31, line: 573, baseType: !19, size: 8, offset: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !389, file: !31, line: 574, baseType: !19, size: 8, offset: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !389, file: !31, line: 575, baseType: !19, size: 8, offset: 24)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !389, file: !31, line: 576, baseType: !8, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !389, file: !31, line: 577, baseType: !22, size: 16, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !389, file: !31, line: 578, baseType: !175, size: 88, offset: 80)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !389, file: !31, line: 579, baseType: !372, size: 80, offset: 168)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !389, file: !31, line: 580, baseType: !18, size: 64, offset: 248)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !51, file: !31, line: 646, baseType: !401, size: 72)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address", file: !31, line: 303, size: 72, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !401, file: !31, line: 304, baseType: !19, size: 8)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !401, file: !31, line: 304, baseType: !19, size: 8, offset: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !401, file: !31, line: 304, baseType: !19, size: 8, offset: 16)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !401, file: !31, line: 304, baseType: !19, size: 8, offset: 24)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !401, file: !31, line: 304, baseType: !19, size: 8, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !401, file: !31, line: 304, baseType: !149, size: 32, offset: 40)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "aml_resource", file: !411, line: 478, size: 448, elements: !412)
!411 = !DIFile(filename: "drivers/acpi/acpica/amlresrc.h", directory: "/home/lizy2001/genbc/linux")
!412 = !{!413, !414, !418, !423, !429, !435, !440, !444, !453, !459, !466, !470, !475, !485, !495, !500, !510, !518, !531, !544, !557, !573, !581, !598, !612, !629, !646, !658, !672, !686, !697, !710, !724, !732, !733, !734}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !410, file: !411, line: 481, baseType: !19, size: 8)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "small_header", scope: !410, file: !411, line: 482, baseType: !415, size: 8)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_small_header", file: !411, line: 114, size: 8, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !415, file: !411, line: 115, baseType: !19, size: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "large_header", scope: !410, file: !411, line: 483, baseType: !419, size: 24)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_large_header", file: !411, line: 174, size: 24, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !419, file: !411, line: 175, baseType: !19, size: 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !419, file: !411, line: 175, baseType: !22, size: 16, offset: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !410, file: !411, line: 487, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_irq", file: !411, line: 117, size: 32, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !424, file: !411, line: 118, baseType: !19, size: 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "irq_mask", scope: !424, file: !411, line: 118, baseType: !22, size: 16, offset: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !424, file: !411, line: 119, baseType: !19, size: 8, offset: 24)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !410, file: !411, line: 488, baseType: !430, size: 24)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_dma", file: !411, line: 126, size: 24, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !430, file: !411, line: 127, baseType: !19, size: 8)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dma_channel_mask", scope: !430, file: !411, line: 127, baseType: !19, size: 8, offset: 8)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !430, file: !411, line: 128, baseType: !19, size: 8, offset: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !410, file: !411, line: 489, baseType: !436, size: 16)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_start_dependent", file: !411, line: 131, size: 16, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !436, file: !411, line: 132, baseType: !19, size: 8)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !436, file: !411, line: 132, baseType: !19, size: 8, offset: 8)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "end_dpf", scope: !410, file: !411, line: 490, baseType: !441, size: 8)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_end_dependent", file: !411, line: 138, size: 8, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !441, file: !411, line: 139, baseType: !19, size: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !410, file: !411, line: 491, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_io", file: !411, line: 141, size: 64, elements: !446)
!446 = !{!447, !448, !449, !450, !451, !452}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !445, file: !411, line: 142, baseType: !19, size: 8)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !445, file: !411, line: 142, baseType: !19, size: 8, offset: 8)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !445, file: !411, line: 143, baseType: !22, size: 16, offset: 16)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !445, file: !411, line: 144, baseType: !22, size: 16, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !445, file: !411, line: 145, baseType: !19, size: 8, offset: 48)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !445, file: !411, line: 146, baseType: !19, size: 8, offset: 56)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !410, file: !411, line: 492, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_io", file: !411, line: 149, size: 32, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !454, file: !411, line: 150, baseType: !19, size: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !454, file: !411, line: 150, baseType: !22, size: 16, offset: 8)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !454, file: !411, line: 151, baseType: !19, size: 8, offset: 24)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !410, file: !411, line: 493, baseType: !460, size: 48)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_dma", file: !411, line: 161, size: 48, elements: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !460, file: !411, line: 162, baseType: !19, size: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !460, file: !411, line: 162, baseType: !22, size: 16, offset: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !460, file: !411, line: 163, baseType: !22, size: 16, offset: 24)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !460, file: !411, line: 164, baseType: !19, size: 8, offset: 40)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_small", scope: !410, file: !411, line: 494, baseType: !467, size: 8)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_vendor_small", file: !411, line: 154, size: 8, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !467, file: !411, line: 155, baseType: !19, size: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !410, file: !411, line: 495, baseType: !471, size: 16)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_end_tag", file: !411, line: 157, size: 16, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !471, file: !411, line: 158, baseType: !19, size: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !471, file: !411, line: 158, baseType: !19, size: 8, offset: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !410, file: !411, line: 499, baseType: !476, size: 96)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_memory24", file: !411, line: 183, size: 96, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !476, file: !411, line: 184, baseType: !19, size: 8)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !476, file: !411, line: 184, baseType: !22, size: 16, offset: 8)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !476, file: !411, line: 184, baseType: !19, size: 8, offset: 24)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !476, file: !411, line: 185, baseType: !22, size: 16, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !476, file: !411, line: 186, baseType: !22, size: 16, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !476, file: !411, line: 187, baseType: !22, size: 16, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !476, file: !411, line: 188, baseType: !22, size: 16, offset: 80)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !410, file: !411, line: 500, baseType: !486, size: 120)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_generic_register", file: !411, line: 264, size: 120, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !486, file: !411, line: 265, baseType: !19, size: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !486, file: !411, line: 265, baseType: !22, size: 16, offset: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "address_space_id", scope: !486, file: !411, line: 265, baseType: !19, size: 8, offset: 24)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !486, file: !411, line: 266, baseType: !19, size: 8, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !486, file: !411, line: 267, baseType: !19, size: 8, offset: 40)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !486, file: !411, line: 268, baseType: !19, size: 8, offset: 48)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !486, file: !411, line: 269, baseType: !14, size: 64, offset: 56)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_large", scope: !410, file: !411, line: 501, baseType: !496, size: 24)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_vendor_large", file: !411, line: 191, size: 24, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !496, file: !411, line: 192, baseType: !19, size: 8)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !496, file: !411, line: 192, baseType: !22, size: 16, offset: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !410, file: !411, line: 502, baseType: !501, size: 160)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_memory32", file: !411, line: 194, size: 160, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !501, file: !411, line: 195, baseType: !19, size: 8)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !501, file: !411, line: 195, baseType: !22, size: 16, offset: 8)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !501, file: !411, line: 195, baseType: !19, size: 8, offset: 24)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !501, file: !411, line: 196, baseType: !8, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !501, file: !411, line: 197, baseType: !8, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !501, file: !411, line: 198, baseType: !8, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !501, file: !411, line: 199, baseType: !8, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !410, file: !411, line: 503, baseType: !511, size: 96)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_memory32", file: !411, line: 202, size: 96, elements: !512)
!512 = !{!513, !514, !515, !516, !517}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !511, file: !411, line: 203, baseType: !19, size: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !511, file: !411, line: 203, baseType: !22, size: 16, offset: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !511, file: !411, line: 203, baseType: !19, size: 8, offset: 24)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !511, file: !411, line: 204, baseType: !8, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !511, file: !411, line: 205, baseType: !8, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !410, file: !411, line: 504, baseType: !519, size: 128)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address16", file: !411, line: 248, size: 128, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !519, file: !411, line: 249, baseType: !19, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !519, file: !411, line: 249, baseType: !22, size: 16, offset: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !519, file: !411, line: 250, baseType: !19, size: 8, offset: 24)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !519, file: !411, line: 250, baseType: !19, size: 8, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !519, file: !411, line: 250, baseType: !19, size: 8, offset: 40)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !519, file: !411, line: 250, baseType: !22, size: 16, offset: 48)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !519, file: !411, line: 251, baseType: !22, size: 16, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !519, file: !411, line: 252, baseType: !22, size: 16, offset: 80)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !519, file: !411, line: 253, baseType: !22, size: 16, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !519, file: !411, line: 254, baseType: !22, size: 16, offset: 112)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !410, file: !411, line: 505, baseType: !532, size: 208)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address32", file: !411, line: 239, size: 208, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !532, file: !411, line: 240, baseType: !19, size: 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !532, file: !411, line: 240, baseType: !22, size: 16, offset: 8)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !532, file: !411, line: 241, baseType: !19, size: 8, offset: 24)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !532, file: !411, line: 241, baseType: !19, size: 8, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !532, file: !411, line: 241, baseType: !19, size: 8, offset: 40)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !532, file: !411, line: 241, baseType: !8, size: 32, offset: 48)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !532, file: !411, line: 242, baseType: !8, size: 32, offset: 80)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !532, file: !411, line: 243, baseType: !8, size: 32, offset: 112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !532, file: !411, line: 244, baseType: !8, size: 32, offset: 144)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !532, file: !411, line: 245, baseType: !8, size: 32, offset: 176)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !410, file: !411, line: 506, baseType: !545, size: 368)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address64", file: !411, line: 230, size: 368, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !545, file: !411, line: 231, baseType: !19, size: 8)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !545, file: !411, line: 231, baseType: !22, size: 16, offset: 8)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !545, file: !411, line: 232, baseType: !19, size: 8, offset: 24)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !411, line: 232, baseType: !19, size: 8, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !545, file: !411, line: 232, baseType: !19, size: 8, offset: 40)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !545, file: !411, line: 232, baseType: !14, size: 64, offset: 48)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !545, file: !411, line: 233, baseType: !14, size: 64, offset: 112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !545, file: !411, line: 234, baseType: !14, size: 64, offset: 176)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !545, file: !411, line: 235, baseType: !14, size: 64, offset: 240)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !545, file: !411, line: 236, baseType: !14, size: 64, offset: 304)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !410, file: !411, line: 507, baseType: !558, size: 448)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_extended_address64", file: !411, line: 216, size: 448, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !558, file: !411, line: 217, baseType: !19, size: 8)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !558, file: !411, line: 217, baseType: !22, size: 16, offset: 8)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !558, file: !411, line: 218, baseType: !19, size: 8, offset: 24)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !558, file: !411, line: 218, baseType: !19, size: 8, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !558, file: !411, line: 218, baseType: !19, size: 8, offset: 40)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !558, file: !411, line: 218, baseType: !19, size: 8, offset: 48)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !558, file: !411, line: 219, baseType: !19, size: 8, offset: 56)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !558, file: !411, line: 220, baseType: !14, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !558, file: !411, line: 221, baseType: !14, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !558, file: !411, line: 222, baseType: !14, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !558, file: !411, line: 223, baseType: !14, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !558, file: !411, line: 224, baseType: !14, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !558, file: !411, line: 225, baseType: !14, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !410, file: !411, line: 508, baseType: !574, size: 72)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_extended_irq", file: !411, line: 257, size: 72, elements: !575)
!575 = !{!576, !577, !578, !579, !580}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !574, file: !411, line: 258, baseType: !19, size: 8)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !574, file: !411, line: 258, baseType: !22, size: 16, offset: 8)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !574, file: !411, line: 258, baseType: !19, size: 8, offset: 24)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !574, file: !411, line: 259, baseType: !19, size: 8, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !574, file: !411, line: 260, baseType: !239, size: 32, offset: 40)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !410, file: !411, line: 509, baseType: !582, size: 184)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_gpio", file: !411, line: 274, size: 184, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !582, file: !411, line: 275, baseType: !19, size: 8)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !582, file: !411, line: 275, baseType: !22, size: 16, offset: 8)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !582, file: !411, line: 275, baseType: !19, size: 8, offset: 24)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !582, file: !411, line: 276, baseType: !19, size: 8, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !582, file: !411, line: 277, baseType: !22, size: 16, offset: 40)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "int_flags", scope: !582, file: !411, line: 278, baseType: !22, size: 16, offset: 56)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !582, file: !411, line: 279, baseType: !19, size: 8, offset: 72)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !582, file: !411, line: 280, baseType: !22, size: 16, offset: 80)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !582, file: !411, line: 281, baseType: !22, size: 16, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !582, file: !411, line: 282, baseType: !22, size: 16, offset: 112)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !582, file: !411, line: 283, baseType: !19, size: 8, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !582, file: !411, line: 284, baseType: !22, size: 16, offset: 136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !582, file: !411, line: 285, baseType: !22, size: 16, offset: 152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !582, file: !411, line: 286, baseType: !22, size: 16, offset: 168)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !410, file: !411, line: 510, baseType: !599, size: 144)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_i2c_serialbus", file: !411, line: 325, size: 144, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !599, file: !411, line: 326, baseType: !19, size: 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !599, file: !411, line: 326, baseType: !22, size: 16, offset: 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !599, file: !411, line: 327, baseType: !19, size: 8, offset: 24)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !599, file: !411, line: 327, baseType: !19, size: 8, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !411, line: 327, baseType: !19, size: 8, offset: 40)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !411, line: 327, baseType: !19, size: 8, offset: 48)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !599, file: !411, line: 327, baseType: !22, size: 16, offset: 56)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !599, file: !411, line: 327, baseType: !19, size: 8, offset: 72)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !599, file: !411, line: 327, baseType: !22, size: 16, offset: 80)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !599, file: !411, line: 327, baseType: !8, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !599, file: !411, line: 328, baseType: !22, size: 16, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !410, file: !411, line: 511, baseType: !613, size: 168)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_spi_serialbus", file: !411, line: 340, size: 168, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !613, file: !411, line: 341, baseType: !19, size: 8)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !613, file: !411, line: 341, baseType: !22, size: 16, offset: 8)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !613, file: !411, line: 342, baseType: !19, size: 8, offset: 24)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !613, file: !411, line: 342, baseType: !19, size: 8, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !613, file: !411, line: 342, baseType: !19, size: 8, offset: 40)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !613, file: !411, line: 342, baseType: !19, size: 8, offset: 48)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !613, file: !411, line: 342, baseType: !22, size: 16, offset: 56)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !613, file: !411, line: 342, baseType: !19, size: 8, offset: 72)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !613, file: !411, line: 342, baseType: !22, size: 16, offset: 80)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !613, file: !411, line: 342, baseType: !8, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !613, file: !411, line: 343, baseType: !19, size: 8, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !613, file: !411, line: 344, baseType: !19, size: 8, offset: 136)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !613, file: !411, line: 345, baseType: !19, size: 8, offset: 144)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !613, file: !411, line: 346, baseType: !22, size: 16, offset: 152)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !410, file: !411, line: 512, baseType: !630, size: 176)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_uart_serialbus", file: !411, line: 358, size: 176, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !630, file: !411, line: 359, baseType: !19, size: 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !630, file: !411, line: 359, baseType: !22, size: 16, offset: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !630, file: !411, line: 360, baseType: !19, size: 8, offset: 24)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !630, file: !411, line: 360, baseType: !19, size: 8, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !411, line: 360, baseType: !19, size: 8, offset: 40)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !411, line: 360, baseType: !19, size: 8, offset: 48)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !630, file: !411, line: 360, baseType: !22, size: 16, offset: 56)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !630, file: !411, line: 360, baseType: !19, size: 8, offset: 72)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !630, file: !411, line: 360, baseType: !22, size: 16, offset: 80)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !630, file: !411, line: 360, baseType: !8, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !630, file: !411, line: 361, baseType: !22, size: 16, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !630, file: !411, line: 362, baseType: !22, size: 16, offset: 144)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !630, file: !411, line: 363, baseType: !19, size: 8, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !630, file: !411, line: 364, baseType: !19, size: 8, offset: 168)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !410, file: !411, line: 513, baseType: !647, size: 96)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_common_serialbus", file: !411, line: 322, size: 96, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !657}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !647, file: !411, line: 323, baseType: !19, size: 8)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !647, file: !411, line: 323, baseType: !22, size: 16, offset: 8)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !647, file: !411, line: 323, baseType: !19, size: 8, offset: 24)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !647, file: !411, line: 323, baseType: !19, size: 8, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !647, file: !411, line: 323, baseType: !19, size: 8, offset: 40)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !647, file: !411, line: 323, baseType: !19, size: 8, offset: 48)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !647, file: !411, line: 323, baseType: !22, size: 16, offset: 56)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !647, file: !411, line: 323, baseType: !19, size: 8, offset: 72)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !647, file: !411, line: 323, baseType: !22, size: 16, offset: 80)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pin_function", scope: !410, file: !411, line: 514, baseType: !659, size: 144)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_function", file: !411, line: 376, size: 144, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !659, file: !411, line: 377, baseType: !19, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !659, file: !411, line: 377, baseType: !22, size: 16, offset: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !659, file: !411, line: 377, baseType: !19, size: 8, offset: 24)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !659, file: !411, line: 378, baseType: !22, size: 16, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !659, file: !411, line: 379, baseType: !19, size: 8, offset: 48)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !659, file: !411, line: 380, baseType: !22, size: 16, offset: 56)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !659, file: !411, line: 381, baseType: !22, size: 16, offset: 72)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !659, file: !411, line: 382, baseType: !19, size: 8, offset: 88)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !659, file: !411, line: 383, baseType: !22, size: 16, offset: 96)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !659, file: !411, line: 384, baseType: !22, size: 16, offset: 112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !659, file: !411, line: 385, baseType: !22, size: 16, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !410, file: !411, line: 515, baseType: !673, size: 160)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_config", file: !411, line: 396, size: 160, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !673, file: !411, line: 397, baseType: !19, size: 8)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !673, file: !411, line: 397, baseType: !22, size: 16, offset: 8)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !673, file: !411, line: 397, baseType: !19, size: 8, offset: 24)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !673, file: !411, line: 398, baseType: !22, size: 16, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !673, file: !411, line: 399, baseType: !19, size: 8, offset: 48)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !673, file: !411, line: 400, baseType: !8, size: 32, offset: 56)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !673, file: !411, line: 401, baseType: !22, size: 16, offset: 88)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !673, file: !411, line: 402, baseType: !19, size: 8, offset: 104)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !673, file: !411, line: 403, baseType: !22, size: 16, offset: 112)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !673, file: !411, line: 404, baseType: !22, size: 16, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !673, file: !411, line: 405, baseType: !22, size: 16, offset: 144)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group", scope: !410, file: !411, line: 516, baseType: !687, size: 112)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_group", file: !411, line: 416, size: 112, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !687, file: !411, line: 417, baseType: !19, size: 8)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !687, file: !411, line: 417, baseType: !22, size: 16, offset: 8)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !687, file: !411, line: 417, baseType: !19, size: 8, offset: 24)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !687, file: !411, line: 418, baseType: !22, size: 16, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !687, file: !411, line: 419, baseType: !22, size: 16, offset: 48)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "label_offset", scope: !687, file: !411, line: 420, baseType: !22, size: 16, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !687, file: !411, line: 421, baseType: !22, size: 16, offset: 80)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !687, file: !411, line: 422, baseType: !22, size: 16, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_function", scope: !410, file: !411, line: 517, baseType: !698, size: 136)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_group_function", file: !411, line: 433, size: 136, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !698, file: !411, line: 434, baseType: !19, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !698, file: !411, line: 434, baseType: !22, size: 16, offset: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !698, file: !411, line: 434, baseType: !19, size: 8, offset: 24)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !698, file: !411, line: 435, baseType: !22, size: 16, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !698, file: !411, line: 436, baseType: !22, size: 16, offset: 48)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !698, file: !411, line: 437, baseType: !19, size: 8, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !698, file: !411, line: 438, baseType: !22, size: 16, offset: 72)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_label_offset", scope: !698, file: !411, line: 439, baseType: !22, size: 16, offset: 88)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !698, file: !411, line: 440, baseType: !22, size: 16, offset: 104)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !698, file: !411, line: 441, baseType: !22, size: 16, offset: 120)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_config", scope: !410, file: !411, line: 518, baseType: !711, size: 160)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_group_config", file: !411, line: 452, size: 160, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !711, file: !411, line: 453, baseType: !19, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !711, file: !411, line: 453, baseType: !22, size: 16, offset: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !711, file: !411, line: 453, baseType: !19, size: 8, offset: 24)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !711, file: !411, line: 454, baseType: !22, size: 16, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !711, file: !411, line: 455, baseType: !19, size: 8, offset: 48)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !711, file: !411, line: 456, baseType: !8, size: 32, offset: 56)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !711, file: !411, line: 457, baseType: !19, size: 8, offset: 88)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !711, file: !411, line: 458, baseType: !22, size: 16, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_label_offset", scope: !711, file: !411, line: 459, baseType: !22, size: 16, offset: 112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !711, file: !411, line: 460, baseType: !22, size: 16, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !711, file: !411, line: 461, baseType: !22, size: 16, offset: 144)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !410, file: !411, line: 522, baseType: !725, size: 48)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address", file: !411, line: 213, size: 48, elements: !726)
!726 = !{!727, !728, !729, !730, !731}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !725, file: !411, line: 214, baseType: !19, size: 8)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !725, file: !411, line: 214, baseType: !22, size: 16, offset: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !725, file: !411, line: 214, baseType: !19, size: 8, offset: 24)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !411, line: 214, baseType: !19, size: 8, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !725, file: !411, line: 214, baseType: !19, size: 8, offset: 40)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dword_item", scope: !410, file: !411, line: 523, baseType: !8, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "word_item", scope: !410, file: !411, line: 524, baseType: !22, size: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "byte_item", scope: !410, file: !411, line: 525, baseType: !19, size: 8)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_rsconvert_info", file: !737, line: 32, size: 32, elements: !738)
!737 = !DIFile(filename: "drivers/acpi/acpica/acresrc.h", directory: "/home/lizy2001/genbc/linux")
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !736, file: !737, line: 33, baseType: !19, size: 8)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "resource_offset", scope: !736, file: !737, line: 34, baseType: !19, size: 8, offset: 8)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "aml_offset", scope: !736, file: !737, line: 35, baseType: !19, size: 8, offset: 16)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !736, file: !737, line: 36, baseType: !19, size: 8, offset: 24)
!743 = !DILocalVariable(name: "resource", arg: 1, scope: !42, file: !3, line: 35, type: !45)
!744 = !DILocation(line: 35, column: 55, scope: !42)
!745 = !DILocalVariable(name: "aml", arg: 2, scope: !42, file: !3, line: 36, type: !409)
!746 = !DILocation(line: 36, column: 25, scope: !42)
!747 = !DILocalVariable(name: "info", arg: 3, scope: !42, file: !3, line: 37, type: !735)
!748 = !DILocation(line: 37, column: 33, scope: !42)
!749 = !DILocalVariable(name: "aml_resource_length", scope: !42, file: !3, line: 39, type: !30)
!750 = !DILocation(line: 39, column: 17, scope: !42)
!751 = !DILocalVariable(name: "source", scope: !42, file: !3, line: 40, type: !17)
!752 = !DILocation(line: 40, column: 8, scope: !42)
!753 = !DILocalVariable(name: "destination", scope: !42, file: !3, line: 41, type: !17)
!754 = !DILocation(line: 41, column: 8, scope: !42)
!755 = !DILocalVariable(name: "target", scope: !42, file: !3, line: 42, type: !26)
!756 = !DILocation(line: 42, column: 8, scope: !42)
!757 = !DILocalVariable(name: "count", scope: !42, file: !3, line: 43, type: !19)
!758 = !DILocation(line: 43, column: 5, scope: !42)
!759 = !DILocalVariable(name: "flags_mode", scope: !42, file: !3, line: 44, type: !19)
!760 = !DILocation(line: 44, column: 5, scope: !42)
!761 = !DILocalVariable(name: "item_count", scope: !42, file: !3, line: 45, type: !22)
!762 = !DILocation(line: 45, column: 6, scope: !42)
!763 = !DILocalVariable(name: "temp16", scope: !42, file: !3, line: 46, type: !22)
!764 = !DILocation(line: 46, column: 6, scope: !42)
!765 = !DILocation(line: 50, column: 7, scope: !766)
!766 = distinct !DILexicalBlock(scope: !42, file: !3, line: 50, column: 6)
!767 = !DILocation(line: 50, column: 6, scope: !42)
!768 = !DILocation(line: 51, column: 3, scope: !769)
!769 = distinct !DILexicalBlock(scope: !766, file: !3, line: 50, column: 13)
!770 = !DILocation(line: 54, column: 18, scope: !771)
!771 = distinct !DILexicalBlock(scope: !42, file: !3, line: 54, column: 6)
!772 = !DILocation(line: 54, column: 7, scope: !771)
!773 = !DILocation(line: 54, column: 28, scope: !771)
!774 = !DILocation(line: 54, column: 6, scope: !42)
!775 = !DILocation(line: 58, column: 3, scope: !776)
!776 = distinct !DILexicalBlock(scope: !771, file: !3, line: 54, column: 35)
!777 = !DILocation(line: 61, column: 2, scope: !776)
!778 = !DILocation(line: 65, column: 52, scope: !42)
!779 = !DILocation(line: 65, column: 24, scope: !42)
!780 = !DILocation(line: 65, column: 22, scope: !42)
!781 = !DILocation(line: 71, column: 10, scope: !42)
!782 = !DILocation(line: 71, column: 8, scope: !42)
!783 = !DILocation(line: 72, column: 2, scope: !42)
!784 = !DILocation(line: 72, column: 9, scope: !42)
!785 = !DILocation(line: 77, column: 12, scope: !786)
!786 = distinct !DILexicalBlock(scope: !42, file: !3, line: 72, column: 16)
!787 = !DILocation(line: 77, column: 10, scope: !786)
!788 = !DILocation(line: 79, column: 7, scope: !786)
!789 = !DILocation(line: 78, column: 15, scope: !786)
!790 = !DILocation(line: 81, column: 11, scope: !786)
!791 = !DILocation(line: 81, column: 17, scope: !786)
!792 = !DILocation(line: 81, column: 3, scope: !786)
!793 = !DILocation(line: 86, column: 11, scope: !794)
!794 = distinct !DILexicalBlock(scope: !786, file: !3, line: 81, column: 25)
!795 = !DILocation(line: 86, column: 4, scope: !794)
!796 = !DILocation(line: 86, column: 24, scope: !794)
!797 = !DILocation(line: 87, column: 21, scope: !794)
!798 = !DILocation(line: 87, column: 4, scope: !794)
!799 = !DILocation(line: 87, column: 14, scope: !794)
!800 = !DILocation(line: 87, column: 19, scope: !794)
!801 = !DILocation(line: 88, column: 23, scope: !794)
!802 = !DILocation(line: 88, column: 4, scope: !794)
!803 = !DILocation(line: 88, column: 14, scope: !794)
!804 = !DILocation(line: 88, column: 21, scope: !794)
!805 = !DILocation(line: 89, column: 4, scope: !794)
