; ModuleID = '../bcout/drivers/acpi/acpica/rsxface.llvm.bc'
source_filename = "drivers/acpi/acpica/rsxface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_buffer = type { i64, i8* }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/acpi/acpica/rsxface.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{}
!3 = !{!4, !11, !60, !61, !79, !249, !392, !393}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !5, line: 421, baseType: !6)
!5 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !7, line: 21, baseType: !8)
!7 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address16", file: !13, line: 306, size: 240, elements: !14)
!13 = !DIFile(filename: "./include/acpi/acrestyp.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !19, !20, !21, !22, !23, !41, !52}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !12, file: !13, line: 307, baseType: !16, size: 8)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !7, line: 17, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !9, line: 21, baseType: !18)
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !12, file: !13, line: 307, baseType: !16, size: 8, offset: 8)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !12, file: !13, line: 307, baseType: !16, size: 8, offset: 16)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !12, file: !13, line: 307, baseType: !16, size: 8, offset: 24)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !12, file: !13, line: 307, baseType: !16, size: 8, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !12, file: !13, line: 307, baseType: !24, size: 32, offset: 40)
!24 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_attribute", file: !13, line: 249, size: 32, elements: !25)
!25 = !{!26, !33, !40}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !24, file: !13, line: 250, baseType: !27, size: 32)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_memory_attribute", file: !13, line: 235, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !27, file: !13, line: 236, baseType: !16, size: 8)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "caching", scope: !27, file: !13, line: 237, baseType: !16, size: 8, offset: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !27, file: !13, line: 238, baseType: !16, size: 8, offset: 16)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !27, file: !13, line: 239, baseType: !16, size: 8, offset: 24)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !24, file: !13, line: 251, baseType: !34, size: 32)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_io_attribute", file: !13, line: 242, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "range_type", scope: !34, file: !13, line: 243, baseType: !16, size: 8)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "translation", scope: !34, file: !13, line: 244, baseType: !16, size: 8, offset: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "translation_type", scope: !34, file: !13, line: 245, baseType: !16, size: 8, offset: 16)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !34, file: !13, line: 246, baseType: !16, size: 8, offset: 24)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !24, file: !13, line: 255, baseType: !16, size: 8)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !12, file: !13, line: 307, baseType: !42, size: 80, offset: 72)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address16_attribute", file: !13, line: 279, size: 80, elements: !43)
!43 = !{!44, !48, !49, !50, !51}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !42, file: !13, line: 280, baseType: !45, size: 16)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !7, line: 19, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !9, line: 24, baseType: !47)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !42, file: !13, line: 281, baseType: !45, size: 16, offset: 16)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !42, file: !13, line: 282, baseType: !45, size: 16, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !42, file: !13, line: 283, baseType: !45, size: 16, offset: 48)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !42, file: !13, line: 284, baseType: !45, size: 16, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !12, file: !13, line: 308, baseType: !53, size: 88, offset: 152)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_source", file: !13, line: 263, size: 88, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !53, file: !13, line: 264, baseType: !16, size: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !53, file: !13, line: 265, baseType: !45, size: 16, offset: 8)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !53, file: !13, line: 266, baseType: !58, size: 64, offset: 24)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address32", file: !13, line: 311, size: 320, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !78}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !62, file: !13, line: 312, baseType: !16, size: 8)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !62, file: !13, line: 312, baseType: !16, size: 8, offset: 8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !62, file: !13, line: 312, baseType: !16, size: 8, offset: 16)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !62, file: !13, line: 312, baseType: !16, size: 8, offset: 24)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !62, file: !13, line: 312, baseType: !16, size: 8, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !62, file: !13, line: 312, baseType: !24, size: 32, offset: 40)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !62, file: !13, line: 312, baseType: !71, size: 160, offset: 72)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address32_attribute", file: !13, line: 287, size: 160, elements: !72)
!72 = !{!73, !74, !75, !76, !77}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !71, file: !13, line: 288, baseType: !6, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !71, file: !13, line: 289, baseType: !6, size: 32, offset: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !71, file: !13, line: 290, baseType: !6, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !71, file: !13, line: 291, baseType: !6, size: 32, offset: 96)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !71, file: !13, line: 292, baseType: !6, size: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !62, file: !13, line: 313, baseType: !53, size: 88, offset: 232)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource", file: !13, line: 651, size: 544, elements: !81)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !13, line: 652, baseType: !6, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !80, file: !13, line: 653, baseType: !6, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !80, file: !13, line: 654, baseType: !85, size: 480, offset: 64)
!85 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_resource_data", file: !13, line: 614, size: 480, elements: !86)
!86 = !{!87, !100, !108, !114, !122, !127, !133, !138, !148, !152, !160, !168, !174, !175, !176, !197, !209, !221, !229, !250, !266, !286, !308, !321, !333, !346, !360, !371, !383}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !85, file: !13, line: 615, baseType: !88, size: 56)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_irq", file: !13, line: 138, size: 56, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !88, file: !13, line: 139, baseType: !16, size: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !88, file: !13, line: 140, baseType: !16, size: 8, offset: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !88, file: !13, line: 141, baseType: !16, size: 8, offset: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !88, file: !13, line: 142, baseType: !16, size: 8, offset: 24)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !88, file: !13, line: 143, baseType: !16, size: 8, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !88, file: !13, line: 144, baseType: !16, size: 8, offset: 40)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !88, file: !13, line: 145, baseType: !97, size: 8, offset: 48)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !85, file: !13, line: 616, baseType: !101, size: 40)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_dma", file: !13, line: 148, size: 40, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !101, file: !13, line: 149, baseType: !16, size: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bus_master", scope: !101, file: !13, line: 150, baseType: !16, size: 8, offset: 8)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !101, file: !13, line: 151, baseType: !16, size: 8, offset: 16)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "channel_count", scope: !101, file: !13, line: 152, baseType: !16, size: 8, offset: 24)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !101, file: !13, line: 153, baseType: !97, size: 8, offset: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !85, file: !13, line: 617, baseType: !109, size: 24)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_start_dependent", file: !13, line: 156, size: 24, elements: !110)
!110 = !{!111, !112, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_length", scope: !109, file: !13, line: 157, baseType: !16, size: 8)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility_priority", scope: !109, file: !13, line: 158, baseType: !16, size: 8, offset: 8)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "performance_robustness", scope: !109, file: !13, line: 159, baseType: !16, size: 8, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !85, file: !13, line: 618, baseType: !115, size: 56)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_io", file: !13, line: 167, size: 56, elements: !116)
!116 = !{!117, !118, !119, !120, !121}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "io_decode", scope: !115, file: !13, line: 168, baseType: !16, size: 8)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !115, file: !13, line: 169, baseType: !16, size: 8, offset: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !115, file: !13, line: 170, baseType: !16, size: 8, offset: 16)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !115, file: !13, line: 171, baseType: !45, size: 16, offset: 24)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !115, file: !13, line: 172, baseType: !45, size: 16, offset: 40)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !85, file: !13, line: 619, baseType: !123, size: 24)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_io", file: !13, line: 175, size: 24, elements: !124)
!124 = !{!125, !126}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !123, file: !13, line: 176, baseType: !45, size: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !123, file: !13, line: 177, baseType: !16, size: 8, offset: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !85, file: !13, line: 620, baseType: !128, size: 40)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_dma", file: !13, line: 180, size: 40, elements: !129)
!129 = !{!130, !131, !132}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !128, file: !13, line: 181, baseType: !45, size: 16)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !128, file: !13, line: 182, baseType: !45, size: 16, offset: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !128, file: !13, line: 183, baseType: !16, size: 8, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "vendor", scope: !85, file: !13, line: 621, baseType: !134, size: 24)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor", file: !13, line: 195, size: 24, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !134, file: !13, line: 196, baseType: !45, size: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !134, file: !13, line: 197, baseType: !97, size: 8, offset: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_typed", scope: !85, file: !13, line: 622, baseType: !139, size: 160)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_vendor_typed", file: !13, line: 202, size: 160, elements: !140)
!140 = !{!141, !142, !143, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "byte_length", scope: !139, file: !13, line: 203, baseType: !45, size: 16)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uuid_subtype", scope: !139, file: !13, line: 204, baseType: !16, size: 8, offset: 16)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "uuid", scope: !139, file: !13, line: 205, baseType: !144, size: 128, offset: 24)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "byte_data", scope: !139, file: !13, line: 206, baseType: !97, size: 8, offset: 152)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !85, file: !13, line: 623, baseType: !149, size: 8)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_end_tag", file: !13, line: 209, size: 8, elements: !150)
!150 = !{!151}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !149, file: !13, line: 210, baseType: !16, size: 8)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !85, file: !13, line: 624, baseType: !153, size: 72)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory24", file: !13, line: 213, size: 72, elements: !154)
!154 = !{!155, !156, !157, !158, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !153, file: !13, line: 214, baseType: !16, size: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !153, file: !13, line: 215, baseType: !45, size: 16, offset: 8)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !153, file: !13, line: 216, baseType: !45, size: 16, offset: 24)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !153, file: !13, line: 217, baseType: !45, size: 16, offset: 40)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !153, file: !13, line: 218, baseType: !45, size: 16, offset: 56)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !85, file: !13, line: 625, baseType: !161, size: 136)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_memory32", file: !13, line: 221, size: 136, elements: !162)
!162 = !{!163, !164, !165, !166, !167}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !161, file: !13, line: 222, baseType: !16, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !161, file: !13, line: 223, baseType: !6, size: 32, offset: 8)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !161, file: !13, line: 224, baseType: !6, size: 32, offset: 40)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !161, file: !13, line: 225, baseType: !6, size: 32, offset: 72)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !161, file: !13, line: 226, baseType: !6, size: 32, offset: 104)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !85, file: !13, line: 626, baseType: !169, size: 72)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_fixed_memory32", file: !13, line: 229, size: 72, elements: !170)
!170 = !{!171, !172, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "write_protect", scope: !169, file: !13, line: 230, baseType: !16, size: 8)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !169, file: !13, line: 231, baseType: !6, size: 32, offset: 8)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !169, file: !13, line: 232, baseType: !6, size: 32, offset: 40)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !85, file: !13, line: 627, baseType: !12, size: 240)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !85, file: !13, line: 628, baseType: !62, size: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !85, file: !13, line: 629, baseType: !177, size: 480)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address64", file: !13, line: 316, size: 480, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !196}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !177, file: !13, line: 317, baseType: !16, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !177, file: !13, line: 317, baseType: !16, size: 8, offset: 8)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !177, file: !13, line: 317, baseType: !16, size: 8, offset: 16)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !177, file: !13, line: 317, baseType: !16, size: 8, offset: 24)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !177, file: !13, line: 317, baseType: !16, size: 8, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !177, file: !13, line: 317, baseType: !24, size: 32, offset: 40)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !177, file: !13, line: 317, baseType: !186, size: 320, offset: 72)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address64_attribute", file: !13, line: 295, size: 320, elements: !187)
!187 = !{!188, !192, !193, !194, !195}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !186, file: !13, line: 296, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !7, line: 23, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !9, line: 31, baseType: !191)
!191 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !186, file: !13, line: 297, baseType: !189, size: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !186, file: !13, line: 298, baseType: !189, size: 64, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !186, file: !13, line: 299, baseType: !189, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !186, file: !13, line: 300, baseType: !189, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !177, file: !13, line: 318, baseType: !53, size: 88, offset: 392)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !85, file: !13, line: 630, baseType: !198, size: 464)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_address64", file: !13, line: 321, size: 464, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !198, file: !13, line: 322, baseType: !16, size: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !198, file: !13, line: 322, baseType: !16, size: 8, offset: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !198, file: !13, line: 322, baseType: !16, size: 8, offset: 16)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !198, file: !13, line: 322, baseType: !16, size: 8, offset: 24)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !198, file: !13, line: 322, baseType: !16, size: 8, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !198, file: !13, line: 322, baseType: !24, size: 32, offset: 40)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !198, file: !13, line: 322, baseType: !16, size: 8, offset: 72)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !198, file: !13, line: 323, baseType: !186, size: 320, offset: 80)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !198, file: !13, line: 324, baseType: !189, size: 64, offset: 400)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !85, file: !13, line: 631, baseType: !210, size: 168)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_extended_irq", file: !13, line: 327, size: 168, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !210, file: !13, line: 328, baseType: !16, size: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !210, file: !13, line: 329, baseType: !16, size: 8, offset: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !210, file: !13, line: 330, baseType: !16, size: 8, offset: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !210, file: !13, line: 331, baseType: !16, size: 8, offset: 24)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !210, file: !13, line: 332, baseType: !16, size: 8, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !210, file: !13, line: 333, baseType: !16, size: 8, offset: 40)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !210, file: !13, line: 334, baseType: !53, size: 88, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !210, file: !13, line: 335, baseType: !220, size: 32, offset: 136)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 32, elements: !98)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !85, file: !13, line: 632, baseType: !222, size: 96)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_generic_register", file: !13, line: 338, size: 96, elements: !223)
!223 = !{!224, !225, !226, !227, !228}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !222, file: !13, line: 339, baseType: !16, size: 8)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !222, file: !13, line: 340, baseType: !16, size: 8, offset: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !222, file: !13, line: 341, baseType: !16, size: 8, offset: 16)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !222, file: !13, line: 342, baseType: !16, size: 8, offset: 24)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !222, file: !13, line: 343, baseType: !189, size: 64, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !85, file: !13, line: 633, baseType: !230, size: 352)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_gpio", file: !13, line: 346, size: 352, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !248}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !230, file: !13, line: 347, baseType: !16, size: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !230, file: !13, line: 348, baseType: !16, size: 8, offset: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !230, file: !13, line: 349, baseType: !16, size: 8, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !230, file: !13, line: 350, baseType: !16, size: 8, offset: 24)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !230, file: !13, line: 351, baseType: !16, size: 8, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "wake_capable", scope: !230, file: !13, line: 352, baseType: !16, size: 8, offset: 40)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "io_restriction", scope: !230, file: !13, line: 353, baseType: !16, size: 8, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "triggering", scope: !230, file: !13, line: 354, baseType: !16, size: 8, offset: 56)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !230, file: !13, line: 355, baseType: !16, size: 8, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !230, file: !13, line: 356, baseType: !45, size: 16, offset: 72)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !230, file: !13, line: 357, baseType: !45, size: 16, offset: 88)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !230, file: !13, line: 358, baseType: !45, size: 16, offset: 104)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !230, file: !13, line: 359, baseType: !45, size: 16, offset: 120)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !230, file: !13, line: 360, baseType: !53, size: 88, offset: 136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !230, file: !13, line: 361, baseType: !247, size: 64, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !230, file: !13, line: 362, baseType: !249, size: 64, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !85, file: !13, line: 634, baseType: !251, size: 288)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_i2c_serialbus", file: !13, line: 412, size: 288, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !251, file: !13, line: 413, baseType: !16, size: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !251, file: !13, line: 413, baseType: !16, size: 8, offset: 8)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !251, file: !13, line: 413, baseType: !16, size: 8, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !251, file: !13, line: 413, baseType: !16, size: 8, offset: 24)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !251, file: !13, line: 413, baseType: !16, size: 8, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !251, file: !13, line: 413, baseType: !16, size: 8, offset: 40)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !251, file: !13, line: 413, baseType: !45, size: 16, offset: 48)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !251, file: !13, line: 413, baseType: !45, size: 16, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !251, file: !13, line: 413, baseType: !53, size: 88, offset: 80)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !251, file: !13, line: 413, baseType: !249, size: 64, offset: 168)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "access_mode", scope: !251, file: !13, line: 413, baseType: !16, size: 8, offset: 232)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !251, file: !13, line: 414, baseType: !45, size: 16, offset: 240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !251, file: !13, line: 415, baseType: !6, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !85, file: !13, line: 635, baseType: !267, size: 320)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_spi_serialbus", file: !13, line: 423, size: 320, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !267, file: !13, line: 424, baseType: !16, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !13, line: 424, baseType: !16, size: 8, offset: 8)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !267, file: !13, line: 424, baseType: !16, size: 8, offset: 16)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !267, file: !13, line: 424, baseType: !16, size: 8, offset: 24)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !267, file: !13, line: 424, baseType: !16, size: 8, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !267, file: !13, line: 424, baseType: !16, size: 8, offset: 40)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !267, file: !13, line: 424, baseType: !45, size: 16, offset: 48)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !267, file: !13, line: 424, baseType: !45, size: 16, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !267, file: !13, line: 424, baseType: !53, size: 88, offset: 80)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !267, file: !13, line: 424, baseType: !249, size: 64, offset: 168)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "wire_mode", scope: !267, file: !13, line: 424, baseType: !16, size: 8, offset: 232)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "device_polarity", scope: !267, file: !13, line: 425, baseType: !16, size: 8, offset: 240)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !267, file: !13, line: 426, baseType: !16, size: 8, offset: 248)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !267, file: !13, line: 427, baseType: !16, size: 8, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !267, file: !13, line: 428, baseType: !16, size: 8, offset: 264)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !267, file: !13, line: 429, baseType: !45, size: 16, offset: 272)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !267, file: !13, line: 430, baseType: !6, size: 32, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !85, file: !13, line: 636, baseType: !287, size: 344)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_uart_serialbus", file: !13, line: 453, size: 344, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !287, file: !13, line: 454, baseType: !16, size: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !287, file: !13, line: 454, baseType: !16, size: 8, offset: 8)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !287, file: !13, line: 454, baseType: !16, size: 8, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !287, file: !13, line: 454, baseType: !16, size: 8, offset: 24)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !287, file: !13, line: 454, baseType: !16, size: 8, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !287, file: !13, line: 454, baseType: !16, size: 8, offset: 40)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !287, file: !13, line: 454, baseType: !45, size: 16, offset: 48)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !287, file: !13, line: 454, baseType: !45, size: 16, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !287, file: !13, line: 454, baseType: !53, size: 88, offset: 80)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !287, file: !13, line: 454, baseType: !249, size: 64, offset: 168)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !287, file: !13, line: 454, baseType: !16, size: 8, offset: 232)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !287, file: !13, line: 455, baseType: !16, size: 8, offset: 240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !287, file: !13, line: 456, baseType: !16, size: 8, offset: 248)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flow_control", scope: !287, file: !13, line: 457, baseType: !16, size: 8, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !287, file: !13, line: 458, baseType: !16, size: 8, offset: 264)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !287, file: !13, line: 459, baseType: !16, size: 8, offset: 272)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !287, file: !13, line: 460, baseType: !45, size: 16, offset: 280)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !287, file: !13, line: 461, baseType: !45, size: 16, offset: 296)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !287, file: !13, line: 462, baseType: !6, size: 32, offset: 312)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !85, file: !13, line: 637, baseType: !309, size: 232)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_common_serialbus", file: !13, line: 398, size: 232, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !309, file: !13, line: 399, baseType: !16, size: 8)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !309, file: !13, line: 399, baseType: !16, size: 8, offset: 8)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !309, file: !13, line: 399, baseType: !16, size: 8, offset: 16)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "slave_mode", scope: !309, file: !13, line: 399, baseType: !16, size: 8, offset: 24)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "connection_sharing", scope: !309, file: !13, line: 399, baseType: !16, size: 8, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !309, file: !13, line: 399, baseType: !16, size: 8, offset: 40)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !309, file: !13, line: 399, baseType: !45, size: 16, offset: 48)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !309, file: !13, line: 399, baseType: !45, size: 16, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !309, file: !13, line: 399, baseType: !53, size: 88, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !309, file: !13, line: 399, baseType: !249, size: 64, offset: 168)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pin_function", scope: !85, file: !13, line: 638, baseType: !322, size: 288)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_function", file: !13, line: 508, size: 288, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !322, file: !13, line: 509, baseType: !16, size: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !322, file: !13, line: 510, baseType: !16, size: 8, offset: 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !322, file: !13, line: 511, baseType: !16, size: 8, offset: 16)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !322, file: !13, line: 512, baseType: !45, size: 16, offset: 24)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !322, file: !13, line: 513, baseType: !45, size: 16, offset: 40)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !322, file: !13, line: 514, baseType: !45, size: 16, offset: 56)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !322, file: !13, line: 515, baseType: !53, size: 88, offset: 72)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !322, file: !13, line: 516, baseType: !247, size: 64, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !322, file: !13, line: 517, baseType: !249, size: 64, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !85, file: !13, line: 639, baseType: !334, size: 312)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_config", file: !13, line: 520, size: 312, elements: !335)
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !334, file: !13, line: 521, baseType: !16, size: 8)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !334, file: !13, line: 522, baseType: !16, size: 8, offset: 8)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !334, file: !13, line: 523, baseType: !16, size: 8, offset: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !334, file: !13, line: 524, baseType: !16, size: 8, offset: 24)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !334, file: !13, line: 525, baseType: !6, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !334, file: !13, line: 526, baseType: !45, size: 16, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !334, file: !13, line: 527, baseType: !45, size: 16, offset: 80)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !334, file: !13, line: 528, baseType: !53, size: 88, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !334, file: !13, line: 529, baseType: !247, size: 64, offset: 184)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !334, file: !13, line: 530, baseType: !249, size: 64, offset: 248)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group", scope: !85, file: !13, line: 640, baseType: !347, size: 256)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group", file: !13, line: 550, size: 256, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !359}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !347, file: !13, line: 551, baseType: !16, size: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !347, file: !13, line: 552, baseType: !16, size: 8, offset: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_length", scope: !347, file: !13, line: 553, baseType: !45, size: 16, offset: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !347, file: !13, line: 554, baseType: !45, size: 16, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table", scope: !347, file: !13, line: 555, baseType: !247, size: 64, offset: 48)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resource_label", scope: !347, file: !13, line: 556, baseType: !355, size: 80, offset: 112)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_label", file: !13, line: 258, size: 80, elements: !356)
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "string_length", scope: !355, file: !13, line: 259, baseType: !45, size: 16)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "string_ptr", scope: !355, file: !13, line: 260, baseType: !58, size: 64, offset: 16)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !347, file: !13, line: 557, baseType: !249, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_function", scope: !85, file: !13, line: 641, baseType: !361, size: 288)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_function", file: !13, line: 560, size: 288, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !361, file: !13, line: 561, baseType: !16, size: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !361, file: !13, line: 562, baseType: !16, size: 8, offset: 8)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !361, file: !13, line: 563, baseType: !16, size: 8, offset: 16)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !361, file: !13, line: 564, baseType: !45, size: 16, offset: 24)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !361, file: !13, line: 565, baseType: !45, size: 16, offset: 40)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !361, file: !13, line: 566, baseType: !53, size: 88, offset: 56)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !361, file: !13, line: 567, baseType: !355, size: 80, offset: 144)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !361, file: !13, line: 568, baseType: !249, size: 64, offset: 224)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_config", scope: !85, file: !13, line: 642, baseType: !372, size: 312)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_pin_group_config", file: !13, line: 571, size: 312, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381, !382}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !372, file: !13, line: 572, baseType: !16, size: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !372, file: !13, line: 573, baseType: !16, size: 8, offset: 8)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "shareable", scope: !372, file: !13, line: 574, baseType: !16, size: 8, offset: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !372, file: !13, line: 575, baseType: !16, size: 8, offset: 24)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !372, file: !13, line: 576, baseType: !6, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !372, file: !13, line: 577, baseType: !45, size: 16, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source", scope: !372, file: !13, line: 578, baseType: !53, size: 88, offset: 80)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "resource_source_label", scope: !372, file: !13, line: 579, baseType: !355, size: 80, offset: 168)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_data", scope: !372, file: !13, line: 580, baseType: !249, size: 64, offset: 248)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !85, file: !13, line: 646, baseType: !384, size: 72)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_resource_address", file: !13, line: 303, size: 72, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !384, file: !13, line: 304, baseType: !16, size: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "producer_consumer", scope: !384, file: !13, line: 304, baseType: !16, size: 8, offset: 8)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !384, file: !13, line: 304, baseType: !16, size: 8, offset: 16)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "min_address_fixed", scope: !384, file: !13, line: 304, baseType: !16, size: 8, offset: 24)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_address_fixed", scope: !384, file: !13, line: 304, baseType: !16, size: 8, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !384, file: !13, line: 304, baseType: !24, size: 32, offset: 40)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !5, line: 127, baseType: !189)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!394 = !{i32 7, !"Dwarf Version", i32 4}
!395 = !{i32 2, !"Debug Info Version", i32 3}
!396 = !{i32 1, !"wchar_size", i32 2}
!397 = !{i32 1, !"Code Model", i32 2}
!398 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!399 = distinct !DISubprogram(name: "acpi_get_irq_routing_table", scope: !1, file: !1, line: 122, type: !400, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!400 = !DISubroutineType(types: !401)
!401 = !{!4, !402, !403}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !5, line: 424, baseType: !60)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_buffer", file: !5, line: 969, size: 128, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !404, file: !5, line: 970, baseType: !392, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !404, file: !5, line: 971, baseType: !60, size: 64, offset: 64)
!408 = !DILocalVariable(name: "device_handle", arg: 1, scope: !399, file: !1, line: 122, type: !402)
!409 = !DILocation(line: 122, column: 40, scope: !399)
!410 = !DILocalVariable(name: "ret_buffer", arg: 2, scope: !399, file: !1, line: 123, type: !403)
!411 = !DILocation(line: 123, column: 27, scope: !399)
!412 = !DILocalVariable(name: "status", scope: !399, file: !1, line: 125, type: !4)
!413 = !DILocation(line: 125, column: 14, scope: !399)
!414 = !DILocalVariable(name: "node", scope: !399, file: !1, line: 126, type: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !417, line: 133, size: 384, elements: !418)
!417 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!418 = !{!419, !1156, !1157, !1158, !1159, !1165, !1166, !1167, !1168}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !416, file: !417, line: 134, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !422, line: 367, size: 576, elements: !423)
!422 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!423 = !{!424, !432, !445, !455, !468, !482, !491, !807, !824, !839, !852, !930, !942, !956, !966, !984, !1006, !1025, !1044, !1063, !1076, !1102, !1119, !1132, !1146, !1155}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !421, file: !422, line: 368, baseType: !425, size: 128)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !422, line: 73, size: 128, elements: !426)
!426 = !{!427, !428, !429, !430, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !425, file: !422, line: 74, baseType: !420, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !425, file: !422, line: 74, baseType: !16, size: 8, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !422, line: 74, baseType: !16, size: 8, offset: 72)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !425, file: !422, line: 74, baseType: !45, size: 16, offset: 80)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !425, file: !422, line: 74, baseType: !16, size: 8, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !421, file: !422, line: 369, baseType: !433, size: 192)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !422, line: 76, size: 192, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !444}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !433, file: !422, line: 77, baseType: !420, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !433, file: !422, line: 77, baseType: !16, size: 8, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !422, line: 77, baseType: !16, size: 8, offset: 72)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !433, file: !422, line: 77, baseType: !45, size: 16, offset: 80)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !433, file: !422, line: 77, baseType: !16, size: 8, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !433, file: !422, line: 77, baseType: !441, size: 24, offset: 104)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 3)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !433, file: !422, line: 78, baseType: !189, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !421, file: !422, line: 370, baseType: !446, size: 256)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !422, line: 93, size: 256, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !446, file: !422, line: 94, baseType: !420, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !446, file: !422, line: 94, baseType: !16, size: 8, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !446, file: !422, line: 94, baseType: !16, size: 8, offset: 72)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !446, file: !422, line: 94, baseType: !45, size: 16, offset: 80)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !446, file: !422, line: 94, baseType: !16, size: 8, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !446, file: !422, line: 94, baseType: !58, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !446, file: !422, line: 94, baseType: !6, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !421, file: !422, line: 371, baseType: !456, size: 384)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !422, line: 97, size: 384, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !456, file: !422, line: 98, baseType: !420, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !456, file: !422, line: 98, baseType: !16, size: 8, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !456, file: !422, line: 98, baseType: !16, size: 8, offset: 72)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !456, file: !422, line: 98, baseType: !45, size: 16, offset: 80)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !456, file: !422, line: 98, baseType: !16, size: 8, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !456, file: !422, line: 98, baseType: !249, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !456, file: !422, line: 98, baseType: !6, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !456, file: !422, line: 99, baseType: !6, size: 32, offset: 224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !456, file: !422, line: 100, baseType: !249, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !456, file: !422, line: 101, baseType: !415, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !421, file: !422, line: 372, baseType: !469, size: 384)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !422, line: 104, size: 384, elements: !470)
!470 = !{!471, !472, !473, !474, !475, !476, !477, !479, !480, !481}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !469, file: !422, line: 105, baseType: !420, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !469, file: !422, line: 105, baseType: !16, size: 8, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !422, line: 105, baseType: !16, size: 8, offset: 72)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !469, file: !422, line: 105, baseType: !45, size: 16, offset: 80)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !469, file: !422, line: 105, baseType: !16, size: 8, offset: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !469, file: !422, line: 105, baseType: !415, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !469, file: !422, line: 106, baseType: !478, size: 64, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !469, file: !422, line: 107, baseType: !249, size: 64, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !469, file: !422, line: 108, baseType: !6, size: 32, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !469, file: !422, line: 109, baseType: !6, size: 32, offset: 352)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !421, file: !422, line: 373, baseType: !483, size: 192)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !422, line: 118, size: 192, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !483, file: !422, line: 119, baseType: !420, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !483, file: !422, line: 119, baseType: !16, size: 8, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !422, line: 119, baseType: !16, size: 8, offset: 72)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !483, file: !422, line: 119, baseType: !45, size: 16, offset: 80)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !483, file: !422, line: 119, baseType: !16, size: 8, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !483, file: !422, line: 119, baseType: !60, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !421, file: !422, line: 374, baseType: !492, size: 448)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !422, line: 143, size: 448, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !804, !805, !806}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !492, file: !422, line: 144, baseType: !420, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !492, file: !422, line: 144, baseType: !16, size: 8, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !492, file: !422, line: 144, baseType: !16, size: 8, offset: 72)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !492, file: !422, line: 144, baseType: !45, size: 16, offset: 80)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !492, file: !422, line: 144, baseType: !16, size: 8, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !492, file: !422, line: 144, baseType: !16, size: 8, offset: 104)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !492, file: !422, line: 145, baseType: !16, size: 8, offset: 112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !492, file: !422, line: 146, baseType: !16, size: 8, offset: 120)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !492, file: !422, line: 147, baseType: !420, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !492, file: !422, line: 148, baseType: !420, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !492, file: !422, line: 149, baseType: !249, size: 64, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !492, file: !422, line: 153, baseType: !506, size: 64, offset: 320)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !492, file: !422, line: 150, size: 64, elements: !507)
!507 = !{!508, !803}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !506, file: !422, line: 151, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !417, line: 248, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{!4, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !515, line: 37, size: 9024, elements: !516)
!515 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !749, !750, !751, !752, !753, !757, !759, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !786, !787, !788, !789, !790, !791, !792, !793, !795, !801}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !515, line: 38, baseType: !513, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !514, file: !515, line: 39, baseType: !16, size: 8, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !514, file: !515, line: 40, baseType: !16, size: 8, offset: 72)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !514, file: !515, line: 41, baseType: !45, size: 16, offset: 80)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !514, file: !515, line: 42, baseType: !16, size: 8, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !514, file: !515, line: 43, baseType: !16, size: 8, offset: 104)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !514, file: !515, line: 44, baseType: !16, size: 8, offset: 112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !514, file: !515, line: 45, baseType: !525, size: 16, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !5, line: 445, baseType: !45)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !514, file: !515, line: 46, baseType: !16, size: 8, offset: 144)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !514, file: !515, line: 47, baseType: !16, size: 8, offset: 152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !514, file: !515, line: 48, baseType: !16, size: 8, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !514, file: !515, line: 49, baseType: !16, size: 8, offset: 168)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !514, file: !515, line: 50, baseType: !16, size: 8, offset: 176)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !514, file: !515, line: 51, baseType: !16, size: 8, offset: 184)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !514, file: !515, line: 52, baseType: !16, size: 8, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !514, file: !515, line: 53, baseType: !16, size: 8, offset: 200)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !514, file: !515, line: 54, baseType: !249, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !514, file: !515, line: 55, baseType: !6, size: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !514, file: !515, line: 56, baseType: !6, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !514, file: !515, line: 57, baseType: !6, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !514, file: !515, line: 58, baseType: !6, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !514, file: !515, line: 60, baseType: !540, size: 640, offset: 448)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !417, line: 893, size: 640, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !631, !632, !747, !748}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !540, file: !417, line: 894, baseType: !249, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !540, file: !417, line: 895, baseType: !249, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !540, file: !417, line: 896, baseType: !249, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !540, file: !417, line: 897, baseType: !249, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !540, file: !417, line: 898, baseType: !249, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !540, file: !417, line: 899, baseType: !548, size: 64, offset: 320)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !417, line: 875, size: 1600, elements: !550)
!550 = !{!551, !571, !587}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !549, file: !417, line: 876, baseType: !552, size: 448)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !417, line: 828, size: 448, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !570}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !552, file: !417, line: 829, baseType: !548, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !552, file: !417, line: 829, baseType: !16, size: 8, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !552, file: !417, line: 829, baseType: !16, size: 8, offset: 72)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !552, file: !417, line: 829, baseType: !45, size: 16, offset: 80)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !552, file: !417, line: 829, baseType: !249, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !552, file: !417, line: 829, baseType: !548, size: 64, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !552, file: !417, line: 829, baseType: !415, size: 64, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !552, file: !417, line: 829, baseType: !562, size: 64, offset: 320)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !417, line: 716, size: 64, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !562, file: !417, line: 717, baseType: !189, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !562, file: !417, line: 718, baseType: !6, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !562, file: !417, line: 719, baseType: !58, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !562, file: !417, line: 720, baseType: !249, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !417, line: 721, baseType: !58, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !562, file: !417, line: 722, baseType: !548, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !552, file: !417, line: 829, baseType: !16, size: 8, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !549, file: !417, line: 877, baseType: !572, size: 640)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !417, line: 835, size: 640, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !572, file: !417, line: 836, baseType: !548, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !572, file: !417, line: 836, baseType: !16, size: 8, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !572, file: !417, line: 836, baseType: !16, size: 8, offset: 72)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !572, file: !417, line: 836, baseType: !45, size: 16, offset: 80)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !572, file: !417, line: 836, baseType: !249, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !572, file: !417, line: 836, baseType: !548, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !572, file: !417, line: 836, baseType: !415, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !572, file: !417, line: 836, baseType: !562, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !572, file: !417, line: 836, baseType: !16, size: 8, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !572, file: !417, line: 836, baseType: !58, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !417, line: 837, baseType: !249, size: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !572, file: !417, line: 838, baseType: !6, size: 32, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !417, line: 839, baseType: !6, size: 32, offset: 608)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !549, file: !417, line: 878, baseType: !588, size: 1600)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !417, line: 846, size: 1600, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !588, file: !417, line: 847, baseType: !548, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !588, file: !417, line: 847, baseType: !16, size: 8, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !588, file: !417, line: 847, baseType: !16, size: 8, offset: 72)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !588, file: !417, line: 847, baseType: !45, size: 16, offset: 80)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !588, file: !417, line: 847, baseType: !249, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !417, line: 847, baseType: !548, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !588, file: !417, line: 847, baseType: !415, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !588, file: !417, line: 847, baseType: !562, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !588, file: !417, line: 847, baseType: !16, size: 8, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !588, file: !417, line: 847, baseType: !548, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !588, file: !417, line: 848, baseType: !548, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !588, file: !417, line: 849, baseType: !58, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !588, file: !417, line: 850, baseType: !16, size: 8, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !588, file: !417, line: 851, baseType: !58, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !588, file: !417, line: 852, baseType: !58, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !588, file: !417, line: 853, baseType: !58, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !588, file: !417, line: 854, baseType: !607, size: 32, offset: 896)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 32, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 4)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !588, file: !417, line: 855, baseType: !6, size: 32, offset: 928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !588, file: !417, line: 856, baseType: !6, size: 32, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !588, file: !417, line: 857, baseType: !6, size: 32, offset: 992)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !588, file: !417, line: 858, baseType: !6, size: 32, offset: 1024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !588, file: !417, line: 859, baseType: !6, size: 32, offset: 1056)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !588, file: !417, line: 860, baseType: !6, size: 32, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !588, file: !417, line: 861, baseType: !6, size: 32, offset: 1120)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !588, file: !417, line: 862, baseType: !6, size: 32, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !588, file: !417, line: 863, baseType: !6, size: 32, offset: 1184)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !588, file: !417, line: 864, baseType: !6, size: 32, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !588, file: !417, line: 865, baseType: !6, size: 32, offset: 1248)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !588, file: !417, line: 866, baseType: !6, size: 32, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !588, file: !417, line: 867, baseType: !6, size: 32, offset: 1312)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !588, file: !417, line: 868, baseType: !45, size: 16, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !588, file: !417, line: 869, baseType: !16, size: 8, offset: 1360)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !588, file: !417, line: 870, baseType: !16, size: 8, offset: 1368)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !588, file: !417, line: 871, baseType: !16, size: 8, offset: 1376)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !588, file: !417, line: 872, baseType: !628, size: 160, offset: 1384)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 160, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 20)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !540, file: !417, line: 900, baseType: !415, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !540, file: !417, line: 901, baseType: !633, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !417, line: 663, size: 640, elements: !635)
!635 = !{!636, !644, !657, !666, !675, !688, !702, !714, !726}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !634, file: !417, line: 664, baseType: !637, size: 128)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !417, line: 567, size: 128, elements: !638)
!638 = !{!639, !640, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !417, line: 568, baseType: !60, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !637, file: !417, line: 568, baseType: !16, size: 8, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !637, file: !417, line: 568, baseType: !16, size: 8, offset: 72)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !637, file: !417, line: 568, baseType: !45, size: 16, offset: 80)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !637, file: !417, line: 568, baseType: !45, size: 16, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !634, file: !417, line: 665, baseType: !645, size: 384)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !417, line: 593, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !417, line: 594, baseType: !60, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !645, file: !417, line: 594, baseType: !16, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !417, line: 594, baseType: !16, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !417, line: 594, baseType: !45, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !645, file: !417, line: 594, baseType: !45, size: 16, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !645, file: !417, line: 594, baseType: !45, size: 16, offset: 112)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !645, file: !417, line: 595, baseType: !548, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !645, file: !417, line: 596, baseType: !249, size: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !645, file: !417, line: 597, baseType: !249, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !645, file: !417, line: 598, baseType: !189, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !634, file: !417, line: 666, baseType: !658, size: 192)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !417, line: 573, size: 192, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !658, file: !417, line: 574, baseType: !60, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !658, file: !417, line: 574, baseType: !16, size: 8, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !658, file: !417, line: 574, baseType: !16, size: 8, offset: 72)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !658, file: !417, line: 574, baseType: !45, size: 16, offset: 80)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !658, file: !417, line: 574, baseType: !45, size: 16, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !658, file: !417, line: 574, baseType: !420, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !634, file: !417, line: 667, baseType: !667, size: 192)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !417, line: 604, size: 192, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !417, line: 605, baseType: !60, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !667, file: !417, line: 605, baseType: !16, size: 8, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !667, file: !417, line: 605, baseType: !16, size: 8, offset: 72)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !667, file: !417, line: 605, baseType: !45, size: 16, offset: 80)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !667, file: !417, line: 605, baseType: !45, size: 16, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !667, file: !417, line: 605, baseType: !415, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !634, file: !417, line: 668, baseType: !676, size: 448)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !417, line: 608, size: 448, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !417, line: 609, baseType: !60, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !676, file: !417, line: 609, baseType: !16, size: 8, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !417, line: 609, baseType: !16, size: 8, offset: 72)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !676, file: !417, line: 609, baseType: !45, size: 16, offset: 80)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !676, file: !417, line: 609, baseType: !45, size: 16, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !676, file: !417, line: 609, baseType: !6, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !676, file: !417, line: 610, baseType: !548, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !676, file: !417, line: 611, baseType: !249, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !676, file: !417, line: 612, baseType: !249, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !676, file: !417, line: 613, baseType: !6, size: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !634, file: !417, line: 669, baseType: !689, size: 512)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !417, line: 580, size: 512, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !689, file: !417, line: 581, baseType: !60, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !689, file: !417, line: 581, baseType: !16, size: 8, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !689, file: !417, line: 581, baseType: !16, size: 8, offset: 72)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !689, file: !417, line: 581, baseType: !45, size: 16, offset: 80)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !689, file: !417, line: 581, baseType: !45, size: 16, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !689, file: !417, line: 581, baseType: !6, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !689, file: !417, line: 582, baseType: !420, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !689, file: !417, line: 583, baseType: !420, size: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !689, file: !417, line: 584, baseType: !513, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !689, file: !417, line: 585, baseType: !60, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !689, file: !417, line: 586, baseType: !6, size: 32, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !634, file: !417, line: 670, baseType: !703, size: 320)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !417, line: 620, size: 320, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !417, line: 621, baseType: !60, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !703, file: !417, line: 621, baseType: !16, size: 8, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !703, file: !417, line: 621, baseType: !16, size: 8, offset: 72)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !703, file: !417, line: 621, baseType: !45, size: 16, offset: 80)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !703, file: !417, line: 621, baseType: !45, size: 16, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !703, file: !417, line: 621, baseType: !16, size: 8, offset: 112)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !703, file: !417, line: 622, baseType: !513, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !703, file: !417, line: 623, baseType: !420, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !703, file: !417, line: 624, baseType: !189, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !634, file: !417, line: 671, baseType: !715, size: 640)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !417, line: 631, size: 640, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !417, line: 632, baseType: !60, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !417, line: 632, baseType: !16, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !417, line: 632, baseType: !16, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !417, line: 632, baseType: !45, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !715, file: !417, line: 632, baseType: !45, size: 16, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !715, file: !417, line: 633, baseType: !723, size: 512, offset: 128)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 512, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !634, file: !417, line: 672, baseType: !727, size: 320)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !417, line: 654, size: 320, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !727, file: !417, line: 655, baseType: !60, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !727, file: !417, line: 655, baseType: !16, size: 8, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !727, file: !417, line: 655, baseType: !16, size: 8, offset: 72)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !727, file: !417, line: 655, baseType: !45, size: 16, offset: 80)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !727, file: !417, line: 655, baseType: !45, size: 16, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !727, file: !417, line: 655, baseType: !16, size: 8, offset: 112)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !727, file: !417, line: 656, baseType: !415, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !727, file: !417, line: 657, baseType: !420, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !727, file: !417, line: 658, baseType: !738, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !417, line: 645, size: 128, elements: !740)
!740 = !{!741, !746}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !739, file: !417, line: 646, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !5, line: 1052, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !402, !6, !60}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !739, file: !417, line: 647, baseType: !60, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !540, file: !417, line: 902, baseType: !548, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !540, file: !417, line: 903, baseType: !6, size: 32, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !514, file: !515, line: 61, baseType: !6, size: 32, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !514, file: !515, line: 62, baseType: !6, size: 32, offset: 1120)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !514, file: !515, line: 63, baseType: !45, size: 16, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !514, file: !515, line: 64, baseType: !16, size: 8, offset: 1168)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !514, file: !515, line: 66, baseType: !754, size: 2688, offset: 1216)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 2688, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 7)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !514, file: !515, line: 67, baseType: !758, size: 3072, offset: 3904)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 3072, elements: !724)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !514, file: !515, line: 68, baseType: !760, size: 576, offset: 6976)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 576, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 9)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !514, file: !515, line: 69, baseType: !478, size: 64, offset: 7552)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !514, file: !515, line: 71, baseType: !249, size: 64, offset: 7616)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !514, file: !515, line: 72, baseType: !478, size: 64, offset: 7680)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !514, file: !515, line: 73, baseType: !633, size: 64, offset: 7744)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !514, file: !515, line: 74, baseType: !415, size: 64, offset: 7808)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !514, file: !515, line: 75, baseType: !420, size: 64, offset: 7872)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !514, file: !515, line: 76, baseType: !415, size: 64, offset: 7936)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !514, file: !515, line: 77, baseType: !548, size: 64, offset: 8000)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !514, file: !515, line: 78, baseType: !420, size: 64, offset: 8064)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !514, file: !515, line: 79, baseType: !415, size: 64, offset: 8128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !514, file: !515, line: 80, baseType: !58, size: 64, offset: 8192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !514, file: !515, line: 81, baseType: !548, size: 64, offset: 8256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !514, file: !515, line: 82, baseType: !776, size: 64, offset: 8320)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !417, line: 702, size: 128, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !778, file: !417, line: 706, baseType: !6, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !778, file: !417, line: 707, baseType: !6, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !778, file: !417, line: 708, baseType: !45, size: 16, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !778, file: !417, line: 709, baseType: !16, size: 8, offset: 80)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !778, file: !417, line: 710, baseType: !16, size: 8, offset: 88)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !778, file: !417, line: 711, baseType: !16, size: 8, offset: 96)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !514, file: !515, line: 83, baseType: !548, size: 64, offset: 8384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !514, file: !515, line: 84, baseType: !420, size: 64, offset: 8448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !514, file: !515, line: 85, baseType: !633, size: 64, offset: 8512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !514, file: !515, line: 86, baseType: !420, size: 64, offset: 8576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !514, file: !515, line: 87, baseType: !633, size: 64, offset: 8640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !514, file: !515, line: 88, baseType: !548, size: 64, offset: 8704)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !514, file: !515, line: 89, baseType: !548, size: 64, offset: 8768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !514, file: !515, line: 90, baseType: !794, size: 64, offset: 8832)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !514, file: !515, line: 91, baseType: !796, size: 64, offset: 8896)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !417, line: 637, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!4, !513, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !514, file: !515, line: 92, baseType: !802, size: 64, offset: 8960)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !417, line: 641, baseType: !510)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !506, file: !422, line: 152, baseType: !420, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !492, file: !422, line: 155, baseType: !6, size: 32, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !492, file: !422, line: 156, baseType: !525, size: 16, offset: 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !492, file: !422, line: 157, baseType: !16, size: 8, offset: 432)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !421, file: !422, line: 375, baseType: !808, size: 576)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !422, line: 122, size: 576, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !808, file: !422, line: 123, baseType: !420, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !808, file: !422, line: 123, baseType: !16, size: 8, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !808, file: !422, line: 123, baseType: !16, size: 8, offset: 72)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !808, file: !422, line: 123, baseType: !45, size: 16, offset: 80)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !808, file: !422, line: 123, baseType: !16, size: 8, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !808, file: !422, line: 123, baseType: !16, size: 8, offset: 104)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !808, file: !422, line: 124, baseType: !45, size: 16, offset: 112)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !808, file: !422, line: 125, baseType: !60, size: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !808, file: !422, line: 126, baseType: !189, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !808, file: !422, line: 127, baseType: !794, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !808, file: !422, line: 128, baseType: !420, size: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !808, file: !422, line: 129, baseType: !420, size: 64, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !808, file: !422, line: 130, baseType: !415, size: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !808, file: !422, line: 131, baseType: !16, size: 8, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !421, file: !422, line: 376, baseType: !825, size: 448)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !422, line: 134, size: 448, elements: !826)
!826 = !{!827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !825, file: !422, line: 135, baseType: !420, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !825, file: !422, line: 135, baseType: !16, size: 8, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !825, file: !422, line: 135, baseType: !16, size: 8, offset: 72)
