; ModuleID = '../bcout/drivers/acpi/acpica/tbdata.llvm.bc'
source_filename = "drivers/acpi/acpica/tbdata.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_list = type { %struct.acpi_table_desc*, i32, i32, i8 }
%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%union.acpi_name_union = type { i32 }
%struct.acpi_rw_lock = type { i8*, i8*, i32 }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !56, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !55, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbdata.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !19, !20, !46, !51, !15, !48, !31, !52, !54}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !16, line: 21, baseType: !17)
!16 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !18, line: 27, baseType: !7)
!18 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !22, line: 68, size: 288, elements: !23)
!22 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!23 = !{!24, !29, !30, !34, !35, !39, !43, !44, !45}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !21, file: !22, line: 69, baseType: !25, size: 32)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !27)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !{!28}
!28 = !DISubrange(count: 4)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !21, file: !22, line: 70, baseType: !15, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !21, file: !22, line: 71, baseType: !31, size: 8, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !16, line: 17, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !18, line: 21, baseType: !33)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !21, file: !22, line: 72, baseType: !31, size: 8, offset: 72)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !21, file: !22, line: 73, baseType: !36, size: 48, offset: 80)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 48, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !21, file: !22, line: 74, baseType: !40, size: 64, offset: 128)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !21, file: !22, line: 75, baseType: !15, size: 32, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !21, file: !22, line: 76, baseType: !25, size: 32, offset: 224)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !21, file: !22, line: 77, baseType: !15, size: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !47, line: 127, baseType: !48)
!47 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !16, line: 23, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !18, line: 31, baseType: !50)
!50 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !47, line: 421, baseType: !15)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !53, line: 148, baseType: !7)
!53 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !{!0}
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 56, elements: !58)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!58 = !{!59}
!59 = !DISubrange(count: 7)
!60 = !{!"rsp"}
!61 = !{i32 7, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{i32 1, !"wchar_size", i32 2}
!64 = !{i32 1, !"Code Model", i32 2}
!65 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!66 = distinct !DISubprogram(name: "acpi_tb_init_table_descriptor", scope: !3, file: !3, line: 86, type: !67, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69, !73, !31, !20}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !22, line: 334, size: 256, elements: !71)
!71 = !{!72, !74, !75, !76, !81, !86, !87}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !70, file: !22, line: 335, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !47, line: 129, baseType: !48)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !70, file: !22, line: 336, baseType: !20, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !70, file: !22, line: 337, baseType: !15, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !70, file: !22, line: 338, baseType: !77, size: 32, offset: 160)
!77 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !22, line: 327, size: 32, elements: !78)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !77, file: !22, line: 328, baseType: !15, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !77, file: !22, line: 329, baseType: !25, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !70, file: !22, line: 339, baseType: !82, size: 16, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !47, line: 445, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !16, line: 19, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !18, line: 24, baseType: !85)
!85 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !70, file: !22, line: 340, baseType: !31, size: 8, offset: 208)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "validation_count", scope: !70, file: !22, line: 341, baseType: !83, size: 16, offset: 224)
!88 = !{}
!89 = !DILocalVariable(name: "table_desc", arg: 1, scope: !66, file: !3, line: 86, type: !69)
!90 = !DILocation(line: 86, column: 55, scope: !66)
!91 = !DILocalVariable(name: "address", arg: 2, scope: !66, file: !3, line: 87, type: !73)
!92 = !DILocation(line: 87, column: 32, scope: !66)
!93 = !DILocalVariable(name: "flags", arg: 3, scope: !66, file: !3, line: 88, type: !31)
!94 = !DILocation(line: 88, column: 13, scope: !66)
!95 = !DILocalVariable(name: "table", arg: 4, scope: !66, file: !3, line: 88, type: !20)
!96 = !DILocation(line: 88, column: 46, scope: !66)
!97 = !DILocation(line: 95, column: 9, scope: !66)
!98 = !DILocation(line: 95, column: 2, scope: !66)
!99 = !DILocation(line: 96, column: 24, scope: !66)
!100 = !DILocation(line: 96, column: 2, scope: !66)
!101 = !DILocation(line: 96, column: 14, scope: !66)
!102 = !DILocation(line: 96, column: 22, scope: !66)
!103 = !DILocation(line: 97, column: 23, scope: !66)
!104 = !DILocation(line: 97, column: 30, scope: !66)
!105 = !DILocation(line: 97, column: 2, scope: !66)
!106 = !DILocation(line: 97, column: 14, scope: !66)
!107 = !DILocation(line: 97, column: 21, scope: !66)
!108 = !DILocation(line: 98, column: 22, scope: !66)
!109 = !DILocation(line: 98, column: 2, scope: !66)
!110 = !DILocation(line: 98, column: 14, scope: !66)
!111 = !DILocation(line: 98, column: 20, scope: !66)
!112 = !DILocation(line: 99, column: 2, scope: !66)
!113 = !DILocation(line: 100, column: 1, scope: !66)
!114 = distinct !DISubprogram(name: "acpi_tb_acquire_table", scope: !3, file: !3, line: 119, type: !115, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!115 = !DISubroutineType(types: !116)
!116 = !{!51, !69, !117, !14, !118}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!119 = !DILocalVariable(name: "table_desc", arg: 1, scope: !114, file: !3, line: 119, type: !69)
!120 = !DILocation(line: 119, column: 47, scope: !114)
!121 = !DILocalVariable(name: "table_ptr", arg: 2, scope: !114, file: !3, line: 120, type: !117)
!122 = !DILocation(line: 120, column: 36, scope: !114)
!123 = !DILocalVariable(name: "table_length", arg: 3, scope: !114, file: !3, line: 121, type: !14)
!124 = !DILocation(line: 121, column: 14, scope: !114)
!125 = !DILocalVariable(name: "table_flags", arg: 4, scope: !114, file: !3, line: 121, type: !118)
!126 = !DILocation(line: 121, column: 32, scope: !114)
!127 = !DILocalVariable(name: "table", scope: !114, file: !3, line: 123, type: !20)
!128 = !DILocation(line: 123, column: 28, scope: !114)
!129 = !DILocation(line: 125, column: 10, scope: !114)
!130 = !DILocation(line: 125, column: 22, scope: !114)
!131 = !DILocation(line: 125, column: 28, scope: !114)
!132 = !DILocation(line: 125, column: 2, scope: !114)
!133 = !DILocation(line: 129, column: 26, scope: !134)
!134 = distinct !DILexicalBlock(scope: !114, file: !3, line: 125, column: 54)
!135 = !DILocation(line: 129, column: 38, scope: !134)
!136 = !DILocation(line: 129, column: 47, scope: !134)
!137 = !DILocation(line: 129, column: 59, scope: !134)
!138 = !DILocation(line: 129, column: 7, scope: !134)
!139 = !DILocation(line: 128, column: 9, scope: !134)
!140 = !DILocation(line: 130, column: 3, scope: !134)
!141 = !DILocation(line: 135, column: 11, scope: !134)
!142 = !DILocation(line: 135, column: 9, scope: !134)
!143 = !DILocation(line: 138, column: 3, scope: !134)
!144 = !DILocation(line: 142, column: 3, scope: !134)
!145 = !DILocation(line: 147, column: 7, scope: !146)
!146 = distinct !DILexicalBlock(scope: !114, file: !3, line: 147, column: 6)
!147 = !DILocation(line: 147, column: 6, scope: !114)
!148 = !DILocation(line: 148, column: 3, scope: !149)
!149 = distinct !DILexicalBlock(scope: !146, file: !3, line: 147, column: 14)
!150 = !DILocation(line: 153, column: 15, scope: !114)
!151 = !DILocation(line: 153, column: 3, scope: !114)
!152 = !DILocation(line: 153, column: 13, scope: !114)
!153 = !DILocation(line: 154, column: 18, scope: !114)
!154 = !DILocation(line: 154, column: 30, scope: !114)
!155 = !DILocation(line: 154, column: 3, scope: !114)
!156 = !DILocation(line: 154, column: 16, scope: !114)
!157 = !DILocation(line: 155, column: 17, scope: !114)
!158 = !DILocation(line: 155, column: 29, scope: !114)
!159 = !DILocation(line: 155, column: 3, scope: !114)
!160 = !DILocation(line: 155, column: 15, scope: !114)
!161 = !DILocation(line: 156, column: 2, scope: !114)
!162 = !DILocation(line: 157, column: 1, scope: !114)
!163 = distinct !DISubprogram(name: "acpi_tb_release_table", scope: !3, file: !3, line: 174, type: !164, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!164 = !DISubroutineType(types: !165)
!165 = !{null, !20, !15, !31}
!166 = !DILocalVariable(name: "table", arg: 1, scope: !163, file: !3, line: 174, type: !20)
!167 = !DILocation(line: 174, column: 49, scope: !163)
!168 = !DILocalVariable(name: "table_length", arg: 2, scope: !163, file: !3, line: 175, type: !15)
!169 = !DILocation(line: 175, column: 13, scope: !163)
!170 = !DILocalVariable(name: "table_flags", arg: 3, scope: !163, file: !3, line: 175, type: !31)
!171 = !DILocation(line: 175, column: 30, scope: !163)
!172 = !DILocation(line: 178, column: 10, scope: !163)
!173 = !DILocation(line: 178, column: 22, scope: !163)
!174 = !DILocation(line: 178, column: 2, scope: !163)
!175 = !DILocation(line: 181, column: 24, scope: !176)
!176 = distinct !DILexicalBlock(scope: !163, file: !3, line: 178, column: 48)
!177 = !DILocation(line: 181, column: 31, scope: !176)
!178 = !DILocation(line: 181, column: 3, scope: !176)
!179 = !DILocation(line: 182, column: 3, scope: !176)
!180 = !DILocation(line: 188, column: 3, scope: !176)
!181 = !DILocation(line: 190, column: 1, scope: !163)
!182 = distinct !DISubprogram(name: "acpi_tb_acquire_temp_table", scope: !3, file: !3, line: 210, type: !183, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!183 = !DISubroutineType(types: !184)
!184 = !{!51, !69, !73, !31}
!185 = !DILocalVariable(name: "table_desc", arg: 1, scope: !182, file: !3, line: 210, type: !69)
!186 = !DILocation(line: 210, column: 52, scope: !182)
!187 = !DILocalVariable(name: "address", arg: 2, scope: !182, file: !3, line: 211, type: !73)
!188 = !DILocation(line: 211, column: 29, scope: !182)
!189 = !DILocalVariable(name: "flags", arg: 3, scope: !182, file: !3, line: 211, type: !31)
!190 = !DILocation(line: 211, column: 41, scope: !182)
!191 = !DILocalVariable(name: "table_header", scope: !182, file: !3, line: 213, type: !20)
!192 = !DILocation(line: 213, column: 28, scope: !182)
!193 = !DILocation(line: 215, column: 10, scope: !182)
!194 = !DILocation(line: 215, column: 16, scope: !182)
!195 = !DILocation(line: 215, column: 2, scope: !182)
!196 = !DILocation(line: 221, column: 26, scope: !197)
!197 = distinct !DILexicalBlock(scope: !182, file: !3, line: 215, column: 42)
!198 = !DILocation(line: 221, column: 7, scope: !197)
!199 = !DILocation(line: 220, column: 16, scope: !197)
!200 = !DILocation(line: 223, column: 8, scope: !201)
!201 = distinct !DILexicalBlock(scope: !197, file: !3, line: 223, column: 7)
!202 = !DILocation(line: 223, column: 7, scope: !197)
!203 = !DILocation(line: 224, column: 4, scope: !204)
!204 = distinct !DILexicalBlock(scope: !201, file: !3, line: 223, column: 22)
!205 = !DILocation(line: 227, column: 33, scope: !197)
!206 = !DILocation(line: 227, column: 45, scope: !197)
!207 = !DILocation(line: 227, column: 54, scope: !197)
!208 = !DILocation(line: 228, column: 12, scope: !197)
!209 = !DILocation(line: 227, column: 3, scope: !197)
!210 = !DILocation(line: 229, column: 24, scope: !197)
!211 = !DILocation(line: 229, column: 3, scope: !197)
!212 = !DILocation(line: 231, column: 3, scope: !197)
!213 = !DILocation(line: 236, column: 18, scope: !197)
!214 = !DILocation(line: 236, column: 16, scope: !197)
!215 = !DILocation(line: 238, column: 8, scope: !216)
!216 = distinct !DILexicalBlock(scope: !197, file: !3, line: 238, column: 7)
!217 = !DILocation(line: 238, column: 7, scope: !197)
!218 = !DILocation(line: 239, column: 4, scope: !219)
!219 = distinct !DILexicalBlock(scope: !216, file: !3, line: 238, column: 22)
!220 = !DILocation(line: 242, column: 33, scope: !197)
!221 = !DILocation(line: 242, column: 45, scope: !197)
!222 = !DILocation(line: 242, column: 54, scope: !197)
!223 = !DILocation(line: 243, column: 12, scope: !197)
!224 = !DILocation(line: 242, column: 3, scope: !197)
!225 = !DILocation(line: 244, column: 3, scope: !197)
!226 = !DILocation(line: 248, column: 3, scope: !197)
!227 = !DILocation(line: 253, column: 2, scope: !182)
!228 = !DILocation(line: 254, column: 1, scope: !182)
!229 = distinct !DISubprogram(name: "acpi_tb_release_temp_table", scope: !3, file: !3, line: 268, type: !230, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !69}
!232 = !DILocalVariable(name: "table_desc", arg: 1, scope: !229, file: !3, line: 268, type: !69)
!233 = !DILocation(line: 268, column: 57, scope: !229)
!234 = !DILocation(line: 276, column: 27, scope: !229)
!235 = !DILocation(line: 276, column: 2, scope: !229)
!236 = !DILocation(line: 277, column: 1, scope: !229)
!237 = distinct !DISubprogram(name: "acpi_tb_invalidate_table", scope: !3, file: !3, line: 325, type: !230, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!238 = !DILocalVariable(name: "table_desc", arg: 1, scope: !237, file: !3, line: 325, type: !69)
!239 = !DILocation(line: 325, column: 55, scope: !237)
!240 = !DILocation(line: 332, column: 7, scope: !241)
!241 = distinct !DILexicalBlock(scope: !237, file: !3, line: 332, column: 6)
!242 = !DILocation(line: 332, column: 19, scope: !241)
!243 = !DILocation(line: 332, column: 6, scope: !237)
!244 = !DILocation(line: 333, column: 3, scope: !245)
!245 = distinct !DILexicalBlock(scope: !241, file: !3, line: 332, column: 28)
!246 = !DILocation(line: 336, column: 24, scope: !237)
!247 = !DILocation(line: 336, column: 36, scope: !237)
!248 = !DILocation(line: 336, column: 45, scope: !237)
!249 = !DILocation(line: 336, column: 57, scope: !237)
!250 = !DILocation(line: 337, column: 10, scope: !237)
!251 = !DILocation(line: 337, column: 22, scope: !237)
!252 = !DILocation(line: 336, column: 2, scope: !237)
!253 = !DILocation(line: 338, column: 2, scope: !237)
!254 = !DILocation(line: 338, column: 14, scope: !237)
!255 = !DILocation(line: 338, column: 22, scope: !237)
!256 = !DILocation(line: 340, column: 2, scope: !237)
!257 = !DILocation(line: 341, column: 1, scope: !237)
!258 = distinct !DISubprogram(name: "acpi_tb_validate_table", scope: !3, file: !3, line: 292, type: !259, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!259 = !DISubroutineType(types: !260)
!260 = !{!51, !69}
!261 = !DILocalVariable(name: "table_desc", arg: 1, scope: !258, file: !3, line: 292, type: !69)
!262 = !DILocation(line: 292, column: 60, scope: !258)
!263 = !DILocalVariable(name: "status", scope: !258, file: !3, line: 294, type: !51)
!264 = !DILocation(line: 294, column: 14, scope: !258)
!265 = !DILocation(line: 300, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !258, file: !3, line: 300, column: 6)
!267 = !DILocation(line: 300, column: 19, scope: !266)
!268 = !DILocation(line: 300, column: 6, scope: !258)
!269 = !DILocation(line: 301, column: 34, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !3, line: 300, column: 28)
!271 = !DILocation(line: 301, column: 47, scope: !270)
!272 = !DILocation(line: 301, column: 59, scope: !270)
!273 = !DILocation(line: 302, column: 14, scope: !270)
!274 = !DILocation(line: 302, column: 26, scope: !270)
!275 = !DILocation(line: 303, column: 14, scope: !270)
!276 = !DILocation(line: 303, column: 26, scope: !270)
!277 = !DILocation(line: 301, column: 12, scope: !270)
!278 = !DILocation(line: 301, column: 10, scope: !270)
!279 = !DILocation(line: 304, column: 8, scope: !280)
!280 = distinct !DILexicalBlock(scope: !270, file: !3, line: 304, column: 7)
!281 = !DILocation(line: 304, column: 20, scope: !280)
!282 = !DILocation(line: 304, column: 7, scope: !270)
!283 = !DILocation(line: 305, column: 11, scope: !284)
!284 = distinct !DILexicalBlock(scope: !280, file: !3, line: 304, column: 29)
!285 = !DILocation(line: 306, column: 3, scope: !284)
!286 = !DILocation(line: 307, column: 2, scope: !270)
!287 = !DILocation(line: 309, column: 2, scope: !258)
!288 = distinct !DISubprogram(name: "acpi_tb_validate_temp_table", scope: !3, file: !3, line: 356, type: !259, scopeLine: 357, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!289 = !DILocalVariable(name: "table_desc", arg: 1, scope: !288, file: !3, line: 356, type: !69)
!290 = !DILocation(line: 356, column: 65, scope: !288)
!291 = !DILocation(line: 359, column: 7, scope: !292)
!292 = distinct !DILexicalBlock(scope: !288, file: !3, line: 359, column: 6)
!293 = !DILocation(line: 359, column: 19, scope: !292)
!294 = !DILocation(line: 359, column: 27, scope: !292)
!295 = !DILocation(line: 359, column: 31, scope: !292)
!296 = !DILocation(line: 359, column: 6, scope: !288)
!297 = !DILocation(line: 369, column: 3, scope: !298)
!298 = distinct !DILexicalBlock(scope: !292, file: !3, line: 359, column: 65)
!299 = !DILocation(line: 369, column: 15, scope: !298)
!300 = !DILocation(line: 369, column: 22, scope: !298)
!301 = !DILocation(line: 370, column: 2, scope: !298)
!302 = !DILocation(line: 372, column: 33, scope: !288)
!303 = !DILocation(line: 372, column: 10, scope: !288)
!304 = !DILocation(line: 372, column: 2, scope: !288)
!305 = distinct !DISubprogram(name: "acpi_tb_verify_temp_table", scope: !3, file: !3, line: 467, type: !306, scopeLine: 469, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!306 = !DISubroutineType(types: !307)
!307 = !{!51, !69, !308, !14}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!309 = !DILocalVariable(name: "table_desc", arg: 1, scope: !305, file: !3, line: 467, type: !69)
!310 = !DILocation(line: 467, column: 51, scope: !305)
!311 = !DILocalVariable(name: "signature", arg: 2, scope: !305, file: !3, line: 468, type: !308)
!312 = !DILocation(line: 468, column: 12, scope: !305)
!313 = !DILocalVariable(name: "table_index", arg: 3, scope: !305, file: !3, line: 468, type: !14)
!314 = !DILocation(line: 468, column: 28, scope: !305)
!315 = !DILocalVariable(name: "status", scope: !305, file: !3, line: 470, type: !51)
!316 = !DILocation(line: 470, column: 14, scope: !305)
!317 = !DILocation(line: 476, column: 39, scope: !305)
!318 = !DILocation(line: 476, column: 11, scope: !305)
!319 = !DILocation(line: 476, column: 9, scope: !305)
!320 = !DILocation(line: 477, column: 6, scope: !321)
!321 = distinct !DILexicalBlock(scope: !305, file: !3, line: 477, column: 6)
!322 = !DILocation(line: 477, column: 6, scope: !305)
!323 = !DILocation(line: 478, column: 3, scope: !324)
!324 = distinct !DILexicalBlock(scope: !321, file: !3, line: 477, column: 28)
!325 = !DILocation(line: 483, column: 6, scope: !326)
!326 = distinct !DILexicalBlock(scope: !305, file: !3, line: 483, column: 6)
!327 = !DILocation(line: 483, column: 16, scope: !326)
!328 = !DILocation(line: 484, column: 7, scope: !326)
!329 = !DILocation(line: 483, column: 6, scope: !305)
!330 = !DILocation(line: 485, column: 3, scope: !331)
!331 = distinct !DILexicalBlock(scope: !326, file: !3, line: 484, column: 64)
!332 = !DILocation(line: 488, column: 10, scope: !331)
!333 = !DILocation(line: 489, column: 3, scope: !331)
!334 = !DILocation(line: 492, column: 6, scope: !335)
!335 = distinct !DILexicalBlock(scope: !305, file: !3, line: 492, column: 6)
!336 = !DILocation(line: 492, column: 6, scope: !305)
!337 = !DILocation(line: 497, column: 31, scope: !338)
!338 = distinct !DILexicalBlock(scope: !335, file: !3, line: 492, column: 40)
!339 = !DILocation(line: 497, column: 43, scope: !338)
!340 = !DILocation(line: 498, column: 10, scope: !338)
!341 = !DILocation(line: 498, column: 22, scope: !338)
!342 = !DILocation(line: 497, column: 7, scope: !338)
!343 = !DILocation(line: 496, column: 10, scope: !338)
!344 = !DILocation(line: 499, column: 7, scope: !345)
!345 = distinct !DILexicalBlock(scope: !338, file: !3, line: 499, column: 7)
!346 = !DILocation(line: 499, column: 7, scope: !338)
!347 = !DILocation(line: 500, column: 4, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !3, line: 499, column: 29)
!349 = !DILocation(line: 510, column: 4, scope: !348)
!350 = !DILocation(line: 515, column: 7, scope: !351)
!351 = distinct !DILexicalBlock(scope: !338, file: !3, line: 515, column: 7)
!352 = !DILocation(line: 515, column: 7, scope: !338)
!353 = !DILocation(line: 517, column: 34, scope: !354)
!354 = distinct !DILexicalBlock(scope: !351, file: !3, line: 515, column: 20)
!355 = !DILocation(line: 517, column: 46, scope: !354)
!356 = !DILocation(line: 517, column: 8, scope: !354)
!357 = !DILocation(line: 516, column: 11, scope: !354)
!358 = !DILocation(line: 518, column: 8, scope: !359)
!359 = distinct !DILexicalBlock(scope: !354, file: !3, line: 518, column: 8)
!360 = !DILocation(line: 518, column: 8, scope: !354)
!361 = !DILocation(line: 519, column: 9, scope: !362)
!362 = distinct !DILexicalBlock(scope: !363, file: !3, line: 519, column: 9)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 518, column: 30)
!364 = !DILocation(line: 519, column: 16, scope: !362)
!365 = !DILocation(line: 519, column: 9, scope: !363)
!366 = !DILocation(line: 520, column: 6, scope: !367)
!367 = distinct !DILexicalBlock(scope: !362, file: !3, line: 519, column: 38)
!368 = !DILocation(line: 530, column: 5, scope: !367)
!369 = !DILocation(line: 532, column: 5, scope: !363)
!370 = !DILocation(line: 534, column: 3, scope: !354)
!371 = !DILocation(line: 536, column: 3, scope: !338)
!372 = !DILocation(line: 536, column: 15, scope: !338)
!373 = !DILocation(line: 536, column: 21, scope: !338)
!374 = !DILocation(line: 537, column: 2, scope: !338)
!375 = !DILocation(line: 539, column: 2, scope: !305)
!376 = !DILabel(scope: !305, name: "invalidate_and_exit", file: !3, line: 541)
!377 = !DILocation(line: 541, column: 1, scope: !305)
!378 = !DILocation(line: 542, column: 27, scope: !305)
!379 = !DILocation(line: 542, column: 2, scope: !305)
!380 = !DILocation(line: 543, column: 2, scope: !305)
!381 = !DILocation(line: 544, column: 1, scope: !305)
!382 = distinct !DISubprogram(name: "acpi_tb_check_duplication", scope: !3, file: !3, line: 392, type: !383, scopeLine: 393, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !88)
!383 = !DISubroutineType(types: !384)
!384 = !{!51, !69, !14}
!385 = !DILocalVariable(name: "table_desc", arg: 1, scope: !382, file: !3, line: 392, type: !69)
!386 = !DILocation(line: 392, column: 51, scope: !382)
!387 = !DILocalVariable(name: "table_index", arg: 2, scope: !382, file: !3, line: 392, type: !14)
!388 = !DILocation(line: 392, column: 68, scope: !382)
!389 = !DILocalVariable(name: "i", scope: !382, file: !3, line: 394, type: !15)
!390 = !DILocation(line: 394, column: 6, scope: !382)
!391 = !DILocation(line: 400, column: 9, scope: !392)
!392 = distinct !DILexicalBlock(scope: !382, file: !3, line: 400, column: 2)
!393 = !DILocation(line: 400, column: 7, scope: !392)
!394 = !DILocation(line: 400, column: 14, scope: !395)
!395 = distinct !DILexicalBlock(scope: !392, file: !3, line: 400, column: 2)
!396 = !DILocation(line: 400, column: 43, scope: !395)
!397 = !DILocation(line: 400, column: 16, scope: !395)
!398 = !DILocation(line: 400, column: 2, scope: !392)
!399 = !DILocation(line: 405, column: 33, scope: !400)
!400 = distinct !DILexicalBlock(scope: !401, file: !3, line: 404, column: 7)
!401 = distinct !DILexicalBlock(scope: !395, file: !3, line: 400, column: 69)
!402 = !DILocation(line: 405, column: 40, scope: !400)
!403 = !DILocation(line: 405, column: 8, scope: !400)
!404 = !DILocation(line: 406, column: 8, scope: !400)
!405 = !DILocation(line: 406, column: 14, scope: !400)
!406 = !DILocation(line: 404, column: 7, scope: !401)
!407 = !DILocation(line: 407, column: 4, scope: !408)
!408 = distinct !DILexicalBlock(scope: !400, file: !3, line: 406, column: 41)
!409 = !DILocation(line: 414, column: 31, scope: !410)
!410 = distinct !DILexicalBlock(scope: !401, file: !3, line: 414, column: 7)
!411 = !DILocation(line: 414, column: 43, scope: !410)
!412 = !DILocation(line: 414, column: 8, scope: !410)
!413 = !DILocation(line: 414, column: 7, scope: !401)
!414 = !DILocation(line: 415, column: 4, scope: !415)
!415 = distinct !DILexicalBlock(scope: !410, file: !3, line: 414, column: 47)
!416 = !DILocation(line: 432, column: 32, scope: !417)
!417 = distinct !DILexicalBlock(scope: !401, file: !3, line: 432, column: 7)
!418 = !DILocation(line: 432, column: 39, scope: !417)
!419 = !DILocation(line: 432, column: 7, scope: !417)
!420 = !DILocation(line: 432, column: 42, scope: !417)
!421 = !DILocation(line: 432, column: 48, scope: !417)
!422 = !DILocation(line: 432, column: 7, scope: !401)
!423 = !DILocation(line: 437, column: 4, scope: !424)
!424 = distinct !DILexicalBlock(scope: !417, file: !3, line: 433, column: 29)
!425 = !DILocation(line: 439, column: 19, scope: !426)
!426 = distinct !DILexicalBlock(scope: !417, file: !3, line: 438, column: 10)
!427 = !DILocation(line: 439, column: 5, scope: !426)
!428 = !DILocation(line: 439, column: 17, scope: !426)
!429 = !DILocation(line: 440, column: 4, scope: !426)
!430 = !DILocation(line: 400, column: 64, scope: !395)
!431 = !DILocation(line: 400, column: 2, scope: !395)
!432 = distinct !{!432, !398, !433}
!433 = !DILocation(line: 442, column: 2, scope: !392)
!434 = !DILocation(line: 446, column: 2, scope: !382)
!435 = !DILocation(line: 447, column: 1, scope: !382)
!436 = distinct !DISubprogram(name: "acpi_tb_resize_root_table_list", scope: !3, file: !3, line: 558, type: !437, scopeLine: 559, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!437 = !DISubroutineType(types: !438)
!438 = !{!51}
!439 = !DILocalVariable(name: "tables", scope: !436, file: !3, line: 560, type: !69)
!440 = !DILocation(line: 560, column: 26, scope: !436)
!441 = !DILocalVariable(name: "table_count", scope: !436, file: !3, line: 561, type: !15)
!442 = !DILocation(line: 561, column: 6, scope: !436)
!443 = !DILocalVariable(name: "current_table_count", scope: !436, file: !3, line: 562, type: !15)
!444 = !DILocation(line: 562, column: 6, scope: !436)
!445 = !DILocalVariable(name: "max_table_count", scope: !436, file: !3, line: 562, type: !15)
!446 = !DILocation(line: 562, column: 27, scope: !436)
!447 = !DILocalVariable(name: "i", scope: !436, file: !3, line: 563, type: !15)
!448 = !DILocation(line: 563, column: 6, scope: !436)
!449 = !DILocation(line: 569, column: 33, scope: !450)
!450 = distinct !DILexicalBlock(scope: !436, file: !3, line: 569, column: 6)
!451 = !DILocation(line: 569, column: 8, scope: !450)
!452 = !DILocation(line: 569, column: 39, scope: !450)
!453 = !DILocation(line: 569, column: 6, scope: !436)
!454 = !DILocation(line: 570, column: 3, scope: !455)
!455 = distinct !DILexicalBlock(scope: !450, file: !3, line: 569, column: 66)
!456 = !DILocation(line: 572, column: 3, scope: !455)
!457 = !DILocation(line: 577, column: 31, scope: !458)
!458 = distinct !DILexicalBlock(scope: !436, file: !3, line: 577, column: 6)
!459 = !DILocation(line: 577, column: 6, scope: !458)
!460 = !DILocation(line: 577, column: 37, scope: !458)
!461 = !DILocation(line: 577, column: 6, scope: !436)
!462 = !DILocation(line: 578, column: 42, scope: !463)
!463 = distinct !DILexicalBlock(scope: !458, file: !3, line: 577, column: 67)
!464 = !DILocation(line: 578, column: 15, scope: !463)
!465 = !DILocation(line: 579, column: 2, scope: !463)
!466 = !DILocation(line: 580, column: 42, scope: !467)
!467 = distinct !DILexicalBlock(scope: !458, file: !3, line: 579, column: 9)
!468 = !DILocation(line: 580, column: 15, scope: !467)
!469 = !DILocation(line: 583, column: 20, scope: !436)
!470 = !DILocation(line: 583, column: 32, scope: !436)
!471 = !DILocation(line: 583, column: 18, scope: !436)
!472 = !DILocation(line: 584, column: 11, scope: !436)
!473 = !DILocation(line: 584, column: 9, scope: !436)
!474 = !DILocation(line: 586, column: 7, scope: !475)
!475 = distinct !DILexicalBlock(scope: !436, file: !3, line: 586, column: 6)
!476 = !DILocation(line: 586, column: 6, scope: !436)
!477 = !DILocation(line: 587, column: 3, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !3, line: 586, column: 15)
!479 = !DILocation(line: 589, column: 3, scope: !478)
!480 = !DILocation(line: 594, column: 22, scope: !436)
!481 = !DILocation(line: 595, column: 31, scope: !482)
!482 = distinct !DILexicalBlock(scope: !436, file: !3, line: 595, column: 6)
!483 = !DILocation(line: 595, column: 6, scope: !482)
!484 = !DILocation(line: 595, column: 6, scope: !436)
!485 = !DILocation(line: 596, column: 10, scope: !486)
!486 = distinct !DILexicalBlock(scope: !487, file: !3, line: 596, column: 3)
!487 = distinct !DILexicalBlock(scope: !482, file: !3, line: 595, column: 39)
!488 = !DILocation(line: 596, column: 8, scope: !486)
!489 = !DILocation(line: 596, column: 15, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !3, line: 596, column: 3)
!491 = !DILocation(line: 596, column: 19, scope: !490)
!492 = !DILocation(line: 596, column: 17, scope: !490)
!493 = !DILocation(line: 596, column: 3, scope: !486)
!494 = !DILocation(line: 597, column: 33, scope: !495)
!495 = distinct !DILexicalBlock(scope: !496, file: !3, line: 597, column: 8)
!496 = distinct !DILexicalBlock(scope: !490, file: !3, line: 596, column: 37)
!497 = !DILocation(line: 597, column: 40, scope: !495)
!498 = !DILocation(line: 597, column: 8, scope: !495)
!499 = !DILocation(line: 597, column: 43, scope: !495)
!500 = !DILocation(line: 597, column: 8, scope: !496)
!501 = !DILocation(line: 598, column: 12, scope: !502)
!502 = distinct !DILexicalBlock(scope: !495, file: !3, line: 597, column: 52)
!503 = !DILocation(line: 598, column: 21, scope: !502)
!504 = !DILocation(line: 598, column: 19, scope: !502)
!505 = !DILocation(line: 598, column: 5, scope: !502)
!506 = !DILocation(line: 599, column: 37, scope: !502)
!507 = !DILocation(line: 599, column: 46, scope: !502)
!508 = !DILocation(line: 599, column: 44, scope: !502)
!509 = !DILocation(line: 601, column: 24, scope: !502)
!510 = !DILocation(line: 602, column: 4, scope: !502)
!511 = !DILocation(line: 603, column: 3, scope: !496)
!512 = !DILocation(line: 596, column: 33, scope: !490)
!513 = !DILocation(line: 596, column: 3, scope: !490)
!514 = distinct !{!514, !493, !515}
!515 = !DILocation(line: 603, column: 3, scope: !486)
!516 = !DILocation(line: 605, column: 32, scope: !517)
!517 = distinct !DILexicalBlock(scope: !487, file: !3, line: 605, column: 7)
!518 = !DILocation(line: 605, column: 7, scope: !517)
!519 = !DILocation(line: 605, column: 38, scope: !517)
!520 = !DILocation(line: 605, column: 7, scope: !487)
!521 = !DILocation(line: 606, column: 4, scope: !522)
!522 = distinct !DILexicalBlock(scope: !517, file: !3, line: 605, column: 68)
!523 = !DILocation(line: 607, column: 3, scope: !522)
!524 = !DILocation(line: 608, column: 2, scope: !487)
!525 = !DILocation(line: 610, column: 36, scope: !436)
!526 = !DILocation(line: 610, column: 34, scope: !436)
!527 = !DILocation(line: 611, column: 45, scope: !436)
!528 = !DILocation(line: 611, column: 43, scope: !436)
!529 = !DILocation(line: 612, column: 49, scope: !436)
!530 = !DILocation(line: 612, column: 47, scope: !436)
!531 = !DILocation(line: 613, column: 33, scope: !436)
!532 = !DILocation(line: 615, column: 2, scope: !436)
!533 = !DILocation(line: 616, column: 1, scope: !436)
!534 = distinct !DISubprogram(name: "acpi_os_allocate_zeroed", scope: !535, file: !535, line: 55, type: !536, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !88)
!535 = !DIFile(filename: "./include/acpi/platform/aclinuxex.h", directory: "/home/lizy2001/genbc/linux")
!536 = !DISubroutineType(types: !537)
!537 = !{!19, !46}
!538 = !DILocalVariable(name: "flags", arg: 1, scope: !539, file: !540, line: 162, type: !54)
!539 = distinct !DISubprogram(name: "arch_irqs_disabled_flags", scope: !540, file: !540, line: 162, type: !541, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !88)
!540 = !DIFile(filename: "./arch/x86/include/asm/irqflags.h", directory: "/home/lizy2001/genbc/linux")
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !54}
!543 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!544 = !DILocation(line: 162, column: 67, scope: !539, inlinedAt: !545)
!545 = distinct !DILocation(line: 57, column: 23, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !535, line: 57, column: 23)
!547 = distinct !DILexicalBlock(scope: !534, file: !535, line: 57, column: 23)
!548 = !DILocalVariable(name: "size", arg: 1, scope: !534, file: !535, line: 55, type: !46)
!549 = !DILocation(line: 55, column: 55, scope: !534)
!550 = !DILocation(line: 57, column: 17, scope: !534)
!551 = !DILocalVariable(name: "_flags", scope: !547, file: !535, line: 57, type: !54)
!552 = !DILocation(line: 57, column: 23, scope: !547)
!553 = !DILocalVariable(name: "__dummy", scope: !554, file: !535, line: 57, type: !54)
!554 = distinct !DILexicalBlock(scope: !555, file: !535, line: 57, column: 23)
!555 = distinct !DILexicalBlock(scope: !547, file: !535, line: 57, column: 23)
!556 = !DILocation(line: 57, column: 23, scope: !554)
!557 = !DILocalVariable(name: "__dummy2", scope: !554, file: !535, line: 57, type: !54)
!558 = !DILocation(line: 57, column: 23, scope: !555)
!559 = !DILocalVariable(name: "__dummy", scope: !560, file: !535, line: 57, type: !54)
!560 = distinct !DILexicalBlock(scope: !546, file: !535, line: 57, column: 23)
!561 = !DILocation(line: 57, column: 23, scope: !560)
!562 = !DILocalVariable(name: "__dummy2", scope: !560, file: !535, line: 57, type: !54)
!563 = !DILocation(line: 57, column: 23, scope: !546)
!564 = !DILocation(line: 164, column: 11, scope: !539, inlinedAt: !545)
!565 = !DILocation(line: 164, column: 17, scope: !539, inlinedAt: !545)
!566 = !DILocation(line: 164, column: 9, scope: !539, inlinedAt: !545)
!567 = !DILocation(line: 57, column: 23, scope: !534)
!568 = !DILocation(line: 57, column: 9, scope: !534)
!569 = !DILocation(line: 57, column: 2, scope: !534)
!570 = distinct !DISubprogram(name: "acpi_os_free", scope: !535, file: !535, line: 60, type: !571, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !88)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !19}
!573 = !DILocalVariable(name: "memory", arg: 1, scope: !570, file: !535, line: 60, type: !19)
!574 = !DILocation(line: 60, column: 39, scope: !570)
!575 = !DILocation(line: 62, column: 8, scope: !570)
!576 = !DILocation(line: 62, column: 2, scope: !570)
!577 = !DILocation(line: 63, column: 1, scope: !570)
!578 = distinct !DISubprogram(name: "acpi_tb_get_next_table_descriptor", scope: !3, file: !3, line: 632, type: !579, scopeLine: 634, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!579 = !DISubroutineType(types: !580)
!580 = !{!51, !14, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!582 = !DILocalVariable(name: "table_index", arg: 1, scope: !578, file: !3, line: 632, type: !14)
!583 = !DILocation(line: 632, column: 40, scope: !578)
!584 = !DILocalVariable(name: "table_desc", arg: 2, scope: !578, file: !3, line: 633, type: !581)
!585 = !DILocation(line: 633, column: 32, scope: !578)
!586 = !DILocalVariable(name: "status", scope: !578, file: !3, line: 635, type: !51)
!587 = !DILocation(line: 635, column: 14, scope: !578)
!588 = !DILocalVariable(name: "i", scope: !578, file: !3, line: 636, type: !15)
!589 = !DILocation(line: 636, column: 6, scope: !578)
!590 = !DILocation(line: 640, column: 31, scope: !591)
!591 = distinct !DILexicalBlock(scope: !578, file: !3, line: 640, column: 6)
!592 = !DILocation(line: 641, column: 31, scope: !591)
!593 = !DILocation(line: 640, column: 51, scope: !591)
!594 = !DILocation(line: 640, column: 6, scope: !578)
!595 = !DILocation(line: 642, column: 12, scope: !596)
!596 = distinct !DILexicalBlock(scope: !591, file: !3, line: 641, column: 48)
!597 = !DILocation(line: 642, column: 10, scope: !596)
!598 = !DILocation(line: 643, column: 7, scope: !599)
!599 = distinct !DILexicalBlock(scope: !596, file: !3, line: 643, column: 7)
!600 = !DILocation(line: 643, column: 7, scope: !596)
!601 = !DILocation(line: 644, column: 12, scope: !602)
!602 = distinct !DILexicalBlock(scope: !599, file: !3, line: 643, column: 29)
!603 = !DILocation(line: 644, column: 4, scope: !602)
!604 = !DILocation(line: 646, column: 2, scope: !596)
!605 = !DILocation(line: 648, column: 31, scope: !578)
!606 = !DILocation(line: 648, column: 4, scope: !578)
!607 = !DILocation(line: 649, column: 46, scope: !578)
!608 = !DILocation(line: 651, column: 6, scope: !609)
!609 = distinct !DILexicalBlock(scope: !578, file: !3, line: 651, column: 6)
!610 = !DILocation(line: 651, column: 6, scope: !578)
!611 = !DILocation(line: 652, column: 18, scope: !612)
!612 = distinct !DILexicalBlock(scope: !609, file: !3, line: 651, column: 19)
!613 = !DILocation(line: 652, column: 4, scope: !612)
!614 = !DILocation(line: 652, column: 16, scope: !612)
!615 = !DILocation(line: 653, column: 2, scope: !612)
!616 = !DILocation(line: 654, column: 6, scope: !617)
!617 = distinct !DILexicalBlock(scope: !578, file: !3, line: 654, column: 6)
!618 = !DILocation(line: 654, column: 6, scope: !578)
!619 = !DILocation(line: 655, column: 43, scope: !620)
!620 = distinct !DILexicalBlock(scope: !617, file: !3, line: 654, column: 18)
!621 = !DILocation(line: 655, column: 50, scope: !620)
!622 = !DILocation(line: 655, column: 18, scope: !620)
!623 = !DILocation(line: 655, column: 4, scope: !620)
!624 = !DILocation(line: 655, column: 15, scope: !620)
!625 = !DILocation(line: 656, column: 2, scope: !620)
!626 = !DILocation(line: 658, column: 2, scope: !578)
!627 = !DILocation(line: 659, column: 1, scope: !578)
!628 = distinct !DISubprogram(name: "acpi_tb_terminate", scope: !3, file: !3, line: 673, type: !629, scopeLine: 674, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!629 = !DISubroutineType(types: !630)
!630 = !{null}
!631 = !DILocalVariable(name: "i", scope: !628, file: !3, line: 675, type: !15)
!632 = !DILocation(line: 675, column: 6, scope: !628)
!633 = !DILocation(line: 679, column: 8, scope: !628)
!634 = !DILocation(line: 683, column: 9, scope: !635)
!635 = distinct !DILexicalBlock(scope: !628, file: !3, line: 683, column: 2)
!636 = !DILocation(line: 683, column: 7, scope: !635)
!637 = !DILocation(line: 683, column: 14, scope: !638)
!638 = distinct !DILexicalBlock(scope: !635, file: !3, line: 683, column: 2)
!639 = !DILocation(line: 683, column: 43, scope: !638)
!640 = !DILocation(line: 683, column: 16, scope: !638)
!641 = !DILocation(line: 683, column: 2, scope: !635)
!642 = !DILocation(line: 684, column: 53, scope: !643)
!643 = distinct !DILexicalBlock(scope: !638, file: !3, line: 683, column: 69)
!644 = !DILocation(line: 684, column: 60, scope: !643)
!645 = !DILocation(line: 684, column: 28, scope: !643)
!646 = !DILocation(line: 684, column: 3, scope: !643)
!647 = !DILocation(line: 685, column: 2, scope: !643)
!648 = !DILocation(line: 683, column: 65, scope: !638)
!649 = !DILocation(line: 683, column: 2, scope: !638)
!650 = distinct !{!650, !641, !651}
!651 = !DILocation(line: 685, column: 2, scope: !635)
!652 = !DILocation(line: 691, column: 31, scope: !653)
!653 = distinct !DILexicalBlock(scope: !628, file: !3, line: 691, column: 6)
!654 = !DILocation(line: 691, column: 6, scope: !653)
!655 = !DILocation(line: 691, column: 37, scope: !653)
!656 = !DILocation(line: 691, column: 6, scope: !628)
!657 = !DILocation(line: 692, column: 3, scope: !658)
!658 = distinct !DILexicalBlock(scope: !653, file: !3, line: 691, column: 67)
!659 = !DILocation(line: 693, column: 2, scope: !658)
!660 = !DILocation(line: 695, column: 34, scope: !628)
!661 = !DILocation(line: 696, column: 33, scope: !628)
!662 = !DILocation(line: 697, column: 47, scope: !628)
!663 = !DILocation(line: 701, column: 8, scope: !628)
!664 = !DILocation(line: 702, column: 2, scope: !628)
!665 = distinct !DISubprogram(name: "acpi_tb_delete_namespace_by_owner", scope: !3, file: !3, line: 717, type: !666, scopeLine: 718, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!666 = !DISubroutineType(types: !667)
!667 = !{!51, !15}
!668 = !DILocalVariable(name: "table_index", arg: 1, scope: !665, file: !3, line: 717, type: !15)
!669 = !DILocation(line: 717, column: 51, scope: !665)
!670 = !DILocalVariable(name: "owner_id", scope: !665, file: !3, line: 719, type: !82)
!671 = !DILocation(line: 719, column: 16, scope: !665)
!672 = !DILocalVariable(name: "status", scope: !665, file: !3, line: 720, type: !51)
!673 = !DILocation(line: 720, column: 14, scope: !665)
!674 = !DILocation(line: 724, column: 11, scope: !665)
!675 = !DILocation(line: 724, column: 9, scope: !665)
!676 = !DILocation(line: 725, column: 6, scope: !677)
!677 = distinct !DILexicalBlock(scope: !665, file: !3, line: 725, column: 6)
!678 = !DILocation(line: 725, column: 6, scope: !665)
!679 = !DILocation(line: 726, column: 3, scope: !680)
!680 = distinct !DILexicalBlock(scope: !677, file: !3, line: 725, column: 28)
!681 = !DILocation(line: 729, column: 6, scope: !682)
!682 = distinct !DILexicalBlock(scope: !665, file: !3, line: 729, column: 6)
!683 = !DILocation(line: 729, column: 46, scope: !682)
!684 = !DILocation(line: 729, column: 18, scope: !682)
!685 = !DILocation(line: 729, column: 6, scope: !665)
!686 = !DILocation(line: 733, column: 9, scope: !687)
!687 = distinct !DILexicalBlock(scope: !682, file: !3, line: 729, column: 67)
!688 = !DILocation(line: 734, column: 3, scope: !687)
!689 = !DILocation(line: 739, column: 38, scope: !665)
!690 = !DILocation(line: 739, column: 45, scope: !665)
!691 = !DILocation(line: 739, column: 13, scope: !665)
!692 = !DILocation(line: 739, column: 58, scope: !665)
!693 = !DILocation(line: 739, column: 11, scope: !665)
!694 = !DILocation(line: 740, column: 8, scope: !665)
!695 = !DILocation(line: 749, column: 11, scope: !665)
!696 = !DILocation(line: 749, column: 9, scope: !665)
!697 = !DILocation(line: 750, column: 6, scope: !698)
!698 = distinct !DILexicalBlock(scope: !665, file: !3, line: 750, column: 6)
!699 = !DILocation(line: 750, column: 6, scope: !665)
!700 = !DILocation(line: 751, column: 3, scope: !701)
!701 = distinct !DILexicalBlock(scope: !698, file: !3, line: 750, column: 28)
!702 = !DILocation(line: 754, column: 36, scope: !665)
!703 = !DILocation(line: 754, column: 2, scope: !665)
!704 = !DILocation(line: 755, column: 2, scope: !665)
!705 = !DILocation(line: 756, column: 2, scope: !665)
!706 = !DILocation(line: 757, column: 1, scope: !665)
!707 = distinct !DISubprogram(name: "acpi_tb_allocate_owner_id", scope: !3, file: !3, line: 771, type: !666, scopeLine: 772, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!708 = !DILocalVariable(name: "table_index", arg: 1, scope: !707, file: !3, line: 771, type: !15)
!709 = !DILocation(line: 771, column: 43, scope: !707)
!710 = !DILocalVariable(name: "status", scope: !707, file: !3, line: 773, type: !51)
!711 = !DILocation(line: 773, column: 14, scope: !707)
!712 = !DILocation(line: 777, column: 8, scope: !707)
!713 = !DILocation(line: 778, column: 6, scope: !714)
!714 = distinct !DILexicalBlock(scope: !707, file: !3, line: 778, column: 6)
!715 = !DILocation(line: 778, column: 45, scope: !714)
!716 = !DILocation(line: 778, column: 18, scope: !714)
!717 = !DILocation(line: 778, column: 6, scope: !707)
!718 = !DILocation(line: 782, column: 13, scope: !719)
!719 = distinct !DILexicalBlock(scope: !714, file: !3, line: 778, column: 66)
!720 = !DILocation(line: 782, column: 20, scope: !719)
!721 = !DILocation(line: 781, column: 13, scope: !719)
!722 = !DILocation(line: 782, column: 33, scope: !719)
!723 = !DILocation(line: 780, column: 7, scope: !719)
!724 = !DILocation(line: 779, column: 10, scope: !719)
!725 = !DILocation(line: 783, column: 2, scope: !719)
!726 = !DILocation(line: 785, column: 8, scope: !707)
!727 = !DILocation(line: 786, column: 2, scope: !707)
!728 = distinct !DISubprogram(name: "acpi_tb_release_owner_id", scope: !3, file: !3, line: 801, type: !666, scopeLine: 802, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!729 = !DILocalVariable(name: "table_index", arg: 1, scope: !728, file: !3, line: 801, type: !15)
!730 = !DILocation(line: 801, column: 42, scope: !728)
!731 = !DILocalVariable(name: "status", scope: !728, file: !3, line: 803, type: !51)
!732 = !DILocation(line: 803, column: 14, scope: !728)
!733 = !DILocation(line: 807, column: 8, scope: !728)
!734 = !DILocation(line: 808, column: 6, scope: !735)
!735 = distinct !DILexicalBlock(scope: !728, file: !3, line: 808, column: 6)
!736 = !DILocation(line: 808, column: 45, scope: !735)
!737 = !DILocation(line: 808, column: 18, scope: !735)
!738 = !DILocation(line: 808, column: 6, scope: !728)
!739 = !DILocation(line: 811, column: 8, scope: !740)
!740 = distinct !DILexicalBlock(scope: !735, file: !3, line: 808, column: 66)
!741 = !DILocation(line: 811, column: 15, scope: !740)
!742 = !DILocation(line: 810, column: 8, scope: !740)
!743 = !DILocation(line: 811, column: 28, scope: !740)
!744 = !DILocation(line: 809, column: 3, scope: !740)
!745 = !DILocation(line: 812, column: 10, scope: !740)
!746 = !DILocation(line: 813, column: 2, scope: !740)
!747 = !DILocation(line: 815, column: 8, scope: !728)
!748 = !DILocation(line: 816, column: 2, scope: !728)
!749 = distinct !DISubprogram(name: "acpi_tb_get_owner_id", scope: !3, file: !3, line: 832, type: !750, scopeLine: 833, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!750 = !DISubroutineType(types: !751)
!751 = !{!51, !15, !752}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!753 = !DILocalVariable(name: "table_index", arg: 1, scope: !749, file: !3, line: 832, type: !15)
!754 = !DILocation(line: 832, column: 38, scope: !749)
!755 = !DILocalVariable(name: "owner_id", arg: 2, scope: !749, file: !3, line: 832, type: !752)
!756 = !DILocation(line: 832, column: 66, scope: !749)
!757 = !DILocalVariable(name: "status", scope: !749, file: !3, line: 834, type: !51)
!758 = !DILocation(line: 834, column: 14, scope: !749)
!759 = !DILocation(line: 838, column: 8, scope: !749)
!760 = !DILocation(line: 839, column: 6, scope: !761)
!761 = distinct !DILexicalBlock(scope: !749, file: !3, line: 839, column: 6)
!762 = !DILocation(line: 839, column: 45, scope: !761)
!763 = !DILocation(line: 839, column: 18, scope: !761)
!764 = !DILocation(line: 839, column: 6, scope: !749)
!765 = !DILocation(line: 841, column: 32, scope: !766)
!766 = distinct !DILexicalBlock(scope: !761, file: !3, line: 839, column: 66)
!767 = !DILocation(line: 841, column: 39, scope: !766)
!768 = !DILocation(line: 841, column: 7, scope: !766)
!769 = !DILocation(line: 841, column: 52, scope: !766)
!770 = !DILocation(line: 840, column: 4, scope: !766)
!771 = !DILocation(line: 840, column: 13, scope: !766)
!772 = !DILocation(line: 842, column: 10, scope: !766)
!773 = !DILocation(line: 843, column: 2, scope: !766)
!774 = !DILocation(line: 845, column: 8, scope: !749)
!775 = !DILocation(line: 846, column: 2, scope: !749)
!776 = distinct !DISubprogram(name: "acpi_tb_is_table_loaded", scope: !3, file: !3, line: 859, type: !777, scopeLine: 860, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!777 = !DISubroutineType(types: !778)
!778 = !{!31, !15}
!779 = !DILocalVariable(name: "table_index", arg: 1, scope: !776, file: !3, line: 859, type: !15)
!780 = !DILocation(line: 859, column: 32, scope: !776)
!781 = !DILocalVariable(name: "is_loaded", scope: !776, file: !3, line: 861, type: !31)
!782 = !DILocation(line: 861, column: 5, scope: !776)
!783 = !DILocation(line: 863, column: 8, scope: !776)
!784 = !DILocation(line: 864, column: 6, scope: !785)
!785 = distinct !DILexicalBlock(scope: !776, file: !3, line: 864, column: 6)
!786 = !DILocation(line: 864, column: 45, scope: !785)
!787 = !DILocation(line: 864, column: 18, scope: !785)
!788 = !DILocation(line: 864, column: 6, scope: !776)
!789 = !DILocation(line: 866, column: 33, scope: !790)
!790 = distinct !DILexicalBlock(scope: !785, file: !3, line: 864, column: 66)
!791 = !DILocation(line: 866, column: 40, scope: !790)
!792 = !DILocation(line: 866, column: 8, scope: !790)
!793 = !DILocation(line: 866, column: 53, scope: !790)
!794 = !DILocation(line: 866, column: 59, scope: !790)
!795 = !DILocation(line: 865, column: 15, scope: !790)
!796 = !DILocation(line: 865, column: 13, scope: !790)
!797 = !DILocation(line: 868, column: 2, scope: !790)
!798 = !DILocation(line: 870, column: 8, scope: !776)
!799 = !DILocation(line: 871, column: 10, scope: !776)
!800 = !DILocation(line: 871, column: 2, scope: !776)
!801 = distinct !DISubprogram(name: "acpi_tb_set_table_loaded_flag", scope: !3, file: !3, line: 887, type: !802, scopeLine: 888, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !15, !31}
!804 = !DILocalVariable(name: "table_index", arg: 1, scope: !801, file: !3, line: 887, type: !15)
!805 = !DILocation(line: 887, column: 40, scope: !801)
!806 = !DILocalVariable(name: "is_loaded", arg: 2, scope: !801, file: !3, line: 887, type: !31)
!807 = !DILocation(line: 887, column: 56, scope: !801)
!808 = !DILocation(line: 890, column: 8, scope: !801)
!809 = !DILocation(line: 891, column: 6, scope: !810)
!810 = distinct !DILexicalBlock(scope: !801, file: !3, line: 891, column: 6)
!811 = !DILocation(line: 891, column: 45, scope: !810)
!812 = !DILocation(line: 891, column: 18, scope: !810)
!813 = !DILocation(line: 891, column: 6, scope: !801)
!814 = !DILocation(line: 892, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 892, column: 7)
!816 = distinct !DILexicalBlock(scope: !810, file: !3, line: 891, column: 66)
!817 = !DILocation(line: 892, column: 7, scope: !816)
!818 = !DILocation(line: 893, column: 29, scope: !819)
!819 = distinct !DILexicalBlock(scope: !815, file: !3, line: 892, column: 18)
!820 = !DILocation(line: 893, column: 36, scope: !819)
!821 = !DILocation(line: 893, column: 4, scope: !819)
!822 = !DILocation(line: 893, column: 49, scope: !819)
!823 = !DILocation(line: 893, column: 55, scope: !819)
!824 = !DILocation(line: 895, column: 3, scope: !819)
!825 = !DILocation(line: 896, column: 29, scope: !826)
!826 = distinct !DILexicalBlock(scope: !815, file: !3, line: 895, column: 10)
!827 = !DILocation(line: 896, column: 36, scope: !826)
!828 = !DILocation(line: 896, column: 4, scope: !826)
!829 = !DILocation(line: 896, column: 49, scope: !826)
!830 = !DILocation(line: 896, column: 55, scope: !826)
!831 = !DILocation(line: 899, column: 2, scope: !816)
!832 = !DILocation(line: 901, column: 8, scope: !801)
!833 = !DILocation(line: 902, column: 1, scope: !801)
!834 = distinct !DISubprogram(name: "acpi_tb_load_table", scope: !3, file: !3, line: 918, type: !835, scopeLine: 919, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!835 = !DISubroutineType(types: !836)
!836 = !{!51, !15, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !839, line: 133, size: 384, elements: !840)
!839 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!840 = !{!841, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !838, file: !839, line: 134, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !844, line: 367, size: 576, elements: !845)
!844 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!845 = !{!846, !854, !867, !877, !890, !904, !913, !1222, !1239, !1253, !1266, !1344, !1356, !1370, !1380, !1398, !1420, !1439, !1458, !1477, !1490, !1516, !1533, !1546, !1560, !1569}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !844, line: 368, baseType: !847, size: 128)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !844, line: 73, size: 128, elements: !848)
!848 = !{!849, !850, !851, !852, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !847, file: !844, line: 74, baseType: !842, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !847, file: !844, line: 74, baseType: !31, size: 8, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !847, file: !844, line: 74, baseType: !31, size: 8, offset: 72)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !847, file: !844, line: 74, baseType: !83, size: 16, offset: 80)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !847, file: !844, line: 74, baseType: !31, size: 8, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !843, file: !844, line: 369, baseType: !855, size: 192)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !844, line: 76, size: 192, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !866}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !855, file: !844, line: 77, baseType: !842, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !855, file: !844, line: 77, baseType: !31, size: 8, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !855, file: !844, line: 77, baseType: !31, size: 8, offset: 72)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !855, file: !844, line: 77, baseType: !83, size: 16, offset: 80)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !855, file: !844, line: 77, baseType: !31, size: 8, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !855, file: !844, line: 77, baseType: !863, size: 24, offset: 104)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 24, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 3)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !855, file: !844, line: 78, baseType: !48, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !843, file: !844, line: 370, baseType: !868, size: 256)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !844, line: 93, size: 256, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !868, file: !844, line: 94, baseType: !842, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !868, file: !844, line: 94, baseType: !31, size: 8, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !868, file: !844, line: 94, baseType: !31, size: 8, offset: 72)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !868, file: !844, line: 94, baseType: !83, size: 16, offset: 80)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !868, file: !844, line: 94, baseType: !31, size: 8, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !868, file: !844, line: 94, baseType: !308, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !868, file: !844, line: 94, baseType: !15, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !843, file: !844, line: 371, baseType: !878, size: 384)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !844, line: 97, size: 384, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !878, file: !844, line: 98, baseType: !842, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !878, file: !844, line: 98, baseType: !31, size: 8, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !878, file: !844, line: 98, baseType: !31, size: 8, offset: 72)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !878, file: !844, line: 98, baseType: !83, size: 16, offset: 80)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !878, file: !844, line: 98, baseType: !31, size: 8, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !878, file: !844, line: 98, baseType: !118, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !878, file: !844, line: 98, baseType: !15, size: 32, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !878, file: !844, line: 99, baseType: !15, size: 32, offset: 224)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !878, file: !844, line: 100, baseType: !118, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !878, file: !844, line: 101, baseType: !837, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !843, file: !844, line: 372, baseType: !891, size: 384)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !844, line: 104, size: 384, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !898, !899, !901, !902, !903}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !891, file: !844, line: 105, baseType: !842, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !891, file: !844, line: 105, baseType: !31, size: 8, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !891, file: !844, line: 105, baseType: !31, size: 8, offset: 72)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !891, file: !844, line: 105, baseType: !83, size: 16, offset: 80)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !891, file: !844, line: 105, baseType: !31, size: 8, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !891, file: !844, line: 105, baseType: !837, size: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !891, file: !844, line: 106, baseType: !900, size: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !891, file: !844, line: 107, baseType: !118, size: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !891, file: !844, line: 108, baseType: !15, size: 32, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !891, file: !844, line: 109, baseType: !15, size: 32, offset: 352)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !843, file: !844, line: 373, baseType: !905, size: 192)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !844, line: 118, size: 192, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !905, file: !844, line: 119, baseType: !842, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !905, file: !844, line: 119, baseType: !31, size: 8, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !905, file: !844, line: 119, baseType: !31, size: 8, offset: 72)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !905, file: !844, line: 119, baseType: !83, size: 16, offset: 80)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !905, file: !844, line: 119, baseType: !31, size: 8, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !905, file: !844, line: 119, baseType: !19, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !843, file: !844, line: 374, baseType: !914, size: 448)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !844, line: 143, size: 448, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !1219, !1220, !1221}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !914, file: !844, line: 144, baseType: !842, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !914, file: !844, line: 144, baseType: !31, size: 8, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !914, file: !844, line: 144, baseType: !31, size: 8, offset: 72)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !914, file: !844, line: 144, baseType: !83, size: 16, offset: 80)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !914, file: !844, line: 144, baseType: !31, size: 8, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !914, file: !844, line: 144, baseType: !31, size: 8, offset: 104)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !914, file: !844, line: 145, baseType: !31, size: 8, offset: 112)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !914, file: !844, line: 146, baseType: !31, size: 8, offset: 120)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !914, file: !844, line: 147, baseType: !842, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !914, file: !844, line: 148, baseType: !842, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !914, file: !844, line: 149, baseType: !118, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !914, file: !844, line: 153, baseType: !928, size: 64, offset: 320)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !914, file: !844, line: 150, size: 64, elements: !929)
!929 = !{!930, !1218}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !928, file: !844, line: 151, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !839, line: 248, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!51, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !937, line: 37, size: 9024, elements: !938)
!937 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!938 = !{!939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !1166, !1167, !1168, !1169, !1170, !1172, !1174, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1216}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !937, line: 38, baseType: !935, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !936, file: !937, line: 39, baseType: !31, size: 8, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !936, file: !937, line: 40, baseType: !31, size: 8, offset: 72)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !936, file: !937, line: 41, baseType: !83, size: 16, offset: 80)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !936, file: !937, line: 42, baseType: !31, size: 8, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !936, file: !937, line: 43, baseType: !31, size: 8, offset: 104)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !936, file: !937, line: 44, baseType: !31, size: 8, offset: 112)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !936, file: !937, line: 45, baseType: !82, size: 16, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !936, file: !937, line: 46, baseType: !31, size: 8, offset: 144)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !936, file: !937, line: 47, baseType: !31, size: 8, offset: 152)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !936, file: !937, line: 48, baseType: !31, size: 8, offset: 160)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !936, file: !937, line: 49, baseType: !31, size: 8, offset: 168)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !936, file: !937, line: 50, baseType: !31, size: 8, offset: 176)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !936, file: !937, line: 51, baseType: !31, size: 8, offset: 184)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !936, file: !937, line: 52, baseType: !31, size: 8, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !936, file: !937, line: 53, baseType: !31, size: 8, offset: 200)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !936, file: !937, line: 54, baseType: !118, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !936, file: !937, line: 55, baseType: !15, size: 32, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !936, file: !937, line: 56, baseType: !15, size: 32, offset: 352)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !936, file: !937, line: 57, baseType: !15, size: 32, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !936, file: !937, line: 58, baseType: !15, size: 32, offset: 416)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !936, file: !937, line: 60, baseType: !961, size: 640, offset: 448)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !839, line: 893, size: 640, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !1049, !1050, !1164, !1165}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !961, file: !839, line: 894, baseType: !118, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !961, file: !839, line: 895, baseType: !118, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !961, file: !839, line: 896, baseType: !118, size: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !961, file: !839, line: 897, baseType: !118, size: 64, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !961, file: !839, line: 898, baseType: !118, size: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !961, file: !839, line: 899, baseType: !969, size: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !839, line: 875, size: 1600, elements: !971)
!971 = !{!972, !992, !1008}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !839, line: 876, baseType: !973, size: 448)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !839, line: 828, size: 448, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !991}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !973, file: !839, line: 829, baseType: !969, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !973, file: !839, line: 829, baseType: !31, size: 8, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !973, file: !839, line: 829, baseType: !31, size: 8, offset: 72)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !973, file: !839, line: 829, baseType: !83, size: 16, offset: 80)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !973, file: !839, line: 829, baseType: !118, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !973, file: !839, line: 829, baseType: !969, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !973, file: !839, line: 829, baseType: !837, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !973, file: !839, line: 829, baseType: !983, size: 64, offset: 320)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !839, line: 716, size: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !983, file: !839, line: 717, baseType: !48, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !983, file: !839, line: 718, baseType: !15, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !983, file: !839, line: 719, baseType: !308, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !983, file: !839, line: 720, baseType: !118, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !839, line: 721, baseType: !308, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !983, file: !839, line: 722, baseType: !969, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !973, file: !839, line: 829, baseType: !31, size: 8, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !970, file: !839, line: 877, baseType: !993, size: 640)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !839, line: 835, size: 640, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !993, file: !839, line: 836, baseType: !969, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !993, file: !839, line: 836, baseType: !31, size: 8, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !839, line: 836, baseType: !31, size: 8, offset: 72)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !993, file: !839, line: 836, baseType: !83, size: 16, offset: 80)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !993, file: !839, line: 836, baseType: !118, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !993, file: !839, line: 836, baseType: !969, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !993, file: !839, line: 836, baseType: !837, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !993, file: !839, line: 836, baseType: !983, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !993, file: !839, line: 836, baseType: !31, size: 8, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !993, file: !839, line: 836, baseType: !308, size: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !993, file: !839, line: 837, baseType: !118, size: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !993, file: !839, line: 838, baseType: !15, size: 32, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !839, line: 839, baseType: !15, size: 32, offset: 608)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !970, file: !839, line: 878, baseType: !1009, size: 1600)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !839, line: 846, size: 1600, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1009, file: !839, line: 847, baseType: !969, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1009, file: !839, line: 847, baseType: !31, size: 8, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1009, file: !839, line: 847, baseType: !31, size: 8, offset: 72)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !1009, file: !839, line: 847, baseType: !83, size: 16, offset: 80)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !1009, file: !839, line: 847, baseType: !118, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !839, line: 847, baseType: !969, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1009, file: !839, line: 847, baseType: !837, size: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1009, file: !839, line: 847, baseType: !983, size: 64, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !1009, file: !839, line: 847, baseType: !31, size: 8, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !1009, file: !839, line: 847, baseType: !969, size: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !1009, file: !839, line: 848, baseType: !969, size: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1009, file: !839, line: 849, baseType: !308, size: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !1009, file: !839, line: 850, baseType: !31, size: 8, offset: 640)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !1009, file: !839, line: 851, baseType: !308, size: 64, offset: 704)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !1009, file: !839, line: 852, baseType: !308, size: 64, offset: 768)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !1009, file: !839, line: 853, baseType: !308, size: 64, offset: 832)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !1009, file: !839, line: 854, baseType: !25, size: 32, offset: 896)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !1009, file: !839, line: 855, baseType: !15, size: 32, offset: 928)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !1009, file: !839, line: 856, baseType: !15, size: 32, offset: 960)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !1009, file: !839, line: 857, baseType: !15, size: 32, offset: 992)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !1009, file: !839, line: 858, baseType: !15, size: 32, offset: 1024)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !1009, file: !839, line: 859, baseType: !15, size: 32, offset: 1056)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !1009, file: !839, line: 860, baseType: !15, size: 32, offset: 1088)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !1009, file: !839, line: 861, baseType: !15, size: 32, offset: 1120)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !1009, file: !839, line: 862, baseType: !15, size: 32, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !1009, file: !839, line: 863, baseType: !15, size: 32, offset: 1184)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !1009, file: !839, line: 864, baseType: !15, size: 32, offset: 1216)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !1009, file: !839, line: 865, baseType: !15, size: 32, offset: 1248)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !1009, file: !839, line: 866, baseType: !15, size: 32, offset: 1280)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !1009, file: !839, line: 867, baseType: !15, size: 32, offset: 1312)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !1009, file: !839, line: 868, baseType: !83, size: 16, offset: 1344)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !1009, file: !839, line: 869, baseType: !31, size: 8, offset: 1360)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !1009, file: !839, line: 870, baseType: !31, size: 8, offset: 1368)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !1009, file: !839, line: 871, baseType: !31, size: 8, offset: 1376)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !1009, file: !839, line: 872, baseType: !1046, size: 160, offset: 1384)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 160, elements: !1047)
!1047 = !{!1048}
!1048 = !DISubrange(count: 20)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !961, file: !839, line: 900, baseType: !837, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !961, file: !839, line: 901, baseType: !1051, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !839, line: 663, size: 640, elements: !1053)
!1053 = !{!1054, !1062, !1075, !1084, !1093, !1106, !1120, !1132, !1142}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !839, line: 664, baseType: !1055, size: 128)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !839, line: 567, size: 128, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !839, line: 568, baseType: !19, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1055, file: !839, line: 568, baseType: !31, size: 8, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1055, file: !839, line: 568, baseType: !31, size: 8, offset: 72)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1055, file: !839, line: 568, baseType: !83, size: 16, offset: 80)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1055, file: !839, line: 568, baseType: !83, size: 16, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1052, file: !839, line: 665, baseType: !1063, size: 384)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !839, line: 593, size: 384, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !839, line: 594, baseType: !19, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1063, file: !839, line: 594, baseType: !31, size: 8, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1063, file: !839, line: 594, baseType: !31, size: 8, offset: 72)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1063, file: !839, line: 594, baseType: !83, size: 16, offset: 80)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1063, file: !839, line: 594, baseType: !83, size: 16, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !1063, file: !839, line: 594, baseType: !83, size: 16, offset: 112)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !1063, file: !839, line: 595, baseType: !969, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !1063, file: !839, line: 596, baseType: !118, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !1063, file: !839, line: 597, baseType: !118, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !1063, file: !839, line: 598, baseType: !48, size: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1052, file: !839, line: 666, baseType: !1076, size: 192)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !839, line: 573, size: 192, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1076, file: !839, line: 574, baseType: !19, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1076, file: !839, line: 574, baseType: !31, size: 8, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1076, file: !839, line: 574, baseType: !31, size: 8, offset: 72)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1076, file: !839, line: 574, baseType: !83, size: 16, offset: 80)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1076, file: !839, line: 574, baseType: !83, size: 16, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1076, file: !839, line: 574, baseType: !842, size: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !1052, file: !839, line: 667, baseType: !1085, size: 192)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !839, line: 604, size: 192, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !839, line: 605, baseType: !19, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1085, file: !839, line: 605, baseType: !31, size: 8, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !839, line: 605, baseType: !31, size: 8, offset: 72)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1085, file: !839, line: 605, baseType: !83, size: 16, offset: 80)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1085, file: !839, line: 605, baseType: !83, size: 16, offset: 96)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1085, file: !839, line: 605, baseType: !837, size: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !1052, file: !839, line: 668, baseType: !1094, size: 448)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !839, line: 608, size: 448, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1094, file: !839, line: 609, baseType: !19, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1094, file: !839, line: 609, baseType: !31, size: 8, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1094, file: !839, line: 609, baseType: !31, size: 8, offset: 72)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1094, file: !839, line: 609, baseType: !83, size: 16, offset: 80)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1094, file: !839, line: 609, baseType: !83, size: 16, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !1094, file: !839, line: 609, baseType: !15, size: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1094, file: !839, line: 610, baseType: !969, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !1094, file: !839, line: 611, baseType: !118, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !1094, file: !839, line: 612, baseType: !118, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !1094, file: !839, line: 613, baseType: !15, size: 32, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !1052, file: !839, line: 669, baseType: !1107, size: 512)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !839, line: 580, size: 512, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1107, file: !839, line: 581, baseType: !19, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1107, file: !839, line: 581, baseType: !31, size: 8, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1107, file: !839, line: 581, baseType: !31, size: 8, offset: 72)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1107, file: !839, line: 581, baseType: !83, size: 16, offset: 80)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1107, file: !839, line: 581, baseType: !83, size: 16, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1107, file: !839, line: 581, baseType: !15, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !1107, file: !839, line: 582, baseType: !842, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !1107, file: !839, line: 583, baseType: !842, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !1107, file: !839, line: 584, baseType: !935, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !1107, file: !839, line: 585, baseType: !19, size: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !1107, file: !839, line: 586, baseType: !15, size: 32, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1052, file: !839, line: 670, baseType: !1121, size: 320)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !839, line: 620, size: 320, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1121, file: !839, line: 621, baseType: !19, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1121, file: !839, line: 621, baseType: !31, size: 8, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !839, line: 621, baseType: !31, size: 8, offset: 72)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1121, file: !839, line: 621, baseType: !83, size: 16, offset: 80)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1121, file: !839, line: 621, baseType: !83, size: 16, offset: 96)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !1121, file: !839, line: 621, baseType: !31, size: 8, offset: 112)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !1121, file: !839, line: 622, baseType: !935, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !1121, file: !839, line: 623, baseType: !842, size: 64, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !1121, file: !839, line: 624, baseType: !48, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !1052, file: !839, line: 671, baseType: !1133, size: 640)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !839, line: 631, size: 640, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1133, file: !839, line: 632, baseType: !19, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1133, file: !839, line: 632, baseType: !31, size: 8, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1133, file: !839, line: 632, baseType: !31, size: 8, offset: 72)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1133, file: !839, line: 632, baseType: !83, size: 16, offset: 80)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1133, file: !839, line: 632, baseType: !83, size: 16, offset: 96)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !1133, file: !839, line: 633, baseType: !1141, size: 512, offset: 128)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 512, elements: !41)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1052, file: !839, line: 672, baseType: !1143, size: 320)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !839, line: 654, size: 320, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1143, file: !839, line: 655, baseType: !19, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !1143, file: !839, line: 655, baseType: !31, size: 8, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !839, line: 655, baseType: !31, size: 8, offset: 72)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1143, file: !839, line: 655, baseType: !83, size: 16, offset: 80)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1143, file: !839, line: 655, baseType: !83, size: 16, offset: 96)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !1143, file: !839, line: 655, baseType: !31, size: 8, offset: 112)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1143, file: !839, line: 656, baseType: !837, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !1143, file: !839, line: 657, baseType: !842, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !1143, file: !839, line: 658, baseType: !1154, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !839, line: 645, size: 128, elements: !1156)
!1156 = !{!1157, !1163}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1155, file: !839, line: 646, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !47, line: 1052, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1162, !15, !19}
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !47, line: 424, baseType: !19)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1155, file: !839, line: 647, baseType: !19, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !961, file: !839, line: 902, baseType: !969, size: 64, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !961, file: !839, line: 903, baseType: !15, size: 32, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !936, file: !937, line: 61, baseType: !15, size: 32, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !936, file: !937, line: 62, baseType: !15, size: 32, offset: 1120)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !936, file: !937, line: 63, baseType: !83, size: 16, offset: 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !936, file: !937, line: 64, baseType: !31, size: 8, offset: 1168)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !936, file: !937, line: 66, baseType: !1171, size: 2688, offset: 1216)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 2688, elements: !58)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !936, file: !937, line: 67, baseType: !1173, size: 3072, offset: 3904)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 3072, elements: !41)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !936, file: !937, line: 68, baseType: !1175, size: 576, offset: 6976)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 576, elements: !1176)
!1176 = !{!1177}
!1177 = !DISubrange(count: 9)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !936, file: !937, line: 69, baseType: !900, size: 64, offset: 7552)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !936, file: !937, line: 71, baseType: !118, size: 64, offset: 7616)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !936, file: !937, line: 72, baseType: !900, size: 64, offset: 7680)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !936, file: !937, line: 73, baseType: !1051, size: 64, offset: 7744)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !936, file: !937, line: 74, baseType: !837, size: 64, offset: 7808)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !936, file: !937, line: 75, baseType: !842, size: 64, offset: 7872)
