; ModuleID = '../bcout/drivers/acpi/acpica/tbfadt.llvm.bc'
source_filename = "drivers/acpi/acpica/tbfadt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_list = type { %struct.acpi_table_desc*, i32, i32, i8 }
%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%union.acpi_name_union = type { i32 }
%struct.acpi_table_fadt = type <{ %struct.acpi_table_header, i32, i32, i8, i8, i16, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i8, i8, i8, i16, i8, i32, %struct.acpi_generic_address, i8, i16, i8, i64, i64, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, i64 }>
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>
%struct.acpi_fadt_info = type { i8*, i16, i16, i16, i8, i8 }
%struct.acpi_fadt_pm_info = type { %struct.acpi_generic_address*, i16, i8 }

@acpi_gbl_root_table_list = external dso_local global %struct.acpi_table_list, align 8
@acpi_gbl_fadt_index = external dso_local global i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !139, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !117, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbfadt.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !13, !16, !19, !20, !24, !25, !113, !114, !8, !21, !115, !116}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !15)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !17)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !18)
!18 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !7, line: 127, baseType: !8)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !23)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_fadt", file: !27, line: 199, size: 2208, elements: !28)
!27 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!28 = !{!29, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !26, file: !27, line: 200, baseType: !30, size: 288)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !27, line: 68, size: 288, elements: !31)
!31 = !{!32, !37, !38, !39, !40, !44, !48, !49, !50}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !30, file: !27, line: 69, baseType: !33, size: 32)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 32, elements: !35)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!35 = !{!36}
!36 = !DISubrange(count: 4)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !30, file: !27, line: 70, baseType: !13, size: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !30, file: !27, line: 71, baseType: !21, size: 8, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !30, file: !27, line: 72, baseType: !21, size: 8, offset: 72)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !30, file: !27, line: 73, baseType: !41, size: 48, offset: 80)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 48, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 6)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !30, file: !27, line: 74, baseType: !45, size: 64, offset: 128)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 64, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !30, file: !27, line: 75, baseType: !13, size: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !30, file: !27, line: 76, baseType: !33, size: 32, offset: 224)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !30, file: !27, line: 77, baseType: !13, size: 32, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "facs", scope: !26, file: !27, line: 201, baseType: !13, size: 32, offset: 288)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dsdt", scope: !26, file: !27, line: 202, baseType: !13, size: 32, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !26, file: !27, line: 203, baseType: !21, size: 8, offset: 352)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_profile", scope: !26, file: !27, line: 204, baseType: !21, size: 8, offset: 360)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "sci_interrupt", scope: !26, file: !27, line: 205, baseType: !16, size: 16, offset: 368)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "smi_command", scope: !26, file: !27, line: 206, baseType: !13, size: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_enable", scope: !26, file: !27, line: 207, baseType: !21, size: 8, offset: 416)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_disable", scope: !26, file: !27, line: 208, baseType: !21, size: 8, offset: 424)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "s4_bios_request", scope: !26, file: !27, line: 209, baseType: !21, size: 8, offset: 432)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pstate_control", scope: !26, file: !27, line: 210, baseType: !21, size: 8, offset: 440)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pm1a_event_block", scope: !26, file: !27, line: 211, baseType: !13, size: 32, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pm1b_event_block", scope: !26, file: !27, line: 212, baseType: !13, size: 32, offset: 480)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pm1a_control_block", scope: !26, file: !27, line: 213, baseType: !13, size: 32, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pm1b_control_block", scope: !26, file: !27, line: 214, baseType: !13, size: 32, offset: 544)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pm2_control_block", scope: !26, file: !27, line: 215, baseType: !13, size: 32, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pm_timer_block", scope: !26, file: !27, line: 216, baseType: !13, size: 32, offset: 608)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gpe0_block", scope: !26, file: !27, line: 217, baseType: !13, size: 32, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "gpe1_block", scope: !26, file: !27, line: 218, baseType: !13, size: 32, offset: 672)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pm1_event_length", scope: !26, file: !27, line: 219, baseType: !21, size: 8, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "pm1_control_length", scope: !26, file: !27, line: 220, baseType: !21, size: 8, offset: 712)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pm2_control_length", scope: !26, file: !27, line: 221, baseType: !21, size: 8, offset: 720)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pm_timer_length", scope: !26, file: !27, line: 222, baseType: !21, size: 8, offset: 728)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpe0_block_length", scope: !26, file: !27, line: 223, baseType: !21, size: 8, offset: 736)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "gpe1_block_length", scope: !26, file: !27, line: 224, baseType: !21, size: 8, offset: 744)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "gpe1_base", scope: !26, file: !27, line: 225, baseType: !21, size: 8, offset: 752)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "cst_control", scope: !26, file: !27, line: 226, baseType: !21, size: 8, offset: 760)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "c2_latency", scope: !26, file: !27, line: 227, baseType: !16, size: 16, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "c3_latency", scope: !26, file: !27, line: 228, baseType: !16, size: 16, offset: 784)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flush_size", scope: !26, file: !27, line: 229, baseType: !16, size: 16, offset: 800)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "flush_stride", scope: !26, file: !27, line: 230, baseType: !16, size: 16, offset: 816)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "duty_offset", scope: !26, file: !27, line: 231, baseType: !21, size: 8, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "duty_width", scope: !26, file: !27, line: 232, baseType: !21, size: 8, offset: 840)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "day_alarm", scope: !26, file: !27, line: 233, baseType: !21, size: 8, offset: 848)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "month_alarm", scope: !26, file: !27, line: 234, baseType: !21, size: 8, offset: 856)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "century", scope: !26, file: !27, line: 235, baseType: !21, size: 8, offset: 864)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "boot_flags", scope: !26, file: !27, line: 236, baseType: !16, size: 16, offset: 872)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !26, file: !27, line: 237, baseType: !21, size: 8, offset: 888)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !27, line: 238, baseType: !13, size: 32, offset: 896)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reset_register", scope: !26, file: !27, line: 239, baseType: !90, size: 96, offset: 928)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_generic_address", file: !27, line: 90, size: 96, elements: !91)
!91 = !{!92, !93, !94, !95, !96}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !90, file: !27, line: 91, baseType: !21, size: 8)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !90, file: !27, line: 92, baseType: !21, size: 8, offset: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !90, file: !27, line: 93, baseType: !21, size: 8, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "access_width", scope: !90, file: !27, line: 94, baseType: !21, size: 8, offset: 24)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !90, file: !27, line: 95, baseType: !8, size: 64, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reset_value", scope: !26, file: !27, line: 240, baseType: !21, size: 8, offset: 1024)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "arm_boot_flags", scope: !26, file: !27, line: 241, baseType: !16, size: 16, offset: 1032)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "minor_revision", scope: !26, file: !27, line: 242, baseType: !21, size: 8, offset: 1048)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Xfacs", scope: !26, file: !27, line: 243, baseType: !8, size: 64, offset: 1056)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Xdsdt", scope: !26, file: !27, line: 244, baseType: !8, size: 64, offset: 1120)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "xpm1a_event_block", scope: !26, file: !27, line: 245, baseType: !90, size: 96, offset: 1184)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "xpm1b_event_block", scope: !26, file: !27, line: 246, baseType: !90, size: 96, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "xpm1a_control_block", scope: !26, file: !27, line: 247, baseType: !90, size: 96, offset: 1376)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "xpm1b_control_block", scope: !26, file: !27, line: 248, baseType: !90, size: 96, offset: 1472)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "xpm2_control_block", scope: !26, file: !27, line: 249, baseType: !90, size: 96, offset: 1568)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xpm_timer_block", scope: !26, file: !27, line: 250, baseType: !90, size: 96, offset: 1664)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "xgpe0_block", scope: !26, file: !27, line: 251, baseType: !90, size: 96, offset: 1760)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "xgpe1_block", scope: !26, file: !27, line: 252, baseType: !90, size: 96, offset: 1856)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_control", scope: !26, file: !27, line: 253, baseType: !90, size: 96, offset: 1952)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_status", scope: !26, file: !27, line: 254, baseType: !90, size: 96, offset: 2048)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hypervisor_id", scope: !26, file: !27, line: 255, baseType: !8, size: 64, offset: 2144)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !7, line: 805, baseType: !21)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!117 = !{!0, !118, !131}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "fadt_info_table", scope: !2, file: !3, line: 48, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1024, elements: !46)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_fadt_info", file: !3, line: 33, size: 128, elements: !122)
!122 = !{!123, !126, !127, !128, !129, !130}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !3, line: 34, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !121, file: !3, line: 35, baseType: !16, size: 16, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !121, file: !3, line: 36, baseType: !16, size: 16, offset: 80)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !121, file: !3, line: 37, baseType: !16, size: 16, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "default_length", scope: !121, file: !3, line: 38, baseType: !21, size: 8, offset: 112)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !3, line: 39, baseType: !21, size: 8, offset: 120)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "fadt_pm_info_table", scope: !2, file: !3, line: 118, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !35)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_fadt_pm_info", file: !3, line: 111, size: 128, elements: !135)
!135 = !{!136, !137, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !134, file: !3, line: 112, baseType: !114, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !134, file: !3, line: 113, baseType: !16, size: 16, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "register_num", scope: !134, file: !3, line: 114, baseType: !21, size: 8, offset: 80)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 56, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 7)
!142 = !{i32 7, !"Dwarf Version", i32 4}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 2}
!145 = !{i32 1, !"Code Model", i32 2}
!146 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!147 = distinct !DISubprogram(name: "acpi_tb_parse_fadt", scope: !3, file: !3, line: 276, type: !148, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!148 = !DISubroutineType(types: !149)
!149 = !{null}
!150 = !DILocalVariable(name: "length", scope: !147, file: !3, line: 278, type: !13)
!151 = !DILocation(line: 278, column: 6, scope: !147)
!152 = !DILocalVariable(name: "table", scope: !147, file: !3, line: 279, type: !153)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!154 = !DILocation(line: 279, column: 28, scope: !147)
!155 = !DILocalVariable(name: "fadt_desc", scope: !147, file: !3, line: 280, type: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !27, line: 334, size: 256, elements: !158)
!158 = !{!159, !160, !161, !162, !167, !169, !170}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !157, file: !27, line: 335, baseType: !6, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !157, file: !27, line: 336, baseType: !153, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !157, file: !27, line: 337, baseType: !13, size: 32, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !157, file: !27, line: 338, baseType: !163, size: 32, offset: 160)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !27, line: 327, size: 32, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !163, file: !27, line: 328, baseType: !13, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !163, file: !27, line: 329, baseType: !33, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !157, file: !27, line: 339, baseType: !168, size: 16, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !7, line: 445, baseType: !16)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !157, file: !27, line: 340, baseType: !21, size: 8, offset: 208)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "validation_count", scope: !157, file: !27, line: 341, baseType: !16, size: 16, offset: 224)
!171 = !DILocation(line: 280, column: 26, scope: !147)
!172 = !DILocalVariable(name: "status", scope: !147, file: !3, line: 281, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !13)
!174 = !DILocation(line: 281, column: 14, scope: !147)
!175 = !DILocation(line: 290, column: 40, scope: !147)
!176 = !DILocation(line: 290, column: 47, scope: !147)
!177 = !DILocation(line: 290, column: 15, scope: !147)
!178 = !DILocation(line: 290, column: 12, scope: !147)
!179 = !DILocation(line: 291, column: 29, scope: !147)
!180 = !DILocation(line: 291, column: 11, scope: !147)
!181 = !DILocation(line: 291, column: 9, scope: !147)
!182 = !DILocation(line: 292, column: 6, scope: !183)
!183 = distinct !DILexicalBlock(scope: !147, file: !3, line: 292, column: 6)
!184 = !DILocation(line: 292, column: 6, scope: !147)
!185 = !DILocation(line: 293, column: 3, scope: !186)
!186 = distinct !DILexicalBlock(scope: !183, file: !3, line: 292, column: 28)
!187 = !DILocation(line: 295, column: 11, scope: !147)
!188 = !DILocation(line: 295, column: 22, scope: !147)
!189 = !DILocation(line: 295, column: 9, scope: !147)
!190 = !DILocation(line: 301, column: 32, scope: !147)
!191 = !DILocation(line: 301, column: 39, scope: !147)
!192 = !DILocation(line: 301, column: 8, scope: !147)
!193 = !DILocation(line: 305, column: 28, scope: !147)
!194 = !DILocation(line: 305, column: 35, scope: !147)
!195 = !DILocation(line: 305, column: 2, scope: !147)
!196 = !DILocation(line: 309, column: 20, scope: !147)
!197 = !DILocation(line: 309, column: 2, scope: !147)
!198 = !DILocation(line: 314, column: 12, scope: !147)
!199 = !DILocation(line: 313, column: 2, scope: !147)
!200 = !DILocation(line: 320, column: 7, scope: !201)
!201 = distinct !DILexicalBlock(scope: !147, file: !3, line: 320, column: 6)
!202 = !DILocation(line: 320, column: 6, scope: !147)
!203 = !DILocation(line: 321, column: 21, scope: !204)
!204 = distinct !DILexicalBlock(scope: !205, file: !3, line: 321, column: 7)
!205 = distinct !DILexicalBlock(scope: !201, file: !3, line: 320, column: 34)
!206 = !DILocation(line: 321, column: 7, scope: !204)
!207 = !DILocation(line: 321, column: 7, scope: !205)
!208 = !DILocation(line: 323, column: 28, scope: !209)
!209 = distinct !DILexicalBlock(scope: !204, file: !3, line: 321, column: 27)
!210 = !DILocation(line: 322, column: 35, scope: !209)
!211 = !DILocation(line: 322, column: 4, scope: !209)
!212 = !DILocation(line: 327, column: 3, scope: !209)
!213 = !DILocation(line: 328, column: 21, scope: !214)
!214 = distinct !DILexicalBlock(scope: !205, file: !3, line: 328, column: 7)
!215 = !DILocation(line: 328, column: 7, scope: !214)
!216 = !DILocation(line: 328, column: 7, scope: !205)
!217 = !DILocation(line: 330, column: 28, scope: !218)
!218 = distinct !DILexicalBlock(scope: !214, file: !3, line: 328, column: 28)
!219 = !DILocation(line: 329, column: 4, scope: !218)
!220 = !DILocation(line: 334, column: 3, scope: !218)
!221 = !DILocation(line: 335, column: 2, scope: !205)
!222 = !DILocation(line: 336, column: 1, scope: !147)
!223 = distinct !DISubprogram(name: "acpi_tb_create_local_fadt", scope: !3, file: !3, line: 354, type: !224, scopeLine: 355, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !153, !13}
!226 = !DILocalVariable(name: "table", arg: 1, scope: !223, file: !3, line: 354, type: !153)
!227 = !DILocation(line: 354, column: 58, scope: !223)
!228 = !DILocalVariable(name: "length", arg: 2, scope: !223, file: !3, line: 354, type: !13)
!229 = !DILocation(line: 354, column: 69, scope: !223)
!230 = !DILocation(line: 361, column: 6, scope: !231)
!231 = distinct !DILexicalBlock(scope: !223, file: !3, line: 361, column: 6)
!232 = !DILocation(line: 361, column: 13, scope: !231)
