; ModuleID = '../bcout/drivers/acpi/acpica/tbfind.llvm.bc'
source_filename = "drivers/acpi/acpica/tbfind.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_list = type { %struct.acpi_table_desc*, i32, i32, i8 }
%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%union.acpi_name_union = type { i32 }

@acpi_gbl_root_table_list = external dso_local global %struct.acpi_table_list, align 8

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @acpi_tb_find_table(i8* %signature, i8* %oem_id, i8* %oem_table_id, i32* %table_index) #0 !dbg !18 {
entry:
  %retval = alloca i32, align 4
  %signature.addr = alloca i8*, align 8
  %oem_id.addr = alloca i8*, align 8
  %oem_table_id.addr = alloca i8*, align 8
  %table_index.addr = alloca i32*, align 8
  %status = alloca i32, align 4
  %header = alloca %struct.acpi_table_header, align 1
  %i = alloca i32, align 4
  store i8* %signature, i8** %signature.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %signature.addr, metadata !23, metadata !DIExpression()), !dbg !24
  store i8* %oem_id, i8** %oem_id.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %oem_id.addr, metadata !25, metadata !DIExpression()), !dbg !26

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/acpi/acpica/tbfind.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{}
!3 = !{!4, !11, !12}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !5, line: 421, baseType: !6)
!5 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !7, line: 21, baseType: !8)
!7 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !9, line: 27, baseType: !10)
!9 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !{i32 7, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 2}
!16 = !{i32 1, !"Code Model", i32 2}
!17 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!18 = distinct !DISubprogram(name: "acpi_tb_find_table", scope: !1, file: !1, line: 34, type: !19, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!19 = !DISubroutineType(types: !20)
!20 = !{!4, !21, !21, !21, !11}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !DILocalVariable(name: "signature", arg: 1, scope: !18, file: !1, line: 34, type: !21)
!24 = !DILocation(line: 34, column: 26, scope: !18)
!25 = !DILocalVariable(name: "oem_id", arg: 2, scope: !18, file: !1, line: 35, type: !21)
!26 = !DILocation(line: 35, column: 12, scope: !18)
!27 = !DILocalVariable(name: "oem_table_id", arg: 3, scope: !18, file: !1, line: 35, type: !21)
!28 = !DILocation(line: 35, column: 26, scope: !18)
!29 = !DILocalVariable(name: "table_index", arg: 4, scope: !18, file: !1, line: 35, type: !11)
!30 = !DILocation(line: 35, column: 45, scope: !18)
!31 = !DILocalVariable(name: "status", scope: !18, file: !1, line: 37, type: !4)
!32 = !DILocation(line: 37, column: 14, scope: !18)
!33 = !DILocalVariable(name: "header", scope: !18, file: !1, line: 38, type: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !35, line: 68, size: 288, elements: !36)
!35 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !41, !42, !46, !47, !51, !55, !56, !57}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !34, file: !35, line: 69, baseType: !38, size: 32)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 4)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !34, file: !35, line: 70, baseType: !6, size: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !34, file: !35, line: 71, baseType: !43, size: 8, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !7, line: 17, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !9, line: 21, baseType: !45)
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !34, file: !35, line: 72, baseType: !43, size: 8, offset: 72)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !34, file: !35, line: 73, baseType: !48, size: 48, offset: 80)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 48, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 6)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !34, file: !35, line: 74, baseType: !52, size: 64, offset: 128)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 8)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !34, file: !35, line: 75, baseType: !6, size: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !34, file: !35, line: 76, baseType: !38, size: 32, offset: 224)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !34, file: !35, line: 77, baseType: !6, size: 32, offset: 256)
!58 = !DILocation(line: 38, column: 27, scope: !18)
!59 = !DILocalVariable(name: "i", scope: !18, file: !1, line: 39, type: !6)
!60 = !DILocation(line: 39, column: 6, scope: !18)
!61 = !DILocation(line: 45, column: 29, scope: !62)
!62 = distinct !DILexicalBlock(scope: !18, file: !1, line: 45, column: 6)
!63 = !DILocation(line: 45, column: 7, scope: !62)
!64 = !DILocation(line: 45, column: 6, scope: !18)
!65 = !DILocation(line: 46, column: 3, scope: !66)
!66 = distinct !DILexicalBlock(scope: !62, file: !1, line: 45, column: 41)
!67 = !DILocation(line: 51, column: 14, scope: !68)
!68 = distinct !DILexicalBlock(scope: !18, file: !1, line: 51, column: 6)
!69 = !DILocation(line: 51, column: 7, scope: !68)
!70 = !DILocation(line: 51, column: 22, scope: !68)
!71 = !DILocation(line: 51, column: 42, scope: !68)
!72 = !DILocation(line: 52, column: 14, scope: !68)
!73 = !DILocation(line: 52, column: 7, scope: !68)
!74 = !DILocation(line: 52, column: 28, scope: !68)
!75 = !DILocation(line: 51, column: 6, scope: !18)
!76 = !DILocation(line: 53, column: 3, scope: !77)
!77 = distinct !DILexicalBlock(scope: !68, file: !1, line: 52, column: 55)
!78 = !DILocation(line: 58, column: 2, scope: !18)
!79 = !DILocation(line: 59, column: 2, scope: !18)
!80 = !DILocation(line: 60, column: 17, scope: !18)
!81 = !DILocation(line: 60, column: 10, scope: !18)
!82 = !DILocation(line: 60, column: 25, scope: !18)
!83 = !DILocation(line: 60, column: 2, scope: !18)
!84 = !DILocation(line: 61, column: 17, scope: !18)
!85 = !DILocation(line: 61, column: 10, scope: !18)
!86 = !DILocation(line: 61, column: 31, scope: !18)
!87 = !DILocation(line: 61, column: 2, scope: !18)
!88 = !DILocation(line: 65, column: 8, scope: !18)
!89 = !DILocation(line: 66, column: 9, scope: !90)
!90 = distinct !DILexicalBlock(scope: !18, file: !1, line: 66, column: 2)
!91 = !DILocation(line: 66, column: 7, scope: !90)
!92 = !DILocation(line: 66, column: 14, scope: !93)
!93 = distinct !DILexicalBlock(scope: !90, file: !1, line: 66, column: 2)
!94 = !DILocation(line: 66, column: 43, scope: !93)
!95 = !DILocation(line: 66, column: 16, scope: !93)
!96 = !DILocation(line: 66, column: 2, scope: !90)
!97 = !DILocation(line: 67, column: 41, scope: !98)
!98 = distinct !DILexicalBlock(scope: !99, file: !1, line: 67, column: 7)
!99 = distinct !DILexicalBlock(scope: !93, file: !1, line: 66, column: 69)
!100 = !DILocation(line: 67, column: 48, scope: !98)
!101 = !DILocation(line: 67, column: 16, scope: !98)
!102 = !DILocation(line: 67, column: 51, scope: !98)
!103 = !DILocation(line: 67, column: 14, scope: !98)
!104 = !DILocation(line: 68, column: 14, scope: !98)
!105 = !DILocation(line: 68, column: 7, scope: !98)
!106 = !DILocation(line: 67, column: 7, scope: !98)
!107 = !DILocation(line: 67, column: 7, scope: !99)
!108 = !DILocation(line: 72, column: 4, scope: !109)
!109 = distinct !DILexicalBlock(scope: !98, file: !1, line: 68, column: 45)
!110 = !DILocation(line: 77, column: 33, scope: !111)
!111 = distinct !DILexicalBlock(scope: !99, file: !1, line: 77, column: 7)
!112 = !DILocation(line: 77, column: 40, scope: !111)
!113 = !DILocation(line: 77, column: 8, scope: !111)
!114 = !DILocation(line: 77, column: 43, scope: !111)
!115 = !DILocation(line: 77, column: 7, scope: !99)
!116 = !DILocation(line: 83, column: 10, scope: !117)
!117 = distinct !DILexicalBlock(scope: !111, file: !1, line: 77, column: 52)
!118 = !DILocation(line: 83, column: 17, scope: !117)
!119 = !DILocation(line: 82, column: 32, scope: !117)
!120 = !DILocation(line: 82, column: 8, scope: !117)
!121 = !DILocation(line: 81, column: 11, scope: !117)
!122 = !DILocation(line: 84, column: 8, scope: !123)
!123 = distinct !DILexicalBlock(scope: !117, file: !1, line: 84, column: 8)
!124 = !DILocation(line: 84, column: 8, scope: !117)
!125 = !DILocation(line: 85, column: 5, scope: !126)
