; ModuleID = '../bcout/drivers/acpi/acpica/tbinstal.llvm.bc'
source_filename = "drivers/acpi/acpica/tbinstal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_list = type { %struct.acpi_table_desc*, i32, i32, i8 }
%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%union.acpi_name_union = type { i32 }

@acpi_gbl_root_table_list = external dso_local global %struct.acpi_table_list, align 8
@acpi_gbl_dsdt_index = external dso_local global i32, align 4
@_acpi_module_name = internal constant [9 x i8] c"tbinstal\00", align 1, !dbg !0
@.str = private unnamed_addr constant [45 x i8] c"Could not acquire table length at %8.8X%8.8X\00", align 1
@acpi_gbl_disable_ssdt_table_install = external dso_local global i8, align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"SSDT\00", align 1
@.str.2 = private unnamed_addr constant [45 x i8] c"Ignoring installation of %4.4s at %8.8X%8.8X\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"Logical\00", align 1
@.str.4 = private unnamed_addr constant [9 x i8] c"Physical\00", align 1
@.str.5 = private unnamed_addr constant [62 x i8] c"%4.4s 0x%8.8X%8.8X %s table override, new table: 0x%8.8X%8.8X\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !24, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !23, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbinstal.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !8, !13, !16, !17, !18, !19}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !15)
!15 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !7, line: 127, baseType: !13)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !22)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !{!0}
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 72, elements: !27)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!26 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!27 = !{!28}
!28 = !DISubrange(count: 9)
!29 = !{i32 7, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{i32 1, !"wchar_size", i32 2}
!32 = !{i32 1, !"Code Model", i32 2}
!33 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!34 = distinct !DISubprogram(name: "acpi_tb_install_table_with_override", scope: !3, file: !3, line: 34, type: !35, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !20, !16}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !39, line: 334, size: 256, elements: !40)
!39 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!40 = !{!41, !43, !65, !66, !71, !76, !77}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !38, file: !39, line: 335, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !13)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !38, file: !39, line: 336, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !39, line: 68, size: 288, elements: !46)
!46 = !{!47, !51, !52, !53, !54, !58, !62, !63, !64}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !45, file: !39, line: 69, baseType: !48, size: 32)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 4)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !45, file: !39, line: 70, baseType: !8, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !45, file: !39, line: 71, baseType: !20, size: 8, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !45, file: !39, line: 72, baseType: !20, size: 8, offset: 72)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !45, file: !39, line: 73, baseType: !55, size: 48, offset: 80)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 48, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 6)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !45, file: !39, line: 74, baseType: !59, size: 64, offset: 128)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 8)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !45, file: !39, line: 75, baseType: !8, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !45, file: !39, line: 76, baseType: !48, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !45, file: !39, line: 77, baseType: !8, size: 32, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !38, file: !39, line: 337, baseType: !8, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !38, file: !39, line: 338, baseType: !67, size: 32, offset: 160)
!67 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !39, line: 327, size: 32, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !67, file: !39, line: 328, baseType: !8, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !67, file: !39, line: 329, baseType: !48, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !38, file: !39, line: 339, baseType: !72, size: 16, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !7, line: 445, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !75)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !38, file: !39, line: 340, baseType: !20, size: 8, offset: 208)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "validation_count", scope: !38, file: !39, line: 341, baseType: !73, size: 16, offset: 224)
!78 = !DILocalVariable(name: "new_table_desc", arg: 1, scope: !34, file: !3, line: 34, type: !37)
!79 = !DILocation(line: 34, column: 61, scope: !34)
!80 = !DILocalVariable(name: "override", arg: 2, scope: !34, file: !3, line: 35, type: !20)
!81 = !DILocation(line: 35, column: 12, scope: !34)
!82 = !DILocalVariable(name: "table_index", arg: 3, scope: !34, file: !3, line: 35, type: !16)
!83 = !DILocation(line: 35, column: 27, scope: !34)
!84 = !DILocalVariable(name: "i", scope: !34, file: !3, line: 37, type: !8)
!85 = !DILocation(line: 37, column: 6, scope: !34)
!86 = !DILocalVariable(name: "status", scope: !34, file: !3, line: 38, type: !6)
!87 = !DILocation(line: 38, column: 14, scope: !34)
!88 = !DILocation(line: 40, column: 11, scope: !34)
!89 = !DILocation(line: 40, column: 9, scope: !34)
!90 = !DILocation(line: 41, column: 6, scope: !91)
!91 = distinct !DILexicalBlock(scope: !34, file: !3, line: 41, column: 6)
!92 = !DILocation(line: 41, column: 6, scope: !34)
!93 = !DILocation(line: 42, column: 3, scope: !94)
!94 = distinct !DILexicalBlock(scope: !91, file: !3, line: 41, column: 28)
!95 = !DILocation(line: 52, column: 6, scope: !96)
!96 = distinct !DILexicalBlock(scope: !34, file: !3, line: 52, column: 6)
!97 = !DILocation(line: 52, column: 6, scope: !34)
!98 = !DILocation(line: 53, column: 26, scope: !99)
!99 = distinct !DILexicalBlock(scope: !96, file: !3, line: 52, column: 16)
!100 = !DILocation(line: 53, column: 3, scope: !99)
!101 = !DILocation(line: 54, column: 2, scope: !99)
!102 = !DILocation(line: 56, column: 58, scope: !34)
!103 = !DILocation(line: 56, column: 65, scope: !34)
!104 = !DILocation(line: 56, column: 33, scope: !34)
!105 = !DILocation(line: 57, column: 11, scope: !34)
!106 = !DILocation(line: 57, column: 27, scope: !34)
!107 = !DILocation(line: 58, column: 11, scope: !34)
!108 = !DILocation(line: 58, column: 27, scope: !34)
!109 = !DILocation(line: 59, column: 11, scope: !34)
!110 = !DILocation(line: 59, column: 27, scope: !34)
!111 = !DILocation(line: 56, column: 2, scope: !34)
!112 = !DILocation(line: 61, column: 29, scope: !34)
!113 = !DILocation(line: 61, column: 45, scope: !34)
!114 = !DILocation(line: 62, column: 8, scope: !34)
!115 = !DILocation(line: 62, column: 24, scope: !34)
!116 = !DILocation(line: 61, column: 2, scope: !34)
!117 = !DILocation(line: 66, column: 17, scope: !34)
!118 = !DILocation(line: 66, column: 3, scope: !34)
!119 = !DILocation(line: 66, column: 15, scope: !34)
!120 = !DILocation(line: 70, column: 6, scope: !121)
!121 = distinct !DILexicalBlock(scope: !34, file: !3, line: 70, column: 6)
!122 = !DILocation(line: 70, column: 11, scope: !121)
!123 = !DILocation(line: 70, column: 8, scope: !121)
!124 = !DILocation(line: 70, column: 6, scope: !34)
!125 = !DILocation(line: 71, column: 29, scope: !126)
!126 = distinct !DILexicalBlock(scope: !121, file: !3, line: 70, column: 32)
!127 = !DILocation(line: 71, column: 45, scope: !126)
!128 = !DILocation(line: 71, column: 54, scope: !126)
!129 = !DILocation(line: 71, column: 3, scope: !126)
!130 = !DILocation(line: 72, column: 2, scope: !126)
!131 = !DILocation(line: 73, column: 1, scope: !34)
!132 = distinct !DISubprogram(name: "acpi_tb_override_table", scope: !3, file: !3, line: 197, type: !133, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !37}
!135 = !DILocalVariable(name: "old_table_desc", arg: 1, scope: !132, file: !3, line: 197, type: !37)
!136 = !DILocation(line: 197, column: 53, scope: !132)
!137 = !DILocalVariable(name: "status", scope: !132, file: !3, line: 199, type: !6)
!138 = !DILocation(line: 199, column: 14, scope: !132)
!139 = !DILocalVariable(name: "new_table_desc", scope: !132, file: !3, line: 200, type: !38)
!140 = !DILocation(line: 200, column: 25, scope: !132)
