; ModuleID = '../bcout/drivers/acpi/acpica/tbprint.llvm.bc'
source_filename = "drivers/acpi/acpica/tbprint.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_table_rsdp = type <{ [8 x i8], i8, [6 x i8], i8, i32, i32, i64, i8, [3 x i8] }>

@.str = private unnamed_addr constant [5 x i8] c"FACS\00", align 1
@.str.1 = private unnamed_addr constant [25 x i8] c"%-4.4s 0x%8.8X%8.8X %06X\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"RSD PTR \00", align 1
@.str.3 = private unnamed_addr constant [38 x i8] c"RSDP 0x%8.8X%8.8X %06X (v%.2d %-6.6s)\00", align 1
@.str.4 = private unnamed_addr constant [64 x i8] c"%-4.4s 0x%8.8X%8.8X %06X (v%.2d %-6.6s %-8.8s %08X %-4.4s %08X)\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"S3PT\00", align 1
@_acpi_module_name = internal constant [8 x i8] c"tbprint\00", align 1, !dbg !0
@.str.6 = private unnamed_addr constant [65 x i8] c"Incorrect checksum in table [%4.4s] - 0x%2.2X, should be 0x%2.2X\00", align 1
@_ctype = external dso_local constant [0 x i8], align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local void @acpi_tb_print_table_header(i64 %address, %struct.acpi_table_header* %header) #0 !dbg !55 {
entry:
  %address.addr = alloca i64, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !48, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !47, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbprint.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !12, !7, !13, !16, !18, !43, !45, !27, !46, !29}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !8, line: 21, baseType: !9)
!8 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !10, line: 27, baseType: !11)
!10 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !8, line: 23, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !10, line: 31, baseType: !15)
!15 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_rsdp", file: !20, line: 105, size: 288, elements: !21)
!20 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !26, !30, !34, !35, !36, !37, !38, !39}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !19, file: !20, line: 106, baseType: !23, size: 64)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 64, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 8)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !19, file: !20, line: 107, baseType: !27, size: 8, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !8, line: 17, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !10, line: 21, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !19, file: !20, line: 108, baseType: !31, size: 48, offset: 72)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 48, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 6)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !19, file: !20, line: 109, baseType: !27, size: 8, offset: 120)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rsdt_physical_address", scope: !19, file: !20, line: 110, baseType: !7, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !19, file: !20, line: 111, baseType: !7, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "xsdt_physical_address", scope: !19, file: !20, line: 112, baseType: !13, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "extended_checksum", scope: !19, file: !20, line: 113, baseType: !27, size: 8, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !19, file: !20, line: 114, baseType: !40, size: 24, offset: 264)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 3)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !44, line: 421, baseType: !7)
!44 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!46 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!47 = !{!0}
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 64, elements: !24)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!50 = !{i32 7, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 2}
!53 = !{i32 1, !"Code Model", i32 2}
!54 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!55 = distinct !DISubprogram(name: "acpi_tb_print_table_header", scope: !3, file: !3, line: 92, type: !56, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !59}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !44, line: 129, baseType: !13)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !20, line: 68, size: 288, elements: !61)
!61 = !{!62, !66, !67, !68, !69, !70, !71, !72, !73}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !60, file: !20, line: 69, baseType: !63, size: 32)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !60, file: !20, line: 70, baseType: !7, size: 32, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !60, file: !20, line: 71, baseType: !27, size: 8, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !60, file: !20, line: 72, baseType: !27, size: 8, offset: 72)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !60, file: !20, line: 73, baseType: !31, size: 48, offset: 80)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !60, file: !20, line: 74, baseType: !23, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !60, file: !20, line: 75, baseType: !7, size: 32, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !60, file: !20, line: 76, baseType: !63, size: 32, offset: 224)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !60, file: !20, line: 77, baseType: !7, size: 32, offset: 256)
!74 = !DILocalVariable(name: "address", arg: 1, scope: !55, file: !3, line: 92, type: !58)
!75 = !DILocation(line: 92, column: 50, scope: !55)
!76 = !DILocalVariable(name: "header", arg: 2, scope: !55, file: !3, line: 93, type: !59)
!77 = !DILocation(line: 93, column: 33, scope: !55)
!78 = !DILocalVariable(name: "local_header", scope: !55, file: !3, line: 95, type: !60)
!79 = !DILocation(line: 95, column: 27, scope: !55)
!80 = !DILocation(line: 97, column: 6, scope: !81)
!81 = distinct !DILexicalBlock(scope: !55, file: !3, line: 97, column: 6)
!82 = !DILocation(line: 97, column: 6, scope: !55)
!83 = !DILocation(line: 101, column: 3, scope: !84)
!84 = distinct !DILexicalBlock(scope: !81, file: !3, line: 97, column: 62)
!85 = !DILocation(line: 104, column: 2, scope: !84)
!86 = !DILocation(line: 104, column: 13, scope: !87)
!87 = distinct !DILexicalBlock(scope: !81, file: !3, line: 104, column: 13)
!88 = !DILocation(line: 104, column: 13, scope: !81)
!89 = !DILocation(line: 108, column: 23, scope: !90)
!90 = distinct !DILexicalBlock(scope: !87, file: !3, line: 104, column: 56)
!91 = !DILocation(line: 108, column: 3, scope: !90)
!92 = !DILocation(line: 109, column: 10, scope: !90)
!93 = !DILocation(line: 109, column: 57, scope: !90)
!94 = !DILocation(line: 111, column: 35, scope: !90)
!95 = !DILocation(line: 111, column: 22, scope: !90)
!96 = !DILocation(line: 111, column: 3, scope: !90)
!97 = !DILocation(line: 113, column: 3, scope: !90)
!98 = !DILocation(line: 122, column: 2, scope: !90)
!99 = !DILocation(line: 125, column: 47, scope: !100)
!100 = distinct !DILexicalBlock(scope: !87, file: !3, line: 122, column: 9)
!101 = !DILocation(line: 125, column: 3, scope: !100)
!102 = !DILocation(line: 127, column: 3, scope: !100)
!103 = !DILocation(line: 136, column: 1, scope: !55)
!104 = distinct !DISubprogram(name: "acpi_tb_fix_string", scope: !3, file: !3, line: 38, type: !105, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !16, !107}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !44, line: 127, baseType: !13)
!108 = !DILocalVariable(name: "string", arg: 1, scope: !104, file: !3, line: 38, type: !16)
!109 = !DILocation(line: 38, column: 38, scope: !104)
!110 = !DILocalVariable(name: "length", arg: 2, scope: !104, file: !3, line: 38, type: !107)
!111 = !DILocation(line: 38, column: 56, scope: !104)
!112 = !DILocation(line: 41, column: 2, scope: !104)
!113 = !DILocation(line: 41, column: 9, scope: !104)
!114 = !DILocation(line: 41, column: 16, scope: !104)
!115 = !DILocation(line: 41, column: 20, scope: !104)
!116 = !DILocation(line: 41, column: 19, scope: !104)
!117 = !DILocation(line: 0, scope: !104)
!118 = !DILocation(line: 42, column: 8, scope: !119)
!119 = distinct !DILexicalBlock(scope: !120, file: !3, line: 42, column: 7)
!120 = distinct !DILexicalBlock(scope: !104, file: !3, line: 41, column: 28)
!121 = !DILocation(line: 42, column: 7, scope: !120)
!122 = !DILocation(line: 43, column: 5, scope: !123)
!123 = distinct !DILexicalBlock(scope: !119, file: !3, line: 42, column: 31)
!124 = !DILocation(line: 43, column: 12, scope: !123)
!125 = !DILocation(line: 44, column: 3, scope: !123)
!126 = !DILocation(line: 46, column: 9, scope: !120)
!127 = !DILocation(line: 47, column: 9, scope: !120)
!128 = distinct !{!128, !112, !129}
!129 = !DILocation(line: 48, column: 2, scope: !104)
!130 = !DILocation(line: 49, column: 1, scope: !104)
!131 = distinct !DISubprogram(name: "acpi_tb_cleanup_table_header", scope: !3, file: !3, line: 66, type: !132, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !59, !59}
