; ModuleID = '../bcout/drivers/acpi/acpica/tbutils.llvm.bc'
source_filename = "drivers/acpi/acpica/tbutils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_facs = type { [4 x i8], i32, i32, i32, i32, i32, i64, i8, [3 x i8], i32, [24 x i8] }
%struct.acpi_table_fadt = type <{ %struct.acpi_table_header, i32, i32, i8, i8, i16, i32, i8, i8, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, i16, i16, i16, i8, i8, i8, i8, i8, i16, i8, i32, %struct.acpi_generic_address, i8, i16, i8, i64, i64, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, %struct.acpi_generic_address, i64 }>
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%struct.acpi_generic_address = type <{ i8, i8, i8, i8, i64 }>
%struct.acpi_table_list = type { %struct.acpi_table_desc*, i32, i32, i8 }
%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%union.acpi_name_union = type { i32 }
%struct.kmem_cache = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !63, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbutils.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !20, !47, !48, !52, !21, !53, !16, !54, !55, !58, !60, !61}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !23, line: 68, size: 288, elements: !24)
!23 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!24 = !{!25, !30, !31, !35, !36, !40, !44, !45, !46}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !22, file: !23, line: 69, baseType: !26, size: 32)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !28)
!27 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!28 = !{!29}
!29 = !DISubrange(count: 4)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !22, file: !23, line: 70, baseType: !16, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !22, file: !23, line: 71, baseType: !32, size: 8, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !22, file: !23, line: 72, baseType: !32, size: 8, offset: 72)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !22, file: !23, line: 73, baseType: !37, size: 48, offset: 80)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 48, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 6)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !22, file: !23, line: 74, baseType: !41, size: 64, offset: 128)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 64, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !22, file: !23, line: 75, baseType: !16, size: 32, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !22, file: !23, line: 76, baseType: !26, size: 32, offset: 224)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !22, file: !23, line: 77, baseType: !16, size: 32, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !51)
!51 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !49)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !57)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !59, line: 148, baseType: !7)
!59 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!60 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!62 = !{!0}
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !42)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!65 = !{!"rsp"}
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 2}
!69 = !{i32 1, !"Code Model", i32 2}
!70 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!71 = distinct !DISubprogram(name: "acpi_tb_initialize_facs", scope: !3, file: !3, line: 35, type: !72, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !74)
!72 = !DISubroutineType(types: !73)
!73 = !{!14}
!74 = !{}
!75 = !DILocalVariable(name: "facs", scope: !71, file: !3, line: 37, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_facs", file: !23, line: 162, size: 512, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !91, !92}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !77, file: !23, line: 163, baseType: !26, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !77, file: !23, line: 164, baseType: !16, size: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "hardware_signature", scope: !77, file: !23, line: 165, baseType: !16, size: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "firmware_waking_vector", scope: !77, file: !23, line: 166, baseType: !16, size: 32, offset: 96)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "global_lock", scope: !77, file: !23, line: 167, baseType: !16, size: 32, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !23, line: 168, baseType: !16, size: 32, offset: 160)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "xfirmware_waking_vector", scope: !77, file: !23, line: 169, baseType: !49, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !23, line: 170, baseType: !32, size: 8, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !77, file: !23, line: 171, baseType: !88, size: 24, offset: 264)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 24, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ospm_flags", scope: !77, file: !23, line: 172, baseType: !16, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !77, file: !23, line: 173, baseType: !93, size: 192, offset: 320)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 24)
!96 = !DILocation(line: 37, column: 26, scope: !71)
!97 = !DILocation(line: 41, column: 6, scope: !98)
!98 = distinct !DILexicalBlock(scope: !71, file: !3, line: 41, column: 6)
!99 = !DILocation(line: 41, column: 6, scope: !71)
!100 = !DILocation(line: 42, column: 17, scope: !101)
!101 = distinct !DILexicalBlock(scope: !98, file: !3, line: 41, column: 33)
!102 = !DILocation(line: 43, column: 3, scope: !101)
!103 = !DILocation(line: 44, column: 27, scope: !104)
!104 = distinct !DILexicalBlock(scope: !98, file: !3, line: 44, column: 13)
!105 = !DILocation(line: 44, column: 13, scope: !104)
!106 = !DILocation(line: 44, column: 33, scope: !104)
!107 = !DILocation(line: 45, column: 22, scope: !104)
!108 = !DILocation(line: 45, column: 8, scope: !104)
!109 = !DILocation(line: 46, column: 7, scope: !104)
!110 = !DILocation(line: 46, column: 11, scope: !104)
!111 = !DILocation(line: 44, column: 13, scope: !98)
!112 = !DILocation(line: 47, column: 33, scope: !113)
!113 = distinct !DILexicalBlock(scope: !104, file: !3, line: 46, column: 47)
!114 = !DILocation(line: 48, column: 12, scope: !113)
!115 = !DILocation(line: 47, column: 9, scope: !113)
!116 = !DILocation(line: 51, column: 19, scope: !113)
!117 = !DILocation(line: 51, column: 17, scope: !113)
!118 = !DILocation(line: 52, column: 2, scope: !113)
!119 = !DILocation(line: 52, column: 27, scope: !120)
!120 = distinct !DILexicalBlock(scope: !104, file: !3, line: 52, column: 13)
!121 = !DILocation(line: 52, column: 13, scope: !120)
!122 = !DILocation(line: 52, column: 13, scope: !104)
!123 = !DILocation(line: 53, column: 33, scope: !124)
!124 = distinct !DILexicalBlock(scope: !120, file: !3, line: 52, column: 33)
!125 = !DILocation(line: 54, column: 12, scope: !124)
!126 = !DILocation(line: 53, column: 9, scope: !124)
!127 = !DILocation(line: 57, column: 19, scope: !124)
!128 = !DILocation(line: 57, column: 17, scope: !124)
!129 = !DILocation(line: 58, column: 2, scope: !124)
!130 = !DILocation(line: 62, column: 2, scope: !71)
!131 = !DILocation(line: 63, column: 1, scope: !71)
!132 = distinct !DISubprogram(name: "acpi_tb_check_dsdt_header", scope: !3, file: !3, line: 80, type: !133, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !74)
!133 = !DISubroutineType(types: !134)
!134 = !{null}
!135 = !DILocation(line: 85, column: 36, scope: !136)
!136 = distinct !DILexicalBlock(scope: !132, file: !3, line: 85, column: 6)
!137 = !DILocation(line: 85, column: 46, scope: !136)
!138 = !DILocation(line: 85, column: 61, scope: !136)
!139 = !DILocation(line: 85, column: 43, scope: !136)
!140 = !DILocation(line: 85, column: 68, scope: !136)
!141 = !DILocation(line: 86, column: 36, scope: !136)
!142 = !DILocation(line: 86, column: 6, scope: !136)
!143 = !DILocation(line: 86, column: 48, scope: !136)
!144 = !DILocation(line: 86, column: 63, scope: !136)
!145 = !DILocation(line: 86, column: 45, scope: !136)
!146 = !DILocation(line: 85, column: 6, scope: !132)
!147 = !DILocation(line: 87, column: 3, scope: !148)
!148 = distinct !DILexicalBlock(scope: !136, file: !3, line: 86, column: 73)
!149 = !DILocation(line: 91, column: 3, scope: !148)
!150 = !DILocation(line: 92, column: 33, scope: !148)
!151 = !DILocation(line: 92, column: 3, scope: !148)
!152 = !DILocation(line: 94, column: 3, scope: !148)
!153 = !DILocation(line: 100, column: 42, scope: !148)
!154 = !DILocation(line: 100, column: 57, scope: !148)
!155 = !DILocation(line: 100, column: 40, scope: !148)
!156 = !DILocation(line: 102, column: 7, scope: !148)
!157 = !DILocation(line: 102, column: 22, scope: !148)
!158 = !DILocation(line: 101, column: 42, scope: !148)
!159 = !DILocation(line: 103, column: 2, scope: !148)
!160 = !DILocation(line: 104, column: 1, scope: !132)
!161 = distinct !DISubprogram(name: "acpi_tb_copy_dsdt", scope: !3, file: !3, line: 120, type: !162, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !74)
!162 = !DISubroutineType(types: !163)
!163 = !{!21, !16}
!164 = !DILocalVariable(name: "table_index", arg: 1, scope: !161, file: !3, line: 120, type: !16)
!165 = !DILocation(line: 120, column: 49, scope: !161)
!166 = !DILocalVariable(name: "new_table", scope: !161, file: !3, line: 122, type: !21)
!167 = !DILocation(line: 122, column: 28, scope: !161)
!168 = !DILocalVariable(name: "table_desc", scope: !161, file: !3, line: 123, type: !169)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !23, line: 334, size: 256, elements: !171)
!171 = !{!172, !173, !174, !175, !180, !182, !183}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !170, file: !23, line: 335, baseType: !53, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !170, file: !23, line: 336, baseType: !21, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !23, line: 337, baseType: !16, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !170, file: !23, line: 338, baseType: !176, size: 32, offset: 160)
!176 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !23, line: 327, size: 32, elements: !177)
!177 = !{!178, !179}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !176, file: !23, line: 328, baseType: !16, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !176, file: !23, line: 329, baseType: !26, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !170, file: !23, line: 339, baseType: !181, size: 16, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !55)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !23, line: 340, baseType: !32, size: 8, offset: 208)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "validation_count", scope: !170, file: !23, line: 341, baseType: !55, size: 16, offset: 224)
!184 = !DILocation(line: 123, column: 26, scope: !161)
!185 = !DILocation(line: 125, column: 41, scope: !161)
!186 = !DILocation(line: 125, column: 48, scope: !161)
!187 = !DILocation(line: 125, column: 16, scope: !161)
!188 = !DILocation(line: 125, column: 13, scope: !161)
!189 = !DILocation(line: 127, column: 14, scope: !161)
!190 = !DILocation(line: 127, column: 12, scope: !161)
!191 = !DILocation(line: 128, column: 7, scope: !192)
!192 = distinct !DILexicalBlock(scope: !161, file: !3, line: 128, column: 6)
!193 = !DILocation(line: 128, column: 6, scope: !161)
!194 = !DILocation(line: 129, column: 3, scope: !195)
!195 = distinct !DILexicalBlock(scope: !192, file: !3, line: 128, column: 18)
!196 = !DILocation(line: 131, column: 3, scope: !195)
!197 = !DILocation(line: 134, column: 9, scope: !161)
!198 = !DILocation(line: 134, column: 2, scope: !161)
!199 = !DILocation(line: 134, column: 20, scope: !161)
!200 = !DILocation(line: 134, column: 32, scope: !161)
!201 = !DILocation(line: 134, column: 41, scope: !161)
!202 = !DILocation(line: 134, column: 53, scope: !161)
!203 = !DILocation(line: 135, column: 26, scope: !161)
!204 = !DILocation(line: 135, column: 2, scope: !161)
!205 = !DILocation(line: 138, column: 11, scope: !161)
!206 = !DILocation(line: 138, column: 18, scope: !161)
!207 = !DILocation(line: 137, column: 33, scope: !161)
!208 = !DILocation(line: 139, column: 11, scope: !161)
!209 = !DILocation(line: 141, column: 11, scope: !161)
!210 = !DILocation(line: 137, column: 2, scope: !161)
!211 = !DILocation(line: 143, column: 2, scope: !161)
!212 = !DILocation(line: 145, column: 10, scope: !161)
!213 = !DILocation(line: 145, column: 2, scope: !161)
!214 = !DILocation(line: 146, column: 1, scope: !161)
!215 = distinct !DISubprogram(name: "acpi_os_allocate", scope: !216, file: !216, line: 50, type: !217, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!216 = !DIFile(filename: "./include/acpi/platform/aclinuxex.h", directory: "/home/lizy2001/genbc/linux")
!217 = !DISubroutineType(types: !218)
!218 = !{!47, !48}
!219 = !DILocalVariable(name: "s", arg: 1, scope: !220, file: !6, line: 445, type: !223)
!220 = distinct !DISubprogram(name: "kmem_cache_alloc_trace", scope: !6, file: !6, line: 445, type: !221, scopeLine: 447, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!221 = !DISubroutineType(types: !222)
!222 = !{!47, !223, !58, !226}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_cache", file: !225, line: 117, flags: DIFlagFwdDecl)
!225 = !DIFile(filename: "./include/linux/mm_types.h", directory: "/home/lizy2001/genbc/linux")
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !59, line: 55, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !228, line: 72, baseType: !229)
!228 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !228, line: 16, baseType: !60)
!230 = !DILocation(line: 445, column: 72, scope: !220, inlinedAt: !231)
!231 = distinct !DILocation(line: 552, column: 10, scope: !232, inlinedAt: !237)
!232 = distinct !DILexicalBlock(scope: !233, file: !6, line: 540, column: 34)
!233 = distinct !DILexicalBlock(scope: !234, file: !6, line: 540, column: 6)
!234 = distinct !DISubprogram(name: "kmalloc", scope: !6, file: !6, line: 538, type: !235, scopeLine: 539, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!235 = !DISubroutineType(types: !236)
!236 = !{!47, !226, !58}
!237 = distinct !DILocation(line: 52, column: 9, scope: !215)
!238 = !DILocalVariable(name: "flags", arg: 2, scope: !220, file: !6, line: 446, type: !58)
!239 = !DILocation(line: 446, column: 9, scope: !220, inlinedAt: !231)
!240 = !DILocalVariable(name: "size", arg: 3, scope: !220, file: !6, line: 446, type: !226)
!241 = !DILocation(line: 446, column: 23, scope: !220, inlinedAt: !231)
!242 = !DILocalVariable(name: "ret", scope: !220, file: !6, line: 448, type: !47)
!243 = !DILocation(line: 448, column: 8, scope: !220, inlinedAt: !231)
!244 = !DILocalVariable(name: "flags", arg: 1, scope: !245, file: !6, line: 318, type: !58)
!245 = distinct !DISubprogram(name: "kmalloc_type", scope: !6, file: !6, line: 318, type: !246, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!246 = !DISubroutineType(types: !247)
!247 = !{!5, !58}
!248 = !DILocation(line: 318, column: 67, scope: !245, inlinedAt: !249)
!249 = distinct !DILocation(line: 553, column: 20, scope: !232, inlinedAt: !237)
!250 = !DILocalVariable(name: "size", arg: 1, scope: !251, file: !6, line: 346, type: !226)
!251 = distinct !DISubprogram(name: "kmalloc_index", scope: !6, file: !6, line: 346, type: !252, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!252 = !DISubroutineType(types: !253)
!253 = !{!7, !226}
!254 = !DILocation(line: 346, column: 58, scope: !251, inlinedAt: !255)
!255 = distinct !DILocation(line: 547, column: 11, scope: !232, inlinedAt: !237)
!256 = !DILocalVariable(name: "size", arg: 1, scope: !257, file: !6, line: 472, type: !226)
!257 = distinct !DISubprogram(name: "kmalloc_order_trace", scope: !6, file: !6, line: 472, type: !258, scopeLine: 473, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!258 = !DISubroutineType(types: !259)
!259 = !{!47, !226, !58, !7}
!260 = !DILocation(line: 472, column: 28, scope: !257, inlinedAt: !261)
!261 = distinct !DILocation(line: 481, column: 9, scope: !262, inlinedAt: !263)
!262 = distinct !DISubprogram(name: "kmalloc_large", scope: !6, file: !6, line: 478, type: !235, scopeLine: 479, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!263 = distinct !DILocation(line: 545, column: 11, scope: !264, inlinedAt: !237)
!264 = distinct !DILexicalBlock(scope: !232, file: !6, line: 544, column: 7)
!265 = !DILocalVariable(name: "flags", arg: 2, scope: !257, file: !6, line: 472, type: !58)
!266 = !DILocation(line: 472, column: 40, scope: !257, inlinedAt: !261)
!267 = !DILocalVariable(name: "order", arg: 3, scope: !257, file: !6, line: 472, type: !7)
!268 = !DILocation(line: 472, column: 60, scope: !257, inlinedAt: !261)
!269 = !DILocalVariable(name: "size", arg: 1, scope: !262, file: !6, line: 478, type: !226)
!270 = !DILocation(line: 478, column: 51, scope: !262, inlinedAt: !263)
!271 = !DILocalVariable(name: "flags", arg: 2, scope: !262, file: !6, line: 478, type: !58)
!272 = !DILocation(line: 478, column: 63, scope: !262, inlinedAt: !263)
!273 = !DILocalVariable(name: "order", scope: !262, file: !6, line: 480, type: !7)
!274 = !DILocation(line: 480, column: 15, scope: !262, inlinedAt: !263)
!275 = !DILocalVariable(name: "size", arg: 1, scope: !234, file: !6, line: 538, type: !226)
!276 = !DILocation(line: 538, column: 45, scope: !234, inlinedAt: !237)
!277 = !DILocalVariable(name: "flags", arg: 2, scope: !234, file: !6, line: 538, type: !58)
!278 = !DILocation(line: 538, column: 57, scope: !234, inlinedAt: !237)
!279 = !DILocalVariable(name: "index", scope: !232, file: !6, line: 542, type: !7)
!280 = !DILocation(line: 542, column: 16, scope: !232, inlinedAt: !237)
!281 = !DILocalVariable(name: "flags", arg: 1, scope: !282, file: !283, line: 162, type: !60)
!282 = distinct !DISubprogram(name: "arch_irqs_disabled_flags", scope: !283, file: !283, line: 162, type: !284, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !74)
!283 = !DIFile(filename: "./arch/x86/include/asm/irqflags.h", directory: "/home/lizy2001/genbc/linux")
!284 = !DISubroutineType(types: !285)
!285 = !{!286, !60}
!286 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!287 = !DILocation(line: 162, column: 67, scope: !282, inlinedAt: !288)
!288 = distinct !DILocation(line: 52, column: 23, scope: !289)
!289 = distinct !DILexicalBlock(scope: !290, file: !216, line: 52, column: 23)
!290 = distinct !DILexicalBlock(scope: !215, file: !216, line: 52, column: 23)
!291 = !DILocalVariable(name: "size", arg: 1, scope: !215, file: !216, line: 50, type: !48)
!292 = !DILocation(line: 50, column: 48, scope: !215)
!293 = !DILocation(line: 52, column: 17, scope: !215)
!294 = !DILocalVariable(name: "_flags", scope: !290, file: !216, line: 52, type: !60)
!295 = !DILocation(line: 52, column: 23, scope: !290)
!296 = !DILocalVariable(name: "__dummy", scope: !297, file: !216, line: 52, type: !60)
!297 = distinct !DILexicalBlock(scope: !298, file: !216, line: 52, column: 23)
!298 = distinct !DILexicalBlock(scope: !290, file: !216, line: 52, column: 23)
!299 = !DILocation(line: 52, column: 23, scope: !297)
!300 = !DILocalVariable(name: "__dummy2", scope: !297, file: !216, line: 52, type: !60)
!301 = !DILocation(line: 52, column: 23, scope: !298)
!302 = !DILocalVariable(name: "__dummy", scope: !303, file: !216, line: 52, type: !60)
!303 = distinct !DILexicalBlock(scope: !289, file: !216, line: 52, column: 23)
!304 = !DILocation(line: 52, column: 23, scope: !303)
!305 = !DILocalVariable(name: "__dummy2", scope: !303, file: !216, line: 52, type: !60)
!306 = !DILocation(line: 52, column: 23, scope: !289)
!307 = !DILocation(line: 164, column: 11, scope: !282, inlinedAt: !288)
!308 = !DILocation(line: 164, column: 17, scope: !282, inlinedAt: !288)
!309 = !DILocation(line: 164, column: 9, scope: !282, inlinedAt: !288)
!310 = !DILocation(line: 52, column: 23, scope: !215)
!311 = !DILocation(line: 540, column: 27, scope: !233, inlinedAt: !237)
!312 = !DILocation(line: 540, column: 6, scope: !233, inlinedAt: !237)
!313 = !DILocation(line: 540, column: 6, scope: !234, inlinedAt: !237)
!314 = !DILocation(line: 544, column: 7, scope: !264, inlinedAt: !237)
!315 = !DILocation(line: 544, column: 12, scope: !264, inlinedAt: !237)
!316 = !DILocation(line: 544, column: 7, scope: !232, inlinedAt: !237)
!317 = !DILocation(line: 545, column: 25, scope: !264, inlinedAt: !237)
!318 = !DILocation(line: 545, column: 31, scope: !264, inlinedAt: !237)
!319 = !DILocation(line: 480, column: 33, scope: !262, inlinedAt: !263)
!320 = !DILocation(line: 480, column: 23, scope: !262, inlinedAt: !263)
!321 = !DILocation(line: 481, column: 29, scope: !262, inlinedAt: !263)
!322 = !DILocation(line: 481, column: 35, scope: !262, inlinedAt: !263)
!323 = !DILocation(line: 481, column: 42, scope: !262, inlinedAt: !263)
!324 = !DILocation(line: 474, column: 23, scope: !257, inlinedAt: !261)
!325 = !DILocation(line: 474, column: 29, scope: !257, inlinedAt: !261)
!326 = !DILocation(line: 474, column: 36, scope: !257, inlinedAt: !261)
!327 = !DILocation(line: 474, column: 9, scope: !257, inlinedAt: !261)
!328 = !DILocation(line: 545, column: 4, scope: !264, inlinedAt: !237)
!329 = !DILocation(line: 547, column: 25, scope: !232, inlinedAt: !237)
!330 = !DILocation(line: 348, column: 7, scope: !331, inlinedAt: !255)
!331 = distinct !DILexicalBlock(scope: !251, file: !6, line: 348, column: 6)
!332 = !DILocation(line: 348, column: 6, scope: !251, inlinedAt: !255)
!333 = !DILocation(line: 349, column: 3, scope: !331, inlinedAt: !255)
!334 = !DILocation(line: 351, column: 6, scope: !335, inlinedAt: !255)
!335 = distinct !DILexicalBlock(scope: !251, file: !6, line: 351, column: 6)
!336 = !DILocation(line: 351, column: 11, scope: !335, inlinedAt: !255)
!337 = !DILocation(line: 351, column: 6, scope: !251, inlinedAt: !255)
!338 = !DILocation(line: 352, column: 3, scope: !335, inlinedAt: !255)
!339 = !DILocation(line: 354, column: 32, scope: !340, inlinedAt: !255)
!340 = distinct !DILexicalBlock(scope: !251, file: !6, line: 354, column: 6)
!341 = !DILocation(line: 354, column: 37, scope: !340, inlinedAt: !255)
!342 = !DILocation(line: 354, column: 42, scope: !340, inlinedAt: !255)
!343 = !DILocation(line: 354, column: 45, scope: !340, inlinedAt: !255)
!344 = !DILocation(line: 354, column: 50, scope: !340, inlinedAt: !255)
!345 = !DILocation(line: 354, column: 6, scope: !251, inlinedAt: !255)
!346 = !DILocation(line: 355, column: 3, scope: !340, inlinedAt: !255)
!347 = !DILocation(line: 356, column: 32, scope: !348, inlinedAt: !255)
!348 = distinct !DILexicalBlock(scope: !251, file: !6, line: 356, column: 6)
!349 = !DILocation(line: 356, column: 37, scope: !348, inlinedAt: !255)
!350 = !DILocation(line: 356, column: 43, scope: !348, inlinedAt: !255)
!351 = !DILocation(line: 356, column: 46, scope: !348, inlinedAt: !255)
!352 = !DILocation(line: 356, column: 51, scope: !348, inlinedAt: !255)
!353 = !DILocation(line: 356, column: 6, scope: !251, inlinedAt: !255)
!354 = !DILocation(line: 357, column: 3, scope: !348, inlinedAt: !255)
!355 = !DILocation(line: 358, column: 6, scope: !356, inlinedAt: !255)
!356 = distinct !DILexicalBlock(scope: !251, file: !6, line: 358, column: 6)
!357 = !DILocation(line: 358, column: 11, scope: !356, inlinedAt: !255)
!358 = !DILocation(line: 358, column: 6, scope: !251, inlinedAt: !255)
!359 = !DILocation(line: 358, column: 26, scope: !356, inlinedAt: !255)
!360 = !DILocation(line: 359, column: 6, scope: !361, inlinedAt: !255)
!361 = distinct !DILexicalBlock(scope: !251, file: !6, line: 359, column: 6)
!362 = !DILocation(line: 359, column: 11, scope: !361, inlinedAt: !255)
!363 = !DILocation(line: 359, column: 6, scope: !251, inlinedAt: !255)
!364 = !DILocation(line: 359, column: 26, scope: !361, inlinedAt: !255)
!365 = !DILocation(line: 360, column: 6, scope: !366, inlinedAt: !255)
!366 = distinct !DILexicalBlock(scope: !251, file: !6, line: 360, column: 6)
!367 = !DILocation(line: 360, column: 11, scope: !366, inlinedAt: !255)
!368 = !DILocation(line: 360, column: 6, scope: !251, inlinedAt: !255)
!369 = !DILocation(line: 360, column: 26, scope: !366, inlinedAt: !255)
!370 = !DILocation(line: 361, column: 6, scope: !371, inlinedAt: !255)
!371 = distinct !DILexicalBlock(scope: !251, file: !6, line: 361, column: 6)
!372 = !DILocation(line: 361, column: 11, scope: !371, inlinedAt: !255)
!373 = !DILocation(line: 361, column: 6, scope: !251, inlinedAt: !255)
!374 = !DILocation(line: 361, column: 26, scope: !371, inlinedAt: !255)
!375 = !DILocation(line: 362, column: 6, scope: !376, inlinedAt: !255)
!376 = distinct !DILexicalBlock(scope: !251, file: !6, line: 362, column: 6)
!377 = !DILocation(line: 362, column: 11, scope: !376, inlinedAt: !255)
!378 = !DILocation(line: 362, column: 6, scope: !251, inlinedAt: !255)
!379 = !DILocation(line: 362, column: 26, scope: !376, inlinedAt: !255)
!380 = !DILocation(line: 363, column: 6, scope: !381, inlinedAt: !255)
!381 = distinct !DILexicalBlock(scope: !251, file: !6, line: 363, column: 6)
!382 = !DILocation(line: 363, column: 11, scope: !381, inlinedAt: !255)
!383 = !DILocation(line: 363, column: 6, scope: !251, inlinedAt: !255)
!384 = !DILocation(line: 363, column: 26, scope: !381, inlinedAt: !255)
!385 = !DILocation(line: 364, column: 6, scope: !386, inlinedAt: !255)
!386 = distinct !DILexicalBlock(scope: !251, file: !6, line: 364, column: 6)
!387 = !DILocation(line: 364, column: 11, scope: !386, inlinedAt: !255)
!388 = !DILocation(line: 364, column: 6, scope: !251, inlinedAt: !255)
!389 = !DILocation(line: 364, column: 26, scope: !386, inlinedAt: !255)
!390 = !DILocation(line: 365, column: 6, scope: !391, inlinedAt: !255)
!391 = distinct !DILexicalBlock(scope: !251, file: !6, line: 365, column: 6)
!392 = !DILocation(line: 365, column: 11, scope: !391, inlinedAt: !255)
!393 = !DILocation(line: 365, column: 6, scope: !251, inlinedAt: !255)
!394 = !DILocation(line: 365, column: 26, scope: !391, inlinedAt: !255)
!395 = !DILocation(line: 366, column: 6, scope: !396, inlinedAt: !255)
!396 = distinct !DILexicalBlock(scope: !251, file: !6, line: 366, column: 6)
!397 = !DILocation(line: 366, column: 11, scope: !396, inlinedAt: !255)
!398 = !DILocation(line: 366, column: 6, scope: !251, inlinedAt: !255)
!399 = !DILocation(line: 366, column: 26, scope: !396, inlinedAt: !255)
!400 = !DILocation(line: 367, column: 6, scope: !401, inlinedAt: !255)
!401 = distinct !DILexicalBlock(scope: !251, file: !6, line: 367, column: 6)
!402 = !DILocation(line: 367, column: 11, scope: !401, inlinedAt: !255)
!403 = !DILocation(line: 367, column: 6, scope: !251, inlinedAt: !255)
!404 = !DILocation(line: 367, column: 26, scope: !401, inlinedAt: !255)
!405 = !DILocation(line: 368, column: 6, scope: !406, inlinedAt: !255)
!406 = distinct !DILexicalBlock(scope: !251, file: !6, line: 368, column: 6)
!407 = !DILocation(line: 368, column: 11, scope: !406, inlinedAt: !255)
!408 = !DILocation(line: 368, column: 6, scope: !251, inlinedAt: !255)
!409 = !DILocation(line: 368, column: 26, scope: !406, inlinedAt: !255)
!410 = !DILocation(line: 369, column: 6, scope: !411, inlinedAt: !255)
!411 = distinct !DILexicalBlock(scope: !251, file: !6, line: 369, column: 6)
!412 = !DILocation(line: 369, column: 11, scope: !411, inlinedAt: !255)
!413 = !DILocation(line: 369, column: 6, scope: !251, inlinedAt: !255)
!414 = !DILocation(line: 369, column: 26, scope: !411, inlinedAt: !255)
!415 = !DILocation(line: 370, column: 6, scope: !416, inlinedAt: !255)
!416 = distinct !DILexicalBlock(scope: !251, file: !6, line: 370, column: 6)
!417 = !DILocation(line: 370, column: 11, scope: !416, inlinedAt: !255)
!418 = !DILocation(line: 370, column: 6, scope: !251, inlinedAt: !255)
!419 = !DILocation(line: 370, column: 26, scope: !416, inlinedAt: !255)
!420 = !DILocation(line: 371, column: 6, scope: !421, inlinedAt: !255)
!421 = distinct !DILexicalBlock(scope: !251, file: !6, line: 371, column: 6)
!422 = !DILocation(line: 371, column: 11, scope: !421, inlinedAt: !255)
!423 = !DILocation(line: 371, column: 6, scope: !251, inlinedAt: !255)
!424 = !DILocation(line: 371, column: 26, scope: !421, inlinedAt: !255)
!425 = !DILocation(line: 372, column: 6, scope: !426, inlinedAt: !255)
!426 = distinct !DILexicalBlock(scope: !251, file: !6, line: 372, column: 6)
!427 = !DILocation(line: 372, column: 11, scope: !426, inlinedAt: !255)
!428 = !DILocation(line: 372, column: 6, scope: !251, inlinedAt: !255)
!429 = !DILocation(line: 372, column: 26, scope: !426, inlinedAt: !255)
!430 = !DILocation(line: 373, column: 6, scope: !431, inlinedAt: !255)
!431 = distinct !DILexicalBlock(scope: !251, file: !6, line: 373, column: 6)
!432 = !DILocation(line: 373, column: 11, scope: !431, inlinedAt: !255)
!433 = !DILocation(line: 373, column: 6, scope: !251, inlinedAt: !255)
!434 = !DILocation(line: 373, column: 26, scope: !431, inlinedAt: !255)
!435 = !DILocation(line: 374, column: 6, scope: !436, inlinedAt: !255)
!436 = distinct !DILexicalBlock(scope: !251, file: !6, line: 374, column: 6)
!437 = !DILocation(line: 374, column: 11, scope: !436, inlinedAt: !255)
!438 = !DILocation(line: 374, column: 6, scope: !251, inlinedAt: !255)
!439 = !DILocation(line: 374, column: 26, scope: !436, inlinedAt: !255)
!440 = !DILocation(line: 375, column: 6, scope: !441, inlinedAt: !255)
!441 = distinct !DILexicalBlock(scope: !251, file: !6, line: 375, column: 6)
!442 = !DILocation(line: 375, column: 11, scope: !441, inlinedAt: !255)
!443 = !DILocation(line: 375, column: 6, scope: !251, inlinedAt: !255)
!444 = !DILocation(line: 375, column: 27, scope: !441, inlinedAt: !255)
!445 = !DILocation(line: 376, column: 6, scope: !446, inlinedAt: !255)
!446 = distinct !DILexicalBlock(scope: !251, file: !6, line: 376, column: 6)
!447 = !DILocation(line: 376, column: 11, scope: !446, inlinedAt: !255)
!448 = !DILocation(line: 376, column: 6, scope: !251, inlinedAt: !255)
!449 = !DILocation(line: 376, column: 32, scope: !446, inlinedAt: !255)
!450 = !DILocation(line: 377, column: 6, scope: !451, inlinedAt: !255)
!451 = distinct !DILexicalBlock(scope: !251, file: !6, line: 377, column: 6)
!452 = !DILocation(line: 377, column: 11, scope: !451, inlinedAt: !255)
!453 = !DILocation(line: 377, column: 6, scope: !251, inlinedAt: !255)
!454 = !DILocation(line: 377, column: 32, scope: !451, inlinedAt: !255)
!455 = !DILocation(line: 378, column: 6, scope: !456, inlinedAt: !255)
!456 = distinct !DILexicalBlock(scope: !251, file: !6, line: 378, column: 6)
!457 = !DILocation(line: 378, column: 11, scope: !456, inlinedAt: !255)
!458 = !DILocation(line: 378, column: 6, scope: !251, inlinedAt: !255)
!459 = !DILocation(line: 378, column: 32, scope: !456, inlinedAt: !255)
!460 = !DILocation(line: 379, column: 6, scope: !461, inlinedAt: !255)
!461 = distinct !DILexicalBlock(scope: !251, file: !6, line: 379, column: 6)
!462 = !DILocation(line: 379, column: 11, scope: !461, inlinedAt: !255)
!463 = !DILocation(line: 379, column: 6, scope: !251, inlinedAt: !255)
!464 = !DILocation(line: 379, column: 33, scope: !461, inlinedAt: !255)
!465 = !DILocation(line: 380, column: 6, scope: !466, inlinedAt: !255)
!466 = distinct !DILexicalBlock(scope: !251, file: !6, line: 380, column: 6)
!467 = !DILocation(line: 380, column: 11, scope: !466, inlinedAt: !255)
!468 = !DILocation(line: 380, column: 6, scope: !251, inlinedAt: !255)
!469 = !DILocation(line: 380, column: 33, scope: !466, inlinedAt: !255)
!470 = !DILocation(line: 381, column: 6, scope: !471, inlinedAt: !255)
!471 = distinct !DILexicalBlock(scope: !251, file: !6, line: 381, column: 6)
!472 = !DILocation(line: 381, column: 11, scope: !471, inlinedAt: !255)
!473 = !DILocation(line: 381, column: 6, scope: !251, inlinedAt: !255)
!474 = !DILocation(line: 381, column: 33, scope: !471, inlinedAt: !255)
!475 = !DILocation(line: 382, column: 2, scope: !476, inlinedAt: !255)
!476 = distinct !DILexicalBlock(scope: !477, file: !6, line: 382, column: 2)
!477 = distinct !DILexicalBlock(scope: !251, file: !6, line: 382, column: 2)
!478 = !{i32 -2144106973, i32 -2144106944, i32 -2144106898, i32 -2144106840, i32 -2144106786, i32 -2144106732, i32 -2144106677, i32 -2144106646}
!479 = !DILocation(line: 382, column: 2, scope: !480, inlinedAt: !255)
!480 = distinct !DILexicalBlock(scope: !481, file: !6, line: 382, column: 2)
!481 = distinct !DILexicalBlock(scope: !477, file: !6, line: 382, column: 2)
!482 = !{i32 -2144106203, i32 -2144106196, i32 -2144106142, i32 -2144106111, i32 -2144106081}
!483 = !DILocation(line: 382, column: 2, scope: !481, inlinedAt: !255)
!484 = !DILocation(line: 386, column: 1, scope: !251, inlinedAt: !255)
!485 = !DILocation(line: 547, column: 9, scope: !232, inlinedAt: !237)
!486 = !DILocation(line: 549, column: 8, scope: !487, inlinedAt: !237)
!487 = distinct !DILexicalBlock(scope: !232, file: !6, line: 549, column: 7)
!488 = !DILocation(line: 549, column: 7, scope: !232, inlinedAt: !237)
!489 = !DILocation(line: 550, column: 4, scope: !487, inlinedAt: !237)
!490 = !DILocation(line: 553, column: 33, scope: !232, inlinedAt: !237)
!491 = !DILocation(line: 325, column: 6, scope: !492, inlinedAt: !249)
!492 = distinct !DILexicalBlock(scope: !245, file: !6, line: 325, column: 6)
!493 = !DILocation(line: 325, column: 6, scope: !245, inlinedAt: !249)
!494 = !DILocation(line: 326, column: 3, scope: !492, inlinedAt: !249)
!495 = !DILocation(line: 332, column: 9, scope: !245, inlinedAt: !249)
!496 = !DILocation(line: 332, column: 15, scope: !245, inlinedAt: !249)
!497 = !DILocation(line: 332, column: 2, scope: !245, inlinedAt: !249)
!498 = !DILocation(line: 336, column: 1, scope: !245, inlinedAt: !249)
!499 = !DILocation(line: 553, column: 5, scope: !232, inlinedAt: !237)
!500 = !DILocation(line: 553, column: 41, scope: !232, inlinedAt: !237)
!501 = !DILocation(line: 554, column: 5, scope: !232, inlinedAt: !237)
!502 = !DILocation(line: 554, column: 12, scope: !232, inlinedAt: !237)
!503 = !DILocation(line: 448, column: 31, scope: !220, inlinedAt: !231)
!504 = !DILocation(line: 448, column: 34, scope: !220, inlinedAt: !231)
!505 = !DILocation(line: 448, column: 14, scope: !220, inlinedAt: !231)
!506 = !DILocation(line: 450, column: 22, scope: !220, inlinedAt: !231)
!507 = !DILocation(line: 450, column: 25, scope: !220, inlinedAt: !231)
!508 = !DILocation(line: 450, column: 30, scope: !220, inlinedAt: !231)
!509 = !DILocation(line: 450, column: 36, scope: !220, inlinedAt: !231)
!510 = !DILocation(line: 450, column: 8, scope: !220, inlinedAt: !231)
!511 = !DILocation(line: 450, column: 6, scope: !220, inlinedAt: !231)
!512 = !DILocation(line: 451, column: 9, scope: !220, inlinedAt: !231)
!513 = !DILocation(line: 552, column: 3, scope: !232, inlinedAt: !237)
!514 = !DILocation(line: 557, column: 19, scope: !234, inlinedAt: !237)
!515 = !DILocation(line: 557, column: 25, scope: !234, inlinedAt: !237)
!516 = !DILocation(line: 557, column: 9, scope: !234, inlinedAt: !237)
!517 = !DILocation(line: 557, column: 2, scope: !234, inlinedAt: !237)
!518 = !DILocation(line: 558, column: 1, scope: !234, inlinedAt: !237)
!519 = !DILocation(line: 52, column: 2, scope: !215)
!520 = distinct !DISubprogram(name: "acpi_tb_parse_root_table", scope: !3, file: !3, line: 222, type: !521, scopeLine: 223, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !74)
!521 = !DISubroutineType(types: !522)
!522 = !{!14, !53}
!523 = !DILocalVariable(name: "rsdp_address", arg: 1, scope: !520, file: !3, line: 222, type: !53)
!524 = !DILocation(line: 222, column: 48, scope: !520)
!525 = !DILocalVariable(name: "rsdp", scope: !520, file: !3, line: 224, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_rsdp", file: !23, line: 105, size: 288, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !527, file: !23, line: 106, baseType: !41, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !527, file: !23, line: 107, baseType: !32, size: 8, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !527, file: !23, line: 108, baseType: !37, size: 48, offset: 72)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !527, file: !23, line: 109, baseType: !32, size: 8, offset: 120)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rsdt_physical_address", scope: !527, file: !23, line: 110, baseType: !16, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !527, file: !23, line: 111, baseType: !16, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "xsdt_physical_address", scope: !527, file: !23, line: 112, baseType: !49, size: 64, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "extended_checksum", scope: !527, file: !23, line: 113, baseType: !32, size: 8, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !527, file: !23, line: 114, baseType: !88, size: 24, offset: 264)
!538 = !DILocation(line: 224, column: 26, scope: !520)
!539 = !DILocalVariable(name: "table_entry_size", scope: !520, file: !3, line: 225, type: !16)
!540 = !DILocation(line: 225, column: 6, scope: !520)
!541 = !DILocalVariable(name: "i", scope: !520, file: !3, line: 226, type: !16)
!542 = !DILocation(line: 226, column: 6, scope: !520)
!543 = !DILocalVariable(name: "table_count", scope: !520, file: !3, line: 227, type: !16)
!544 = !DILocation(line: 227, column: 6, scope: !520)
!545 = !DILocalVariable(name: "table", scope: !520, file: !3, line: 228, type: !21)
!546 = !DILocation(line: 228, column: 28, scope: !520)
!547 = !DILocalVariable(name: "address", scope: !520, file: !3, line: 229, type: !53)
!548 = !DILocation(line: 229, column: 24, scope: !520)
!549 = !DILocalVariable(name: "length", scope: !520, file: !3, line: 230, type: !16)
!550 = !DILocation(line: 230, column: 6, scope: !520)
!551 = !DILocalVariable(name: "table_entry", scope: !520, file: !3, line: 231, type: !52)
!552 = !DILocation(line: 231, column: 6, scope: !520)
!553 = !DILocalVariable(name: "status", scope: !520, file: !3, line: 232, type: !14)
!554 = !DILocation(line: 232, column: 14, scope: !520)
!555 = !DILocalVariable(name: "table_index", scope: !520, file: !3, line: 233, type: !16)
!556 = !DILocation(line: 233, column: 6, scope: !520)
!557 = !DILocation(line: 239, column: 28, scope: !520)
!558 = !DILocation(line: 239, column: 9, scope: !520)
!559 = !DILocation(line: 239, column: 7, scope: !520)
!560 = !DILocation(line: 240, column: 7, scope: !561)
!561 = distinct !DILexicalBlock(scope: !520, file: !3, line: 240, column: 6)
!562 = !DILocation(line: 240, column: 6, scope: !520)
!563 = !DILocation(line: 241, column: 3, scope: !564)
!564 = distinct !DILexicalBlock(scope: !561, file: !3, line: 240, column: 13)
!565 = !DILocation(line: 244, column: 29, scope: !520)
!566 = !DILocation(line: 245, column: 8, scope: !520)
!567 = !DILocation(line: 244, column: 2, scope: !520)
!568 = !DILocation(line: 250, column: 7, scope: !569)
!569 = distinct !DILexicalBlock(scope: !520, file: !3, line: 250, column: 6)
!570 = !DILocation(line: 250, column: 13, scope: !569)
!571 = !DILocation(line: 250, column: 22, scope: !569)
!572 = !DILocation(line: 250, column: 27, scope: !569)
!573 = !DILocation(line: 251, column: 6, scope: !569)
!574 = !DILocation(line: 251, column: 12, scope: !569)
!575 = !DILocation(line: 251, column: 34, scope: !569)
!576 = !DILocation(line: 251, column: 38, scope: !569)
!577 = !DILocation(line: 250, column: 6, scope: !520)
!578 = !DILocation(line: 257, column: 36, scope: !579)
!579 = distinct !DILexicalBlock(scope: !569, file: !3, line: 251, column: 64)
!580 = !DILocation(line: 257, column: 42, scope: !579)
!581 = !DILocation(line: 257, column: 11, scope: !579)
!582 = !DILocation(line: 258, column: 20, scope: !579)
!583 = !DILocation(line: 259, column: 2, scope: !579)
!584 = !DILocation(line: 262, column: 36, scope: !585)
!585 = distinct !DILexicalBlock(scope: !569, file: !3, line: 259, column: 9)
!586 = !DILocation(line: 262, column: 42, scope: !585)
!587 = !DILocation(line: 262, column: 13, scope: !585)
!588 = !DILocation(line: 262, column: 11, scope: !585)
!589 = !DILocation(line: 263, column: 20, scope: !585)
!590 = !DILocation(line: 270, column: 23, scope: !520)
!591 = !DILocation(line: 270, column: 2, scope: !520)
!592 = !DILocation(line: 274, column: 29, scope: !520)
!593 = !DILocation(line: 274, column: 10, scope: !520)
!594 = !DILocation(line: 274, column: 8, scope: !520)
!595 = !DILocation(line: 275, column: 7, scope: !596)
!596 = distinct !DILexicalBlock(scope: !520, file: !3, line: 275, column: 6)
!597 = !DILocation(line: 275, column: 6, scope: !520)
!598 = !DILocation(line: 276, column: 3, scope: !599)
!599 = distinct !DILexicalBlock(scope: !596, file: !3, line: 275, column: 14)
!600 = !DILocation(line: 279, column: 29, scope: !520)
