; ModuleID = '../bcout/drivers/acpi/acpica/tbxfroot.llvm.bc'
source_filename = "drivers/acpi/acpica/tbxfroot.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_rsdp = type <{ [8 x i8], i8, [6 x i8], i8, i32, i32, i64, i8, [3 x i8] }>

@.str = private unnamed_addr constant [9 x i8] c"RSD PTR \00", align 1
@_acpi_module_name = internal constant [9 x i8] c"tbxfroot\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [46 x i8] c"Could not map memory at 0x%8.8X for length %u\00", align 1
@.str.2 = private unnamed_addr constant [27 x i8] c"A valid RSDP was not found\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @acpi_tb_get_rsdp_length(%struct.acpi_table_rsdp* %rsdp) #0 !dbg !62 {
entry:
  %retval = alloca i32, align 4
  %rsdp.addr = alloca %struct.acpi_table_rsdp*, align 8
  store %struct.acpi_table_rsdp* %rsdp, %struct.acpi_table_rsdp** %rsdp.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.acpi_table_rsdp** %rsdp.addr, metadata !65, metadata !DIExpression()), !dbg !66
  %0 = load %struct.acpi_table_rsdp*, %struct.acpi_table_rsdp** %rsdp.addr, align 8, !dbg !67
  %signature = getelementptr inbounds %struct.acpi_table_rsdp, %struct.acpi_table_rsdp* %0, i32 0, i32 0, !dbg !67
  %arraydecay = getelementptr inbounds [8 x i8], [8 x i8]* %signature, i64 0, i64 0, !dbg !67

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !53, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !52, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbxfroot.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !8, !9, !16, !20, !24, !28, !11, !29, !30}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !10, line: 421, baseType: !11)
!10 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !12, line: 21, baseType: !13)
!12 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !14, line: 27, baseType: !15)
!14 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !12, line: 17, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !14, line: 21, baseType: !19)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !10, line: 129, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !12, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !14, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !12, line: 19, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !14, line: 24, baseType: !27)
!27 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !10, line: 127, baseType: !21)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_rsdp", file: !32, line: 105, size: 288, elements: !33)
!32 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!33 = !{!34, !38, !39, !43, !44, !45, !46, !47, !48}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !31, file: !32, line: 106, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 8)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !31, file: !32, line: 107, baseType: !17, size: 8, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !31, file: !32, line: 108, baseType: !40, size: 48, offset: 72)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 6)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !31, file: !32, line: 109, baseType: !17, size: 8, offset: 120)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rsdt_physical_address", scope: !31, file: !32, line: 110, baseType: !11, size: 32, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !31, file: !32, line: 111, baseType: !11, size: 32, offset: 160)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "xsdt_physical_address", scope: !31, file: !32, line: 112, baseType: !21, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "extended_checksum", scope: !31, file: !32, line: 113, baseType: !17, size: 8, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !31, file: !32, line: 114, baseType: !49, size: 24, offset: 264)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 24, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 3)
!52 = !{!0}
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 72, elements: !55)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!55 = !{!56}
!56 = !DISubrange(count: 9)
!57 = !{i32 7, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 2}
!60 = !{i32 1, !"Code Model", i32 2}
!61 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!62 = distinct !DISubprogram(name: "acpi_tb_get_rsdp_length", scope: !3, file: !3, line: 28, type: !63, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!63 = !DISubroutineType(types: !64)
!64 = !{!11, !30}
!65 = !DILocalVariable(name: "rsdp", arg: 1, scope: !62, file: !3, line: 28, type: !30)
!66 = !DILocation(line: 28, column: 53, scope: !62)
!67 = !DILocation(line: 31, column: 7, scope: !68)
!68 = distinct !DILexicalBlock(scope: !62, file: !3, line: 31, column: 6)
!69 = !DILocation(line: 31, column: 6, scope: !62)
!70 = !DILocation(line: 35, column: 3, scope: !71)
!71 = distinct !DILexicalBlock(scope: !68, file: !3, line: 31, column: 48)
!72 = !DILocation(line: 40, column: 6, scope: !73)
!73 = distinct !DILexicalBlock(scope: !62, file: !3, line: 40, column: 6)
!74 = !DILocation(line: 40, column: 12, scope: !73)
!75 = !DILocation(line: 40, column: 21, scope: !73)
!76 = !DILocation(line: 40, column: 6, scope: !62)
!77 = !DILocation(line: 41, column: 11, scope: !78)
!78 = distinct !DILexicalBlock(scope: !73, file: !3, line: 40, column: 27)
!79 = !DILocation(line: 41, column: 17, scope: !78)
!80 = !DILocation(line: 41, column: 3, scope: !78)
!81 = !DILocation(line: 43, column: 3, scope: !82)
!82 = distinct !DILexicalBlock(scope: !73, file: !3, line: 42, column: 9)
!83 = !DILocation(line: 45, column: 1, scope: !62)
!84 = distinct !DISubprogram(name: "acpi_tb_validate_rsdp", scope: !3, file: !3, line: 59, type: !85, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{!9, !30}
!87 = !DILocalVariable(name: "rsdp", arg: 1, scope: !84, file: !3, line: 59, type: !30)
!88 = !DILocation(line: 59, column: 59, scope: !84)
!89 = !DILocation(line: 68, column: 7, scope: !90)
!90 = distinct !DILexicalBlock(scope: !84, file: !3, line: 68, column: 6)
!91 = !DILocation(line: 68, column: 6, scope: !84)
!92 = !DILocation(line: 72, column: 3, scope: !93)
!93 = distinct !DILexicalBlock(scope: !90, file: !3, line: 68, column: 48)
!94 = !DILocation(line: 77, column: 30, scope: !95)
!95 = distinct !DILexicalBlock(scope: !84, file: !3, line: 77, column: 6)
!96 = !DILocation(line: 77, column: 23, scope: !95)
!97 = !DILocation(line: 77, column: 6, scope: !95)
!98 = !DILocation(line: 77, column: 63, scope: !95)
!99 = !DILocation(line: 77, column: 6, scope: !84)
!100 = !DILocation(line: 78, column: 3, scope: !101)
!101 = distinct !DILexicalBlock(scope: !95, file: !3, line: 77, column: 69)
!102 = !DILocation(line: 83, column: 7, scope: !103)
!103 = distinct !DILexicalBlock(scope: !84, file: !3, line: 83, column: 6)
!104 = !DILocation(line: 83, column: 13, scope: !103)
!105 = !DILocation(line: 83, column: 22, scope: !103)
!106 = !DILocation(line: 83, column: 28, scope: !103)
!107 = !DILocation(line: 84, column: 31, scope: !103)
!108 = !DILocation(line: 84, column: 24, scope: !103)
!109 = !DILocation(line: 84, column: 7, scope: !103)
!110 = !DILocation(line: 84, column: 65, scope: !103)
!111 = !DILocation(line: 83, column: 6, scope: !84)
!112 = !DILocation(line: 85, column: 3, scope: !113)
!113 = distinct !DILexicalBlock(scope: !103, file: !3, line: 84, column: 72)
!114 = !DILocation(line: 88, column: 2, scope: !84)
