; ModuleID = '../bcout/drivers/acpi/acpica/tbxface.llvm.bc'
source_filename = "drivers/acpi/acpica/tbxface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_table_list = type { %struct.acpi_table_desc*, i32, i32, i8 }
%struct.acpi_table_desc = type { i64, %struct.acpi_table_header*, i32, %union.acpi_name_union, i16, i8, i16 }
%struct.acpi_table_header = type { [4 x i8], i32, i8, i8, [6 x i8], [8 x i8], i32, [4 x i8], i32 }
%union.acpi_name_union = type { i32 }

@acpi_gbl_root_table_list = external dso_local global %struct.acpi_table_list, align 8
@acpi_gbl_enable_table_validation = external dso_local global i8, align 1
@_acpi_module_name = internal constant [8 x i8] c"tbxface\00", align 1, !dbg !0
@.str = private unnamed_addr constant [57 x i8] c"Table [%4.4s] is not invalidated during early boot stage\00", align 1
@acpi_gbl_table_handler = external dso_local global i32 (i32, i8*, i8*)*, align 8
@acpi_gbl_table_handler_context = external dso_local global i8*, align 8

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @acpi_allocate_root_table(i32 %initial_table_count) #0 !dbg !30 {
entry:
  %initial_table_count.addr = alloca i32, align 4
  store i32 %initial_table_count, i32* %initial_table_count.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %initial_table_count.addr, metadata !33, metadata !DIExpression()), !dbg !34

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 17, type: !20, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/tbxface.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !13, !17, !18}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !7, line: 127, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !16)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !{!0}
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 64, elements: !23)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: 8)
!25 = !{i32 7, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 2}
!28 = !{i32 1, !"Code Model", i32 2}
!29 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!30 = distinct !DISubprogram(name: "acpi_allocate_root_table", scope: !3, file: !3, line: 32, type: !31, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!31 = !DISubroutineType(types: !32)
!32 = !{!13, !14}
!33 = !DILocalVariable(name: "initial_table_count", arg: 1, scope: !30, file: !3, line: 32, type: !14)
!34 = !DILocation(line: 32, column: 42, scope: !30)
!35 = !DILocation(line: 35, column: 45, scope: !30)
!36 = !DILocation(line: 35, column: 43, scope: !30)
!37 = !DILocation(line: 36, column: 33, scope: !30)
!38 = !DILocation(line: 38, column: 10, scope: !30)
!39 = !DILocation(line: 38, column: 2, scope: !30)
!40 = distinct !DISubprogram(name: "acpi_initialize_tables", scope: !3, file: !3, line: 68, type: !41, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!41 = !DISubroutineType(types: !42)
!42 = !{!13, !43, !14, !59}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_desc", file: !45, line: 334, size: 256, elements: !46)
!45 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!46 = !{!47, !49, !72, !73, !78, !83, !84}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !44, file: !45, line: 335, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !8)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !44, file: !45, line: 336, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_table_header", file: !45, line: 68, size: 288, elements: !52)
!52 = !{!53, !57, !58, !62, !63, !67, !69, !70, !71}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !51, file: !45, line: 69, baseType: !54, size: 32)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 4)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !51, file: !45, line: 70, baseType: !14, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !51, file: !45, line: 71, baseType: !59, size: 8, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !61)
!61 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !51, file: !45, line: 72, baseType: !59, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "oem_id", scope: !51, file: !45, line: 73, baseType: !64, size: 48, offset: 80)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 48, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 6)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "oem_table_id", scope: !51, file: !45, line: 74, baseType: !68, size: 64, offset: 128)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !23)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "oem_revision", scope: !51, file: !45, line: 75, baseType: !14, size: 32, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_id", scope: !51, file: !45, line: 76, baseType: !54, size: 32, offset: 224)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "asl_compiler_revision", scope: !51, file: !45, line: 77, baseType: !14, size: 32, offset: 256)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !45, line: 337, baseType: !14, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !44, file: !45, line: 338, baseType: !74, size: 32, offset: 160)
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !45, line: 327, size: 32, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !74, file: !45, line: 328, baseType: !14, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !74, file: !45, line: 329, baseType: !54, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !44, file: !45, line: 339, baseType: !79, size: 16, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !7, line: 445, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !82)
!82 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !45, line: 340, baseType: !59, size: 8, offset: 208)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "validation_count", scope: !44, file: !45, line: 341, baseType: !80, size: 16, offset: 224)
!85 = !DILocalVariable(name: "initial_table_array", arg: 1, scope: !40, file: !3, line: 68, type: !43)
!86 = !DILocation(line: 68, column: 48, scope: !40)
!87 = !DILocalVariable(name: "initial_table_count", arg: 2, scope: !40, file: !3, line: 69, type: !14)
!88 = !DILocation(line: 69, column: 14, scope: !40)
!89 = !DILocalVariable(name: "allow_resize", arg: 3, scope: !40, file: !3, line: 69, type: !59)
!90 = !DILocation(line: 69, column: 38, scope: !40)
!91 = !DILocalVariable(name: "rsdp_address", scope: !40, file: !3, line: 71, type: !48)
!92 = !DILocation(line: 71, column: 24, scope: !40)
!93 = !DILocalVariable(name: "status", scope: !40, file: !3, line: 72, type: !13)
!94 = !DILocation(line: 72, column: 14, scope: !40)
!95 = !DILocation(line: 80, column: 7, scope: !96)
!96 = distinct !DILexicalBlock(scope: !40, file: !3, line: 80, column: 6)
!97 = !DILocation(line: 80, column: 6, scope: !40)
!98 = !DILocation(line: 81, column: 37, scope: !99)
!99 = distinct !DILexicalBlock(scope: !96, file: !3, line: 80, column: 28)
!100 = !DILocation(line: 81, column: 12, scope: !99)
!101 = !DILocation(line: 81, column: 10, scope: !99)
!102 = !DILocation(line: 82, column: 7, scope: !103)
!103 = distinct !DILexicalBlock(scope: !99, file: !3, line: 82, column: 7)
!104 = !DILocation(line: 82, column: 7, scope: !99)
!105 = !DILocation(line: 83, column: 4, scope: !106)
!106 = distinct !DILexicalBlock(scope: !103, file: !3, line: 82, column: 29)
!107 = !DILocation(line: 85, column: 2, scope: !99)
!108 = !DILocation(line: 88, column: 10, scope: !109)
!109 = distinct !DILexicalBlock(scope: !96, file: !3, line: 85, column: 9)
!110 = !DILocation(line: 88, column: 3, scope: !109)
!111 = !DILocation(line: 89, column: 21, scope: !109)
!112 = !DILocation(line: 89, column: 10, scope: !109)
!113 = !DILocation(line: 89, column: 41, scope: !109)
!114 = !DILocation(line: 92, column: 37, scope: !109)
!115 = !DILocation(line: 92, column: 35, scope: !109)
!116 = !DILocation(line: 93, column: 46, scope: !109)
!117 = !DILocation(line: 93, column: 44, scope: !109)
!118 = !DILocation(line: 94, column: 34, scope: !109)
!119 = !DILocation(line: 95, column: 7, scope: !120)
!120 = distinct !DILexicalBlock(scope: !109, file: !3, line: 95, column: 7)
!121 = !DILocation(line: 95, column: 7, scope: !109)
!122 = !DILocation(line: 96, column: 35, scope: !123)
!123 = distinct !DILexicalBlock(scope: !120, file: !3, line: 95, column: 21)
!124 = !DILocation(line: 98, column: 3, scope: !123)
!125 = !DILocation(line: 103, column: 17, scope: !40)
!126 = !DILocation(line: 103, column: 15, scope: !40)
!127 = !DILocation(line: 104, column: 7, scope: !128)
!128 = distinct !DILexicalBlock(scope: !40, file: !3, line: 104, column: 6)
!129 = !DILocation(line: 104, column: 6, scope: !40)
!130 = !DILocation(line: 105, column: 3, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !3, line: 104, column: 21)
!132 = !DILocation(line: 113, column: 36, scope: !40)
!133 = !DILocation(line: 113, column: 11, scope: !40)
!134 = !DILocation(line: 113, column: 9, scope: !40)
!135 = !DILocation(line: 114, column: 2, scope: !40)
!136 = !DILocation(line: 115, column: 1, scope: !40)
!137 = distinct !DISubprogram(name: "acpi_reallocate_root_table", scope: !3, file: !3, line: 133, type: !138, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!138 = !DISubroutineType(types: !139)
!139 = !{!13}
!140 = !DILocalVariable(name: "status", scope: !137, file: !3, line: 135, type: !13)
!141 = !DILocation(line: 135, column: 14, scope: !137)
!142 = !DILocalVariable(name: "table_desc", scope: !137, file: !3, line: 136, type: !43)
!143 = !DILocation(line: 136, column: 26, scope: !137)
!144 = !DILocalVariable(name: "i", scope: !137, file: !3, line: 137, type: !14)
!145 = !DILocation(line: 137, column: 6, scope: !137)
