; ModuleID = '../bcout/drivers/acpi/acpica/utaddress.llvm.bc'
source_filename = "drivers/acpi/acpica/utaddress.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_address_range = type { %struct.acpi_address_range*, %struct.acpi_namespace_node*, i64, i64 }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !33, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !32, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/utaddress.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !21, !24, !22, !25, !28, !30, !31}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !15, line: 805, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !20)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !27)
!27 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !29, line: 148, baseType: !7)
!29 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !{!0}
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 80, elements: !36)
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!36 = !{!37}
!37 = !DISubrange(count: 10)
!38 = !{!"rsp"}
!39 = !{i32 7, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 2}
!42 = !{i32 1, !"Code Model", i32 2}
!43 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!44 = distinct !DISubprogram(name: "acpi_ut_add_address_range", scope: !3, file: !3, line: 41, type: !45, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !807)
!45 = !DISubroutineType(types: !46)
!46 = !{!21, !14, !47, !22, !48}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !25)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !50, line: 133, size: 384, elements: !51)
!50 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!51 = !{!52, !794, !795, !796, !797, !803, !804, !805, !806}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !49, file: !50, line: 134, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !55, line: 367, size: 576, elements: !56)
!55 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!56 = !{!57, !68, !81, !92, !106, !120, !129, !446, !463, !477, !490, !568, !580, !594, !604, !622, !644, !663, !682, !701, !714, !740, !757, !770, !784, !793}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !54, file: !55, line: 368, baseType: !58, size: 128)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !55, line: 73, size: 128, elements: !59)
!59 = !{!60, !61, !62, !63, !67}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !58, file: !55, line: 74, baseType: !53, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !58, file: !55, line: 74, baseType: !16, size: 8, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !58, file: !55, line: 74, baseType: !16, size: 8, offset: 72)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !58, file: !55, line: 74, baseType: !64, size: 16, offset: 80)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !66)
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !55, line: 74, baseType: !16, size: 8, offset: 96)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !54, file: !55, line: 369, baseType: !69, size: 192)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !55, line: 76, size: 192, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !69, file: !55, line: 77, baseType: !53, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !69, file: !55, line: 77, baseType: !16, size: 8, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !55, line: 77, baseType: !16, size: 8, offset: 72)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !69, file: !55, line: 77, baseType: !64, size: 16, offset: 80)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !69, file: !55, line: 77, baseType: !16, size: 8, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !69, file: !55, line: 77, baseType: !77, size: 24, offset: 104)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 24, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 3)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !69, file: !55, line: 78, baseType: !25, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !54, file: !55, line: 370, baseType: !82, size: 256)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !55, line: 93, size: 256, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !89, !91}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !82, file: !55, line: 94, baseType: !53, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !82, file: !55, line: 94, baseType: !16, size: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !55, line: 94, baseType: !16, size: 8, offset: 72)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !82, file: !55, line: 94, baseType: !64, size: 16, offset: 80)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !55, line: 94, baseType: !16, size: 8, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !82, file: !55, line: 94, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !82, file: !55, line: 94, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !54, file: !55, line: 371, baseType: !93, size: 384)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !55, line: 97, size: 384, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !102, !103, !104, !105}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !93, file: !55, line: 98, baseType: !53, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !93, file: !55, line: 98, baseType: !16, size: 8, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !93, file: !55, line: 98, baseType: !16, size: 8, offset: 72)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !93, file: !55, line: 98, baseType: !64, size: 16, offset: 80)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !55, line: 98, baseType: !16, size: 8, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !93, file: !55, line: 98, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !93, file: !55, line: 98, baseType: !22, size: 32, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !93, file: !55, line: 99, baseType: !22, size: 32, offset: 224)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !93, file: !55, line: 100, baseType: !101, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !93, file: !55, line: 101, baseType: !48, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !54, file: !55, line: 372, baseType: !107, size: 384)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !55, line: 104, size: 384, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !114, !115, !117, !118, !119}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !107, file: !55, line: 105, baseType: !53, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !107, file: !55, line: 105, baseType: !16, size: 8, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !55, line: 105, baseType: !16, size: 8, offset: 72)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !107, file: !55, line: 105, baseType: !64, size: 16, offset: 80)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !55, line: 105, baseType: !16, size: 8, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !107, file: !55, line: 105, baseType: !48, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !107, file: !55, line: 106, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !107, file: !55, line: 107, baseType: !101, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !107, file: !55, line: 108, baseType: !22, size: 32, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !107, file: !55, line: 109, baseType: !22, size: 32, offset: 352)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !54, file: !55, line: 373, baseType: !121, size: 192)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !55, line: 118, size: 192, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !121, file: !55, line: 119, baseType: !53, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !121, file: !55, line: 119, baseType: !16, size: 8, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !55, line: 119, baseType: !16, size: 8, offset: 72)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !121, file: !55, line: 119, baseType: !64, size: 16, offset: 80)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !121, file: !55, line: 119, baseType: !16, size: 8, offset: 96)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !121, file: !55, line: 119, baseType: !30, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !54, file: !55, line: 374, baseType: !130, size: 448)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !55, line: 143, size: 448, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !443, !444, !445}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !130, file: !55, line: 144, baseType: !53, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !130, file: !55, line: 144, baseType: !16, size: 8, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !130, file: !55, line: 144, baseType: !16, size: 8, offset: 72)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !130, file: !55, line: 144, baseType: !64, size: 16, offset: 80)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !130, file: !55, line: 144, baseType: !16, size: 8, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !130, file: !55, line: 144, baseType: !16, size: 8, offset: 104)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !130, file: !55, line: 145, baseType: !16, size: 8, offset: 112)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !130, file: !55, line: 146, baseType: !16, size: 8, offset: 120)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !130, file: !55, line: 147, baseType: !53, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !130, file: !55, line: 148, baseType: !53, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !130, file: !55, line: 149, baseType: !101, size: 64, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !130, file: !55, line: 153, baseType: !144, size: 64, offset: 320)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !55, line: 150, size: 64, elements: !145)
!145 = !{!146, !442}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !144, file: !55, line: 151, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !50, line: 248, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!21, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !153, line: 37, size: 9024, elements: !154)
!153 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !388, !389, !390, !391, !392, !396, !398, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !425, !426, !427, !428, !429, !430, !431, !432, !434, !440}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !153, line: 38, baseType: !151, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !152, file: !153, line: 39, baseType: !16, size: 8, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !152, file: !153, line: 40, baseType: !16, size: 8, offset: 72)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !152, file: !153, line: 41, baseType: !64, size: 16, offset: 80)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !152, file: !153, line: 42, baseType: !16, size: 8, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !152, file: !153, line: 43, baseType: !16, size: 8, offset: 104)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !152, file: !153, line: 44, baseType: !16, size: 8, offset: 112)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !152, file: !153, line: 45, baseType: !163, size: 16, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !152, file: !153, line: 46, baseType: !16, size: 8, offset: 144)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !152, file: !153, line: 47, baseType: !16, size: 8, offset: 152)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !152, file: !153, line: 48, baseType: !16, size: 8, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !152, file: !153, line: 49, baseType: !16, size: 8, offset: 168)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !152, file: !153, line: 50, baseType: !16, size: 8, offset: 176)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !152, file: !153, line: 51, baseType: !16, size: 8, offset: 184)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !152, file: !153, line: 52, baseType: !16, size: 8, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !152, file: !153, line: 53, baseType: !16, size: 8, offset: 200)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !152, file: !153, line: 54, baseType: !101, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !152, file: !153, line: 55, baseType: !22, size: 32, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !152, file: !153, line: 56, baseType: !22, size: 32, offset: 352)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !152, file: !153, line: 57, baseType: !22, size: 32, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !152, file: !153, line: 58, baseType: !22, size: 32, offset: 416)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !152, file: !153, line: 60, baseType: !178, size: 640, offset: 448)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !50, line: 893, size: 640, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !185, !269, !270, !386, !387}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !178, file: !50, line: 894, baseType: !101, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !178, file: !50, line: 895, baseType: !101, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !178, file: !50, line: 896, baseType: !101, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !178, file: !50, line: 897, baseType: !101, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !178, file: !50, line: 898, baseType: !101, size: 64, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !178, file: !50, line: 899, baseType: !186, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !50, line: 875, size: 1600, elements: !188)
!188 = !{!189, !209, !225}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !187, file: !50, line: 876, baseType: !190, size: 448)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !50, line: 828, size: 448, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !208}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !190, file: !50, line: 829, baseType: !186, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !190, file: !50, line: 829, baseType: !16, size: 8, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !190, file: !50, line: 829, baseType: !16, size: 8, offset: 72)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !190, file: !50, line: 829, baseType: !64, size: 16, offset: 80)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !190, file: !50, line: 829, baseType: !101, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !50, line: 829, baseType: !186, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !190, file: !50, line: 829, baseType: !48, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !190, file: !50, line: 829, baseType: !200, size: 64, offset: 320)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !50, line: 716, size: 64, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !200, file: !50, line: 717, baseType: !25, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !50, line: 718, baseType: !22, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !200, file: !50, line: 719, baseType: !90, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !200, file: !50, line: 720, baseType: !101, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !50, line: 721, baseType: !90, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !200, file: !50, line: 722, baseType: !186, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !190, file: !50, line: 829, baseType: !16, size: 8, offset: 384)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !187, file: !50, line: 877, baseType: !210, size: 640)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !50, line: 835, size: 640, elements: !211)
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !210, file: !50, line: 836, baseType: !186, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !210, file: !50, line: 836, baseType: !16, size: 8, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !210, file: !50, line: 836, baseType: !16, size: 8, offset: 72)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !210, file: !50, line: 836, baseType: !64, size: 16, offset: 80)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !210, file: !50, line: 836, baseType: !101, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !210, file: !50, line: 836, baseType: !186, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !210, file: !50, line: 836, baseType: !48, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !210, file: !50, line: 836, baseType: !200, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !210, file: !50, line: 836, baseType: !16, size: 8, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !210, file: !50, line: 836, baseType: !90, size: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !50, line: 837, baseType: !101, size: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !210, file: !50, line: 838, baseType: !22, size: 32, offset: 576)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !210, file: !50, line: 839, baseType: !22, size: 32, offset: 608)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !187, file: !50, line: 878, baseType: !226, size: 1600)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !50, line: 846, size: 1600, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !226, file: !50, line: 847, baseType: !186, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !226, file: !50, line: 847, baseType: !16, size: 8, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !226, file: !50, line: 847, baseType: !16, size: 8, offset: 72)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !226, file: !50, line: 847, baseType: !64, size: 16, offset: 80)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !226, file: !50, line: 847, baseType: !101, size: 64, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !226, file: !50, line: 847, baseType: !186, size: 64, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !50, line: 847, baseType: !48, size: 64, offset: 256)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !226, file: !50, line: 847, baseType: !200, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !226, file: !50, line: 847, baseType: !16, size: 8, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !226, file: !50, line: 847, baseType: !186, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !226, file: !50, line: 848, baseType: !186, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !226, file: !50, line: 849, baseType: !90, size: 64, offset: 576)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !226, file: !50, line: 850, baseType: !16, size: 8, offset: 640)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !226, file: !50, line: 851, baseType: !90, size: 64, offset: 704)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !226, file: !50, line: 852, baseType: !90, size: 64, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !226, file: !50, line: 853, baseType: !90, size: 64, offset: 832)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !226, file: !50, line: 854, baseType: !245, size: 32, offset: 896)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 4)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !226, file: !50, line: 855, baseType: !22, size: 32, offset: 928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !226, file: !50, line: 856, baseType: !22, size: 32, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !226, file: !50, line: 857, baseType: !22, size: 32, offset: 992)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !226, file: !50, line: 858, baseType: !22, size: 32, offset: 1024)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !226, file: !50, line: 859, baseType: !22, size: 32, offset: 1056)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !226, file: !50, line: 860, baseType: !22, size: 32, offset: 1088)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !226, file: !50, line: 861, baseType: !22, size: 32, offset: 1120)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !226, file: !50, line: 862, baseType: !22, size: 32, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !226, file: !50, line: 863, baseType: !22, size: 32, offset: 1184)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !226, file: !50, line: 864, baseType: !22, size: 32, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !226, file: !50, line: 865, baseType: !22, size: 32, offset: 1248)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !226, file: !50, line: 866, baseType: !22, size: 32, offset: 1280)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !226, file: !50, line: 867, baseType: !22, size: 32, offset: 1312)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !226, file: !50, line: 868, baseType: !64, size: 16, offset: 1344)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !226, file: !50, line: 869, baseType: !16, size: 8, offset: 1360)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !226, file: !50, line: 870, baseType: !16, size: 8, offset: 1368)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !226, file: !50, line: 871, baseType: !16, size: 8, offset: 1376)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !226, file: !50, line: 872, baseType: !266, size: 160, offset: 1384)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 160, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 20)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !178, file: !50, line: 900, baseType: !48, size: 64, offset: 384)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !178, file: !50, line: 901, baseType: !271, size: 64, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !50, line: 663, size: 640, elements: !273)
!273 = !{!274, !282, !295, !304, !313, !326, !340, !352, !364}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !272, file: !50, line: 664, baseType: !275, size: 128)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !50, line: 567, size: 128, elements: !276)
!276 = !{!277, !278, !279, !280, !281}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !50, line: 568, baseType: !30, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !275, file: !50, line: 568, baseType: !16, size: 8, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !275, file: !50, line: 568, baseType: !16, size: 8, offset: 72)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !275, file: !50, line: 568, baseType: !64, size: 16, offset: 80)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !275, file: !50, line: 568, baseType: !64, size: 16, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !272, file: !50, line: 665, baseType: !283, size: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !50, line: 593, size: 384, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !283, file: !50, line: 594, baseType: !30, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !283, file: !50, line: 594, baseType: !16, size: 8, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !50, line: 594, baseType: !16, size: 8, offset: 72)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !283, file: !50, line: 594, baseType: !64, size: 16, offset: 80)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !283, file: !50, line: 594, baseType: !64, size: 16, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !283, file: !50, line: 594, baseType: !64, size: 16, offset: 112)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !283, file: !50, line: 595, baseType: !186, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !283, file: !50, line: 596, baseType: !101, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !283, file: !50, line: 597, baseType: !101, size: 64, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !283, file: !50, line: 598, baseType: !25, size: 64, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !272, file: !50, line: 666, baseType: !296, size: 192)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !50, line: 573, size: 192, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !296, file: !50, line: 574, baseType: !30, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !296, file: !50, line: 574, baseType: !16, size: 8, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !296, file: !50, line: 574, baseType: !16, size: 8, offset: 72)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !296, file: !50, line: 574, baseType: !64, size: 16, offset: 80)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !296, file: !50, line: 574, baseType: !64, size: 16, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !296, file: !50, line: 574, baseType: !53, size: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !272, file: !50, line: 667, baseType: !305, size: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !50, line: 604, size: 192, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !50, line: 605, baseType: !30, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !305, file: !50, line: 605, baseType: !16, size: 8, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !50, line: 605, baseType: !16, size: 8, offset: 72)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !50, line: 605, baseType: !64, size: 16, offset: 80)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !305, file: !50, line: 605, baseType: !64, size: 16, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !50, line: 605, baseType: !48, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !272, file: !50, line: 668, baseType: !314, size: 448)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !50, line: 608, size: 448, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !50, line: 609, baseType: !30, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !314, file: !50, line: 609, baseType: !16, size: 8, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !50, line: 609, baseType: !16, size: 8, offset: 72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !314, file: !50, line: 609, baseType: !64, size: 16, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !50, line: 609, baseType: !64, size: 16, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !314, file: !50, line: 609, baseType: !22, size: 32, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !314, file: !50, line: 610, baseType: !186, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !314, file: !50, line: 611, baseType: !101, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !314, file: !50, line: 612, baseType: !101, size: 64, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !314, file: !50, line: 613, baseType: !22, size: 32, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !272, file: !50, line: 669, baseType: !327, size: 512)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !50, line: 580, size: 512, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !50, line: 581, baseType: !30, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !327, file: !50, line: 581, baseType: !16, size: 8, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !327, file: !50, line: 581, baseType: !16, size: 8, offset: 72)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !327, file: !50, line: 581, baseType: !64, size: 16, offset: 80)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !327, file: !50, line: 581, baseType: !64, size: 16, offset: 96)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !327, file: !50, line: 581, baseType: !22, size: 32, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !327, file: !50, line: 582, baseType: !53, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !327, file: !50, line: 583, baseType: !53, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !327, file: !50, line: 584, baseType: !151, size: 64, offset: 320)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !327, file: !50, line: 585, baseType: !30, size: 64, offset: 384)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !327, file: !50, line: 586, baseType: !22, size: 32, offset: 448)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !272, file: !50, line: 670, baseType: !341, size: 320)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !50, line: 620, size: 320, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !341, file: !50, line: 621, baseType: !30, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !341, file: !50, line: 621, baseType: !16, size: 8, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !341, file: !50, line: 621, baseType: !16, size: 8, offset: 72)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !341, file: !50, line: 621, baseType: !64, size: 16, offset: 80)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !341, file: !50, line: 621, baseType: !64, size: 16, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !341, file: !50, line: 621, baseType: !16, size: 8, offset: 112)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !341, file: !50, line: 622, baseType: !151, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !341, file: !50, line: 623, baseType: !53, size: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !341, file: !50, line: 624, baseType: !25, size: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !272, file: !50, line: 671, baseType: !353, size: 640)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !50, line: 631, size: 640, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !50, line: 632, baseType: !30, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !353, file: !50, line: 632, baseType: !16, size: 8, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !353, file: !50, line: 632, baseType: !16, size: 8, offset: 72)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !353, file: !50, line: 632, baseType: !64, size: 16, offset: 80)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !353, file: !50, line: 632, baseType: !64, size: 16, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !353, file: !50, line: 633, baseType: !361, size: 512, offset: 128)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 512, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !272, file: !50, line: 672, baseType: !365, size: 320)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !50, line: 654, size: 320, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !365, file: !50, line: 655, baseType: !30, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !365, file: !50, line: 655, baseType: !16, size: 8, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !365, file: !50, line: 655, baseType: !16, size: 8, offset: 72)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !365, file: !50, line: 655, baseType: !64, size: 16, offset: 80)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !365, file: !50, line: 655, baseType: !64, size: 16, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !365, file: !50, line: 655, baseType: !16, size: 8, offset: 112)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !365, file: !50, line: 656, baseType: !48, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !365, file: !50, line: 657, baseType: !53, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !365, file: !50, line: 658, baseType: !376, size: 64, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !50, line: 645, size: 128, elements: !378)
!378 = !{!379, !385}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !377, file: !50, line: 646, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !384, !22, !30}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !30)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !377, file: !50, line: 647, baseType: !30, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !178, file: !50, line: 902, baseType: !186, size: 64, offset: 512)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !178, file: !50, line: 903, baseType: !22, size: 32, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !152, file: !153, line: 61, baseType: !22, size: 32, offset: 1088)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !152, file: !153, line: 62, baseType: !22, size: 32, offset: 1120)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !152, file: !153, line: 63, baseType: !64, size: 16, offset: 1152)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !152, file: !153, line: 64, baseType: !16, size: 8, offset: 1168)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !152, file: !153, line: 66, baseType: !393, size: 2688, offset: 1216)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 2688, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 7)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !152, file: !153, line: 67, baseType: !397, size: 3072, offset: 3904)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 3072, elements: !362)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !152, file: !153, line: 68, baseType: !399, size: 576, offset: 6976)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 576, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 9)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !152, file: !153, line: 69, baseType: !116, size: 64, offset: 7552)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !152, file: !153, line: 71, baseType: !101, size: 64, offset: 7616)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !152, file: !153, line: 72, baseType: !116, size: 64, offset: 7680)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !152, file: !153, line: 73, baseType: !271, size: 64, offset: 7744)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !152, file: !153, line: 74, baseType: !48, size: 64, offset: 7808)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !152, file: !153, line: 75, baseType: !53, size: 64, offset: 7872)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !152, file: !153, line: 76, baseType: !48, size: 64, offset: 7936)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !152, file: !153, line: 77, baseType: !186, size: 64, offset: 8000)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !152, file: !153, line: 78, baseType: !53, size: 64, offset: 8064)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !152, file: !153, line: 79, baseType: !48, size: 64, offset: 8128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !152, file: !153, line: 80, baseType: !90, size: 64, offset: 8192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !152, file: !153, line: 81, baseType: !186, size: 64, offset: 8256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !152, file: !153, line: 82, baseType: !415, size: 64, offset: 8320)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !50, line: 702, size: 128, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !417, file: !50, line: 706, baseType: !22, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !417, file: !50, line: 707, baseType: !22, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !50, line: 708, baseType: !64, size: 16, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !417, file: !50, line: 709, baseType: !16, size: 8, offset: 80)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !417, file: !50, line: 710, baseType: !16, size: 8, offset: 88)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !50, line: 711, baseType: !16, size: 8, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !152, file: !153, line: 83, baseType: !186, size: 64, offset: 8384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !152, file: !153, line: 84, baseType: !53, size: 64, offset: 8448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !152, file: !153, line: 85, baseType: !271, size: 64, offset: 8512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !152, file: !153, line: 86, baseType: !53, size: 64, offset: 8576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !152, file: !153, line: 87, baseType: !271, size: 64, offset: 8640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !152, file: !153, line: 88, baseType: !186, size: 64, offset: 8704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !152, file: !153, line: 89, baseType: !186, size: 64, offset: 8768)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !152, file: !153, line: 90, baseType: !433, size: 64, offset: 8832)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !152, file: !153, line: 91, baseType: !435, size: 64, offset: 8896)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !50, line: 637, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DISubroutineType(types: !438)
!438 = !{!21, !151, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !152, file: !153, line: 92, baseType: !441, size: 64, offset: 8960)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !50, line: 641, baseType: !148)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !144, file: !55, line: 152, baseType: !53, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !130, file: !55, line: 155, baseType: !22, size: 32, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !130, file: !55, line: 156, baseType: !163, size: 16, offset: 416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !130, file: !55, line: 157, baseType: !16, size: 8, offset: 432)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !54, file: !55, line: 375, baseType: !447, size: 576)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !55, line: 122, size: 576, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !447, file: !55, line: 123, baseType: !53, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !447, file: !55, line: 123, baseType: !16, size: 8, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !447, file: !55, line: 123, baseType: !16, size: 8, offset: 72)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !447, file: !55, line: 123, baseType: !64, size: 16, offset: 80)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !447, file: !55, line: 123, baseType: !16, size: 8, offset: 96)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !447, file: !55, line: 123, baseType: !16, size: 8, offset: 104)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !447, file: !55, line: 124, baseType: !64, size: 16, offset: 112)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !447, file: !55, line: 125, baseType: !30, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !447, file: !55, line: 126, baseType: !25, size: 64, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !447, file: !55, line: 127, baseType: !433, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !55, line: 128, baseType: !53, size: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !55, line: 129, baseType: !53, size: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !447, file: !55, line: 130, baseType: !48, size: 64, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !447, file: !55, line: 131, baseType: !16, size: 8, offset: 512)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !54, file: !55, line: 376, baseType: !464, size: 448)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !55, line: 134, size: 448, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !464, file: !55, line: 135, baseType: !53, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !464, file: !55, line: 135, baseType: !16, size: 8, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !464, file: !55, line: 135, baseType: !16, size: 8, offset: 72)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !464, file: !55, line: 135, baseType: !64, size: 16, offset: 80)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !464, file: !55, line: 135, baseType: !16, size: 8, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !464, file: !55, line: 135, baseType: !16, size: 8, offset: 104)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !464, file: !55, line: 136, baseType: !48, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !464, file: !55, line: 137, baseType: !53, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !464, file: !55, line: 138, baseType: !53, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !464, file: !55, line: 139, baseType: !47, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !464, file: !55, line: 140, baseType: !22, size: 32, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !54, file: !55, line: 377, baseType: !478, size: 320)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !55, line: 184, size: 320, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !489}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !478, file: !55, line: 185, baseType: !53, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !478, file: !55, line: 185, baseType: !16, size: 8, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !478, file: !55, line: 185, baseType: !16, size: 8, offset: 72)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !478, file: !55, line: 185, baseType: !64, size: 16, offset: 80)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !478, file: !55, line: 185, baseType: !16, size: 8, offset: 96)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !478, file: !55, line: 185, baseType: !486, size: 128, offset: 128)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 128, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 2)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !478, file: !55, line: 185, baseType: !53, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !54, file: !55, line: 378, baseType: !491, size: 384)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !55, line: 187, size: 384, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !491, file: !55, line: 188, baseType: !53, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !491, file: !55, line: 188, baseType: !16, size: 8, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !55, line: 188, baseType: !16, size: 8, offset: 72)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !491, file: !55, line: 188, baseType: !64, size: 16, offset: 80)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !491, file: !55, line: 188, baseType: !16, size: 8, offset: 96)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !491, file: !55, line: 189, baseType: !486, size: 128, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !491, file: !55, line: 189, baseType: !53, size: 64, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !491, file: !55, line: 189, baseType: !501, size: 64, offset: 320)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !50, line: 480, size: 576, elements: !503)
!503 = !{!504, !505, !506, !507, !515, !530, !562, !563, !564, !565, !566, !567}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !502, file: !50, line: 481, baseType: !48, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !502, file: !50, line: 482, baseType: !501, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !50, line: 483, baseType: !501, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !502, file: !50, line: 484, baseType: !508, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !50, line: 497, size: 256, elements: !510)
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !509, file: !50, line: 498, baseType: !508, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !509, file: !50, line: 499, baseType: !508, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !509, file: !50, line: 500, baseType: !501, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !509, file: !50, line: 501, baseType: !22, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !502, file: !50, line: 485, baseType: !516, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !50, line: 466, size: 320, elements: !518)
!518 = !{!519, !524, !525, !526, !527, !528, !529}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !517, file: !50, line: 467, baseType: !520, size: 128)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !50, line: 459, size: 128, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !520, file: !50, line: 460, baseType: !16, size: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !520, file: !50, line: 461, baseType: !25, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !517, file: !50, line: 468, baseType: !520, size: 128, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !517, file: !50, line: 469, baseType: !64, size: 16, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !517, file: !50, line: 470, baseType: !16, size: 8, offset: 272)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !517, file: !50, line: 471, baseType: !16, size: 8, offset: 280)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !517, file: !50, line: 472, baseType: !16, size: 8, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !517, file: !50, line: 473, baseType: !16, size: 8, offset: 296)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !502, file: !50, line: 486, baseType: !531, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !50, line: 448, size: 192, elements: !533)
!533 = !{!534, !557, !558, !559, !560, !561}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !532, file: !50, line: 449, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !50, line: 438, size: 64, elements: !536)
!536 = !{!537, !538, !551}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !535, file: !50, line: 439, baseType: !48, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !535, file: !50, line: 440, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !50, line: 419, size: 256, elements: !541)
!541 = !{!542, !547, !548, !549, !550}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !540, file: !50, line: 420, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!22, !384, !22, !30}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !540, file: !50, line: 421, baseType: !30, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !540, file: !50, line: 422, baseType: !48, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !540, file: !50, line: 423, baseType: !16, size: 8, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !540, file: !50, line: 424, baseType: !16, size: 8, offset: 200)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !535, file: !50, line: 441, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !50, line: 429, size: 128, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !553, file: !50, line: 430, baseType: !48, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !553, file: !50, line: 431, baseType: !552, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !532, file: !50, line: 450, baseType: !516, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !532, file: !50, line: 451, baseType: !16, size: 8, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !532, file: !50, line: 452, baseType: !16, size: 8, offset: 136)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !532, file: !50, line: 453, baseType: !16, size: 8, offset: 144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !532, file: !50, line: 454, baseType: !16, size: 8, offset: 152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !502, file: !50, line: 487, baseType: !25, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !502, file: !50, line: 488, baseType: !22, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !502, file: !50, line: 489, baseType: !64, size: 16, offset: 480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !502, file: !50, line: 490, baseType: !64, size: 16, offset: 496)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !502, file: !50, line: 491, baseType: !16, size: 8, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !502, file: !50, line: 492, baseType: !16, size: 8, offset: 520)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !54, file: !55, line: 379, baseType: !569, size: 384)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !55, line: 192, size: 384, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !569, file: !55, line: 193, baseType: !53, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !569, file: !55, line: 193, baseType: !16, size: 8, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !55, line: 193, baseType: !16, size: 8, offset: 72)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !569, file: !55, line: 193, baseType: !64, size: 16, offset: 80)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !55, line: 193, baseType: !16, size: 8, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !569, file: !55, line: 193, baseType: !486, size: 128, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !569, file: !55, line: 193, baseType: !53, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !569, file: !55, line: 193, baseType: !22, size: 32, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !569, file: !55, line: 194, baseType: !22, size: 32, offset: 352)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !54, file: !55, line: 380, baseType: !581, size: 384)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !55, line: 197, size: 384, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !581, file: !55, line: 198, baseType: !53, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !581, file: !55, line: 198, baseType: !16, size: 8, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !581, file: !55, line: 198, baseType: !16, size: 8, offset: 72)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !581, file: !55, line: 198, baseType: !64, size: 16, offset: 80)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !581, file: !55, line: 198, baseType: !16, size: 8, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !581, file: !55, line: 200, baseType: !16, size: 8, offset: 104)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !581, file: !55, line: 201, baseType: !16, size: 8, offset: 112)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !581, file: !55, line: 202, baseType: !486, size: 128, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !581, file: !55, line: 202, baseType: !53, size: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !581, file: !55, line: 202, baseType: !593, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !25)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !54, file: !55, line: 381, baseType: !595, size: 320)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !55, line: 205, size: 320, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !595, file: !55, line: 206, baseType: !53, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !595, file: !55, line: 206, baseType: !16, size: 8, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !595, file: !55, line: 206, baseType: !16, size: 8, offset: 72)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !595, file: !55, line: 206, baseType: !64, size: 16, offset: 80)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !595, file: !55, line: 206, baseType: !16, size: 8, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !595, file: !55, line: 206, baseType: !486, size: 128, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !595, file: !55, line: 206, baseType: !53, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !54, file: !55, line: 382, baseType: !605, size: 384)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !55, line: 233, size: 384, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !605, file: !55, line: 234, baseType: !53, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 72)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !605, file: !55, line: 234, baseType: !64, size: 16, offset: 80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 104)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 120)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !605, file: !55, line: 234, baseType: !48, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !605, file: !55, line: 234, baseType: !22, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !605, file: !55, line: 234, baseType: !22, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !605, file: !55, line: 234, baseType: !22, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !605, file: !55, line: 234, baseType: !16, size: 8, offset: 296)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !605, file: !55, line: 234, baseType: !53, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !54, file: !55, line: 383, baseType: !623, size: 576)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !55, line: 237, size: 576, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !623, file: !55, line: 238, baseType: !53, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 72)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !623, file: !55, line: 238, baseType: !64, size: 16, offset: 80)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 104)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 112)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 120)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !623, file: !55, line: 238, baseType: !48, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !623, file: !55, line: 238, baseType: !22, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !623, file: !55, line: 238, baseType: !22, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !623, file: !55, line: 238, baseType: !22, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !623, file: !55, line: 238, baseType: !16, size: 8, offset: 296)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !623, file: !55, line: 238, baseType: !64, size: 16, offset: 304)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !623, file: !55, line: 239, baseType: !53, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !623, file: !55, line: 240, baseType: !101, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !623, file: !55, line: 241, baseType: !64, size: 16, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !623, file: !55, line: 242, baseType: !101, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !54, file: !55, line: 384, baseType: !645, size: 384)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !55, line: 262, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !645, file: !55, line: 263, baseType: !53, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !645, file: !55, line: 263, baseType: !64, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 104)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 112)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 120)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !645, file: !55, line: 263, baseType: !48, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !645, file: !55, line: 263, baseType: !22, size: 32, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !645, file: !55, line: 263, baseType: !22, size: 32, offset: 224)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !55, line: 263, baseType: !22, size: 32, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 288)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 296)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !645, file: !55, line: 263, baseType: !16, size: 8, offset: 304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !645, file: !55, line: 264, baseType: !53, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !54, file: !55, line: 385, baseType: !664, size: 448)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !55, line: 245, size: 448, elements: !665)
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !664, file: !55, line: 246, baseType: !53, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 72)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !664, file: !55, line: 246, baseType: !64, size: 16, offset: 80)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 104)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 112)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 120)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !664, file: !55, line: 246, baseType: !48, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !664, file: !55, line: 246, baseType: !22, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !664, file: !55, line: 246, baseType: !22, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !664, file: !55, line: 246, baseType: !22, size: 32, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 288)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !664, file: !55, line: 246, baseType: !16, size: 8, offset: 296)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !664, file: !55, line: 246, baseType: !53, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !664, file: !55, line: 247, baseType: !53, size: 64, offset: 384)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !54, file: !55, line: 386, baseType: !683, size: 448)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !55, line: 250, size: 448, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !683, file: !55, line: 251, baseType: !53, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 72)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !683, file: !55, line: 251, baseType: !64, size: 16, offset: 80)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 104)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 120)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !683, file: !55, line: 251, baseType: !48, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !683, file: !55, line: 251, baseType: !22, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !683, file: !55, line: 251, baseType: !22, size: 32, offset: 224)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !683, file: !55, line: 251, baseType: !22, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !683, file: !55, line: 251, baseType: !16, size: 8, offset: 296)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !683, file: !55, line: 256, baseType: !53, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !683, file: !55, line: 257, baseType: !53, size: 64, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !54, file: !55, line: 387, baseType: !702, size: 512)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !55, line: 273, size: 512, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !702, file: !55, line: 274, baseType: !53, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !702, file: !55, line: 274, baseType: !16, size: 8, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !702, file: !55, line: 274, baseType: !16, size: 8, offset: 72)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !702, file: !55, line: 274, baseType: !64, size: 16, offset: 80)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !702, file: !55, line: 274, baseType: !16, size: 8, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !702, file: !55, line: 274, baseType: !48, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !702, file: !55, line: 275, baseType: !22, size: 32, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !702, file: !55, line: 276, baseType: !380, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !702, file: !55, line: 277, baseType: !30, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !702, file: !55, line: 278, baseType: !486, size: 128, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !54, file: !55, line: 388, baseType: !715, size: 512)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !55, line: 281, size: 512, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !730, !731, !732, !738, !739}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !715, file: !55, line: 282, baseType: !53, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !55, line: 282, baseType: !16, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !55, line: 282, baseType: !16, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !715, file: !55, line: 282, baseType: !64, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !55, line: 282, baseType: !16, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !715, file: !55, line: 282, baseType: !16, size: 8, offset: 104)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !715, file: !55, line: 283, baseType: !16, size: 8, offset: 112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !715, file: !55, line: 284, baseType: !725, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!21, !22, !47, !22, !729, !30, !30}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !55, line: 285, baseType: !48, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !715, file: !55, line: 286, baseType: !30, size: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !715, file: !55, line: 287, baseType: !733, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!21, !384, !22, !30, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !715, file: !55, line: 288, baseType: !53, size: 64, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !55, line: 289, baseType: !53, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !54, file: !55, line: 389, baseType: !741, size: 512)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !55, line: 307, size: 512, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !741, file: !55, line: 308, baseType: !53, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !741, file: !55, line: 308, baseType: !16, size: 8, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !55, line: 308, baseType: !16, size: 8, offset: 72)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !741, file: !55, line: 308, baseType: !64, size: 16, offset: 80)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !741, file: !55, line: 308, baseType: !16, size: 8, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !741, file: !55, line: 308, baseType: !16, size: 8, offset: 104)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !741, file: !55, line: 309, baseType: !16, size: 8, offset: 112)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !741, file: !55, line: 310, baseType: !16, size: 8, offset: 120)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !741, file: !55, line: 311, baseType: !30, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !741, file: !55, line: 312, baseType: !48, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !741, file: !55, line: 313, baseType: !116, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !741, file: !55, line: 314, baseType: !101, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !741, file: !55, line: 315, baseType: !101, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !741, file: !55, line: 316, baseType: !22, size: 32, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !54, file: !55, line: 390, baseType: !758, size: 448)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !55, line: 340, size: 448, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !758, file: !55, line: 341, baseType: !53, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !758, file: !55, line: 341, baseType: !16, size: 8, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !55, line: 341, baseType: !16, size: 8, offset: 72)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !758, file: !55, line: 341, baseType: !64, size: 16, offset: 80)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !758, file: !55, line: 341, baseType: !16, size: 8, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !758, file: !55, line: 341, baseType: !48, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !758, file: !55, line: 342, baseType: !48, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !758, file: !55, line: 343, baseType: !30, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !758, file: !55, line: 344, baseType: !101, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !758, file: !55, line: 345, baseType: !22, size: 32, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !55, line: 391, baseType: !771, size: 256)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !55, line: 350, size: 256, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !783}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !771, file: !55, line: 351, baseType: !53, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !771, file: !55, line: 351, baseType: !16, size: 8, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !55, line: 351, baseType: !16, size: 8, offset: 72)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !771, file: !55, line: 351, baseType: !64, size: 16, offset: 80)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !771, file: !55, line: 351, baseType: !16, size: 8, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !771, file: !55, line: 351, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !384, !30}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !771, file: !55, line: 352, baseType: !30, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !54, file: !55, line: 392, baseType: !785, size: 192)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !55, line: 357, size: 192, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !785, file: !55, line: 358, baseType: !53, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !785, file: !55, line: 358, baseType: !16, size: 8, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !55, line: 358, baseType: !16, size: 8, offset: 72)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !785, file: !55, line: 358, baseType: !64, size: 16, offset: 80)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !785, file: !55, line: 358, baseType: !16, size: 8, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !55, line: 358, baseType: !53, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !54, file: !55, line: 399, baseType: !49, size: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !49, file: !50, line: 135, baseType: !16, size: 8, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !50, line: 136, baseType: !16, size: 8, offset: 72)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !50, line: 137, baseType: !64, size: 16, offset: 80)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !50, line: 138, baseType: !798, size: 32, offset: 96)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !799, line: 327, size: 32, elements: !800)
!799 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !798, file: !799, line: 328, baseType: !22, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !798, file: !799, line: 329, baseType: !245, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !49, file: !50, line: 139, baseType: !48, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !49, file: !50, line: 140, baseType: !48, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !49, file: !50, line: 141, baseType: !48, size: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !49, file: !50, line: 142, baseType: !163, size: 16, offset: 320)
!807 = !{}
!808 = !DILocalVariable(name: "space_id", arg: 1, scope: !44, file: !3, line: 41, type: !14)
!809 = !DILocation(line: 41, column: 47, scope: !44)
!810 = !DILocalVariable(name: "address", arg: 2, scope: !44, file: !3, line: 42, type: !47)
!811 = !DILocation(line: 42, column: 28, scope: !44)
!812 = !DILocalVariable(name: "length", arg: 3, scope: !44, file: !3, line: 43, type: !22)
!813 = !DILocation(line: 43, column: 10, scope: !44)
!814 = !DILocalVariable(name: "region_node", arg: 4, scope: !44, file: !3, line: 43, type: !48)
!815 = !DILocation(line: 43, column: 46, scope: !44)
!816 = !DILocalVariable(name: "range_info", scope: !44, file: !3, line: 45, type: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_address_range", file: !50, line: 686, size: 256, elements: !819)
!819 = !{!820, !821, !822, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !50, line: 687, baseType: !817, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "region_node", scope: !818, file: !50, line: 688, baseType: !48, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "start_address", scope: !818, file: !50, line: 689, baseType: !47, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "end_address", scope: !818, file: !50, line: 690, baseType: !47, size: 64, offset: 192)
!824 = !DILocation(line: 45, column: 29, scope: !44)
!825 = !DILocation(line: 49, column: 7, scope: !826)
!826 = distinct !DILexicalBlock(scope: !44, file: !3, line: 49, column: 6)
!827 = !DILocation(line: 49, column: 16, scope: !826)
!828 = !DILocation(line: 49, column: 49, scope: !826)
!829 = !DILocation(line: 50, column: 7, scope: !826)
!830 = !DILocation(line: 50, column: 16, scope: !826)
!831 = !DILocation(line: 49, column: 6, scope: !44)
!832 = !DILocation(line: 51, column: 3, scope: !833)
!833 = distinct !DILexicalBlock(scope: !826, file: !3, line: 50, column: 46)
!834 = !DILocation(line: 56, column: 15, scope: !44)
!835 = !DILocation(line: 56, column: 13, scope: !44)
!836 = !DILocation(line: 57, column: 7, scope: !837)
!837 = distinct !DILexicalBlock(scope: !44, file: !3, line: 57, column: 6)
!838 = !DILocation(line: 57, column: 6, scope: !44)
!839 = !DILocation(line: 58, column: 3, scope: !840)
!840 = distinct !DILexicalBlock(scope: !837, file: !3, line: 57, column: 19)
!841 = !DILocation(line: 61, column: 30, scope: !44)
!842 = !DILocation(line: 61, column: 2, scope: !44)
!843 = !DILocation(line: 61, column: 14, scope: !44)
!844 = !DILocation(line: 61, column: 28, scope: !44)
!845 = !DILocation(line: 62, column: 29, scope: !44)
!846 = !DILocation(line: 62, column: 39, scope: !44)
!847 = !DILocation(line: 62, column: 37, scope: !44)
!848 = !DILocation(line: 62, column: 46, scope: !44)
!849 = !DILocation(line: 62, column: 2, scope: !44)
!850 = !DILocation(line: 62, column: 14, scope: !44)
!851 = !DILocation(line: 62, column: 26, scope: !44)
!852 = !DILocation(line: 63, column: 28, scope: !44)
!853 = !DILocation(line: 63, column: 2, scope: !44)
!854 = !DILocation(line: 63, column: 14, scope: !44)
!855 = !DILocation(line: 63, column: 26, scope: !44)
!856 = !DILocation(line: 65, column: 49, scope: !44)
!857 = !DILocation(line: 65, column: 21, scope: !44)
!858 = !DILocation(line: 65, column: 2, scope: !44)
!859 = !DILocation(line: 65, column: 14, scope: !44)
!860 = !DILocation(line: 65, column: 19, scope: !44)
!861 = !DILocation(line: 66, column: 42, scope: !44)
!862 = !DILocation(line: 66, column: 30, scope: !44)
!863 = !DILocation(line: 66, column: 2, scope: !44)
