; ModuleID = '../bcout/drivers/acpi/acpica/utcopy.llvm.bc'
source_filename = "drivers/acpi/acpica/utcopy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 16, type: !869, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !868, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/utcopy.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 321, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16}
!9 = !DIEnumerator(name: "ACPI_REFCLASS_LOCAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "ACPI_REFCLASS_ARG", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "ACPI_REFCLASS_REFOF", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "ACPI_REFCLASS_INDEX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "ACPI_REFCLASS_TABLE", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "ACPI_REFCLASS_NAME", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "ACPI_REFCLASS_DEBUG", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "ACPI_REFCLASS_MAX", value: 6, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !18, line: 305, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!24 = !{!25, !74, !57, !89, !90, !91, !49, !58, !99, !101, !102, !857, !31}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_object", file: !27, line: 899, size: 192, elements: !28)
!27 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!28 = !{!29, !35, !43, !51, !61, !67, !75, !83}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !26, file: !27, line: 900, baseType: !30, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !27, line: 635, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !32, line: 21, baseType: !33)
!32 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !34, line: 27, baseType: !7)
!34 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!35 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !26, file: !27, line: 904, baseType: !36, size: 128)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 901, size: 128, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !27, line: 902, baseType: !30, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !36, file: !27, line: 903, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !32, line: 23, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !34, line: 31, baseType: !42)
!42 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !26, file: !27, line: 910, baseType: !44, size: 128)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 906, size: 128, elements: !45)
!45 = !{!46, !47, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !27, line: 907, baseType: !30, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !27, line: 908, baseType: !31, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !44, file: !27, line: 909, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !26, file: !27, line: 916, baseType: !52, size: 128)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 912, size: 128, elements: !53)
!53 = !{!54, !55, !56}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !27, line: 913, baseType: !30, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !52, file: !27, line: 914, baseType: !31, size: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !52, file: !27, line: 915, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !32, line: 17, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !34, line: 21, baseType: !60)
!60 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !26, file: !27, line: 922, baseType: !62, size: 128)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 918, size: 128, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !62, file: !27, line: 919, baseType: !30, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !62, file: !27, line: 920, baseType: !31, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !62, file: !27, line: 921, baseType: !25, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !26, file: !27, line: 928, baseType: !68, size: 128)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 924, size: 128, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !27, line: 925, baseType: !30, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "actual_type", scope: !68, file: !27, line: 926, baseType: !30, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !68, file: !27, line: 927, baseType: !73, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !27, line: 424, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !26, file: !27, line: 935, baseType: !76, size: 192)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 930, size: 192, elements: !77)
!77 = !{!78, !79, !80, !82}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !76, file: !27, line: 931, baseType: !30, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !76, file: !27, line: 932, baseType: !31, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_address", scope: !76, file: !27, line: 933, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !27, line: 128, baseType: !40)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pblk_length", scope: !76, file: !27, line: 934, baseType: !31, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !26, file: !27, line: 941, baseType: !84, size: 96)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !26, file: !27, line: 937, size: 96, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !27, line: 938, baseType: !30, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !84, file: !27, line: 939, baseType: !31, size: 32, offset: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !84, file: !27, line: 940, baseType: !31, size: 32, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !27, line: 127, baseType: !40)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !27, line: 421, baseType: !31)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_info", file: !93, line: 131, size: 192, elements: !94)
!93 = !DIFile(filename: "drivers/acpi/acpica/acutils.h", directory: "/home/lizy2001/genbc/linux")
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "free_space", scope: !92, file: !93, line: 132, baseType: !57, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !92, file: !93, line: 133, baseType: !89, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "object_space", scope: !92, file: !93, line: 134, baseType: !31, size: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !92, file: !93, line: 135, baseType: !31, size: 32, offset: 160)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !100, line: 148, baseType: !7)
!100 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !6, line: 367, size: 576, elements: !105)
!105 = !{!106, !117, !130, !140, !175, !188, !197, !509, !526, !541, !554, !632, !644, !657, !667, !685, !707, !726, !745, !764, !777, !803, !820, !833, !847, !856}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !104, file: !6, line: 368, baseType: !107, size: 128)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !6, line: 73, size: 128, elements: !108)
!108 = !{!109, !110, !111, !112, !116}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !107, file: !6, line: 74, baseType: !103, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !107, file: !6, line: 74, baseType: !58, size: 8, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !6, line: 74, baseType: !58, size: 8, offset: 72)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !107, file: !6, line: 74, baseType: !113, size: 16, offset: 80)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !32, line: 19, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !34, line: 24, baseType: !115)
!115 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !6, line: 74, baseType: !58, size: 8, offset: 96)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !104, file: !6, line: 369, baseType: !118, size: 192)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !6, line: 76, size: 192, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !118, file: !6, line: 77, baseType: !103, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !118, file: !6, line: 77, baseType: !58, size: 8, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !118, file: !6, line: 77, baseType: !58, size: 8, offset: 72)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !118, file: !6, line: 77, baseType: !113, size: 16, offset: 80)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !6, line: 77, baseType: !58, size: 8, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !118, file: !6, line: 77, baseType: !126, size: 24, offset: 104)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !118, file: !6, line: 78, baseType: !40, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !104, file: !6, line: 370, baseType: !131, size: 256)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !6, line: 93, size: 256, elements: !132)
!132 = !{!133, !134, !135, !136, !137, !138, !139}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !131, file: !6, line: 94, baseType: !103, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !131, file: !6, line: 94, baseType: !58, size: 8, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !6, line: 94, baseType: !58, size: 8, offset: 72)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !131, file: !6, line: 94, baseType: !113, size: 16, offset: 80)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !131, file: !6, line: 94, baseType: !58, size: 8, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !131, file: !6, line: 94, baseType: !49, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !131, file: !6, line: 94, baseType: !31, size: 32, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !104, file: !6, line: 371, baseType: !141, size: 384)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !6, line: 97, size: 384, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !141, file: !6, line: 98, baseType: !103, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !141, file: !6, line: 98, baseType: !58, size: 8, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !6, line: 98, baseType: !58, size: 8, offset: 72)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !141, file: !6, line: 98, baseType: !113, size: 16, offset: 80)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !141, file: !6, line: 98, baseType: !58, size: 8, offset: 96)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !141, file: !6, line: 98, baseType: !57, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !141, file: !6, line: 98, baseType: !31, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !141, file: !6, line: 99, baseType: !31, size: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !141, file: !6, line: 100, baseType: !57, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !141, file: !6, line: 101, baseType: !153, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !155, line: 133, size: 384, elements: !156)
!155 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!156 = !{!157, !158, !159, !160, !161, !170, !171, !172, !173}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !154, file: !155, line: 134, baseType: !103, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !154, file: !155, line: 135, baseType: !58, size: 8, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !155, line: 136, baseType: !58, size: 8, offset: 72)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !154, file: !155, line: 137, baseType: !113, size: 16, offset: 80)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !155, line: 138, baseType: !162, size: 32, offset: 96)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !163, line: 327, size: 32, elements: !164)
!163 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !162, file: !163, line: 328, baseType: !31, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !162, file: !163, line: 329, baseType: !167, size: 32)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 4)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !154, file: !155, line: 139, baseType: !153, size: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !154, file: !155, line: 140, baseType: !153, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !154, file: !155, line: 141, baseType: !153, size: 64, offset: 256)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !154, file: !155, line: 142, baseType: !174, size: 16, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !27, line: 445, baseType: !113)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !104, file: !6, line: 372, baseType: !176, size: 384)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !6, line: 104, size: 384, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !176, file: !6, line: 105, baseType: !103, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !176, file: !6, line: 105, baseType: !58, size: 8, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !176, file: !6, line: 105, baseType: !58, size: 8, offset: 72)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !176, file: !6, line: 105, baseType: !113, size: 16, offset: 80)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !176, file: !6, line: 105, baseType: !58, size: 8, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !176, file: !6, line: 105, baseType: !153, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !176, file: !6, line: 106, baseType: !102, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !176, file: !6, line: 107, baseType: !57, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !176, file: !6, line: 108, baseType: !31, size: 32, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !176, file: !6, line: 109, baseType: !31, size: 32, offset: 352)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !104, file: !6, line: 373, baseType: !189, size: 192)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !6, line: 118, size: 192, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !189, file: !6, line: 119, baseType: !103, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !189, file: !6, line: 119, baseType: !58, size: 8, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !189, file: !6, line: 119, baseType: !58, size: 8, offset: 72)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !189, file: !6, line: 119, baseType: !113, size: 16, offset: 80)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !6, line: 119, baseType: !58, size: 8, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !189, file: !6, line: 119, baseType: !74, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !104, file: !6, line: 374, baseType: !198, size: 448)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !6, line: 143, size: 448, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !506, !507, !508}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !198, file: !6, line: 144, baseType: !103, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 72)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !198, file: !6, line: 144, baseType: !113, size: 16, offset: 80)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 96)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 104)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !198, file: !6, line: 145, baseType: !58, size: 8, offset: 112)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !198, file: !6, line: 146, baseType: !58, size: 8, offset: 120)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !198, file: !6, line: 147, baseType: !103, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !6, line: 148, baseType: !103, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !198, file: !6, line: 149, baseType: !57, size: 64, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !198, file: !6, line: 153, baseType: !212, size: 64, offset: 320)
!212 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !6, line: 150, size: 64, elements: !213)
!213 = !{!214, !505}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !212, file: !6, line: 151, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !155, line: 248, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!90, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !221, line: 37, size: 9024, elements: !222)
!221 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !451, !452, !453, !454, !455, !459, !461, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !488, !489, !490, !491, !492, !493, !494, !495, !497, !503}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !220, file: !221, line: 38, baseType: !219, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !220, file: !221, line: 39, baseType: !58, size: 8, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !220, file: !221, line: 40, baseType: !58, size: 8, offset: 72)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !220, file: !221, line: 41, baseType: !113, size: 16, offset: 80)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !220, file: !221, line: 42, baseType: !58, size: 8, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !220, file: !221, line: 43, baseType: !58, size: 8, offset: 104)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !220, file: !221, line: 44, baseType: !58, size: 8, offset: 112)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !220, file: !221, line: 45, baseType: !174, size: 16, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !220, file: !221, line: 46, baseType: !58, size: 8, offset: 144)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !220, file: !221, line: 47, baseType: !58, size: 8, offset: 152)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !220, file: !221, line: 48, baseType: !58, size: 8, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !220, file: !221, line: 49, baseType: !58, size: 8, offset: 168)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !220, file: !221, line: 50, baseType: !58, size: 8, offset: 176)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !220, file: !221, line: 51, baseType: !58, size: 8, offset: 184)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !220, file: !221, line: 52, baseType: !58, size: 8, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !220, file: !221, line: 53, baseType: !58, size: 8, offset: 200)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !220, file: !221, line: 54, baseType: !57, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !220, file: !221, line: 55, baseType: !31, size: 32, offset: 320)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !220, file: !221, line: 56, baseType: !31, size: 32, offset: 352)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !220, file: !221, line: 57, baseType: !31, size: 32, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !220, file: !221, line: 58, baseType: !31, size: 32, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !220, file: !221, line: 60, baseType: !245, size: 640, offset: 448)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !155, line: 893, size: 640, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !333, !334, !449, !450}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !245, file: !155, line: 894, baseType: !57, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !245, file: !155, line: 895, baseType: !57, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !245, file: !155, line: 896, baseType: !57, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !245, file: !155, line: 897, baseType: !57, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !245, file: !155, line: 898, baseType: !57, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !245, file: !155, line: 899, baseType: !253, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !155, line: 875, size: 1600, elements: !255)
!255 = !{!256, !276, !292}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !254, file: !155, line: 876, baseType: !257, size: 448)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !155, line: 828, size: 448, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !257, file: !155, line: 829, baseType: !253, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !257, file: !155, line: 829, baseType: !58, size: 8, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !257, file: !155, line: 829, baseType: !58, size: 8, offset: 72)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !257, file: !155, line: 829, baseType: !113, size: 16, offset: 80)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !257, file: !155, line: 829, baseType: !57, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !257, file: !155, line: 829, baseType: !253, size: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !257, file: !155, line: 829, baseType: !153, size: 64, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !257, file: !155, line: 829, baseType: !267, size: 64, offset: 320)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !155, line: 716, size: 64, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !267, file: !155, line: 717, baseType: !40, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !155, line: 718, baseType: !31, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !267, file: !155, line: 719, baseType: !49, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !267, file: !155, line: 720, baseType: !57, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !155, line: 721, baseType: !49, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !267, file: !155, line: 722, baseType: !253, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !257, file: !155, line: 829, baseType: !58, size: 8, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !254, file: !155, line: 877, baseType: !277, size: 640)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !155, line: 835, size: 640, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !277, file: !155, line: 836, baseType: !253, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !277, file: !155, line: 836, baseType: !58, size: 8, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !277, file: !155, line: 836, baseType: !58, size: 8, offset: 72)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !277, file: !155, line: 836, baseType: !113, size: 16, offset: 80)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !277, file: !155, line: 836, baseType: !57, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !155, line: 836, baseType: !253, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !277, file: !155, line: 836, baseType: !153, size: 64, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !277, file: !155, line: 836, baseType: !267, size: 64, offset: 320)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !277, file: !155, line: 836, baseType: !58, size: 8, offset: 384)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !277, file: !155, line: 836, baseType: !49, size: 64, offset: 448)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !155, line: 837, baseType: !57, size: 64, offset: 512)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !277, file: !155, line: 838, baseType: !31, size: 32, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !277, file: !155, line: 839, baseType: !31, size: 32, offset: 608)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !254, file: !155, line: 878, baseType: !293, size: 1600)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !155, line: 846, size: 1600, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !293, file: !155, line: 847, baseType: !253, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !293, file: !155, line: 847, baseType: !58, size: 8, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !293, file: !155, line: 847, baseType: !58, size: 8, offset: 72)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !293, file: !155, line: 847, baseType: !113, size: 16, offset: 80)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !293, file: !155, line: 847, baseType: !57, size: 64, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !155, line: 847, baseType: !253, size: 64, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !293, file: !155, line: 847, baseType: !153, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !293, file: !155, line: 847, baseType: !267, size: 64, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !293, file: !155, line: 847, baseType: !58, size: 8, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !293, file: !155, line: 847, baseType: !253, size: 64, offset: 448)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !293, file: !155, line: 848, baseType: !253, size: 64, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !293, file: !155, line: 849, baseType: !49, size: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !293, file: !155, line: 850, baseType: !58, size: 8, offset: 640)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !293, file: !155, line: 851, baseType: !49, size: 64, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !293, file: !155, line: 852, baseType: !49, size: 64, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !293, file: !155, line: 853, baseType: !49, size: 64, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !293, file: !155, line: 854, baseType: !167, size: 32, offset: 896)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !293, file: !155, line: 855, baseType: !31, size: 32, offset: 928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !293, file: !155, line: 856, baseType: !31, size: 32, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !293, file: !155, line: 857, baseType: !31, size: 32, offset: 992)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !293, file: !155, line: 858, baseType: !31, size: 32, offset: 1024)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !293, file: !155, line: 859, baseType: !31, size: 32, offset: 1056)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !293, file: !155, line: 860, baseType: !31, size: 32, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !293, file: !155, line: 861, baseType: !31, size: 32, offset: 1120)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !293, file: !155, line: 862, baseType: !31, size: 32, offset: 1152)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !293, file: !155, line: 863, baseType: !31, size: 32, offset: 1184)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !293, file: !155, line: 864, baseType: !31, size: 32, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !293, file: !155, line: 865, baseType: !31, size: 32, offset: 1248)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !293, file: !155, line: 866, baseType: !31, size: 32, offset: 1280)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !293, file: !155, line: 867, baseType: !31, size: 32, offset: 1312)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !293, file: !155, line: 868, baseType: !113, size: 16, offset: 1344)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !293, file: !155, line: 869, baseType: !58, size: 8, offset: 1360)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !293, file: !155, line: 870, baseType: !58, size: 8, offset: 1368)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !293, file: !155, line: 871, baseType: !58, size: 8, offset: 1376)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !293, file: !155, line: 872, baseType: !330, size: 160, offset: 1384)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 20)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !245, file: !155, line: 900, baseType: !153, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !245, file: !155, line: 901, baseType: !335, size: 64, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !155, line: 663, size: 640, elements: !337)
!337 = !{!338, !346, !359, !368, !377, !390, !404, !416, !428}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !336, file: !155, line: 664, baseType: !339, size: 128)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !155, line: 567, size: 128, elements: !340)
!340 = !{!341, !342, !343, !344, !345}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !155, line: 568, baseType: !74, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !339, file: !155, line: 568, baseType: !58, size: 8, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !155, line: 568, baseType: !58, size: 8, offset: 72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !339, file: !155, line: 568, baseType: !113, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !155, line: 568, baseType: !113, size: 16, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !336, file: !155, line: 665, baseType: !347, size: 384)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !155, line: 593, size: 384, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !155, line: 594, baseType: !74, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !347, file: !155, line: 594, baseType: !58, size: 8, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !347, file: !155, line: 594, baseType: !58, size: 8, offset: 72)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !347, file: !155, line: 594, baseType: !113, size: 16, offset: 80)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !347, file: !155, line: 594, baseType: !113, size: 16, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !347, file: !155, line: 594, baseType: !113, size: 16, offset: 112)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !347, file: !155, line: 595, baseType: !253, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !347, file: !155, line: 596, baseType: !57, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !347, file: !155, line: 597, baseType: !57, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !347, file: !155, line: 598, baseType: !40, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !336, file: !155, line: 666, baseType: !360, size: 192)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !155, line: 573, size: 192, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !155, line: 574, baseType: !74, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !360, file: !155, line: 574, baseType: !58, size: 8, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !360, file: !155, line: 574, baseType: !58, size: 8, offset: 72)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !360, file: !155, line: 574, baseType: !113, size: 16, offset: 80)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !360, file: !155, line: 574, baseType: !113, size: 16, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !360, file: !155, line: 574, baseType: !103, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !336, file: !155, line: 667, baseType: !369, size: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !155, line: 604, size: 192, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !155, line: 605, baseType: !74, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !369, file: !155, line: 605, baseType: !58, size: 8, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !155, line: 605, baseType: !58, size: 8, offset: 72)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !369, file: !155, line: 605, baseType: !113, size: 16, offset: 80)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !369, file: !155, line: 605, baseType: !113, size: 16, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !369, file: !155, line: 605, baseType: !153, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !336, file: !155, line: 668, baseType: !378, size: 448)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !155, line: 608, size: 448, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !378, file: !155, line: 609, baseType: !74, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !378, file: !155, line: 609, baseType: !58, size: 8, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !378, file: !155, line: 609, baseType: !58, size: 8, offset: 72)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !378, file: !155, line: 609, baseType: !113, size: 16, offset: 80)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !378, file: !155, line: 609, baseType: !113, size: 16, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !378, file: !155, line: 609, baseType: !31, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !378, file: !155, line: 610, baseType: !253, size: 64, offset: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !378, file: !155, line: 611, baseType: !57, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !378, file: !155, line: 612, baseType: !57, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !378, file: !155, line: 613, baseType: !31, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !336, file: !155, line: 669, baseType: !391, size: 512)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !155, line: 580, size: 512, elements: !392)
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !155, line: 581, baseType: !74, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !391, file: !155, line: 581, baseType: !58, size: 8, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !391, file: !155, line: 581, baseType: !58, size: 8, offset: 72)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !391, file: !155, line: 581, baseType: !113, size: 16, offset: 80)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !391, file: !155, line: 581, baseType: !113, size: 16, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !391, file: !155, line: 581, baseType: !31, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !391, file: !155, line: 582, baseType: !103, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !391, file: !155, line: 583, baseType: !103, size: 64, offset: 256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !391, file: !155, line: 584, baseType: !219, size: 64, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !391, file: !155, line: 585, baseType: !74, size: 64, offset: 384)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !391, file: !155, line: 586, baseType: !31, size: 32, offset: 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !336, file: !155, line: 670, baseType: !405, size: 320)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !155, line: 620, size: 320, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !155, line: 621, baseType: !74, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !405, file: !155, line: 621, baseType: !58, size: 8, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !405, file: !155, line: 621, baseType: !58, size: 8, offset: 72)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !405, file: !155, line: 621, baseType: !113, size: 16, offset: 80)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !405, file: !155, line: 621, baseType: !113, size: 16, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !405, file: !155, line: 621, baseType: !58, size: 8, offset: 112)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !405, file: !155, line: 622, baseType: !219, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !405, file: !155, line: 623, baseType: !103, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !405, file: !155, line: 624, baseType: !40, size: 64, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !336, file: !155, line: 671, baseType: !417, size: 640)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !155, line: 631, size: 640, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !155, line: 632, baseType: !74, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !417, file: !155, line: 632, baseType: !58, size: 8, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !417, file: !155, line: 632, baseType: !58, size: 8, offset: 72)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !417, file: !155, line: 632, baseType: !113, size: 16, offset: 80)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !417, file: !155, line: 632, baseType: !113, size: 16, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !417, file: !155, line: 633, baseType: !425, size: 512, offset: 128)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 8)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !336, file: !155, line: 672, baseType: !429, size: 320)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !155, line: 654, size: 320, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !429, file: !155, line: 655, baseType: !74, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !429, file: !155, line: 655, baseType: !58, size: 8, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !429, file: !155, line: 655, baseType: !58, size: 8, offset: 72)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !429, file: !155, line: 655, baseType: !113, size: 16, offset: 80)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !429, file: !155, line: 655, baseType: !113, size: 16, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !429, file: !155, line: 655, baseType: !58, size: 8, offset: 112)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !429, file: !155, line: 656, baseType: !153, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !429, file: !155, line: 657, baseType: !103, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !429, file: !155, line: 658, baseType: !440, size: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !155, line: 645, size: 128, elements: !442)
!442 = !{!443, !448}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !441, file: !155, line: 646, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !27, line: 1052, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !73, !31, !74}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !441, file: !155, line: 647, baseType: !74, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !245, file: !155, line: 902, baseType: !253, size: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !245, file: !155, line: 903, baseType: !31, size: 32, offset: 576)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !220, file: !221, line: 61, baseType: !31, size: 32, offset: 1088)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !220, file: !221, line: 62, baseType: !31, size: 32, offset: 1120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !220, file: !221, line: 63, baseType: !113, size: 16, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !220, file: !221, line: 64, baseType: !58, size: 8, offset: 1168)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !220, file: !221, line: 66, baseType: !456, size: 2688, offset: 1216)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 2688, elements: !457)
!457 = !{!458}
!458 = !DISubrange(count: 7)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !220, file: !221, line: 67, baseType: !460, size: 3072, offset: 3904)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 3072, elements: !426)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !220, file: !221, line: 68, baseType: !462, size: 576, offset: 6976)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 576, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 9)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !220, file: !221, line: 69, baseType: !102, size: 64, offset: 7552)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !220, file: !221, line: 71, baseType: !57, size: 64, offset: 7616)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !220, file: !221, line: 72, baseType: !102, size: 64, offset: 7680)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !220, file: !221, line: 73, baseType: !335, size: 64, offset: 7744)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !220, file: !221, line: 74, baseType: !153, size: 64, offset: 7808)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !220, file: !221, line: 75, baseType: !103, size: 64, offset: 7872)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !220, file: !221, line: 76, baseType: !153, size: 64, offset: 7936)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !220, file: !221, line: 77, baseType: !253, size: 64, offset: 8000)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !220, file: !221, line: 78, baseType: !103, size: 64, offset: 8064)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !220, file: !221, line: 79, baseType: !153, size: 64, offset: 8128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !220, file: !221, line: 80, baseType: !49, size: 64, offset: 8192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !220, file: !221, line: 81, baseType: !253, size: 64, offset: 8256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !220, file: !221, line: 82, baseType: !478, size: 64, offset: 8320)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !155, line: 702, size: 128, elements: !481)
!481 = !{!482, !483, !484, !485, !486, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !480, file: !155, line: 706, baseType: !31, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !480, file: !155, line: 707, baseType: !31, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !480, file: !155, line: 708, baseType: !113, size: 16, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !480, file: !155, line: 709, baseType: !58, size: 8, offset: 80)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !480, file: !155, line: 710, baseType: !58, size: 8, offset: 88)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !480, file: !155, line: 711, baseType: !58, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !220, file: !221, line: 83, baseType: !253, size: 64, offset: 8384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !220, file: !221, line: 84, baseType: !103, size: 64, offset: 8448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !220, file: !221, line: 85, baseType: !335, size: 64, offset: 8512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !220, file: !221, line: 86, baseType: !103, size: 64, offset: 8576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !220, file: !221, line: 87, baseType: !335, size: 64, offset: 8640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !220, file: !221, line: 88, baseType: !253, size: 64, offset: 8704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !220, file: !221, line: 89, baseType: !253, size: 64, offset: 8768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !220, file: !221, line: 90, baseType: !496, size: 64, offset: 8832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !220, file: !221, line: 91, baseType: !498, size: 64, offset: 8896)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !155, line: 637, baseType: !499)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DISubroutineType(types: !501)
!501 = !{!90, !219, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !220, file: !221, line: 92, baseType: !504, size: 64, offset: 8960)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !155, line: 641, baseType: !216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !212, file: !6, line: 152, baseType: !103, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !198, file: !6, line: 155, baseType: !31, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !198, file: !6, line: 156, baseType: !174, size: 16, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !198, file: !6, line: 157, baseType: !58, size: 8, offset: 432)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !104, file: !6, line: 375, baseType: !510, size: 576)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !6, line: 122, size: 576, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !510, file: !6, line: 123, baseType: !103, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !510, file: !6, line: 123, baseType: !58, size: 8, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !510, file: !6, line: 123, baseType: !58, size: 8, offset: 72)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !510, file: !6, line: 123, baseType: !113, size: 16, offset: 80)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !510, file: !6, line: 123, baseType: !58, size: 8, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !510, file: !6, line: 123, baseType: !58, size: 8, offset: 104)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !510, file: !6, line: 124, baseType: !113, size: 16, offset: 112)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !510, file: !6, line: 125, baseType: !74, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !510, file: !6, line: 126, baseType: !40, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !510, file: !6, line: 127, baseType: !496, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !510, file: !6, line: 128, baseType: !103, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !510, file: !6, line: 129, baseType: !103, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !510, file: !6, line: 130, baseType: !153, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !510, file: !6, line: 131, baseType: !58, size: 8, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !104, file: !6, line: 376, baseType: !527, size: 448)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !6, line: 134, size: 448, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !540}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !527, file: !6, line: 135, baseType: !103, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !527, file: !6, line: 135, baseType: !58, size: 8, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !6, line: 135, baseType: !58, size: 8, offset: 72)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !527, file: !6, line: 135, baseType: !113, size: 16, offset: 80)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !527, file: !6, line: 135, baseType: !58, size: 8, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !527, file: !6, line: 135, baseType: !58, size: 8, offset: 104)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !527, file: !6, line: 136, baseType: !153, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !527, file: !6, line: 137, baseType: !103, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !6, line: 138, baseType: !103, size: 64, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !527, file: !6, line: 139, baseType: !539, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !27, line: 129, baseType: !40)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !527, file: !6, line: 140, baseType: !31, size: 32, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !104, file: !6, line: 377, baseType: !542, size: 320)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !6, line: 184, size: 320, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !553}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !542, file: !6, line: 185, baseType: !103, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !542, file: !6, line: 185, baseType: !58, size: 8, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !542, file: !6, line: 185, baseType: !58, size: 8, offset: 72)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !542, file: !6, line: 185, baseType: !113, size: 16, offset: 80)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !542, file: !6, line: 185, baseType: !58, size: 8, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !542, file: !6, line: 185, baseType: !550, size: 128, offset: 128)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 128, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 2)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !542, file: !6, line: 185, baseType: !103, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !104, file: !6, line: 378, baseType: !555, size: 384)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !6, line: 187, size: 384, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !555, file: !6, line: 188, baseType: !103, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !555, file: !6, line: 188, baseType: !58, size: 8, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !6, line: 188, baseType: !58, size: 8, offset: 72)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !555, file: !6, line: 188, baseType: !113, size: 16, offset: 80)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !555, file: !6, line: 188, baseType: !58, size: 8, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !555, file: !6, line: 189, baseType: !550, size: 128, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !555, file: !6, line: 189, baseType: !103, size: 64, offset: 256)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !555, file: !6, line: 189, baseType: !565, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !155, line: 480, size: 576, elements: !567)
!567 = !{!568, !569, !570, !571, !579, !594, !626, !627, !628, !629, !630, !631}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !566, file: !155, line: 481, baseType: !153, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !566, file: !155, line: 482, baseType: !565, size: 64, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !566, file: !155, line: 483, baseType: !565, size: 64, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !566, file: !155, line: 484, baseType: !572, size: 64, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !155, line: 497, size: 256, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !573, file: !155, line: 498, baseType: !572, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !155, line: 499, baseType: !572, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !573, file: !155, line: 500, baseType: !565, size: 64, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !573, file: !155, line: 501, baseType: !31, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !566, file: !155, line: 485, baseType: !580, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !155, line: 466, size: 320, elements: !582)
!582 = !{!583, !588, !589, !590, !591, !592, !593}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !581, file: !155, line: 467, baseType: !584, size: 128)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !155, line: 459, size: 128, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !584, file: !155, line: 460, baseType: !58, size: 8)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !584, file: !155, line: 461, baseType: !40, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !581, file: !155, line: 468, baseType: !584, size: 128, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !581, file: !155, line: 469, baseType: !113, size: 16, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !581, file: !155, line: 470, baseType: !58, size: 8, offset: 272)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !581, file: !155, line: 471, baseType: !58, size: 8, offset: 280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !581, file: !155, line: 472, baseType: !58, size: 8, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !581, file: !155, line: 473, baseType: !58, size: 8, offset: 296)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !566, file: !155, line: 486, baseType: !595, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !155, line: 448, size: 192, elements: !597)
!597 = !{!598, !621, !622, !623, !624, !625}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !596, file: !155, line: 449, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !155, line: 438, size: 64, elements: !600)
!600 = !{!601, !602, !615}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !599, file: !155, line: 439, baseType: !153, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !599, file: !155, line: 440, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !155, line: 419, size: 256, elements: !605)
!605 = !{!606, !611, !612, !613, !614}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !604, file: !155, line: 420, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !27, line: 1049, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DISubroutineType(types: !610)
!610 = !{!31, !73, !31, !74}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !604, file: !155, line: 421, baseType: !74, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !604, file: !155, line: 422, baseType: !153, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !604, file: !155, line: 423, baseType: !58, size: 8, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !604, file: !155, line: 424, baseType: !58, size: 8, offset: 200)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !599, file: !155, line: 441, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !155, line: 429, size: 128, elements: !618)
!618 = !{!619, !620}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !617, file: !155, line: 430, baseType: !153, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !155, line: 431, baseType: !616, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !596, file: !155, line: 450, baseType: !580, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !155, line: 451, baseType: !58, size: 8, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !596, file: !155, line: 452, baseType: !58, size: 8, offset: 136)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !596, file: !155, line: 453, baseType: !58, size: 8, offset: 144)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !596, file: !155, line: 454, baseType: !58, size: 8, offset: 152)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !566, file: !155, line: 487, baseType: !40, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !566, file: !155, line: 488, baseType: !31, size: 32, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !566, file: !155, line: 489, baseType: !113, size: 16, offset: 480)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !566, file: !155, line: 490, baseType: !113, size: 16, offset: 496)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !566, file: !155, line: 491, baseType: !58, size: 8, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !566, file: !155, line: 492, baseType: !58, size: 8, offset: 520)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !104, file: !6, line: 379, baseType: !633, size: 384)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !6, line: 192, size: 384, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !633, file: !6, line: 193, baseType: !103, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !633, file: !6, line: 193, baseType: !58, size: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !633, file: !6, line: 193, baseType: !58, size: 8, offset: 72)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !633, file: !6, line: 193, baseType: !113, size: 16, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !6, line: 193, baseType: !58, size: 8, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !633, file: !6, line: 193, baseType: !550, size: 128, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !633, file: !6, line: 193, baseType: !103, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !633, file: !6, line: 193, baseType: !31, size: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !633, file: !6, line: 194, baseType: !31, size: 32, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !104, file: !6, line: 380, baseType: !645, size: 384)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !6, line: 197, size: 384, elements: !646)
!646 = !{!647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !645, file: !6, line: 198, baseType: !103, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !645, file: !6, line: 198, baseType: !58, size: 8, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !645, file: !6, line: 198, baseType: !58, size: 8, offset: 72)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !645, file: !6, line: 198, baseType: !113, size: 16, offset: 80)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !645, file: !6, line: 198, baseType: !58, size: 8, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !645, file: !6, line: 200, baseType: !58, size: 8, offset: 104)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !645, file: !6, line: 201, baseType: !58, size: 8, offset: 112)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !645, file: !6, line: 202, baseType: !550, size: 128, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !645, file: !6, line: 202, baseType: !103, size: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !645, file: !6, line: 202, baseType: !81, size: 64, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !104, file: !6, line: 381, baseType: !658, size: 320)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !6, line: 205, size: 320, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !658, file: !6, line: 206, baseType: !103, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !658, file: !6, line: 206, baseType: !58, size: 8, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !6, line: 206, baseType: !58, size: 8, offset: 72)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !658, file: !6, line: 206, baseType: !113, size: 16, offset: 80)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !658, file: !6, line: 206, baseType: !58, size: 8, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !658, file: !6, line: 206, baseType: !550, size: 128, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !658, file: !6, line: 206, baseType: !103, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !104, file: !6, line: 382, baseType: !668, size: 384)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !6, line: 233, size: 384, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !668, file: !6, line: 234, baseType: !103, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 72)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !668, file: !6, line: 234, baseType: !113, size: 16, offset: 80)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 104)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 120)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !668, file: !6, line: 234, baseType: !153, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !668, file: !6, line: 234, baseType: !31, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !668, file: !6, line: 234, baseType: !31, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !668, file: !6, line: 234, baseType: !31, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !668, file: !6, line: 234, baseType: !58, size: 8, offset: 296)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !668, file: !6, line: 234, baseType: !103, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !104, file: !6, line: 383, baseType: !686, size: 576)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !6, line: 237, size: 576, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !686, file: !6, line: 238, baseType: !103, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 72)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !686, file: !6, line: 238, baseType: !113, size: 16, offset: 80)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 104)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 120)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !686, file: !6, line: 238, baseType: !153, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !686, file: !6, line: 238, baseType: !31, size: 32, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !686, file: !6, line: 238, baseType: !31, size: 32, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !686, file: !6, line: 238, baseType: !31, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 288)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !686, file: !6, line: 238, baseType: !58, size: 8, offset: 296)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !686, file: !6, line: 238, baseType: !113, size: 16, offset: 304)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !686, file: !6, line: 239, baseType: !103, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !686, file: !6, line: 240, baseType: !57, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !686, file: !6, line: 241, baseType: !113, size: 16, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !686, file: !6, line: 242, baseType: !57, size: 64, offset: 512)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !104, file: !6, line: 384, baseType: !708, size: 384)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !6, line: 262, size: 384, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !708, file: !6, line: 263, baseType: !103, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 72)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !708, file: !6, line: 263, baseType: !113, size: 16, offset: 80)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 96)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 104)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 112)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 120)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !708, file: !6, line: 263, baseType: !153, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !708, file: !6, line: 263, baseType: !31, size: 32, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !708, file: !6, line: 263, baseType: !31, size: 32, offset: 224)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !708, file: !6, line: 263, baseType: !31, size: 32, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 296)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !708, file: !6, line: 263, baseType: !58, size: 8, offset: 304)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !708, file: !6, line: 264, baseType: !103, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !104, file: !6, line: 385, baseType: !727, size: 448)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !6, line: 245, size: 448, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !727, file: !6, line: 246, baseType: !103, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 72)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !727, file: !6, line: 246, baseType: !113, size: 16, offset: 80)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 120)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !727, file: !6, line: 246, baseType: !153, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !727, file: !6, line: 246, baseType: !31, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !727, file: !6, line: 246, baseType: !31, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !727, file: !6, line: 246, baseType: !31, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !727, file: !6, line: 246, baseType: !58, size: 8, offset: 296)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !727, file: !6, line: 246, baseType: !103, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !727, file: !6, line: 247, baseType: !103, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !104, file: !6, line: 386, baseType: !746, size: 448)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !6, line: 250, size: 448, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !746, file: !6, line: 251, baseType: !103, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 72)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !746, file: !6, line: 251, baseType: !113, size: 16, offset: 80)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 104)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 120)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !746, file: !6, line: 251, baseType: !153, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !746, file: !6, line: 251, baseType: !31, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !746, file: !6, line: 251, baseType: !31, size: 32, offset: 224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !746, file: !6, line: 251, baseType: !31, size: 32, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !746, file: !6, line: 251, baseType: !58, size: 8, offset: 296)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !746, file: !6, line: 256, baseType: !103, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !746, file: !6, line: 257, baseType: !103, size: 64, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !104, file: !6, line: 387, baseType: !765, size: 512)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !6, line: 273, size: 512, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !765, file: !6, line: 274, baseType: !103, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !765, file: !6, line: 274, baseType: !58, size: 8, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !6, line: 274, baseType: !58, size: 8, offset: 72)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !765, file: !6, line: 274, baseType: !113, size: 16, offset: 80)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !6, line: 274, baseType: !58, size: 8, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !765, file: !6, line: 274, baseType: !153, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !765, file: !6, line: 275, baseType: !31, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !765, file: !6, line: 276, baseType: !444, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !765, file: !6, line: 277, baseType: !74, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !765, file: !6, line: 278, baseType: !550, size: 128, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !104, file: !6, line: 388, baseType: !778, size: 512)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !6, line: 281, size: 512, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !793, !794, !795, !801, !802}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !778, file: !6, line: 282, baseType: !103, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !778, file: !6, line: 282, baseType: !58, size: 8, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !778, file: !6, line: 282, baseType: !58, size: 8, offset: 72)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !778, file: !6, line: 282, baseType: !113, size: 16, offset: 80)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !778, file: !6, line: 282, baseType: !58, size: 8, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !778, file: !6, line: 282, baseType: !58, size: 8, offset: 104)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !778, file: !6, line: 283, baseType: !58, size: 8, offset: 112)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !778, file: !6, line: 284, baseType: !788, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !27, line: 1084, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!90, !31, !539, !31, !792, !74, !74}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !778, file: !6, line: 285, baseType: !153, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !778, file: !6, line: 286, baseType: !74, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !778, file: !6, line: 287, baseType: !796, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !27, line: 1102, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!90, !73, !31, !74, !800}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !778, file: !6, line: 288, baseType: !103, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !6, line: 289, baseType: !103, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !104, file: !6, line: 389, baseType: !804, size: 512)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !6, line: 307, size: 512, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !804, file: !6, line: 308, baseType: !103, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !804, file: !6, line: 308, baseType: !58, size: 8, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !804, file: !6, line: 308, baseType: !58, size: 8, offset: 72)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !804, file: !6, line: 308, baseType: !113, size: 16, offset: 80)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !804, file: !6, line: 308, baseType: !58, size: 8, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !804, file: !6, line: 308, baseType: !58, size: 8, offset: 104)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !804, file: !6, line: 309, baseType: !58, size: 8, offset: 112)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !804, file: !6, line: 310, baseType: !58, size: 8, offset: 120)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !804, file: !6, line: 311, baseType: !74, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !804, file: !6, line: 312, baseType: !153, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !804, file: !6, line: 313, baseType: !102, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !804, file: !6, line: 314, baseType: !57, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !804, file: !6, line: 315, baseType: !57, size: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !804, file: !6, line: 316, baseType: !31, size: 32, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !104, file: !6, line: 390, baseType: !821, size: 448)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !6, line: 340, size: 448, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !821, file: !6, line: 341, baseType: !103, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !821, file: !6, line: 341, baseType: !58, size: 8, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !821, file: !6, line: 341, baseType: !58, size: 8, offset: 72)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !821, file: !6, line: 341, baseType: !113, size: 16, offset: 80)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !821, file: !6, line: 341, baseType: !58, size: 8, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !821, file: !6, line: 341, baseType: !153, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !821, file: !6, line: 342, baseType: !153, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !821, file: !6, line: 343, baseType: !74, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !821, file: !6, line: 344, baseType: !57, size: 64, offset: 320)
