; ModuleID = '../bcout/drivers/acpi/acpica/uteval.llvm.bc'
source_filename = "drivers/acpi/acpica/uteval.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 15, type: !34, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !33, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/uteval.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !21, !22, !24, !26, !27, !30, !32}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !20)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !29)
!29 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !31, line: 148, baseType: !7)
!31 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !{!0}
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 56, elements: !36)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!36 = !{!37}
!37 = !DISubrange(count: 7)
!38 = !{!"rsp"}
!39 = !{i32 7, !"Dwarf Version", i32 4}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 2}
!42 = !{i32 1, !"Code Model", i32 2}
!43 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!44 = distinct !DISubprogram(name: "acpi_ut_evaluate_object", scope: !3, file: !3, line: 37, type: !45, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !805)
!45 = !DISubroutineType(types: !46)
!46 = !{!21, !47, !804, !22, !114}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !49, line: 133, size: 384, elements: !50)
!49 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!50 = !{!51, !791, !792, !793, !794, !800, !801, !802, !803}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !48, file: !49, line: 134, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !54, line: 367, size: 576, elements: !55)
!54 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!55 = !{!56, !67, !80, !90, !104, !118, !127, !442, !459, !474, !487, !565, !577, !591, !601, !619, !641, !660, !679, !698, !711, !737, !754, !767, !781, !790}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !53, file: !54, line: 368, baseType: !57, size: 128)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !54, line: 73, size: 128, elements: !58)
!58 = !{!59, !60, !61, !62, !66}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !57, file: !54, line: 74, baseType: !52, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !57, file: !54, line: 74, baseType: !27, size: 8, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !57, file: !54, line: 74, baseType: !27, size: 8, offset: 72)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !57, file: !54, line: 74, baseType: !63, size: 16, offset: 80)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !65)
!65 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !57, file: !54, line: 74, baseType: !27, size: 8, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !53, file: !54, line: 369, baseType: !68, size: 192)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !54, line: 76, size: 192, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !79}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !68, file: !54, line: 77, baseType: !52, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !68, file: !54, line: 77, baseType: !27, size: 8, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !54, line: 77, baseType: !27, size: 8, offset: 72)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !68, file: !54, line: 77, baseType: !63, size: 16, offset: 80)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !68, file: !54, line: 77, baseType: !27, size: 8, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !68, file: !54, line: 77, baseType: !76, size: 24, offset: 104)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 3)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !54, line: 78, baseType: !16, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !53, file: !54, line: 370, baseType: !81, size: 256)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !54, line: 93, size: 256, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !81, file: !54, line: 94, baseType: !52, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !81, file: !54, line: 94, baseType: !27, size: 8, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !81, file: !54, line: 94, baseType: !27, size: 8, offset: 72)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !81, file: !54, line: 94, baseType: !63, size: 16, offset: 80)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !81, file: !54, line: 94, baseType: !27, size: 8, offset: 96)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !81, file: !54, line: 94, baseType: !24, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !81, file: !54, line: 94, baseType: !22, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !53, file: !54, line: 371, baseType: !91, size: 384)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !54, line: 97, size: 384, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98, !100, !101, !102, !103}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !91, file: !54, line: 98, baseType: !52, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !91, file: !54, line: 98, baseType: !27, size: 8, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !54, line: 98, baseType: !27, size: 8, offset: 72)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !91, file: !54, line: 98, baseType: !63, size: 16, offset: 80)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !54, line: 98, baseType: !27, size: 8, offset: 96)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !91, file: !54, line: 98, baseType: !99, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !91, file: !54, line: 98, baseType: !22, size: 32, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !91, file: !54, line: 99, baseType: !22, size: 32, offset: 224)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !91, file: !54, line: 100, baseType: !99, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !91, file: !54, line: 101, baseType: !47, size: 64, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !53, file: !54, line: 372, baseType: !105, size: 384)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !54, line: 104, size: 384, elements: !106)
!106 = !{!107, !108, !109, !110, !111, !112, !113, !115, !116, !117}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !105, file: !54, line: 105, baseType: !52, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !105, file: !54, line: 105, baseType: !27, size: 8, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !105, file: !54, line: 105, baseType: !27, size: 8, offset: 72)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !105, file: !54, line: 105, baseType: !63, size: 16, offset: 80)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !105, file: !54, line: 105, baseType: !27, size: 8, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !105, file: !54, line: 105, baseType: !47, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !105, file: !54, line: 106, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !105, file: !54, line: 107, baseType: !99, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !105, file: !54, line: 108, baseType: !22, size: 32, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !105, file: !54, line: 109, baseType: !22, size: 32, offset: 352)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !53, file: !54, line: 373, baseType: !119, size: 192)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !54, line: 118, size: 192, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !119, file: !54, line: 119, baseType: !52, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !119, file: !54, line: 119, baseType: !27, size: 8, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !54, line: 119, baseType: !27, size: 8, offset: 72)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !119, file: !54, line: 119, baseType: !63, size: 16, offset: 80)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !119, file: !54, line: 119, baseType: !27, size: 8, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !119, file: !54, line: 119, baseType: !26, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !53, file: !54, line: 374, baseType: !128, size: 448)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !54, line: 143, size: 448, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !439, !440, !441}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !128, file: !54, line: 144, baseType: !52, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !128, file: !54, line: 144, baseType: !27, size: 8, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !54, line: 144, baseType: !27, size: 8, offset: 72)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !128, file: !54, line: 144, baseType: !63, size: 16, offset: 80)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !128, file: !54, line: 144, baseType: !27, size: 8, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !128, file: !54, line: 144, baseType: !27, size: 8, offset: 104)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !128, file: !54, line: 145, baseType: !27, size: 8, offset: 112)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !128, file: !54, line: 146, baseType: !27, size: 8, offset: 120)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !128, file: !54, line: 147, baseType: !52, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !128, file: !54, line: 148, baseType: !52, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !128, file: !54, line: 149, baseType: !99, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !128, file: !54, line: 153, baseType: !142, size: 64, offset: 320)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !54, line: 150, size: 64, elements: !143)
!143 = !{!144, !438}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !142, file: !54, line: 151, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !49, line: 248, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!21, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !151, line: 37, size: 9024, elements: !152)
!151 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !386, !387, !388, !389, !390, !392, !394, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !421, !422, !423, !424, !425, !426, !427, !428, !430, !436}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !151, line: 38, baseType: !149, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !150, file: !151, line: 39, baseType: !27, size: 8, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !150, file: !151, line: 40, baseType: !27, size: 8, offset: 72)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !150, file: !151, line: 41, baseType: !63, size: 16, offset: 80)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !150, file: !151, line: 42, baseType: !27, size: 8, offset: 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !150, file: !151, line: 43, baseType: !27, size: 8, offset: 104)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !150, file: !151, line: 44, baseType: !27, size: 8, offset: 112)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !150, file: !151, line: 45, baseType: !161, size: 16, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !63)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !150, file: !151, line: 46, baseType: !27, size: 8, offset: 144)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !150, file: !151, line: 47, baseType: !27, size: 8, offset: 152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !150, file: !151, line: 48, baseType: !27, size: 8, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !150, file: !151, line: 49, baseType: !27, size: 8, offset: 168)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !150, file: !151, line: 50, baseType: !27, size: 8, offset: 176)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !150, file: !151, line: 51, baseType: !27, size: 8, offset: 184)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !150, file: !151, line: 52, baseType: !27, size: 8, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !150, file: !151, line: 53, baseType: !27, size: 8, offset: 200)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !150, file: !151, line: 54, baseType: !99, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !150, file: !151, line: 55, baseType: !22, size: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !150, file: !151, line: 56, baseType: !22, size: 32, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !150, file: !151, line: 57, baseType: !22, size: 32, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !150, file: !151, line: 58, baseType: !22, size: 32, offset: 416)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !150, file: !151, line: 60, baseType: !176, size: 640, offset: 448)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !49, line: 893, size: 640, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !267, !268, !384, !385}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !176, file: !49, line: 894, baseType: !99, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !176, file: !49, line: 895, baseType: !99, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !176, file: !49, line: 896, baseType: !99, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !176, file: !49, line: 897, baseType: !99, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !176, file: !49, line: 898, baseType: !99, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !176, file: !49, line: 899, baseType: !184, size: 64, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !49, line: 875, size: 1600, elements: !186)
!186 = !{!187, !207, !223}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !185, file: !49, line: 876, baseType: !188, size: 448)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !49, line: 828, size: 448, elements: !189)
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !206}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !188, file: !49, line: 829, baseType: !184, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !188, file: !49, line: 829, baseType: !27, size: 8, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !188, file: !49, line: 829, baseType: !27, size: 8, offset: 72)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !188, file: !49, line: 829, baseType: !63, size: 16, offset: 80)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !188, file: !49, line: 829, baseType: !99, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !49, line: 829, baseType: !184, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !188, file: !49, line: 829, baseType: !47, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !49, line: 829, baseType: !198, size: 64, offset: 320)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !49, line: 716, size: 64, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !198, file: !49, line: 717, baseType: !16, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !198, file: !49, line: 718, baseType: !22, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !198, file: !49, line: 719, baseType: !24, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !198, file: !49, line: 720, baseType: !99, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !49, line: 721, baseType: !24, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !198, file: !49, line: 722, baseType: !184, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !188, file: !49, line: 829, baseType: !27, size: 8, offset: 384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !185, file: !49, line: 877, baseType: !208, size: 640)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !49, line: 835, size: 640, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !208, file: !49, line: 836, baseType: !184, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !208, file: !49, line: 836, baseType: !27, size: 8, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !208, file: !49, line: 836, baseType: !27, size: 8, offset: 72)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !208, file: !49, line: 836, baseType: !63, size: 16, offset: 80)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !208, file: !49, line: 836, baseType: !99, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !49, line: 836, baseType: !184, size: 64, offset: 192)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !208, file: !49, line: 836, baseType: !47, size: 64, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !208, file: !49, line: 836, baseType: !198, size: 64, offset: 320)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !208, file: !49, line: 836, baseType: !27, size: 8, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !208, file: !49, line: 836, baseType: !24, size: 64, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !49, line: 837, baseType: !99, size: 64, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !208, file: !49, line: 838, baseType: !22, size: 32, offset: 576)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !49, line: 839, baseType: !22, size: 32, offset: 608)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !185, file: !49, line: 878, baseType: !224, size: 1600)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !49, line: 846, size: 1600, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !224, file: !49, line: 847, baseType: !184, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !224, file: !49, line: 847, baseType: !27, size: 8, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !224, file: !49, line: 847, baseType: !27, size: 8, offset: 72)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !224, file: !49, line: 847, baseType: !63, size: 16, offset: 80)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !224, file: !49, line: 847, baseType: !99, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !224, file: !49, line: 847, baseType: !184, size: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !224, file: !49, line: 847, baseType: !47, size: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !224, file: !49, line: 847, baseType: !198, size: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !224, file: !49, line: 847, baseType: !27, size: 8, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !224, file: !49, line: 847, baseType: !184, size: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !224, file: !49, line: 848, baseType: !184, size: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !224, file: !49, line: 849, baseType: !24, size: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !224, file: !49, line: 850, baseType: !27, size: 8, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !224, file: !49, line: 851, baseType: !24, size: 64, offset: 704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !224, file: !49, line: 852, baseType: !24, size: 64, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !224, file: !49, line: 853, baseType: !24, size: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !224, file: !49, line: 854, baseType: !243, size: 32, offset: 896)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 32, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 4)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !224, file: !49, line: 855, baseType: !22, size: 32, offset: 928)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !224, file: !49, line: 856, baseType: !22, size: 32, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !224, file: !49, line: 857, baseType: !22, size: 32, offset: 992)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !224, file: !49, line: 858, baseType: !22, size: 32, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !224, file: !49, line: 859, baseType: !22, size: 32, offset: 1056)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !224, file: !49, line: 860, baseType: !22, size: 32, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !224, file: !49, line: 861, baseType: !22, size: 32, offset: 1120)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !224, file: !49, line: 862, baseType: !22, size: 32, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !224, file: !49, line: 863, baseType: !22, size: 32, offset: 1184)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !224, file: !49, line: 864, baseType: !22, size: 32, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !224, file: !49, line: 865, baseType: !22, size: 32, offset: 1248)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !224, file: !49, line: 866, baseType: !22, size: 32, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !224, file: !49, line: 867, baseType: !22, size: 32, offset: 1312)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !224, file: !49, line: 868, baseType: !63, size: 16, offset: 1344)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !224, file: !49, line: 869, baseType: !27, size: 8, offset: 1360)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !224, file: !49, line: 870, baseType: !27, size: 8, offset: 1368)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !224, file: !49, line: 871, baseType: !27, size: 8, offset: 1376)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !224, file: !49, line: 872, baseType: !264, size: 160, offset: 1384)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 20)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !176, file: !49, line: 900, baseType: !47, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !176, file: !49, line: 901, baseType: !269, size: 64, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !49, line: 663, size: 640, elements: !271)
!271 = !{!272, !280, !293, !302, !311, !324, !338, !350, !362}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !270, file: !49, line: 664, baseType: !273, size: 128)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !49, line: 567, size: 128, elements: !274)
!274 = !{!275, !276, !277, !278, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !49, line: 568, baseType: !26, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !273, file: !49, line: 568, baseType: !27, size: 8, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !273, file: !49, line: 568, baseType: !27, size: 8, offset: 72)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !49, line: 568, baseType: !63, size: 16, offset: 80)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !273, file: !49, line: 568, baseType: !63, size: 16, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !270, file: !49, line: 665, baseType: !281, size: 384)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !49, line: 593, size: 384, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !49, line: 594, baseType: !26, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !281, file: !49, line: 594, baseType: !27, size: 8, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !49, line: 594, baseType: !27, size: 8, offset: 72)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !281, file: !49, line: 594, baseType: !63, size: 16, offset: 80)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !281, file: !49, line: 594, baseType: !63, size: 16, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !281, file: !49, line: 594, baseType: !63, size: 16, offset: 112)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !281, file: !49, line: 595, baseType: !184, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !281, file: !49, line: 596, baseType: !99, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !281, file: !49, line: 597, baseType: !99, size: 64, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !281, file: !49, line: 598, baseType: !16, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !270, file: !49, line: 666, baseType: !294, size: 192)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !49, line: 573, size: 192, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !294, file: !49, line: 574, baseType: !26, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !294, file: !49, line: 574, baseType: !27, size: 8, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !294, file: !49, line: 574, baseType: !27, size: 8, offset: 72)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !294, file: !49, line: 574, baseType: !63, size: 16, offset: 80)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !294, file: !49, line: 574, baseType: !63, size: 16, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !294, file: !49, line: 574, baseType: !52, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !270, file: !49, line: 667, baseType: !303, size: 192)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !49, line: 604, size: 192, elements: !304)
!304 = !{!305, !306, !307, !308, !309, !310}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !49, line: 605, baseType: !26, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !303, file: !49, line: 605, baseType: !27, size: 8, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !49, line: 605, baseType: !27, size: 8, offset: 72)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !303, file: !49, line: 605, baseType: !63, size: 16, offset: 80)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !303, file: !49, line: 605, baseType: !63, size: 16, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !303, file: !49, line: 605, baseType: !47, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !270, file: !49, line: 668, baseType: !312, size: 448)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !49, line: 608, size: 448, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !49, line: 609, baseType: !26, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !312, file: !49, line: 609, baseType: !27, size: 8, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !312, file: !49, line: 609, baseType: !27, size: 8, offset: 72)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !49, line: 609, baseType: !63, size: 16, offset: 80)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !312, file: !49, line: 609, baseType: !63, size: 16, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !312, file: !49, line: 609, baseType: !22, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !312, file: !49, line: 610, baseType: !184, size: 64, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !312, file: !49, line: 611, baseType: !99, size: 64, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !312, file: !49, line: 612, baseType: !99, size: 64, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !312, file: !49, line: 613, baseType: !22, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !270, file: !49, line: 669, baseType: !325, size: 512)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !49, line: 580, size: 512, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !49, line: 581, baseType: !26, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !325, file: !49, line: 581, baseType: !27, size: 8, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !325, file: !49, line: 581, baseType: !27, size: 8, offset: 72)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !325, file: !49, line: 581, baseType: !63, size: 16, offset: 80)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !325, file: !49, line: 581, baseType: !63, size: 16, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !325, file: !49, line: 581, baseType: !22, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !325, file: !49, line: 582, baseType: !52, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !325, file: !49, line: 583, baseType: !52, size: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !325, file: !49, line: 584, baseType: !149, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !325, file: !49, line: 585, baseType: !26, size: 64, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !325, file: !49, line: 586, baseType: !22, size: 32, offset: 448)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !270, file: !49, line: 670, baseType: !339, size: 320)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !49, line: 620, size: 320, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !49, line: 621, baseType: !26, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !339, file: !49, line: 621, baseType: !27, size: 8, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !339, file: !49, line: 621, baseType: !27, size: 8, offset: 72)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !339, file: !49, line: 621, baseType: !63, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !339, file: !49, line: 621, baseType: !63, size: 16, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !339, file: !49, line: 621, baseType: !27, size: 8, offset: 112)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !339, file: !49, line: 622, baseType: !149, size: 64, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !339, file: !49, line: 623, baseType: !52, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !339, file: !49, line: 624, baseType: !16, size: 64, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !270, file: !49, line: 671, baseType: !351, size: 640)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !49, line: 631, size: 640, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !351, file: !49, line: 632, baseType: !26, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !351, file: !49, line: 632, baseType: !27, size: 8, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !351, file: !49, line: 632, baseType: !27, size: 8, offset: 72)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !351, file: !49, line: 632, baseType: !63, size: 16, offset: 80)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !351, file: !49, line: 632, baseType: !63, size: 16, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !351, file: !49, line: 633, baseType: !359, size: 512, offset: 128)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 512, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !270, file: !49, line: 672, baseType: !363, size: 320)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !49, line: 654, size: 320, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !49, line: 655, baseType: !26, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !363, file: !49, line: 655, baseType: !27, size: 8, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !363, file: !49, line: 655, baseType: !27, size: 8, offset: 72)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !363, file: !49, line: 655, baseType: !63, size: 16, offset: 80)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !363, file: !49, line: 655, baseType: !63, size: 16, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !363, file: !49, line: 655, baseType: !27, size: 8, offset: 112)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !363, file: !49, line: 656, baseType: !47, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !363, file: !49, line: 657, baseType: !52, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !363, file: !49, line: 658, baseType: !374, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !49, line: 645, size: 128, elements: !376)
!376 = !{!377, !383}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !375, file: !49, line: 646, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382, !22, !26}
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !26)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !375, file: !49, line: 647, baseType: !26, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !176, file: !49, line: 902, baseType: !184, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !176, file: !49, line: 903, baseType: !22, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !150, file: !151, line: 61, baseType: !22, size: 32, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !150, file: !151, line: 62, baseType: !22, size: 32, offset: 1120)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !150, file: !151, line: 63, baseType: !63, size: 16, offset: 1152)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !150, file: !151, line: 64, baseType: !27, size: 8, offset: 1168)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !150, file: !151, line: 66, baseType: !391, size: 2688, offset: 1216)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 2688, elements: !36)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !150, file: !151, line: 67, baseType: !393, size: 3072, offset: 3904)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 3072, elements: !360)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !150, file: !151, line: 68, baseType: !395, size: 576, offset: 6976)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 576, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 9)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !150, file: !151, line: 69, baseType: !114, size: 64, offset: 7552)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !150, file: !151, line: 71, baseType: !99, size: 64, offset: 7616)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !150, file: !151, line: 72, baseType: !114, size: 64, offset: 7680)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !150, file: !151, line: 73, baseType: !269, size: 64, offset: 7744)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !150, file: !151, line: 74, baseType: !47, size: 64, offset: 7808)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !150, file: !151, line: 75, baseType: !52, size: 64, offset: 7872)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !150, file: !151, line: 76, baseType: !47, size: 64, offset: 7936)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !150, file: !151, line: 77, baseType: !184, size: 64, offset: 8000)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !150, file: !151, line: 78, baseType: !52, size: 64, offset: 8064)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !150, file: !151, line: 79, baseType: !47, size: 64, offset: 8128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !150, file: !151, line: 80, baseType: !24, size: 64, offset: 8192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !150, file: !151, line: 81, baseType: !184, size: 64, offset: 8256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !150, file: !151, line: 82, baseType: !411, size: 64, offset: 8320)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !49, line: 702, size: 128, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !413, file: !49, line: 706, baseType: !22, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !413, file: !49, line: 707, baseType: !22, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !413, file: !49, line: 708, baseType: !63, size: 16, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !413, file: !49, line: 709, baseType: !27, size: 8, offset: 80)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !413, file: !49, line: 710, baseType: !27, size: 8, offset: 88)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !413, file: !49, line: 711, baseType: !27, size: 8, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !150, file: !151, line: 83, baseType: !184, size: 64, offset: 8384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !150, file: !151, line: 84, baseType: !52, size: 64, offset: 8448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !150, file: !151, line: 85, baseType: !269, size: 64, offset: 8512)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !150, file: !151, line: 86, baseType: !52, size: 64, offset: 8576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !150, file: !151, line: 87, baseType: !269, size: 64, offset: 8640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !150, file: !151, line: 88, baseType: !184, size: 64, offset: 8704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !150, file: !151, line: 89, baseType: !184, size: 64, offset: 8768)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !150, file: !151, line: 90, baseType: !429, size: 64, offset: 8832)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !150, file: !151, line: 91, baseType: !431, size: 64, offset: 8896)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !49, line: 637, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!21, !149, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !150, file: !151, line: 92, baseType: !437, size: 64, offset: 8960)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !49, line: 641, baseType: !146)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !142, file: !54, line: 152, baseType: !52, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !128, file: !54, line: 155, baseType: !22, size: 32, offset: 384)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !128, file: !54, line: 156, baseType: !161, size: 16, offset: 416)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !128, file: !54, line: 157, baseType: !27, size: 8, offset: 432)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !53, file: !54, line: 375, baseType: !443, size: 576)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !54, line: 122, size: 576, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !443, file: !54, line: 123, baseType: !52, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !443, file: !54, line: 123, baseType: !27, size: 8, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !443, file: !54, line: 123, baseType: !27, size: 8, offset: 72)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !443, file: !54, line: 123, baseType: !63, size: 16, offset: 80)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !443, file: !54, line: 123, baseType: !27, size: 8, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !443, file: !54, line: 123, baseType: !27, size: 8, offset: 104)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !443, file: !54, line: 124, baseType: !63, size: 16, offset: 112)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !443, file: !54, line: 125, baseType: !26, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !443, file: !54, line: 126, baseType: !16, size: 64, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !443, file: !54, line: 127, baseType: !429, size: 64, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !54, line: 128, baseType: !52, size: 64, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !54, line: 129, baseType: !52, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !443, file: !54, line: 130, baseType: !47, size: 64, offset: 448)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !443, file: !54, line: 131, baseType: !27, size: 8, offset: 512)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !53, file: !54, line: 376, baseType: !460, size: 448)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !54, line: 134, size: 448, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !473}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !460, file: !54, line: 135, baseType: !52, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !460, file: !54, line: 135, baseType: !27, size: 8, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !54, line: 135, baseType: !27, size: 8, offset: 72)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !460, file: !54, line: 135, baseType: !63, size: 16, offset: 80)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !460, file: !54, line: 135, baseType: !27, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !460, file: !54, line: 135, baseType: !27, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !54, line: 136, baseType: !47, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !460, file: !54, line: 137, baseType: !52, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !460, file: !54, line: 138, baseType: !52, size: 64, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !460, file: !54, line: 139, baseType: !472, size: 64, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !16)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !460, file: !54, line: 140, baseType: !22, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !53, file: !54, line: 377, baseType: !475, size: 320)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !54, line: 184, size: 320, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !486}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !475, file: !54, line: 185, baseType: !52, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !475, file: !54, line: 185, baseType: !27, size: 8, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !54, line: 185, baseType: !27, size: 8, offset: 72)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !475, file: !54, line: 185, baseType: !63, size: 16, offset: 80)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !475, file: !54, line: 185, baseType: !27, size: 8, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !475, file: !54, line: 185, baseType: !483, size: 128, offset: 128)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 128, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 2)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !475, file: !54, line: 185, baseType: !52, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !53, file: !54, line: 378, baseType: !488, size: 384)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !54, line: 187, size: 384, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !488, file: !54, line: 188, baseType: !52, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !488, file: !54, line: 188, baseType: !27, size: 8, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !54, line: 188, baseType: !27, size: 8, offset: 72)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !488, file: !54, line: 188, baseType: !63, size: 16, offset: 80)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !488, file: !54, line: 188, baseType: !27, size: 8, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !488, file: !54, line: 189, baseType: !483, size: 128, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !488, file: !54, line: 189, baseType: !52, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !488, file: !54, line: 189, baseType: !498, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !49, line: 480, size: 576, elements: !500)
!500 = !{!501, !502, !503, !504, !512, !527, !559, !560, !561, !562, !563, !564}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !499, file: !49, line: 481, baseType: !47, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !499, file: !49, line: 482, baseType: !498, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !499, file: !49, line: 483, baseType: !498, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !499, file: !49, line: 484, baseType: !505, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !49, line: 497, size: 256, elements: !507)
!507 = !{!508, !509, !510, !511}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !506, file: !49, line: 498, baseType: !505, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !49, line: 499, baseType: !505, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !506, file: !49, line: 500, baseType: !498, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !506, file: !49, line: 501, baseType: !22, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !499, file: !49, line: 485, baseType: !513, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !49, line: 466, size: 320, elements: !515)
!515 = !{!516, !521, !522, !523, !524, !525, !526}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !514, file: !49, line: 467, baseType: !517, size: 128)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !49, line: 459, size: 128, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !517, file: !49, line: 460, baseType: !27, size: 8)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !517, file: !49, line: 461, baseType: !16, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !514, file: !49, line: 468, baseType: !517, size: 128, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !514, file: !49, line: 469, baseType: !63, size: 16, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !514, file: !49, line: 470, baseType: !27, size: 8, offset: 272)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !514, file: !49, line: 471, baseType: !27, size: 8, offset: 280)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !514, file: !49, line: 472, baseType: !27, size: 8, offset: 288)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !514, file: !49, line: 473, baseType: !27, size: 8, offset: 296)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !499, file: !49, line: 486, baseType: !528, size: 64, offset: 320)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !49, line: 448, size: 192, elements: !530)
!530 = !{!531, !554, !555, !556, !557, !558}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !529, file: !49, line: 449, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !49, line: 438, size: 64, elements: !533)
!533 = !{!534, !535, !548}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !532, file: !49, line: 439, baseType: !47, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !532, file: !49, line: 440, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !49, line: 419, size: 256, elements: !538)
!538 = !{!539, !544, !545, !546, !547}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !537, file: !49, line: 420, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!22, !382, !22, !26}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !537, file: !49, line: 421, baseType: !26, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !537, file: !49, line: 422, baseType: !47, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !537, file: !49, line: 423, baseType: !27, size: 8, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !537, file: !49, line: 424, baseType: !27, size: 8, offset: 200)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !532, file: !49, line: 441, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !49, line: 429, size: 128, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !550, file: !49, line: 430, baseType: !47, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !550, file: !49, line: 431, baseType: !549, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !529, file: !49, line: 450, baseType: !513, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !529, file: !49, line: 451, baseType: !27, size: 8, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !529, file: !49, line: 452, baseType: !27, size: 8, offset: 136)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !529, file: !49, line: 453, baseType: !27, size: 8, offset: 144)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !529, file: !49, line: 454, baseType: !27, size: 8, offset: 152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !499, file: !49, line: 487, baseType: !16, size: 64, offset: 384)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !499, file: !49, line: 488, baseType: !22, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !499, file: !49, line: 489, baseType: !63, size: 16, offset: 480)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !499, file: !49, line: 490, baseType: !63, size: 16, offset: 496)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !499, file: !49, line: 491, baseType: !27, size: 8, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !499, file: !49, line: 492, baseType: !27, size: 8, offset: 520)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !53, file: !54, line: 379, baseType: !566, size: 384)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !54, line: 192, size: 384, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !566, file: !54, line: 193, baseType: !52, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !566, file: !54, line: 193, baseType: !27, size: 8, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !566, file: !54, line: 193, baseType: !27, size: 8, offset: 72)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !566, file: !54, line: 193, baseType: !63, size: 16, offset: 80)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !566, file: !54, line: 193, baseType: !27, size: 8, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !566, file: !54, line: 193, baseType: !483, size: 128, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !566, file: !54, line: 193, baseType: !52, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !566, file: !54, line: 193, baseType: !22, size: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !566, file: !54, line: 194, baseType: !22, size: 32, offset: 352)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !53, file: !54, line: 380, baseType: !578, size: 384)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !54, line: 197, size: 384, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !578, file: !54, line: 198, baseType: !52, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !578, file: !54, line: 198, baseType: !27, size: 8, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !54, line: 198, baseType: !27, size: 8, offset: 72)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !578, file: !54, line: 198, baseType: !63, size: 16, offset: 80)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !54, line: 198, baseType: !27, size: 8, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !578, file: !54, line: 200, baseType: !27, size: 8, offset: 104)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !578, file: !54, line: 201, baseType: !27, size: 8, offset: 112)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !578, file: !54, line: 202, baseType: !483, size: 128, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !578, file: !54, line: 202, baseType: !52, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !578, file: !54, line: 202, baseType: !590, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !16)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !53, file: !54, line: 381, baseType: !592, size: 320)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !54, line: 205, size: 320, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !592, file: !54, line: 206, baseType: !52, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !592, file: !54, line: 206, baseType: !27, size: 8, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !54, line: 206, baseType: !27, size: 8, offset: 72)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !592, file: !54, line: 206, baseType: !63, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !54, line: 206, baseType: !27, size: 8, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !592, file: !54, line: 206, baseType: !483, size: 128, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !592, file: !54, line: 206, baseType: !52, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !53, file: !54, line: 382, baseType: !602, size: 384)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !54, line: 233, size: 384, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !602, file: !54, line: 234, baseType: !52, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 72)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !602, file: !54, line: 234, baseType: !63, size: 16, offset: 80)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 104)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 112)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 120)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !602, file: !54, line: 234, baseType: !47, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !602, file: !54, line: 234, baseType: !22, size: 32, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !602, file: !54, line: 234, baseType: !22, size: 32, offset: 224)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !602, file: !54, line: 234, baseType: !22, size: 32, offset: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 288)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !602, file: !54, line: 234, baseType: !27, size: 8, offset: 296)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !602, file: !54, line: 234, baseType: !52, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !53, file: !54, line: 383, baseType: !620, size: 576)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !54, line: 237, size: 576, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !620, file: !54, line: 238, baseType: !52, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 72)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !620, file: !54, line: 238, baseType: !63, size: 16, offset: 80)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 96)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 104)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 112)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 120)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !620, file: !54, line: 238, baseType: !47, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !620, file: !54, line: 238, baseType: !22, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !620, file: !54, line: 238, baseType: !22, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !620, file: !54, line: 238, baseType: !22, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !620, file: !54, line: 238, baseType: !27, size: 8, offset: 296)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !620, file: !54, line: 238, baseType: !63, size: 16, offset: 304)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !620, file: !54, line: 239, baseType: !52, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !620, file: !54, line: 240, baseType: !99, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !620, file: !54, line: 241, baseType: !63, size: 16, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !620, file: !54, line: 242, baseType: !99, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !53, file: !54, line: 384, baseType: !642, size: 384)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !54, line: 262, size: 384, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !642, file: !54, line: 263, baseType: !52, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 72)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !642, file: !54, line: 263, baseType: !63, size: 16, offset: 80)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 104)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 112)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 120)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !642, file: !54, line: 263, baseType: !47, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !642, file: !54, line: 263, baseType: !22, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !642, file: !54, line: 263, baseType: !22, size: 32, offset: 224)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !642, file: !54, line: 263, baseType: !22, size: 32, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 288)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !642, file: !54, line: 263, baseType: !27, size: 8, offset: 304)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !642, file: !54, line: 264, baseType: !52, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !53, file: !54, line: 385, baseType: !661, size: 448)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !54, line: 245, size: 448, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !661, file: !54, line: 246, baseType: !52, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 72)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !661, file: !54, line: 246, baseType: !63, size: 16, offset: 80)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 104)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 112)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 120)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !661, file: !54, line: 246, baseType: !47, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !661, file: !54, line: 246, baseType: !22, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !661, file: !54, line: 246, baseType: !22, size: 32, offset: 224)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !661, file: !54, line: 246, baseType: !22, size: 32, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !661, file: !54, line: 246, baseType: !27, size: 8, offset: 296)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !661, file: !54, line: 246, baseType: !52, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !661, file: !54, line: 247, baseType: !52, size: 64, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !53, file: !54, line: 386, baseType: !680, size: 448)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !54, line: 250, size: 448, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !680, file: !54, line: 251, baseType: !52, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 72)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !680, file: !54, line: 251, baseType: !63, size: 16, offset: 80)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 104)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 112)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 120)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !680, file: !54, line: 251, baseType: !47, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !680, file: !54, line: 251, baseType: !22, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !680, file: !54, line: 251, baseType: !22, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !680, file: !54, line: 251, baseType: !22, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !680, file: !54, line: 251, baseType: !27, size: 8, offset: 296)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !680, file: !54, line: 256, baseType: !52, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !680, file: !54, line: 257, baseType: !52, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !53, file: !54, line: 387, baseType: !699, size: 512)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !54, line: 273, size: 512, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !699, file: !54, line: 274, baseType: !52, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !699, file: !54, line: 274, baseType: !27, size: 8, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !54, line: 274, baseType: !27, size: 8, offset: 72)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !699, file: !54, line: 274, baseType: !63, size: 16, offset: 80)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !699, file: !54, line: 274, baseType: !27, size: 8, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !699, file: !54, line: 274, baseType: !47, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !699, file: !54, line: 275, baseType: !22, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !699, file: !54, line: 276, baseType: !378, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !699, file: !54, line: 277, baseType: !26, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !54, line: 278, baseType: !483, size: 128, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !53, file: !54, line: 388, baseType: !712, size: 512)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !54, line: 281, size: 512, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !727, !728, !729, !735, !736}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !712, file: !54, line: 282, baseType: !52, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !712, file: !54, line: 282, baseType: !27, size: 8, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !54, line: 282, baseType: !27, size: 8, offset: 72)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !712, file: !54, line: 282, baseType: !63, size: 16, offset: 80)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !712, file: !54, line: 282, baseType: !27, size: 8, offset: 96)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !712, file: !54, line: 282, baseType: !27, size: 8, offset: 104)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !712, file: !54, line: 283, baseType: !27, size: 8, offset: 112)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !712, file: !54, line: 284, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!21, !22, !472, !22, !726, !26, !26}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !712, file: !54, line: 285, baseType: !47, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !712, file: !54, line: 286, baseType: !26, size: 64, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !712, file: !54, line: 287, baseType: !730, size: 64, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!21, !382, !22, !26, !734}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !712, file: !54, line: 288, baseType: !52, size: 64, offset: 384)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !54, line: 289, baseType: !52, size: 64, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !53, file: !54, line: 389, baseType: !738, size: 512)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !54, line: 307, size: 512, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !738, file: !54, line: 308, baseType: !52, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !738, file: !54, line: 308, baseType: !27, size: 8, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !54, line: 308, baseType: !27, size: 8, offset: 72)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !738, file: !54, line: 308, baseType: !63, size: 16, offset: 80)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !738, file: !54, line: 308, baseType: !27, size: 8, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !738, file: !54, line: 308, baseType: !27, size: 8, offset: 104)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !738, file: !54, line: 309, baseType: !27, size: 8, offset: 112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !738, file: !54, line: 310, baseType: !27, size: 8, offset: 120)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !738, file: !54, line: 311, baseType: !26, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !738, file: !54, line: 312, baseType: !47, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !738, file: !54, line: 313, baseType: !114, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !738, file: !54, line: 314, baseType: !99, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !738, file: !54, line: 315, baseType: !99, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !738, file: !54, line: 316, baseType: !22, size: 32, offset: 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !53, file: !54, line: 390, baseType: !755, size: 448)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !54, line: 340, size: 448, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !755, file: !54, line: 341, baseType: !52, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !755, file: !54, line: 341, baseType: !27, size: 8, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !755, file: !54, line: 341, baseType: !27, size: 8, offset: 72)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !755, file: !54, line: 341, baseType: !63, size: 16, offset: 80)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !755, file: !54, line: 341, baseType: !27, size: 8, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !755, file: !54, line: 341, baseType: !47, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !755, file: !54, line: 342, baseType: !47, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !755, file: !54, line: 343, baseType: !26, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !755, file: !54, line: 344, baseType: !99, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !755, file: !54, line: 345, baseType: !22, size: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !53, file: !54, line: 391, baseType: !768, size: 256)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !54, line: 350, size: 256, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !780}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !768, file: !54, line: 351, baseType: !52, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !768, file: !54, line: 351, baseType: !27, size: 8, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !768, file: !54, line: 351, baseType: !27, size: 8, offset: 72)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !768, file: !54, line: 351, baseType: !63, size: 16, offset: 80)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !768, file: !54, line: 351, baseType: !27, size: 8, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !768, file: !54, line: 351, baseType: !776, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !777)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{null, !382, !26}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !768, file: !54, line: 352, baseType: !26, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !53, file: !54, line: 392, baseType: !782, size: 192)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !54, line: 357, size: 192, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !782, file: !54, line: 358, baseType: !52, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !782, file: !54, line: 358, baseType: !27, size: 8, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !54, line: 358, baseType: !27, size: 8, offset: 72)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !782, file: !54, line: 358, baseType: !63, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !54, line: 358, baseType: !27, size: 8, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !54, line: 358, baseType: !52, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !53, file: !54, line: 399, baseType: !48, size: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !48, file: !49, line: 135, baseType: !27, size: 8, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !48, file: !49, line: 136, baseType: !27, size: 8, offset: 72)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !49, line: 137, baseType: !63, size: 16, offset: 80)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !48, file: !49, line: 138, baseType: !795, size: 32, offset: 96)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !796, line: 327, size: 32, elements: !797)
!796 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !795, file: !796, line: 328, baseType: !22, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !795, file: !796, line: 329, baseType: !243, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !48, file: !49, line: 139, baseType: !47, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !48, file: !49, line: 140, baseType: !47, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !48, file: !49, line: 141, baseType: !47, size: 64, offset: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !48, file: !49, line: 142, baseType: !161, size: 16, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!805 = !{}
!806 = !DILocalVariable(name: "prefix_node", arg: 1, scope: !44, file: !3, line: 37, type: !47)
!807 = !DILocation(line: 37, column: 53, scope: !44)
!808 = !DILocalVariable(name: "path", arg: 2, scope: !44, file: !3, line: 38, type: !804)
!809 = !DILocation(line: 38, column: 16, scope: !44)
!810 = !DILocalVariable(name: "expected_return_btypes", arg: 3, scope: !44, file: !3, line: 39, type: !22)
!811 = !DILocation(line: 39, column: 8, scope: !44)
!812 = !DILocalVariable(name: "return_desc", arg: 4, scope: !44, file: !3, line: 40, type: !114)
!813 = !DILocation(line: 40, column: 32, scope: !44)
!814 = !DILocalVariable(name: "info", scope: !44, file: !3, line: 42, type: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_evaluate_info", file: !151, line: 152, size: 704, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "prefix_node", scope: !816, file: !151, line: 155, baseType: !47, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "relative_pathname", scope: !816, file: !151, line: 156, baseType: !804, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parameters", scope: !816, file: !151, line: 157, baseType: !114, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !816, file: !151, line: 159, baseType: !47, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !816, file: !151, line: 160, baseType: !52, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "full_pathname", scope: !816, file: !151, line: 161, baseType: !24, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "predefined", scope: !816, file: !151, line: 163, baseType: !825, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_predefined_info", file: !49, line: 351, size: 56, elements: !828)
!828 = !{!829, !835, !844, !852, !861}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !827, file: !49, line: 352, baseType: !830, size: 56)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_name_info", file: !49, line: 295, size: 56, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !830, file: !49, line: 296, baseType: !243, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "argument_list", scope: !830, file: !49, line: 297, baseType: !63, size: 16, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "expected_btypes", scope: !830, file: !49, line: 298, baseType: !27, size: 8, offset: 48)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ret_info", scope: !827, file: !49, line: 353, baseType: !836, size: 56)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_package_info", file: !49, line: 314, size: 56, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843}
