; ModuleID = '../bcout/drivers/acpi/acpica/utglobal.llvm.bc'
source_filename = "drivers/acpi/acpica/utglobal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%union.acpi_parse_object = type { %struct.acpi_parse_obj_asl }
%struct.acpi_parse_obj_asl = type { %union.acpi_parse_object*, i8, i8, i16, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_parse_value, i8, %union.acpi_parse_object*, %union.acpi_parse_object*, i8*, i8, i8*, i8*, i8*, [4 x i8], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16, i8, i8, i8, [20 x i8] }
%struct.acpi_namespace_node = type { %union.acpi_operand_object*, i8, i8, i16, %union.acpi_name_union, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, %struct.acpi_namespace_node*, i16 }
%union.acpi_operand_object = type { %struct.acpi_object_mutex }
%struct.acpi_object_mutex = type { %union.acpi_operand_object*, i8, i8, i16, i8, i8, i16, i8*, i64, %struct.acpi_thread_state*, %union.acpi_operand_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8 }
%struct.acpi_thread_state = type { i8*, i8, i8, i16, i16, i8, %struct.acpi_walk_state*, %union.acpi_operand_object*, i64 }

!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "acpi_gbl_disable_ssdt_table_install", scope: !2, file: !8, line: 196, type: !9, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "acpi_gbl_runtime_namespace_override", scope: !2, file: !8, line: 201, type: !9, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "acpi_gbl_osi_data", scope: !2, file: !8, line: 207, type: !9, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "acpi_gbl_reduced_hardware", scope: !2, file: !8, line: 214, type: !9, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "acpi_gbl_max_loop_iterations", scope: !2, file: !8, line: 221, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !10, line: 21, baseType: !45)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !12, line: 27, baseType: !46)
!46 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "acpi_gbl_ignore_package_resolution_errors", scope: !2, file: !8, line: 231, type: !9, isLocal: false, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "acpi_gbl_trace_flags", scope: !2, file: !8, line: 237, type: !44, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "acpi_gbl_trace_method_name", scope: !2, file: !8, line: 238, type: !53, isLocal: false, isDefinition: true)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "acpi_gbl_trace_dbg_level", scope: !2, file: !8, line: 239, type: !44, isLocal: false, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "acpi_gbl_trace_dbg_layer", scope: !2, file: !8, line: 240, type: !44, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "acpi_dbg_level", scope: !2, file: !8, line: 247, type: !44, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "acpi_dbg_layer", scope: !2, file: !8, line: 248, type: !44, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "acpi_gbl_display_debug_timer", scope: !2, file: !8, line: 252, type: !9, isLocal: false, isDefinition: true)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "acpi_gbl_dsdt_index", scope: !2, file: !68, line: 27, type: !44, isLocal: false, isDefinition: true)
!68 = !DIFile(filename: "drivers/acpi/acpica/acglobal.h", directory: "/home/lizy2001/genbc/linux")
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "acpi_gbl_facs_index", scope: !2, file: !68, line: 28, type: !44, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "acpi_gbl_xfacs_index", scope: !2, file: !68, line: 29, type: !44, isLocal: false, isDefinition: true)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "acpi_gbl_fadt_index", scope: !2, file: !68, line: 30, type: !44, isLocal: false, isDefinition: true)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "acpi_gbl_startup_flags", scope: !2, file: !68, line: 118, type: !44, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "acpi_gbl_shutdown", scope: !2, file: !68, line: 119, type: !9, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "acpi_gbl_early_initialization", scope: !2, file: !68, line: 120, type: !9, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "acpi_gbl_namespace_initialized", scope: !2, file: !68, line: 140, type: !9, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "acpi_gbl_current_scope", scope: !2, file: !68, line: 212, type: !85, isLocal: false, isDefinition: true)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !87, line: 875, size: 1600, elements: !88)
!87 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!89, !794, !810}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !86, file: !87, line: 876, baseType: !90, size: 448)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !87, line: 828, size: 448, elements: !91)
!91 = !{!92, !93, !94, !95, !99, !101, !102, !784, !793}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !90, file: !87, line: 829, baseType: !85, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !90, file: !87, line: 829, baseType: !9, size: 8, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !87, line: 829, baseType: !9, size: 8, offset: 72)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !90, file: !87, line: 829, baseType: !96, size: 16, offset: 80)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !10, line: 19, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !12, line: 24, baseType: !98)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !90, file: !87, line: 829, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !90, file: !87, line: 829, baseType: !85, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !90, file: !87, line: 829, baseType: !103, size: 64, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !87, line: 133, size: 384, elements: !105)
!105 = !{!106, !768, !769, !770, !771, !780, !781, !782, !783}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !104, file: !87, line: 134, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !109, line: 367, size: 576, elements: !110)
!109 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!110 = !{!111, !119, !135, !146, !159, !173, !183, !419, !436, !451, !464, !542, !554, !568, !578, !596, !618, !637, !656, !675, !688, !714, !731, !744, !758, !767}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !108, file: !109, line: 368, baseType: !112, size: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !109, line: 73, size: 128, elements: !113)
!113 = !{!114, !115, !116, !117, !118}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !112, file: !109, line: 74, baseType: !107, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !112, file: !109, line: 74, baseType: !9, size: 8, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !109, line: 74, baseType: !9, size: 8, offset: 72)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !112, file: !109, line: 74, baseType: !96, size: 16, offset: 80)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !112, file: !109, line: 74, baseType: !9, size: 8, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !108, file: !109, line: 369, baseType: !120, size: 192)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !109, line: 76, size: 192, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !131}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !120, file: !109, line: 77, baseType: !107, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !120, file: !109, line: 77, baseType: !9, size: 8, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !109, line: 77, baseType: !9, size: 8, offset: 72)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !120, file: !109, line: 77, baseType: !96, size: 16, offset: 80)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !120, file: !109, line: 77, baseType: !9, size: 8, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !120, file: !109, line: 77, baseType: !128, size: 24, offset: 104)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 24, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 3)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !120, file: !109, line: 78, baseType: !132, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !10, line: 23, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !12, line: 31, baseType: !134)
!134 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !108, file: !109, line: 370, baseType: !136, size: 256)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !109, line: 93, size: 256, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !136, file: !109, line: 94, baseType: !107, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !136, file: !109, line: 94, baseType: !9, size: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !136, file: !109, line: 94, baseType: !9, size: 8, offset: 72)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !136, file: !109, line: 94, baseType: !96, size: 16, offset: 80)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !109, line: 94, baseType: !9, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !136, file: !109, line: 94, baseType: !144, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !136, file: !109, line: 94, baseType: !44, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !108, file: !109, line: 371, baseType: !147, size: 384)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !109, line: 97, size: 384, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !147, file: !109, line: 98, baseType: !107, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !147, file: !109, line: 98, baseType: !9, size: 8, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !147, file: !109, line: 98, baseType: !9, size: 8, offset: 72)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !147, file: !109, line: 98, baseType: !96, size: 16, offset: 80)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !109, line: 98, baseType: !9, size: 8, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !147, file: !109, line: 98, baseType: !100, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !147, file: !109, line: 98, baseType: !44, size: 32, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !147, file: !109, line: 99, baseType: !44, size: 32, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !147, file: !109, line: 100, baseType: !100, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !147, file: !109, line: 101, baseType: !103, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !108, file: !109, line: 372, baseType: !160, size: 384)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !109, line: 104, size: 384, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !170, !171, !172}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !160, file: !109, line: 105, baseType: !107, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !160, file: !109, line: 105, baseType: !9, size: 8, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !160, file: !109, line: 105, baseType: !9, size: 8, offset: 72)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !160, file: !109, line: 105, baseType: !96, size: 16, offset: 80)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !160, file: !109, line: 105, baseType: !9, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !160, file: !109, line: 105, baseType: !103, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !160, file: !109, line: 106, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !160, file: !109, line: 107, baseType: !100, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !160, file: !109, line: 108, baseType: !44, size: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !160, file: !109, line: 109, baseType: !44, size: 32, offset: 352)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !108, file: !109, line: 373, baseType: !174, size: 192)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !109, line: 118, size: 192, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !174, file: !109, line: 119, baseType: !107, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !174, file: !109, line: 119, baseType: !9, size: 8, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !174, file: !109, line: 119, baseType: !9, size: 8, offset: 72)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !174, file: !109, line: 119, baseType: !96, size: 16, offset: 80)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !174, file: !109, line: 119, baseType: !9, size: 8, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !174, file: !109, line: 119, baseType: !182, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !108, file: !109, line: 374, baseType: !184, size: 448)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !109, line: 143, size: 448, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !416, !417, !418}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !184, file: !109, line: 144, baseType: !107, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !184, file: !109, line: 144, baseType: !9, size: 8, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !109, line: 144, baseType: !9, size: 8, offset: 72)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !184, file: !109, line: 144, baseType: !96, size: 16, offset: 80)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !184, file: !109, line: 144, baseType: !9, size: 8, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !184, file: !109, line: 144, baseType: !9, size: 8, offset: 104)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !184, file: !109, line: 145, baseType: !9, size: 8, offset: 112)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !184, file: !109, line: 146, baseType: !9, size: 8, offset: 120)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !184, file: !109, line: 147, baseType: !107, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !184, file: !109, line: 148, baseType: !107, size: 64, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !184, file: !109, line: 149, baseType: !100, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !184, file: !109, line: 153, baseType: !198, size: 64, offset: 320)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !184, file: !109, line: 150, size: 64, elements: !199)
!199 = !{!200, !415}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !198, file: !109, line: 151, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !87, line: 248, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{!205, !207}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !206, line: 421, baseType: !44)
!206 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !209, line: 37, size: 9024, elements: !210)
!209 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !361, !362, !363, !364, !365, !369, !371, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !398, !399, !400, !401, !402, !403, !404, !405, !407, !413}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !208, file: !209, line: 38, baseType: !207, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !208, file: !209, line: 39, baseType: !9, size: 8, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !208, file: !209, line: 40, baseType: !9, size: 8, offset: 72)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !208, file: !209, line: 41, baseType: !96, size: 16, offset: 80)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !208, file: !209, line: 42, baseType: !9, size: 8, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !208, file: !209, line: 43, baseType: !9, size: 8, offset: 104)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !208, file: !209, line: 44, baseType: !9, size: 8, offset: 112)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !208, file: !209, line: 45, baseType: !219, size: 16, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !206, line: 445, baseType: !96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !208, file: !209, line: 46, baseType: !9, size: 8, offset: 144)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !208, file: !209, line: 47, baseType: !9, size: 8, offset: 152)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !208, file: !209, line: 48, baseType: !9, size: 8, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !208, file: !209, line: 49, baseType: !9, size: 8, offset: 168)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !208, file: !209, line: 50, baseType: !9, size: 8, offset: 176)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !208, file: !209, line: 51, baseType: !9, size: 8, offset: 184)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !208, file: !209, line: 52, baseType: !9, size: 8, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !208, file: !209, line: 53, baseType: !9, size: 8, offset: 200)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !208, file: !209, line: 54, baseType: !100, size: 64, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !208, file: !209, line: 55, baseType: !44, size: 32, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !208, file: !209, line: 56, baseType: !44, size: 32, offset: 352)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !208, file: !209, line: 57, baseType: !44, size: 32, offset: 384)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !208, file: !209, line: 58, baseType: !44, size: 32, offset: 416)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !208, file: !209, line: 60, baseType: !234, size: 640, offset: 448)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !87, line: 893, size: 640, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !359, !360}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !234, file: !87, line: 894, baseType: !100, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !234, file: !87, line: 895, baseType: !100, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !234, file: !87, line: 896, baseType: !100, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !234, file: !87, line: 897, baseType: !100, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !234, file: !87, line: 898, baseType: !100, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !234, file: !87, line: 899, baseType: !85, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !234, file: !87, line: 900, baseType: !103, size: 64, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !234, file: !87, line: 901, baseType: !244, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !87, line: 663, size: 640, elements: !246)
!246 = !{!247, !255, !268, !277, !286, !299, !313, !325, !337}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !245, file: !87, line: 664, baseType: !248, size: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !87, line: 567, size: 128, elements: !249)
!249 = !{!250, !251, !252, !253, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !248, file: !87, line: 568, baseType: !182, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !248, file: !87, line: 568, baseType: !9, size: 8, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !87, line: 568, baseType: !9, size: 8, offset: 72)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !87, line: 568, baseType: !96, size: 16, offset: 80)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !248, file: !87, line: 568, baseType: !96, size: 16, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !245, file: !87, line: 665, baseType: !256, size: 384)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !87, line: 593, size: 384, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !256, file: !87, line: 594, baseType: !182, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !256, file: !87, line: 594, baseType: !9, size: 8, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !87, line: 594, baseType: !9, size: 8, offset: 72)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !256, file: !87, line: 594, baseType: !96, size: 16, offset: 80)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !256, file: !87, line: 594, baseType: !96, size: 16, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !256, file: !87, line: 594, baseType: !96, size: 16, offset: 112)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !256, file: !87, line: 595, baseType: !85, size: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !256, file: !87, line: 596, baseType: !100, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !256, file: !87, line: 597, baseType: !100, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !256, file: !87, line: 598, baseType: !132, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !245, file: !87, line: 666, baseType: !269, size: 192)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !87, line: 573, size: 192, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !87, line: 574, baseType: !182, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !269, file: !87, line: 574, baseType: !9, size: 8, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !269, file: !87, line: 574, baseType: !9, size: 8, offset: 72)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !269, file: !87, line: 574, baseType: !96, size: 16, offset: 80)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !87, line: 574, baseType: !96, size: 16, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !269, file: !87, line: 574, baseType: !107, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !245, file: !87, line: 667, baseType: !278, size: 192)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !87, line: 604, size: 192, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !87, line: 605, baseType: !182, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !278, file: !87, line: 605, baseType: !9, size: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !278, file: !87, line: 605, baseType: !9, size: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !278, file: !87, line: 605, baseType: !96, size: 16, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !278, file: !87, line: 605, baseType: !96, size: 16, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !278, file: !87, line: 605, baseType: !103, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !245, file: !87, line: 668, baseType: !287, size: 448)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !87, line: 608, size: 448, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !87, line: 609, baseType: !182, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !287, file: !87, line: 609, baseType: !9, size: 8, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !87, line: 609, baseType: !9, size: 8, offset: 72)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !87, line: 609, baseType: !96, size: 16, offset: 80)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !87, line: 609, baseType: !96, size: 16, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !287, file: !87, line: 609, baseType: !44, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !287, file: !87, line: 610, baseType: !85, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !287, file: !87, line: 611, baseType: !100, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !287, file: !87, line: 612, baseType: !100, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !287, file: !87, line: 613, baseType: !44, size: 32, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !245, file: !87, line: 669, baseType: !300, size: 512)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !87, line: 580, size: 512, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !300, file: !87, line: 581, baseType: !182, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !300, file: !87, line: 581, baseType: !9, size: 8, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !87, line: 581, baseType: !9, size: 8, offset: 72)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !300, file: !87, line: 581, baseType: !96, size: 16, offset: 80)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !300, file: !87, line: 581, baseType: !96, size: 16, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !300, file: !87, line: 581, baseType: !44, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !300, file: !87, line: 582, baseType: !107, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !300, file: !87, line: 583, baseType: !107, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !300, file: !87, line: 584, baseType: !207, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !300, file: !87, line: 585, baseType: !182, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !300, file: !87, line: 586, baseType: !44, size: 32, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !245, file: !87, line: 670, baseType: !314, size: 320)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !87, line: 620, size: 320, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !87, line: 621, baseType: !182, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !314, file: !87, line: 621, baseType: !9, size: 8, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !314, file: !87, line: 621, baseType: !9, size: 8, offset: 72)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !314, file: !87, line: 621, baseType: !96, size: 16, offset: 80)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !87, line: 621, baseType: !96, size: 16, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !314, file: !87, line: 621, baseType: !9, size: 8, offset: 112)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !314, file: !87, line: 622, baseType: !207, size: 64, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !314, file: !87, line: 623, baseType: !107, size: 64, offset: 192)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !314, file: !87, line: 624, baseType: !132, size: 64, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !245, file: !87, line: 671, baseType: !326, size: 640)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !87, line: 631, size: 640, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !87, line: 632, baseType: !182, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !326, file: !87, line: 632, baseType: !9, size: 8, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !326, file: !87, line: 632, baseType: !9, size: 8, offset: 72)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !326, file: !87, line: 632, baseType: !96, size: 16, offset: 80)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !326, file: !87, line: 632, baseType: !96, size: 16, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !326, file: !87, line: 633, baseType: !334, size: 512, offset: 128)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 512, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 8)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !245, file: !87, line: 672, baseType: !338, size: 320)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !87, line: 654, size: 320, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347, !348}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !87, line: 655, baseType: !182, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !338, file: !87, line: 655, baseType: !9, size: 8, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !338, file: !87, line: 655, baseType: !9, size: 8, offset: 72)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !338, file: !87, line: 655, baseType: !96, size: 16, offset: 80)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !338, file: !87, line: 655, baseType: !96, size: 16, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !338, file: !87, line: 655, baseType: !9, size: 8, offset: 112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !338, file: !87, line: 656, baseType: !103, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !338, file: !87, line: 657, baseType: !107, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !338, file: !87, line: 658, baseType: !349, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !87, line: 645, size: 128, elements: !351)
!351 = !{!352, !358}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !350, file: !87, line: 646, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !206, line: 1052, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357, !44, !182}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !206, line: 424, baseType: !182)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !350, file: !87, line: 647, baseType: !182, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !234, file: !87, line: 902, baseType: !85, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !234, file: !87, line: 903, baseType: !44, size: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !208, file: !209, line: 61, baseType: !44, size: 32, offset: 1088)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !208, file: !209, line: 62, baseType: !44, size: 32, offset: 1120)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !208, file: !209, line: 63, baseType: !96, size: 16, offset: 1152)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !208, file: !209, line: 64, baseType: !9, size: 8, offset: 1168)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !208, file: !209, line: 66, baseType: !366, size: 2688, offset: 1216)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2688, elements: !367)
!367 = !{!368}
!368 = !DISubrange(count: 7)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !208, file: !209, line: 67, baseType: !370, size: 3072, offset: 3904)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 3072, elements: !335)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !208, file: !209, line: 68, baseType: !372, size: 576, offset: 6976)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 576, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 9)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !208, file: !209, line: 69, baseType: !169, size: 64, offset: 7552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !208, file: !209, line: 71, baseType: !100, size: 64, offset: 7616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !208, file: !209, line: 72, baseType: !169, size: 64, offset: 7680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !208, file: !209, line: 73, baseType: !244, size: 64, offset: 7744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !208, file: !209, line: 74, baseType: !103, size: 64, offset: 7808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !208, file: !209, line: 75, baseType: !107, size: 64, offset: 7872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !208, file: !209, line: 76, baseType: !103, size: 64, offset: 7936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !208, file: !209, line: 77, baseType: !85, size: 64, offset: 8000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !208, file: !209, line: 78, baseType: !107, size: 64, offset: 8064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !208, file: !209, line: 79, baseType: !103, size: 64, offset: 8128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !208, file: !209, line: 80, baseType: !144, size: 64, offset: 8192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !208, file: !209, line: 81, baseType: !85, size: 64, offset: 8256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !208, file: !209, line: 82, baseType: !388, size: 64, offset: 8320)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !87, line: 702, size: 128, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !390, file: !87, line: 706, baseType: !44, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !390, file: !87, line: 707, baseType: !44, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !390, file: !87, line: 708, baseType: !96, size: 16, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !390, file: !87, line: 709, baseType: !9, size: 8, offset: 80)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !390, file: !87, line: 710, baseType: !9, size: 8, offset: 88)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !390, file: !87, line: 711, baseType: !9, size: 8, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !208, file: !209, line: 83, baseType: !85, size: 64, offset: 8384)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !208, file: !209, line: 84, baseType: !107, size: 64, offset: 8448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !208, file: !209, line: 85, baseType: !244, size: 64, offset: 8512)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !208, file: !209, line: 86, baseType: !107, size: 64, offset: 8576)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !208, file: !209, line: 87, baseType: !244, size: 64, offset: 8640)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !208, file: !209, line: 88, baseType: !85, size: 64, offset: 8704)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !208, file: !209, line: 89, baseType: !85, size: 64, offset: 8768)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !208, file: !209, line: 90, baseType: !406, size: 64, offset: 8832)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !208, file: !209, line: 91, baseType: !408, size: 64, offset: 8896)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !87, line: 637, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!205, !207, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !208, file: !209, line: 92, baseType: !414, size: 64, offset: 8960)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !87, line: 641, baseType: !202)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !198, file: !109, line: 152, baseType: !107, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !184, file: !109, line: 155, baseType: !44, size: 32, offset: 384)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !184, file: !109, line: 156, baseType: !219, size: 16, offset: 416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !184, file: !109, line: 157, baseType: !9, size: 8, offset: 432)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !108, file: !109, line: 375, baseType: !420, size: 576)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !109, line: 122, size: 576, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !420, file: !109, line: 123, baseType: !107, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !420, file: !109, line: 123, baseType: !9, size: 8, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !109, line: 123, baseType: !9, size: 8, offset: 72)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !420, file: !109, line: 123, baseType: !96, size: 16, offset: 80)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !420, file: !109, line: 123, baseType: !9, size: 8, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !420, file: !109, line: 123, baseType: !9, size: 8, offset: 104)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !420, file: !109, line: 124, baseType: !96, size: 16, offset: 112)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !420, file: !109, line: 125, baseType: !182, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !420, file: !109, line: 126, baseType: !132, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !420, file: !109, line: 127, baseType: !406, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !420, file: !109, line: 128, baseType: !107, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !420, file: !109, line: 129, baseType: !107, size: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !420, file: !109, line: 130, baseType: !103, size: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !420, file: !109, line: 131, baseType: !9, size: 8, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !108, file: !109, line: 376, baseType: !437, size: 448)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !109, line: 134, size: 448, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !450}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !437, file: !109, line: 135, baseType: !107, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !437, file: !109, line: 135, baseType: !9, size: 8, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !437, file: !109, line: 135, baseType: !9, size: 8, offset: 72)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !437, file: !109, line: 135, baseType: !96, size: 16, offset: 80)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !437, file: !109, line: 135, baseType: !9, size: 8, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !437, file: !109, line: 135, baseType: !9, size: 8, offset: 104)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !437, file: !109, line: 136, baseType: !103, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !437, file: !109, line: 137, baseType: !107, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !109, line: 138, baseType: !107, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !437, file: !109, line: 139, baseType: !449, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !206, line: 129, baseType: !132)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !437, file: !109, line: 140, baseType: !44, size: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !108, file: !109, line: 377, baseType: !452, size: 320)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !109, line: 184, size: 320, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !463}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !452, file: !109, line: 185, baseType: !107, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !452, file: !109, line: 185, baseType: !9, size: 8, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !452, file: !109, line: 185, baseType: !9, size: 8, offset: 72)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !452, file: !109, line: 185, baseType: !96, size: 16, offset: 80)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !452, file: !109, line: 185, baseType: !9, size: 8, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !452, file: !109, line: 185, baseType: !460, size: 128, offset: 128)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 128, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 2)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !452, file: !109, line: 185, baseType: !107, size: 64, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !108, file: !109, line: 378, baseType: !465, size: 384)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !109, line: 187, size: 384, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !465, file: !109, line: 188, baseType: !107, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !465, file: !109, line: 188, baseType: !9, size: 8, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !465, file: !109, line: 188, baseType: !9, size: 8, offset: 72)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !465, file: !109, line: 188, baseType: !96, size: 16, offset: 80)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !465, file: !109, line: 188, baseType: !9, size: 8, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !465, file: !109, line: 189, baseType: !460, size: 128, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !465, file: !109, line: 189, baseType: !107, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !465, file: !109, line: 189, baseType: !475, size: 64, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !87, line: 480, size: 576, elements: !477)
!477 = !{!478, !479, !480, !481, !489, !504, !536, !537, !538, !539, !540, !541}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !476, file: !87, line: 481, baseType: !103, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !476, file: !87, line: 482, baseType: !475, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !87, line: 483, baseType: !475, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !476, file: !87, line: 484, baseType: !482, size: 64, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !87, line: 497, size: 256, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !483, file: !87, line: 498, baseType: !482, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !483, file: !87, line: 499, baseType: !482, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !483, file: !87, line: 500, baseType: !475, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !483, file: !87, line: 501, baseType: !44, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !476, file: !87, line: 485, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !87, line: 466, size: 320, elements: !492)
!492 = !{!493, !498, !499, !500, !501, !502, !503}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !491, file: !87, line: 467, baseType: !494, size: 128)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !87, line: 459, size: 128, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !494, file: !87, line: 460, baseType: !9, size: 8)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !494, file: !87, line: 461, baseType: !132, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !491, file: !87, line: 468, baseType: !494, size: 128, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !491, file: !87, line: 469, baseType: !96, size: 16, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !491, file: !87, line: 470, baseType: !9, size: 8, offset: 272)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !491, file: !87, line: 471, baseType: !9, size: 8, offset: 280)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !491, file: !87, line: 472, baseType: !9, size: 8, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !491, file: !87, line: 473, baseType: !9, size: 8, offset: 296)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !476, file: !87, line: 486, baseType: !505, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !87, line: 448, size: 192, elements: !507)
!507 = !{!508, !531, !532, !533, !534, !535}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !506, file: !87, line: 449, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !87, line: 438, size: 64, elements: !510)
!510 = !{!511, !512, !525}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !509, file: !87, line: 439, baseType: !103, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !509, file: !87, line: 440, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !87, line: 419, size: 256, elements: !515)
!515 = !{!516, !521, !522, !523, !524}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !514, file: !87, line: 420, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !206, line: 1049, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DISubroutineType(types: !520)
!520 = !{!44, !357, !44, !182}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !514, file: !87, line: 421, baseType: !182, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !514, file: !87, line: 422, baseType: !103, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !514, file: !87, line: 423, baseType: !9, size: 8, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !514, file: !87, line: 424, baseType: !9, size: 8, offset: 200)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !509, file: !87, line: 441, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !87, line: 429, size: 128, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !527, file: !87, line: 430, baseType: !103, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !527, file: !87, line: 431, baseType: !526, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !506, file: !87, line: 450, baseType: !490, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !506, file: !87, line: 451, baseType: !9, size: 8, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !506, file: !87, line: 452, baseType: !9, size: 8, offset: 136)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !506, file: !87, line: 453, baseType: !9, size: 8, offset: 144)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !506, file: !87, line: 454, baseType: !9, size: 8, offset: 152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !476, file: !87, line: 487, baseType: !132, size: 64, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !476, file: !87, line: 488, baseType: !44, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !476, file: !87, line: 489, baseType: !96, size: 16, offset: 480)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !476, file: !87, line: 490, baseType: !96, size: 16, offset: 496)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !476, file: !87, line: 491, baseType: !9, size: 8, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !476, file: !87, line: 492, baseType: !9, size: 8, offset: 520)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !108, file: !109, line: 379, baseType: !543, size: 384)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !109, line: 192, size: 384, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !543, file: !109, line: 193, baseType: !107, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !543, file: !109, line: 193, baseType: !9, size: 8, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !543, file: !109, line: 193, baseType: !9, size: 8, offset: 72)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !543, file: !109, line: 193, baseType: !96, size: 16, offset: 80)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !543, file: !109, line: 193, baseType: !9, size: 8, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !543, file: !109, line: 193, baseType: !460, size: 128, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !543, file: !109, line: 193, baseType: !107, size: 64, offset: 256)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !543, file: !109, line: 193, baseType: !44, size: 32, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !543, file: !109, line: 194, baseType: !44, size: 32, offset: 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !108, file: !109, line: 380, baseType: !555, size: 384)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !109, line: 197, size: 384, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !555, file: !109, line: 198, baseType: !107, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !555, file: !109, line: 198, baseType: !9, size: 8, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !555, file: !109, line: 198, baseType: !9, size: 8, offset: 72)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !555, file: !109, line: 198, baseType: !96, size: 16, offset: 80)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !555, file: !109, line: 198, baseType: !9, size: 8, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !555, file: !109, line: 200, baseType: !9, size: 8, offset: 104)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !555, file: !109, line: 201, baseType: !9, size: 8, offset: 112)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !555, file: !109, line: 202, baseType: !460, size: 128, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !555, file: !109, line: 202, baseType: !107, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !555, file: !109, line: 202, baseType: !567, size: 64, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !206, line: 128, baseType: !132)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !108, file: !109, line: 381, baseType: !569, size: 320)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !109, line: 205, size: 320, elements: !570)
!570 = !{!571, !572, !573, !574, !575, !576, !577}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !569, file: !109, line: 206, baseType: !107, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !569, file: !109, line: 206, baseType: !9, size: 8, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !569, file: !109, line: 206, baseType: !9, size: 8, offset: 72)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !569, file: !109, line: 206, baseType: !96, size: 16, offset: 80)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !569, file: !109, line: 206, baseType: !9, size: 8, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !569, file: !109, line: 206, baseType: !460, size: 128, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !569, file: !109, line: 206, baseType: !107, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !108, file: !109, line: 382, baseType: !579, size: 384)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !109, line: 233, size: 384, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !579, file: !109, line: 234, baseType: !107, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 72)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !579, file: !109, line: 234, baseType: !96, size: 16, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 104)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 112)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 120)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !579, file: !109, line: 234, baseType: !103, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !579, file: !109, line: 234, baseType: !44, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !579, file: !109, line: 234, baseType: !44, size: 32, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !579, file: !109, line: 234, baseType: !44, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !579, file: !109, line: 234, baseType: !9, size: 8, offset: 296)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !579, file: !109, line: 234, baseType: !107, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !108, file: !109, line: 383, baseType: !597, size: 576)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !109, line: 237, size: 576, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !597, file: !109, line: 238, baseType: !107, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 72)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !597, file: !109, line: 238, baseType: !96, size: 16, offset: 80)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 104)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 112)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 120)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !597, file: !109, line: 238, baseType: !103, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !597, file: !109, line: 238, baseType: !44, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !597, file: !109, line: 238, baseType: !44, size: 32, offset: 224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !597, file: !109, line: 238, baseType: !44, size: 32, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !597, file: !109, line: 238, baseType: !9, size: 8, offset: 296)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !597, file: !109, line: 238, baseType: !96, size: 16, offset: 304)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !597, file: !109, line: 239, baseType: !107, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !597, file: !109, line: 240, baseType: !100, size: 64, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !597, file: !109, line: 241, baseType: !96, size: 16, offset: 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !597, file: !109, line: 242, baseType: !100, size: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !108, file: !109, line: 384, baseType: !619, size: 384)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !109, line: 262, size: 384, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !619, file: !109, line: 263, baseType: !107, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 72)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !619, file: !109, line: 263, baseType: !96, size: 16, offset: 80)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 104)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 120)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !619, file: !109, line: 263, baseType: !103, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !619, file: !109, line: 263, baseType: !44, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !619, file: !109, line: 263, baseType: !44, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !619, file: !109, line: 263, baseType: !44, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 296)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !619, file: !109, line: 263, baseType: !9, size: 8, offset: 304)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !619, file: !109, line: 264, baseType: !107, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !108, file: !109, line: 385, baseType: !638, size: 448)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !109, line: 245, size: 448, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !638, file: !109, line: 246, baseType: !107, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 72)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !638, file: !109, line: 246, baseType: !96, size: 16, offset: 80)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 104)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 112)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 120)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !638, file: !109, line: 246, baseType: !103, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !638, file: !109, line: 246, baseType: !44, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !638, file: !109, line: 246, baseType: !44, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !638, file: !109, line: 246, baseType: !44, size: 32, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 288)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !638, file: !109, line: 246, baseType: !9, size: 8, offset: 296)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !638, file: !109, line: 246, baseType: !107, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !638, file: !109, line: 247, baseType: !107, size: 64, offset: 384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !108, file: !109, line: 386, baseType: !657, size: 448)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !109, line: 250, size: 448, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !657, file: !109, line: 251, baseType: !107, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 72)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !657, file: !109, line: 251, baseType: !96, size: 16, offset: 80)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 104)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 112)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 120)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !657, file: !109, line: 251, baseType: !103, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !657, file: !109, line: 251, baseType: !44, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !657, file: !109, line: 251, baseType: !44, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !657, file: !109, line: 251, baseType: !44, size: 32, offset: 256)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !657, file: !109, line: 251, baseType: !9, size: 8, offset: 296)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !657, file: !109, line: 256, baseType: !107, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !657, file: !109, line: 257, baseType: !107, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !108, file: !109, line: 387, baseType: !676, size: 512)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !109, line: 273, size: 512, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !676, file: !109, line: 274, baseType: !107, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !676, file: !109, line: 274, baseType: !9, size: 8, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !109, line: 274, baseType: !9, size: 8, offset: 72)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !676, file: !109, line: 274, baseType: !96, size: 16, offset: 80)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !109, line: 274, baseType: !9, size: 8, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !676, file: !109, line: 274, baseType: !103, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !676, file: !109, line: 275, baseType: !44, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !676, file: !109, line: 276, baseType: !353, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !676, file: !109, line: 277, baseType: !182, size: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !109, line: 278, baseType: !460, size: 128, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !108, file: !109, line: 388, baseType: !689, size: 512)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !109, line: 281, size: 512, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !704, !705, !706, !712, !713}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !689, file: !109, line: 282, baseType: !107, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !689, file: !109, line: 282, baseType: !9, size: 8, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !109, line: 282, baseType: !9, size: 8, offset: 72)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !689, file: !109, line: 282, baseType: !96, size: 16, offset: 80)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !689, file: !109, line: 282, baseType: !9, size: 8, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !689, file: !109, line: 282, baseType: !9, size: 8, offset: 104)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !689, file: !109, line: 283, baseType: !9, size: 8, offset: 112)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !689, file: !109, line: 284, baseType: !699, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !206, line: 1084, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!205, !44, !449, !44, !703, !182, !182}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !689, file: !109, line: 285, baseType: !103, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !689, file: !109, line: 286, baseType: !182, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !689, file: !109, line: 287, baseType: !707, size: 64, offset: 320)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !206, line: 1102, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!205, !357, !44, !182, !711}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !689, file: !109, line: 288, baseType: !107, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !689, file: !109, line: 289, baseType: !107, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !108, file: !109, line: 389, baseType: !715, size: 512)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !109, line: 307, size: 512, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !715, file: !109, line: 308, baseType: !107, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !715, file: !109, line: 308, baseType: !9, size: 8, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !109, line: 308, baseType: !9, size: 8, offset: 72)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !715, file: !109, line: 308, baseType: !96, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !109, line: 308, baseType: !9, size: 8, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !715, file: !109, line: 308, baseType: !9, size: 8, offset: 104)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !715, file: !109, line: 309, baseType: !9, size: 8, offset: 112)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !715, file: !109, line: 310, baseType: !9, size: 8, offset: 120)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !715, file: !109, line: 311, baseType: !182, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !715, file: !109, line: 312, baseType: !103, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !715, file: !109, line: 313, baseType: !169, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !715, file: !109, line: 314, baseType: !100, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !715, file: !109, line: 315, baseType: !100, size: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !109, line: 316, baseType: !44, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !108, file: !109, line: 390, baseType: !732, size: 448)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !109, line: 340, size: 448, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !732, file: !109, line: 341, baseType: !107, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !732, file: !109, line: 341, baseType: !9, size: 8, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !732, file: !109, line: 341, baseType: !9, size: 8, offset: 72)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !732, file: !109, line: 341, baseType: !96, size: 16, offset: 80)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !732, file: !109, line: 341, baseType: !9, size: 8, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !732, file: !109, line: 341, baseType: !103, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !732, file: !109, line: 342, baseType: !103, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !732, file: !109, line: 343, baseType: !182, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !732, file: !109, line: 344, baseType: !100, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !732, file: !109, line: 345, baseType: !44, size: 32, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !109, line: 391, baseType: !745, size: 256)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !109, line: 350, size: 256, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !757}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !745, file: !109, line: 351, baseType: !107, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !745, file: !109, line: 351, baseType: !9, size: 8, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !745, file: !109, line: 351, baseType: !9, size: 8, offset: 72)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !745, file: !109, line: 351, baseType: !96, size: 16, offset: 80)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !109, line: 351, baseType: !9, size: 8, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !745, file: !109, line: 351, baseType: !753, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !206, line: 1055, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !357, !182}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !745, file: !109, line: 352, baseType: !182, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !108, file: !109, line: 392, baseType: !759, size: 192)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !109, line: 357, size: 192, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !759, file: !109, line: 358, baseType: !107, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !759, file: !109, line: 358, baseType: !9, size: 8, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !109, line: 358, baseType: !9, size: 8, offset: 72)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !759, file: !109, line: 358, baseType: !96, size: 16, offset: 80)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !109, line: 358, baseType: !9, size: 8, offset: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !109, line: 358, baseType: !107, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !108, file: !109, line: 399, baseType: !104, size: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !104, file: !87, line: 135, baseType: !9, size: 8, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !87, line: 136, baseType: !9, size: 8, offset: 72)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !87, line: 137, baseType: !96, size: 16, offset: 80)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !104, file: !87, line: 138, baseType: !772, size: 32, offset: 96)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !773, line: 327, size: 32, elements: !774)
!773 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !772, file: !773, line: 328, baseType: !44, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !772, file: !773, line: 329, baseType: !777, size: 32)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 4)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !104, file: !87, line: 139, baseType: !103, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !104, file: !87, line: 140, baseType: !103, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !104, file: !87, line: 141, baseType: !103, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !104, file: !87, line: 142, baseType: !219, size: 16, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !90, file: !87, line: 829, baseType: !785, size: 64, offset: 320)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !87, line: 716, size: 64, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !785, file: !87, line: 717, baseType: !132, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !785, file: !87, line: 718, baseType: !44, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !785, file: !87, line: 719, baseType: !144, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !785, file: !87, line: 720, baseType: !100, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !87, line: 721, baseType: !144, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !785, file: !87, line: 722, baseType: !85, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !90, file: !87, line: 829, baseType: !9, size: 8, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !86, file: !87, line: 877, baseType: !795, size: 640)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !87, line: 835, size: 640, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !795, file: !87, line: 836, baseType: !85, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !795, file: !87, line: 836, baseType: !9, size: 8, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !87, line: 836, baseType: !9, size: 8, offset: 72)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !795, file: !87, line: 836, baseType: !96, size: 16, offset: 80)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !795, file: !87, line: 836, baseType: !100, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !87, line: 836, baseType: !85, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !795, file: !87, line: 836, baseType: !103, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !795, file: !87, line: 836, baseType: !785, size: 64, offset: 320)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !795, file: !87, line: 836, baseType: !9, size: 8, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !795, file: !87, line: 836, baseType: !144, size: 64, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !795, file: !87, line: 837, baseType: !100, size: 64, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !795, file: !87, line: 838, baseType: !44, size: 32, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !87, line: 839, baseType: !44, size: 32, offset: 608)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !86, file: !87, line: 878, baseType: !811, size: 1600)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !87, line: 846, size: 1600, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !811, file: !87, line: 847, baseType: !85, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !811, file: !87, line: 847, baseType: !9, size: 8, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !811, file: !87, line: 847, baseType: !9, size: 8, offset: 72)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !811, file: !87, line: 847, baseType: !96, size: 16, offset: 80)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !811, file: !87, line: 847, baseType: !100, size: 64, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !811, file: !87, line: 847, baseType: !85, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !811, file: !87, line: 847, baseType: !103, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !811, file: !87, line: 847, baseType: !785, size: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !811, file: !87, line: 847, baseType: !9, size: 8, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !811, file: !87, line: 847, baseType: !85, size: 64, offset: 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !811, file: !87, line: 848, baseType: !85, size: 64, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !811, file: !87, line: 849, baseType: !144, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !811, file: !87, line: 850, baseType: !9, size: 8, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !811, file: !87, line: 851, baseType: !144, size: 64, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !811, file: !87, line: 852, baseType: !144, size: 64, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !811, file: !87, line: 853, baseType: !144, size: 64, offset: 832)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !811, file: !87, line: 854, baseType: !777, size: 32, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !811, file: !87, line: 855, baseType: !44, size: 32, offset: 928)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !811, file: !87, line: 856, baseType: !44, size: 32, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !811, file: !87, line: 857, baseType: !44, size: 32, offset: 992)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !811, file: !87, line: 858, baseType: !44, size: 32, offset: 1024)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !811, file: !87, line: 859, baseType: !44, size: 32, offset: 1056)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !811, file: !87, line: 860, baseType: !44, size: 32, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !811, file: !87, line: 861, baseType: !44, size: 32, offset: 1120)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !811, file: !87, line: 862, baseType: !44, size: 32, offset: 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !811, file: !87, line: 863, baseType: !44, size: 32, offset: 1184)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !811, file: !87, line: 864, baseType: !44, size: 32, offset: 1216)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !811, file: !87, line: 865, baseType: !44, size: 32, offset: 1248)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !811, file: !87, line: 866, baseType: !44, size: 32, offset: 1280)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !811, file: !87, line: 867, baseType: !44, size: 32, offset: 1312)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !811, file: !87, line: 868, baseType: !96, size: 16, offset: 1344)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !811, file: !87, line: 869, baseType: !9, size: 8, offset: 1360)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !811, file: !87, line: 870, baseType: !9, size: 8, offset: 1368)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !811, file: !87, line: 871, baseType: !9, size: 8, offset: 1376)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !811, file: !87, line: 872, baseType: !848, size: 160, offset: 1384)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 160, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 20)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "acpi_gbl_capture_comments", scope: !2, file: !68, line: 216, type: !9, isLocal: false, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "acpi_gbl_last_list_head", scope: !2, file: !68, line: 217, type: !855, isLocal: false, isDefinition: true)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_comment_node", file: !87, line: 800, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "comment", scope: !856, file: !87, line: 801, baseType: !144, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !87, line: 802, baseType: !855, size: 64, offset: 64)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
