; ModuleID = '../bcout/drivers/acpi/acpica/utobject.llvm.bc'
source_filename = "drivers/acpi/acpica/utobject.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 16, type: !812, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !811, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/utobject.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !19, !24, !26, !34, !800, !802, !157, !803, !90}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !15, line: 17, baseType: !16)
!15 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !18)
!17 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !20, line: 127, baseType: !21)
!20 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !15, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !15, line: 21, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !7)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_descriptor", file: !28, line: 432, size: 1600, elements: !29)
!28 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!29 = !{!30, !36, !798, !799}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !27, file: !28, line: 433, baseType: !31, size: 128)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_descriptor", file: !28, line: 427, size: 128, elements: !32)
!32 = !{!33, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "common_pointer", scope: !31, file: !28, line: 428, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !31, file: !28, line: 429, baseType: !14, size: 8, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !27, file: !28, line: 434, baseType: !37, size: 576)
!37 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !28, line: 367, size: 576, elements: !38)
!38 = !{!39, !51, !64, !76, !112, !126, !135, !449, !466, !481, !494, !572, !584, !598, !608, !626, !648, !667, !686, !705, !718, !744, !761, !774, !788, !797}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !37, file: !28, line: 368, baseType: !40, size: 128)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !28, line: 73, size: 128, elements: !41)
!41 = !{!42, !44, !45, !46, !50}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !40, file: !28, line: 74, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !40, file: !28, line: 74, baseType: !14, size: 8, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !28, line: 74, baseType: !14, size: 8, offset: 72)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !40, file: !28, line: 74, baseType: !47, size: 16, offset: 80)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !15, line: 19, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !49)
!49 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !40, file: !28, line: 74, baseType: !14, size: 8, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !37, file: !28, line: 369, baseType: !52, size: 192)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !28, line: 76, size: 192, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !63}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !52, file: !28, line: 77, baseType: !43, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !52, file: !28, line: 77, baseType: !14, size: 8, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !28, line: 77, baseType: !14, size: 8, offset: 72)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !52, file: !28, line: 77, baseType: !47, size: 16, offset: 80)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !28, line: 77, baseType: !14, size: 8, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !52, file: !28, line: 77, baseType: !60, size: 24, offset: 104)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 24, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 3)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !52, file: !28, line: 78, baseType: !21, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !37, file: !28, line: 370, baseType: !65, size: 256)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !28, line: 93, size: 256, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !75}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !65, file: !28, line: 94, baseType: !43, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !65, file: !28, line: 94, baseType: !14, size: 8, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !28, line: 94, baseType: !14, size: 8, offset: 72)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !65, file: !28, line: 94, baseType: !47, size: 16, offset: 80)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !28, line: 94, baseType: !14, size: 8, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !65, file: !28, line: 94, baseType: !73, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !65, file: !28, line: 94, baseType: !24, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !37, file: !28, line: 371, baseType: !77, size: 384)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !28, line: 97, size: 384, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !86, !87, !88, !89}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !77, file: !28, line: 98, baseType: !43, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !77, file: !28, line: 98, baseType: !14, size: 8, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !77, file: !28, line: 98, baseType: !14, size: 8, offset: 72)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !77, file: !28, line: 98, baseType: !47, size: 16, offset: 80)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !77, file: !28, line: 98, baseType: !14, size: 8, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !77, file: !28, line: 98, baseType: !85, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !77, file: !28, line: 98, baseType: !24, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !77, file: !28, line: 99, baseType: !24, size: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !77, file: !28, line: 100, baseType: !85, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !77, file: !28, line: 101, baseType: !90, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !92, line: 133, size: 384, elements: !93)
!92 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!93 = !{!94, !95, !96, !97, !98, !107, !108, !109, !110}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !91, file: !92, line: 134, baseType: !43, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !91, file: !92, line: 135, baseType: !14, size: 8, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !92, line: 136, baseType: !14, size: 8, offset: 72)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !92, line: 137, baseType: !47, size: 16, offset: 80)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !92, line: 138, baseType: !99, size: 32, offset: 96)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !100, line: 327, size: 32, elements: !101)
!100 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !99, file: !100, line: 328, baseType: !24, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !99, file: !100, line: 329, baseType: !104, size: 32)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 4)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !91, file: !92, line: 139, baseType: !90, size: 64, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !91, file: !92, line: 140, baseType: !90, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !91, file: !92, line: 141, baseType: !90, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !91, file: !92, line: 142, baseType: !111, size: 16, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !20, line: 445, baseType: !47)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !37, file: !28, line: 372, baseType: !113, size: 384)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !28, line: 104, size: 384, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !123, !124, !125}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !113, file: !28, line: 105, baseType: !43, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !113, file: !28, line: 105, baseType: !14, size: 8, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !28, line: 105, baseType: !14, size: 8, offset: 72)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !113, file: !28, line: 105, baseType: !47, size: 16, offset: 80)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !113, file: !28, line: 105, baseType: !14, size: 8, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !113, file: !28, line: 105, baseType: !90, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !113, file: !28, line: 106, baseType: !122, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !113, file: !28, line: 107, baseType: !85, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !113, file: !28, line: 108, baseType: !24, size: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !113, file: !28, line: 109, baseType: !24, size: 32, offset: 352)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !37, file: !28, line: 373, baseType: !127, size: 192)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !28, line: 118, size: 192, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !127, file: !28, line: 119, baseType: !43, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !127, file: !28, line: 119, baseType: !14, size: 8, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !28, line: 119, baseType: !14, size: 8, offset: 72)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !127, file: !28, line: 119, baseType: !47, size: 16, offset: 80)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !127, file: !28, line: 119, baseType: !14, size: 8, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !127, file: !28, line: 119, baseType: !34, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !37, file: !28, line: 374, baseType: !136, size: 448)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !28, line: 143, size: 448, elements: !137)
!137 = !{!138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !446, !447, !448}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !136, file: !28, line: 144, baseType: !43, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !136, file: !28, line: 144, baseType: !14, size: 8, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !136, file: !28, line: 144, baseType: !14, size: 8, offset: 72)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !136, file: !28, line: 144, baseType: !47, size: 16, offset: 80)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !136, file: !28, line: 144, baseType: !14, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !136, file: !28, line: 144, baseType: !14, size: 8, offset: 104)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !136, file: !28, line: 145, baseType: !14, size: 8, offset: 112)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !136, file: !28, line: 146, baseType: !14, size: 8, offset: 120)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !136, file: !28, line: 147, baseType: !43, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !136, file: !28, line: 148, baseType: !43, size: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !136, file: !28, line: 149, baseType: !85, size: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !136, file: !28, line: 153, baseType: !150, size: 64, offset: 320)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !28, line: 150, size: 64, elements: !151)
!151 = !{!152, !445}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !150, file: !28, line: 151, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !92, line: 248, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !20, line: 421, baseType: !24)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !160, line: 37, size: 9024, elements: !161)
!160 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !391, !392, !393, !394, !395, !399, !401, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !428, !429, !430, !431, !432, !433, !434, !435, !437, !443}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !160, line: 38, baseType: !158, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !159, file: !160, line: 39, baseType: !14, size: 8, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !159, file: !160, line: 40, baseType: !14, size: 8, offset: 72)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !159, file: !160, line: 41, baseType: !47, size: 16, offset: 80)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !159, file: !160, line: 42, baseType: !14, size: 8, offset: 96)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !159, file: !160, line: 43, baseType: !14, size: 8, offset: 104)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !159, file: !160, line: 44, baseType: !14, size: 8, offset: 112)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !159, file: !160, line: 45, baseType: !111, size: 16, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !159, file: !160, line: 46, baseType: !14, size: 8, offset: 144)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !159, file: !160, line: 47, baseType: !14, size: 8, offset: 152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !159, file: !160, line: 48, baseType: !14, size: 8, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !159, file: !160, line: 49, baseType: !14, size: 8, offset: 168)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !159, file: !160, line: 50, baseType: !14, size: 8, offset: 176)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !159, file: !160, line: 51, baseType: !14, size: 8, offset: 184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !159, file: !160, line: 52, baseType: !14, size: 8, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !159, file: !160, line: 53, baseType: !14, size: 8, offset: 200)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !159, file: !160, line: 54, baseType: !85, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !159, file: !160, line: 55, baseType: !24, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !159, file: !160, line: 56, baseType: !24, size: 32, offset: 352)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !159, file: !160, line: 57, baseType: !24, size: 32, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !159, file: !160, line: 58, baseType: !24, size: 32, offset: 416)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !159, file: !160, line: 60, baseType: !184, size: 640, offset: 448)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !92, line: 893, size: 640, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191, !272, !273, !389, !390}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !184, file: !92, line: 894, baseType: !85, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !184, file: !92, line: 895, baseType: !85, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !184, file: !92, line: 896, baseType: !85, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !184, file: !92, line: 897, baseType: !85, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !184, file: !92, line: 898, baseType: !85, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !184, file: !92, line: 899, baseType: !192, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !92, line: 875, size: 1600, elements: !194)
!194 = !{!195, !215, !231}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !193, file: !92, line: 876, baseType: !196, size: 448)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !92, line: 828, size: 448, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !214}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !196, file: !92, line: 829, baseType: !192, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !196, file: !92, line: 829, baseType: !14, size: 8, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !196, file: !92, line: 829, baseType: !14, size: 8, offset: 72)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !196, file: !92, line: 829, baseType: !47, size: 16, offset: 80)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !196, file: !92, line: 829, baseType: !85, size: 64, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !196, file: !92, line: 829, baseType: !192, size: 64, offset: 192)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !196, file: !92, line: 829, baseType: !90, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !196, file: !92, line: 829, baseType: !206, size: 64, offset: 320)
!206 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !92, line: 716, size: 64, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !206, file: !92, line: 717, baseType: !21, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !92, line: 718, baseType: !24, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !206, file: !92, line: 719, baseType: !73, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !206, file: !92, line: 720, baseType: !85, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !206, file: !92, line: 721, baseType: !73, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !206, file: !92, line: 722, baseType: !192, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !196, file: !92, line: 829, baseType: !14, size: 8, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !193, file: !92, line: 877, baseType: !216, size: 640)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !92, line: 835, size: 640, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !216, file: !92, line: 836, baseType: !192, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !216, file: !92, line: 836, baseType: !14, size: 8, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !216, file: !92, line: 836, baseType: !14, size: 8, offset: 72)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !216, file: !92, line: 836, baseType: !47, size: 16, offset: 80)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !216, file: !92, line: 836, baseType: !85, size: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !92, line: 836, baseType: !192, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !216, file: !92, line: 836, baseType: !90, size: 64, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !216, file: !92, line: 836, baseType: !206, size: 64, offset: 320)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !216, file: !92, line: 836, baseType: !14, size: 8, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !216, file: !92, line: 836, baseType: !73, size: 64, offset: 448)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !92, line: 837, baseType: !85, size: 64, offset: 512)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !216, file: !92, line: 838, baseType: !24, size: 32, offset: 576)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !92, line: 839, baseType: !24, size: 32, offset: 608)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !193, file: !92, line: 878, baseType: !232, size: 1600)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !92, line: 846, size: 1600, elements: !233)
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !232, file: !92, line: 847, baseType: !192, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !232, file: !92, line: 847, baseType: !14, size: 8, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !92, line: 847, baseType: !14, size: 8, offset: 72)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !232, file: !92, line: 847, baseType: !47, size: 16, offset: 80)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !232, file: !92, line: 847, baseType: !85, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !92, line: 847, baseType: !192, size: 64, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !232, file: !92, line: 847, baseType: !90, size: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !232, file: !92, line: 847, baseType: !206, size: 64, offset: 320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !232, file: !92, line: 847, baseType: !14, size: 8, offset: 384)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !232, file: !92, line: 847, baseType: !192, size: 64, offset: 448)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !232, file: !92, line: 848, baseType: !192, size: 64, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !232, file: !92, line: 849, baseType: !73, size: 64, offset: 576)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !232, file: !92, line: 850, baseType: !14, size: 8, offset: 640)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !232, file: !92, line: 851, baseType: !73, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !232, file: !92, line: 852, baseType: !73, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !232, file: !92, line: 853, baseType: !73, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !232, file: !92, line: 854, baseType: !104, size: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !232, file: !92, line: 855, baseType: !24, size: 32, offset: 928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !232, file: !92, line: 856, baseType: !24, size: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !232, file: !92, line: 857, baseType: !24, size: 32, offset: 992)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !232, file: !92, line: 858, baseType: !24, size: 32, offset: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !232, file: !92, line: 859, baseType: !24, size: 32, offset: 1056)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !232, file: !92, line: 860, baseType: !24, size: 32, offset: 1088)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !232, file: !92, line: 861, baseType: !24, size: 32, offset: 1120)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !232, file: !92, line: 862, baseType: !24, size: 32, offset: 1152)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !232, file: !92, line: 863, baseType: !24, size: 32, offset: 1184)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !232, file: !92, line: 864, baseType: !24, size: 32, offset: 1216)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !232, file: !92, line: 865, baseType: !24, size: 32, offset: 1248)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !232, file: !92, line: 866, baseType: !24, size: 32, offset: 1280)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !232, file: !92, line: 867, baseType: !24, size: 32, offset: 1312)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !232, file: !92, line: 868, baseType: !47, size: 16, offset: 1344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !232, file: !92, line: 869, baseType: !14, size: 8, offset: 1360)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !232, file: !92, line: 870, baseType: !14, size: 8, offset: 1368)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !232, file: !92, line: 871, baseType: !14, size: 8, offset: 1376)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "parse_op_name", scope: !232, file: !92, line: 872, baseType: !269, size: 160, offset: 1384)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 160, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 20)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "start_node", scope: !184, file: !92, line: 900, baseType: !90, size: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !184, file: !92, line: 901, baseType: !274, size: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_generic_state", file: !92, line: 663, size: 640, elements: !276)
!276 = !{!277, !285, !298, !307, !316, !329, !343, !355, !367}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !275, file: !92, line: 664, baseType: !278, size: 128)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_common_state", file: !92, line: 567, size: 128, elements: !279)
!279 = !{!280, !281, !282, !283, !284}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !92, line: 568, baseType: !34, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !278, file: !92, line: 568, baseType: !14, size: 8, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !278, file: !92, line: 568, baseType: !14, size: 8, offset: 72)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !278, file: !92, line: 568, baseType: !47, size: 16, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !278, file: !92, line: 568, baseType: !47, size: 16, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !275, file: !92, line: 665, baseType: !286, size: 384)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_control_state", file: !92, line: 593, size: 384, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !286, file: !92, line: 594, baseType: !34, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !286, file: !92, line: 594, baseType: !14, size: 8, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !92, line: 594, baseType: !14, size: 8, offset: 72)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !286, file: !92, line: 594, baseType: !47, size: 16, offset: 80)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !286, file: !92, line: 594, baseType: !47, size: 16, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !286, file: !92, line: 594, baseType: !47, size: 16, offset: 112)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "predicate_op", scope: !286, file: !92, line: 595, baseType: !192, size: 64, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "aml_predicate_start", scope: !286, file: !92, line: 596, baseType: !85, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "package_end", scope: !286, file: !92, line: 597, baseType: !85, size: 64, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "loop_timeout", scope: !286, file: !92, line: 598, baseType: !21, size: 64, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !275, file: !92, line: 666, baseType: !299, size: 192)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_update_state", file: !92, line: 573, size: 192, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !92, line: 574, baseType: !34, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !299, file: !92, line: 574, baseType: !14, size: 8, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !299, file: !92, line: 574, baseType: !14, size: 8, offset: 72)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !299, file: !92, line: 574, baseType: !47, size: 16, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !92, line: 574, baseType: !47, size: 16, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !299, file: !92, line: 574, baseType: !43, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !275, file: !92, line: 667, baseType: !308, size: 192)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_scope_state", file: !92, line: 604, size: 192, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !308, file: !92, line: 605, baseType: !34, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !308, file: !92, line: 605, baseType: !14, size: 8, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !308, file: !92, line: 605, baseType: !14, size: 8, offset: 72)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !308, file: !92, line: 605, baseType: !47, size: 16, offset: 80)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !92, line: 605, baseType: !47, size: 16, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !308, file: !92, line: 605, baseType: !90, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "parse_scope", scope: !275, file: !92, line: 668, baseType: !317, size: 448)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pscope_state", file: !92, line: 608, size: 448, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !92, line: 609, baseType: !34, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !317, file: !92, line: 609, baseType: !14, size: 8, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !92, line: 609, baseType: !14, size: 8, offset: 72)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !317, file: !92, line: 609, baseType: !47, size: 16, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !317, file: !92, line: 609, baseType: !47, size: 16, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !317, file: !92, line: 609, baseType: !24, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !317, file: !92, line: 610, baseType: !192, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !317, file: !92, line: 611, baseType: !85, size: 64, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !317, file: !92, line: 612, baseType: !85, size: 64, offset: 320)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list", scope: !317, file: !92, line: 613, baseType: !24, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !275, file: !92, line: 669, baseType: !330, size: 512)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_state", file: !92, line: 580, size: 512, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !330, file: !92, line: 581, baseType: !34, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !330, file: !92, line: 581, baseType: !14, size: 8, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !330, file: !92, line: 581, baseType: !14, size: 8, offset: 72)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !330, file: !92, line: 581, baseType: !47, size: 16, offset: 80)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !330, file: !92, line: 581, baseType: !47, size: 16, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !330, file: !92, line: 581, baseType: !24, size: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "source_object", scope: !330, file: !92, line: 582, baseType: !43, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "dest_object", scope: !330, file: !92, line: 583, baseType: !43, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state", scope: !330, file: !92, line: 584, baseType: !158, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "this_target_obj", scope: !330, file: !92, line: 585, baseType: !34, size: 64, offset: 384)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !330, file: !92, line: 586, baseType: !24, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !275, file: !92, line: 670, baseType: !344, size: 320)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !92, line: 620, size: 320, elements: !345)
!345 = !{!346, !347, !348, !349, !350, !351, !352, !353, !354}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !92, line: 621, baseType: !34, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !344, file: !92, line: 621, baseType: !14, size: 8, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !344, file: !92, line: 621, baseType: !14, size: 8, offset: 72)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !344, file: !92, line: 621, baseType: !47, size: 16, offset: 80)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !92, line: 621, baseType: !47, size: 16, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !344, file: !92, line: 621, baseType: !14, size: 8, offset: 112)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !344, file: !92, line: 622, baseType: !158, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !344, file: !92, line: 623, baseType: !43, size: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !344, file: !92, line: 624, baseType: !21, size: 64, offset: 256)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !275, file: !92, line: 671, baseType: !356, size: 640)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_result_values", file: !92, line: 631, size: 640, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !92, line: 632, baseType: !34, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !356, file: !92, line: 632, baseType: !14, size: 8, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !356, file: !92, line: 632, baseType: !14, size: 8, offset: 72)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !356, file: !92, line: 632, baseType: !47, size: 16, offset: 80)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !356, file: !92, line: 632, baseType: !47, size: 16, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "obj_desc", scope: !356, file: !92, line: 633, baseType: !364, size: 512, offset: 128)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 512, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !275, file: !92, line: 672, baseType: !368, size: 320)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_notify_info", file: !92, line: 654, size: 320, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !92, line: 655, baseType: !34, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !368, file: !92, line: 655, baseType: !14, size: 8, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !368, file: !92, line: 655, baseType: !14, size: 8, offset: 72)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !368, file: !92, line: 655, baseType: !47, size: 16, offset: 80)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !368, file: !92, line: 655, baseType: !47, size: 16, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_id", scope: !368, file: !92, line: 655, baseType: !14, size: 8, offset: 112)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !368, file: !92, line: 656, baseType: !90, size: 64, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "handler_list_head", scope: !368, file: !92, line: 657, baseType: !43, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "global", scope: !368, file: !92, line: 658, baseType: !379, size: 64, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_global_notify_handler", file: !92, line: 645, size: 128, elements: !381)
!381 = !{!382, !388}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !380, file: !92, line: 646, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !20, line: 1052, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387, !24, !34}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !20, line: 424, baseType: !34)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !380, file: !92, line: 647, baseType: !34, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "start_scope", scope: !184, file: !92, line: 902, baseType: !192, size: 64, offset: 512)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "aml_size", scope: !184, file: !92, line: 903, baseType: !24, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "prev_arg_types", scope: !159, file: !160, line: 61, baseType: !24, size: 32, offset: 1088)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !159, file: !160, line: 62, baseType: !24, size: 32, offset: 1120)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "method_nesting_depth", scope: !159, file: !160, line: 63, baseType: !47, size: 16, offset: 1152)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "method_is_nested", scope: !159, file: !160, line: 64, baseType: !14, size: 8, offset: 1168)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !159, file: !160, line: 66, baseType: !396, size: 2688, offset: 1216)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2688, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 7)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "local_variables", scope: !159, file: !160, line: 67, baseType: !400, size: 3072, offset: 3904)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 3072, elements: !365)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !159, file: !160, line: 68, baseType: !402, size: 576, offset: 6976)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 576, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 9)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "params", scope: !159, file: !160, line: 69, baseType: !122, size: 64, offset: 7552)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "aml_last_while", scope: !159, file: !160, line: 71, baseType: !85, size: 64, offset: 7616)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "caller_return_desc", scope: !159, file: !160, line: 72, baseType: !122, size: 64, offset: 7680)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "control_state", scope: !159, file: !160, line: 73, baseType: !274, size: 64, offset: 7744)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "deferred_node", scope: !159, file: !160, line: 74, baseType: !90, size: 64, offset: 7808)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_return_obj", scope: !159, file: !160, line: 75, baseType: !43, size: 64, offset: 7872)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_node", scope: !159, file: !160, line: 76, baseType: !90, size: 64, offset: 7936)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "method_call_op", scope: !159, file: !160, line: 77, baseType: !192, size: 64, offset: 8000)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "method_desc", scope: !159, file: !160, line: 78, baseType: !43, size: 64, offset: 8064)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !159, file: !160, line: 79, baseType: !90, size: 64, offset: 8128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "method_pathname", scope: !159, file: !160, line: 80, baseType: !73, size: 64, offset: 8192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !159, file: !160, line: 81, baseType: !192, size: 64, offset: 8256)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "op_info", scope: !159, file: !160, line: 82, baseType: !418, size: 64, offset: 8320)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_opcode_info", file: !92, line: 702, size: 128, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parse_args", scope: !420, file: !92, line: 706, baseType: !24, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_args", scope: !420, file: !92, line: 707, baseType: !24, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !420, file: !92, line: 708, baseType: !47, size: 16, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !420, file: !92, line: 709, baseType: !14, size: 8, offset: 80)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !420, file: !92, line: 710, baseType: !14, size: 8, offset: 88)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !92, line: 711, baseType: !14, size: 8, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !159, file: !160, line: 83, baseType: !192, size: 64, offset: 8384)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "result_obj", scope: !159, file: !160, line: 84, baseType: !43, size: 64, offset: 8448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "results", scope: !159, file: !160, line: 85, baseType: !274, size: 64, offset: 8512)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "return_desc", scope: !159, file: !160, line: 86, baseType: !43, size: 64, offset: 8576)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "scope_info", scope: !159, file: !160, line: 87, baseType: !274, size: 64, offset: 8640)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev_op", scope: !159, file: !160, line: 88, baseType: !192, size: 64, offset: 8704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next_op", scope: !159, file: !160, line: 89, baseType: !192, size: 64, offset: 8768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !159, file: !160, line: 90, baseType: !436, size: 64, offset: 8832)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "descending_callback", scope: !159, file: !160, line: 91, baseType: !438, size: 64, offset: 8896)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_downwards", file: !92, line: 637, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{!157, !158, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ascending_callback", scope: !159, file: !160, line: 92, baseType: !444, size: 64, offset: 8960)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_parse_upwards", file: !92, line: 641, baseType: !154)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !150, file: !28, line: 152, baseType: !43, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !136, file: !28, line: 155, baseType: !24, size: 32, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !136, file: !28, line: 156, baseType: !111, size: 16, offset: 416)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !136, file: !28, line: 157, baseType: !14, size: 8, offset: 432)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !37, file: !28, line: 375, baseType: !450, size: 576)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !28, line: 122, size: 576, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !450, file: !28, line: 123, baseType: !43, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !450, file: !28, line: 123, baseType: !14, size: 8, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !28, line: 123, baseType: !14, size: 8, offset: 72)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !450, file: !28, line: 123, baseType: !47, size: 16, offset: 80)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !28, line: 123, baseType: !14, size: 8, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !450, file: !28, line: 123, baseType: !14, size: 8, offset: 104)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !450, file: !28, line: 124, baseType: !47, size: 16, offset: 112)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !450, file: !28, line: 125, baseType: !34, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !450, file: !28, line: 126, baseType: !21, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !450, file: !28, line: 127, baseType: !436, size: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !28, line: 128, baseType: !43, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !28, line: 129, baseType: !43, size: 64, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !450, file: !28, line: 130, baseType: !90, size: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !450, file: !28, line: 131, baseType: !14, size: 8, offset: 512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !37, file: !28, line: 376, baseType: !467, size: 448)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !28, line: 134, size: 448, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !480}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !467, file: !28, line: 135, baseType: !43, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !467, file: !28, line: 135, baseType: !14, size: 8, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !467, file: !28, line: 135, baseType: !14, size: 8, offset: 72)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !467, file: !28, line: 135, baseType: !47, size: 16, offset: 80)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !28, line: 135, baseType: !14, size: 8, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !467, file: !28, line: 135, baseType: !14, size: 8, offset: 104)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !467, file: !28, line: 136, baseType: !90, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !467, file: !28, line: 137, baseType: !43, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !467, file: !28, line: 138, baseType: !43, size: 64, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !467, file: !28, line: 139, baseType: !479, size: 64, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !20, line: 129, baseType: !21)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !467, file: !28, line: 140, baseType: !24, size: 32, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !37, file: !28, line: 377, baseType: !482, size: 320)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !28, line: 184, size: 320, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !493}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !482, file: !28, line: 185, baseType: !43, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !482, file: !28, line: 185, baseType: !14, size: 8, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !28, line: 185, baseType: !14, size: 8, offset: 72)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !482, file: !28, line: 185, baseType: !47, size: 16, offset: 80)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !482, file: !28, line: 185, baseType: !14, size: 8, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !482, file: !28, line: 185, baseType: !490, size: 128, offset: 128)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 128, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 2)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !482, file: !28, line: 185, baseType: !43, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !37, file: !28, line: 378, baseType: !495, size: 384)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !28, line: 187, size: 384, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !495, file: !28, line: 188, baseType: !43, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !495, file: !28, line: 188, baseType: !14, size: 8, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !28, line: 188, baseType: !14, size: 8, offset: 72)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !495, file: !28, line: 188, baseType: !47, size: 16, offset: 80)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !495, file: !28, line: 188, baseType: !14, size: 8, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !495, file: !28, line: 189, baseType: !490, size: 128, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !495, file: !28, line: 189, baseType: !43, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !495, file: !28, line: 189, baseType: !505, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !92, line: 480, size: 576, elements: !507)
!507 = !{!508, !509, !510, !511, !519, !534, !566, !567, !568, !569, !570, !571}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !506, file: !92, line: 481, baseType: !90, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !506, file: !92, line: 482, baseType: !505, size: 64, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !506, file: !92, line: 483, baseType: !505, size: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !506, file: !92, line: 484, baseType: !512, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !92, line: 497, size: 256, elements: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !513, file: !92, line: 498, baseType: !512, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !513, file: !92, line: 499, baseType: !512, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !513, file: !92, line: 500, baseType: !505, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !513, file: !92, line: 501, baseType: !24, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !506, file: !92, line: 485, baseType: !520, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !92, line: 466, size: 320, elements: !522)
!522 = !{!523, !528, !529, !530, !531, !532, !533}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !521, file: !92, line: 467, baseType: !524, size: 128)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !92, line: 459, size: 128, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !524, file: !92, line: 460, baseType: !14, size: 8)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !524, file: !92, line: 461, baseType: !21, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !521, file: !92, line: 468, baseType: !524, size: 128, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !521, file: !92, line: 469, baseType: !47, size: 16, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !521, file: !92, line: 470, baseType: !14, size: 8, offset: 272)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !521, file: !92, line: 471, baseType: !14, size: 8, offset: 280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !521, file: !92, line: 472, baseType: !14, size: 8, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !521, file: !92, line: 473, baseType: !14, size: 8, offset: 296)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !506, file: !92, line: 486, baseType: !535, size: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !92, line: 448, size: 192, elements: !537)
!537 = !{!538, !561, !562, !563, !564, !565}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !536, file: !92, line: 449, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !92, line: 438, size: 64, elements: !540)
!540 = !{!541, !542, !555}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !539, file: !92, line: 439, baseType: !90, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !539, file: !92, line: 440, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !92, line: 419, size: 256, elements: !545)
!545 = !{!546, !551, !552, !553, !554}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !544, file: !92, line: 420, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !20, line: 1049, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!24, !387, !24, !34}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !544, file: !92, line: 421, baseType: !34, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !544, file: !92, line: 422, baseType: !90, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !544, file: !92, line: 423, baseType: !14, size: 8, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !544, file: !92, line: 424, baseType: !14, size: 8, offset: 200)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !539, file: !92, line: 441, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !92, line: 429, size: 128, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !557, file: !92, line: 430, baseType: !90, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !557, file: !92, line: 431, baseType: !556, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !536, file: !92, line: 450, baseType: !520, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !536, file: !92, line: 451, baseType: !14, size: 8, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !536, file: !92, line: 452, baseType: !14, size: 8, offset: 136)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !536, file: !92, line: 453, baseType: !14, size: 8, offset: 144)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !536, file: !92, line: 454, baseType: !14, size: 8, offset: 152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !506, file: !92, line: 487, baseType: !21, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !506, file: !92, line: 488, baseType: !24, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !506, file: !92, line: 489, baseType: !47, size: 16, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !506, file: !92, line: 490, baseType: !47, size: 16, offset: 496)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !506, file: !92, line: 491, baseType: !14, size: 8, offset: 512)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !506, file: !92, line: 492, baseType: !14, size: 8, offset: 520)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !37, file: !28, line: 379, baseType: !573, size: 384)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !28, line: 192, size: 384, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !573, file: !28, line: 193, baseType: !43, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !573, file: !28, line: 193, baseType: !14, size: 8, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !573, file: !28, line: 193, baseType: !14, size: 8, offset: 72)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !573, file: !28, line: 193, baseType: !47, size: 16, offset: 80)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !573, file: !28, line: 193, baseType: !14, size: 8, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !573, file: !28, line: 193, baseType: !490, size: 128, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !573, file: !28, line: 193, baseType: !43, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !573, file: !28, line: 193, baseType: !24, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !573, file: !28, line: 194, baseType: !24, size: 32, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !37, file: !28, line: 380, baseType: !585, size: 384)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !28, line: 197, size: 384, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !585, file: !28, line: 198, baseType: !43, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !585, file: !28, line: 198, baseType: !14, size: 8, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !585, file: !28, line: 198, baseType: !14, size: 8, offset: 72)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !585, file: !28, line: 198, baseType: !47, size: 16, offset: 80)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !585, file: !28, line: 198, baseType: !14, size: 8, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !585, file: !28, line: 200, baseType: !14, size: 8, offset: 104)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !585, file: !28, line: 201, baseType: !14, size: 8, offset: 112)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !585, file: !28, line: 202, baseType: !490, size: 128, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !585, file: !28, line: 202, baseType: !43, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !585, file: !28, line: 202, baseType: !597, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !20, line: 128, baseType: !21)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !37, file: !28, line: 381, baseType: !599, size: 320)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !28, line: 205, size: 320, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !599, file: !28, line: 206, baseType: !43, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !599, file: !28, line: 206, baseType: !14, size: 8, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !599, file: !28, line: 206, baseType: !14, size: 8, offset: 72)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !599, file: !28, line: 206, baseType: !47, size: 16, offset: 80)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !599, file: !28, line: 206, baseType: !14, size: 8, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !599, file: !28, line: 206, baseType: !490, size: 128, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !599, file: !28, line: 206, baseType: !43, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !37, file: !28, line: 382, baseType: !609, size: 384)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !28, line: 233, size: 384, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !609, file: !28, line: 234, baseType: !43, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 72)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !609, file: !28, line: 234, baseType: !47, size: 16, offset: 80)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 104)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 112)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 120)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !609, file: !28, line: 234, baseType: !90, size: 64, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !609, file: !28, line: 234, baseType: !24, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !609, file: !28, line: 234, baseType: !24, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !609, file: !28, line: 234, baseType: !24, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 288)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !609, file: !28, line: 234, baseType: !14, size: 8, offset: 296)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !609, file: !28, line: 234, baseType: !43, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !37, file: !28, line: 383, baseType: !627, size: 576)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !28, line: 237, size: 576, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !627, file: !28, line: 238, baseType: !43, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 72)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !627, file: !28, line: 238, baseType: !47, size: 16, offset: 80)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 96)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 104)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 112)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 120)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !627, file: !28, line: 238, baseType: !90, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !627, file: !28, line: 238, baseType: !24, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !627, file: !28, line: 238, baseType: !24, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !627, file: !28, line: 238, baseType: !24, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !627, file: !28, line: 238, baseType: !14, size: 8, offset: 296)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !627, file: !28, line: 238, baseType: !47, size: 16, offset: 304)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !627, file: !28, line: 239, baseType: !43, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !627, file: !28, line: 240, baseType: !85, size: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !627, file: !28, line: 241, baseType: !47, size: 16, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !627, file: !28, line: 242, baseType: !85, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !37, file: !28, line: 384, baseType: !649, size: 384)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !28, line: 262, size: 384, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !649, file: !28, line: 263, baseType: !43, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 72)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !649, file: !28, line: 263, baseType: !47, size: 16, offset: 80)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 104)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 112)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 120)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !649, file: !28, line: 263, baseType: !90, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !649, file: !28, line: 263, baseType: !24, size: 32, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !649, file: !28, line: 263, baseType: !24, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !649, file: !28, line: 263, baseType: !24, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 296)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !649, file: !28, line: 263, baseType: !14, size: 8, offset: 304)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !649, file: !28, line: 264, baseType: !43, size: 64, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !37, file: !28, line: 385, baseType: !668, size: 448)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !28, line: 245, size: 448, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !668, file: !28, line: 246, baseType: !43, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 72)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !668, file: !28, line: 246, baseType: !47, size: 16, offset: 80)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 104)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 112)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 120)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !668, file: !28, line: 246, baseType: !90, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !668, file: !28, line: 246, baseType: !24, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !668, file: !28, line: 246, baseType: !24, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !668, file: !28, line: 246, baseType: !24, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !668, file: !28, line: 246, baseType: !14, size: 8, offset: 296)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !668, file: !28, line: 246, baseType: !43, size: 64, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !668, file: !28, line: 247, baseType: !43, size: 64, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !37, file: !28, line: 386, baseType: !687, size: 448)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !28, line: 250, size: 448, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !687, file: !28, line: 251, baseType: !43, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 72)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !687, file: !28, line: 251, baseType: !47, size: 16, offset: 80)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 96)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 104)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 112)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 120)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !687, file: !28, line: 251, baseType: !90, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !687, file: !28, line: 251, baseType: !24, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !687, file: !28, line: 251, baseType: !24, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !687, file: !28, line: 251, baseType: !24, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !687, file: !28, line: 251, baseType: !14, size: 8, offset: 296)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !687, file: !28, line: 256, baseType: !43, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !687, file: !28, line: 257, baseType: !43, size: 64, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !37, file: !28, line: 387, baseType: !706, size: 512)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !28, line: 273, size: 512, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !706, file: !28, line: 274, baseType: !43, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !706, file: !28, line: 274, baseType: !14, size: 8, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !28, line: 274, baseType: !14, size: 8, offset: 72)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !706, file: !28, line: 274, baseType: !47, size: 16, offset: 80)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !706, file: !28, line: 274, baseType: !14, size: 8, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !706, file: !28, line: 274, baseType: !90, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !706, file: !28, line: 275, baseType: !24, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !706, file: !28, line: 276, baseType: !383, size: 64, offset: 256)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !706, file: !28, line: 277, baseType: !34, size: 64, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !28, line: 278, baseType: !490, size: 128, offset: 384)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !37, file: !28, line: 388, baseType: !719, size: 512)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !28, line: 281, size: 512, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728, !734, !735, !736, !742, !743}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !719, file: !28, line: 282, baseType: !43, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !719, file: !28, line: 282, baseType: !14, size: 8, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !719, file: !28, line: 282, baseType: !14, size: 8, offset: 72)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !719, file: !28, line: 282, baseType: !47, size: 16, offset: 80)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !719, file: !28, line: 282, baseType: !14, size: 8, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !719, file: !28, line: 282, baseType: !14, size: 8, offset: 104)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !719, file: !28, line: 283, baseType: !14, size: 8, offset: 112)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !719, file: !28, line: 284, baseType: !729, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !20, line: 1084, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!157, !24, !479, !24, !733, !34, !34}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !719, file: !28, line: 285, baseType: !90, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !719, file: !28, line: 286, baseType: !34, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !719, file: !28, line: 287, baseType: !737, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !20, line: 1102, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!157, !387, !24, !34, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !719, file: !28, line: 288, baseType: !43, size: 64, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !719, file: !28, line: 289, baseType: !43, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !37, file: !28, line: 389, baseType: !745, size: 512)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !28, line: 307, size: 512, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !745, file: !28, line: 308, baseType: !43, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !745, file: !28, line: 308, baseType: !14, size: 8, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !745, file: !28, line: 308, baseType: !14, size: 8, offset: 72)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !745, file: !28, line: 308, baseType: !47, size: 16, offset: 80)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !28, line: 308, baseType: !14, size: 8, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !745, file: !28, line: 308, baseType: !14, size: 8, offset: 104)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !745, file: !28, line: 309, baseType: !14, size: 8, offset: 112)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !745, file: !28, line: 310, baseType: !14, size: 8, offset: 120)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !745, file: !28, line: 311, baseType: !34, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !745, file: !28, line: 312, baseType: !90, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !745, file: !28, line: 313, baseType: !122, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !745, file: !28, line: 314, baseType: !85, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !745, file: !28, line: 315, baseType: !85, size: 64, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !745, file: !28, line: 316, baseType: !24, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !37, file: !28, line: 390, baseType: !762, size: 448)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !28, line: 340, size: 448, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !762, file: !28, line: 341, baseType: !43, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !762, file: !28, line: 341, baseType: !14, size: 8, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !762, file: !28, line: 341, baseType: !14, size: 8, offset: 72)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !762, file: !28, line: 341, baseType: !47, size: 16, offset: 80)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !28, line: 341, baseType: !14, size: 8, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !762, file: !28, line: 341, baseType: !90, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !762, file: !28, line: 342, baseType: !90, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !762, file: !28, line: 343, baseType: !34, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !762, file: !28, line: 344, baseType: !85, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !762, file: !28, line: 345, baseType: !24, size: 32, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !37, file: !28, line: 391, baseType: !775, size: 256)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !28, line: 350, size: 256, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !787}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !775, file: !28, line: 351, baseType: !43, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !775, file: !28, line: 351, baseType: !14, size: 8, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !775, file: !28, line: 351, baseType: !14, size: 8, offset: 72)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !775, file: !28, line: 351, baseType: !47, size: 16, offset: 80)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !775, file: !28, line: 351, baseType: !14, size: 8, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !775, file: !28, line: 351, baseType: !783, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !20, line: 1055, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !387, !34}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !775, file: !28, line: 352, baseType: !34, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !37, file: !28, line: 392, baseType: !789, size: 192)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !28, line: 357, size: 192, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !789, file: !28, line: 358, baseType: !43, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !789, file: !28, line: 358, baseType: !14, size: 8, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !789, file: !28, line: 358, baseType: !14, size: 8, offset: 72)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !789, file: !28, line: 358, baseType: !47, size: 16, offset: 80)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !28, line: 358, baseType: !14, size: 8, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !28, line: 358, baseType: !43, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !37, file: !28, line: 399, baseType: !91, size: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !27, file: !28, line: 435, baseType: !91, size: 384)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !27, file: !28, line: 436, baseType: !193, size: 1600)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !801, line: 148, baseType: !7)
!801 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!802 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pkg_info", file: !805, line: 131, size: 192, elements: !806)
!805 = !DIFile(filename: "drivers/acpi/acpica/acutils.h", directory: "/home/lizy2001/genbc/linux")
!806 = !{!807, !808, !809, !810}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "free_space", scope: !804, file: !805, line: 132, baseType: !85, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !804, file: !805, line: 133, baseType: !19, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "object_space", scope: !804, file: !805, line: 134, baseType: !24, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "num_packages", scope: !804, file: !805, line: 135, baseType: !24, size: 32, offset: 160)
!811 = !{!0}
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 72, elements: !403)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!814 = !{!"rsp"}
!815 = !{i32 7, !"Dwarf Version", i32 4}
!816 = !{i32 2, !"Debug Info Version", i32 3}
!817 = !{i32 1, !"wchar_size", i32 2}
!818 = !{i32 1, !"Code Model", i32 2}
!819 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!820 = distinct !DISubprogram(name: "acpi_ut_create_internal_object_dbg", scope: !3, file: !3, line: 53, type: !821, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !825)
!821 = !DISubroutineType(types: !822)
!822 = !{!43, !823, !24, !24, !824}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_type", file: !20, line: 635, baseType: !24)
!825 = !{}
!826 = !DILocalVariable(name: "module_name", arg: 1, scope: !820, file: !3, line: 54, type: !823)
!827 = !DILocation(line: 54, column: 15, scope: !820)
!828 = !DILocalVariable(name: "line_number", arg: 2, scope: !820, file: !3, line: 55, type: !24)
!829 = !DILocation(line: 55, column: 18, scope: !820)
!830 = !DILocalVariable(name: "component_id", arg: 3, scope: !820, file: !3, line: 56, type: !24)
!831 = !DILocation(line: 56, column: 18, scope: !820)
!832 = !DILocalVariable(name: "type", arg: 4, scope: !820, file: !3, line: 58, type: !824)
!833 = !DILocation(line: 58, column: 14, scope: !820)
!834 = !DILocalVariable(name: "object", scope: !820, file: !3, line: 60, type: !43)
!835 = !DILocation(line: 60, column: 29, scope: !820)
!836 = !DILocalVariable(name: "second_object", scope: !820, file: !3, line: 61, type: !43)
!837 = !DILocation(line: 61, column: 29, scope: !820)
!838 = !DILocation(line: 69, column: 39, scope: !820)
!839 = !DILocation(line: 69, column: 52, scope: !820)
!840 = !DILocation(line: 70, column: 11, scope: !820)
!841 = !DILocation(line: 69, column: 6, scope: !820)
