; ModuleID = '../bcout/drivers/acpi/acpica/utosi.llvm.bc'
source_filename = "drivers/acpi/acpica/utosi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_interface_info = type { i8*, %struct.acpi_interface_info*, i8, i8 }
%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "acpi_default_supported_interfaces", scope: !2, file: !3, line: 53, type: !36, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !28, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/utosi.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !6, line: 305, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!13 = !{!14, !21, !16, !22, !24, !26, !27}
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !15, line: 127, baseType: !16)
!15 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !17, line: 23, baseType: !18)
!17 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !19, line: 31, baseType: !20)
!19 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!20 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !15, line: 421, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !17, line: 21, baseType: !23)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !19, line: 27, baseType: !7)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !25, line: 148, baseType: !7)
!25 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !{!0, !29}
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 14, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 48, elements: !34)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !{!35}
!35 = !DISubrange(count: 6)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 4992, elements: !49)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_interface_info", file: !38, line: 1045, size: 192, elements: !39)
!38 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!39 = !{!40, !42, !44, !48}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !38, line: 1046, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !38, line: 1047, baseType: !43, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !38, line: 1048, baseType: !45, size: 8, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !17, line: 17, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !19, line: 21, baseType: !47)
!47 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !37, file: !38, line: 1049, baseType: !45, size: 8, offset: 136)
!49 = !{!50}
!50 = !DISubrange(count: 26)
!51 = !{!"rsp"}
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 2}
!55 = !{i32 1, !"Code Model", i32 2}
!56 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!57 = distinct !DISubprogram(name: "acpi_ut_initialize_interfaces", scope: !3, file: !3, line: 107, type: !58, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!58 = !DISubroutineType(types: !59)
!59 = !{!21}
!60 = !{}
!61 = !DILocalVariable(name: "status", scope: !57, file: !3, line: 109, type: !21)
!62 = !DILocation(line: 109, column: 14, scope: !57)
!63 = !DILocalVariable(name: "i", scope: !57, file: !3, line: 110, type: !22)
!64 = !DILocation(line: 110, column: 6, scope: !57)
!65 = !DILocation(line: 112, column: 11, scope: !57)
!66 = !DILocation(line: 112, column: 9, scope: !57)
!67 = !DILocation(line: 113, column: 6, scope: !68)
!68 = distinct !DILexicalBlock(scope: !57, file: !3, line: 113, column: 6)
!69 = !DILocation(line: 113, column: 6, scope: !57)
!70 = !DILocation(line: 114, column: 11, scope: !71)
!71 = distinct !DILexicalBlock(scope: !68, file: !3, line: 113, column: 28)
!72 = !DILocation(line: 114, column: 3, scope: !71)
!73 = !DILocation(line: 117, column: 32, scope: !57)
!74 = !DILocation(line: 121, column: 9, scope: !75)
!75 = distinct !DILexicalBlock(scope: !57, file: !3, line: 121, column: 2)
!76 = !DILocation(line: 121, column: 7, scope: !75)
!77 = !DILocation(line: 122, column: 7, scope: !78)
!78 = distinct !DILexicalBlock(scope: !75, file: !3, line: 121, column: 2)
!79 = !DILocation(line: 122, column: 9, scope: !78)
!80 = !DILocation(line: 121, column: 2, scope: !75)
!81 = !DILocation(line: 125, column: 53, scope: !82)
!82 = distinct !DILexicalBlock(scope: !78, file: !3, line: 123, column: 12)
!83 = !DILocation(line: 125, column: 42, scope: !82)
!84 = !DILocation(line: 125, column: 55, scope: !82)
!85 = !DILocation(line: 125, column: 8, scope: !82)
!86 = !DILocation(line: 124, column: 37, scope: !82)
!87 = !DILocation(line: 124, column: 3, scope: !82)
!88 = !DILocation(line: 124, column: 40, scope: !82)
!89 = !DILocation(line: 124, column: 45, scope: !82)
!90 = !DILocation(line: 126, column: 2, scope: !82)
!91 = !DILocation(line: 123, column: 8, scope: !78)
!92 = !DILocation(line: 121, column: 2, scope: !78)
!93 = distinct !{!93, !80, !94}
!94 = !DILocation(line: 126, column: 2, scope: !75)
!95 = !DILocation(line: 128, column: 2, scope: !57)
!96 = !DILocation(line: 129, column: 2, scope: !57)
!97 = !DILocation(line: 130, column: 1, scope: !57)
!98 = distinct !DISubprogram(name: "acpi_ut_interface_terminate", scope: !3, file: !3, line: 145, type: !58, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!99 = !DILocalVariable(name: "status", scope: !98, file: !3, line: 147, type: !21)
!100 = !DILocation(line: 147, column: 14, scope: !98)
!101 = !DILocalVariable(name: "next_interface", scope: !98, file: !3, line: 148, type: !43)
!102 = !DILocation(line: 148, column: 30, scope: !98)
!103 = !DILocation(line: 150, column: 11, scope: !98)
!104 = !DILocation(line: 150, column: 9, scope: !98)
!105 = !DILocation(line: 151, column: 6, scope: !106)
!106 = distinct !DILexicalBlock(scope: !98, file: !3, line: 151, column: 6)
!107 = !DILocation(line: 151, column: 6, scope: !98)
!108 = !DILocation(line: 152, column: 11, scope: !109)
!109 = distinct !DILexicalBlock(scope: !106, file: !3, line: 151, column: 28)
!110 = !DILocation(line: 152, column: 3, scope: !109)
!111 = !DILocation(line: 155, column: 19, scope: !98)
!112 = !DILocation(line: 155, column: 17, scope: !98)
!113 = !DILocation(line: 156, column: 2, scope: !98)
!114 = !DILocation(line: 156, column: 9, scope: !98)
!115 = !DILocation(line: 157, column: 35, scope: !116)
!116 = distinct !DILexicalBlock(scope: !98, file: !3, line: 156, column: 25)
!117 = !DILocation(line: 157, column: 51, scope: !116)
!118 = !DILocation(line: 157, column: 33, scope: !116)
!119 = !DILocation(line: 159, column: 7, scope: !120)
!120 = distinct !DILexicalBlock(scope: !116, file: !3, line: 159, column: 7)
!121 = !DILocation(line: 159, column: 23, scope: !120)
!122 = !DILocation(line: 159, column: 29, scope: !120)
!123 = !DILocation(line: 159, column: 7, scope: !116)
!124 = !DILocation(line: 163, column: 4, scope: !125)
!125 = distinct !DILexicalBlock(scope: !120, file: !3, line: 159, column: 49)
!126 = !DILocation(line: 164, column: 4, scope: !125)
!127 = !DILocation(line: 165, column: 3, scope: !125)
!128 = !DILocation(line: 168, column: 8, scope: !129)
!129 = distinct !DILexicalBlock(scope: !130, file: !3, line: 168, column: 8)
!130 = distinct !DILexicalBlock(scope: !120, file: !3, line: 165, column: 10)
!131 = !DILocation(line: 168, column: 24, scope: !129)
!132 = !DILocation(line: 168, column: 30, scope: !129)
!133 = !DILocation(line: 168, column: 8, scope: !130)
!134 = !DILocation(line: 169, column: 5, scope: !135)
!135 = distinct !DILexicalBlock(scope: !129, file: !3, line: 168, column: 58)
!136 = !DILocation(line: 169, column: 21, scope: !135)
!137 = !DILocation(line: 169, column: 27, scope: !135)
!138 = !DILocation(line: 170, column: 4, scope: !135)
!139 = !DILocation(line: 171, column: 5, scope: !140)
!140 = distinct !DILexicalBlock(scope: !129, file: !3, line: 170, column: 11)
!141 = !DILocation(line: 171, column: 21, scope: !140)
!142 = !DILocation(line: 171, column: 27, scope: !140)
!143 = !DILocation(line: 175, column: 20, scope: !116)
!144 = !DILocation(line: 175, column: 18, scope: !116)
!145 = distinct !{!145, !113, !146}
!146 = !DILocation(line: 176, column: 2, scope: !98)
!147 = !DILocation(line: 178, column: 2, scope: !98)
!148 = !DILocation(line: 179, column: 2, scope: !98)
!149 = !DILocation(line: 180, column: 1, scope: !98)
!150 = distinct !DISubprogram(name: "acpi_os_free", scope: !151, file: !151, line: 60, type: !152, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !60)
!151 = !DIFile(filename: "./include/acpi/platform/aclinuxex.h", directory: "/home/lizy2001/genbc/linux")
!152 = !DISubroutineType(types: !153)
!153 = !{null, !26}
!154 = !DILocalVariable(name: "memory", arg: 1, scope: !150, file: !151, line: 60, type: !26)
!155 = !DILocation(line: 60, column: 39, scope: !150)
!156 = !DILocation(line: 62, column: 8, scope: !150)
!157 = !DILocation(line: 62, column: 2, scope: !150)
!158 = !DILocation(line: 63, column: 1, scope: !150)
!159 = distinct !DISubprogram(name: "acpi_ut_install_interface", scope: !3, file: !3, line: 195, type: !160, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!160 = !DISubroutineType(types: !161)
!161 = !{!21, !162}
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_string", file: !15, line: 423, baseType: !41)
!163 = !DILocalVariable(name: "interface_name", arg: 1, scope: !159, file: !3, line: 195, type: !162)
!164 = !DILocation(line: 195, column: 51, scope: !159)
!165 = !DILocalVariable(name: "interface_info", scope: !159, file: !3, line: 197, type: !43)
!166 = !DILocation(line: 197, column: 30, scope: !159)
!167 = !DILocation(line: 202, column: 6, scope: !159)
!168 = !DILocation(line: 201, column: 17, scope: !159)
!169 = !DILocation(line: 203, column: 7, scope: !170)
!170 = distinct !DILexicalBlock(scope: !159, file: !3, line: 203, column: 6)
!171 = !DILocation(line: 203, column: 6, scope: !159)
!172 = !DILocation(line: 204, column: 3, scope: !173)
!173 = distinct !DILexicalBlock(scope: !170, file: !3, line: 203, column: 23)
!174 = !DILocation(line: 207, column: 25, scope: !159)
!175 = !DILocation(line: 207, column: 2, scope: !159)
!176 = !DILocation(line: 207, column: 18, scope: !159)
!177 = !DILocation(line: 207, column: 23, scope: !159)
!178 = !DILocation(line: 208, column: 7, scope: !179)
!179 = distinct !DILexicalBlock(scope: !159, file: !3, line: 208, column: 6)
!180 = !DILocation(line: 208, column: 23, scope: !179)
!181 = !DILocation(line: 208, column: 6, scope: !159)
!182 = !DILocation(line: 209, column: 3, scope: !183)
!183 = distinct !DILexicalBlock(scope: !179, file: !3, line: 208, column: 29)
!184 = !DILocation(line: 210, column: 3, scope: !183)
!185 = !DILocation(line: 215, column: 9, scope: !159)
!186 = !DILocation(line: 215, column: 25, scope: !159)
!187 = !DILocation(line: 215, column: 31, scope: !159)
!188 = !DILocation(line: 215, column: 2, scope: !159)
!189 = !DILocation(line: 216, column: 2, scope: !159)
!190 = !DILocation(line: 216, column: 18, scope: !159)
!191 = !DILocation(line: 216, column: 24, scope: !159)
!192 = !DILocation(line: 217, column: 25, scope: !159)
!193 = !DILocation(line: 217, column: 2, scope: !159)
!194 = !DILocation(line: 217, column: 18, scope: !159)
!195 = !DILocation(line: 217, column: 23, scope: !159)
!196 = !DILocation(line: 219, column: 34, scope: !159)
!197 = !DILocation(line: 219, column: 32, scope: !159)
!198 = !DILocation(line: 220, column: 2, scope: !159)
!199 = !DILocation(line: 221, column: 1, scope: !159)
!200 = distinct !DISubprogram(name: "acpi_os_allocate_zeroed", scope: !151, file: !151, line: 55, type: !201, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !60)
!201 = !DISubroutineType(types: !202)
!202 = !{!26, !14}
!203 = !DILocalVariable(name: "flags", arg: 1, scope: !204, file: !205, line: 162, type: !27)
!204 = distinct !DISubprogram(name: "arch_irqs_disabled_flags", scope: !205, file: !205, line: 162, type: !206, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !60)
!205 = !DIFile(filename: "./arch/x86/include/asm/irqflags.h", directory: "/home/lizy2001/genbc/linux")
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !27}
!208 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!209 = !DILocation(line: 162, column: 67, scope: !204, inlinedAt: !210)
!210 = distinct !DILocation(line: 57, column: 23, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !151, line: 57, column: 23)
!212 = distinct !DILexicalBlock(scope: !200, file: !151, line: 57, column: 23)
!213 = !DILocalVariable(name: "size", arg: 1, scope: !200, file: !151, line: 55, type: !14)
!214 = !DILocation(line: 55, column: 55, scope: !200)
!215 = !DILocation(line: 57, column: 17, scope: !200)
!216 = !DILocalVariable(name: "_flags", scope: !212, file: !151, line: 57, type: !27)
!217 = !DILocation(line: 57, column: 23, scope: !212)
!218 = !DILocalVariable(name: "__dummy", scope: !219, file: !151, line: 57, type: !27)
!219 = distinct !DILexicalBlock(scope: !220, file: !151, line: 57, column: 23)
!220 = distinct !DILexicalBlock(scope: !212, file: !151, line: 57, column: 23)
!221 = !DILocation(line: 57, column: 23, scope: !219)
!222 = !DILocalVariable(name: "__dummy2", scope: !219, file: !151, line: 57, type: !27)
!223 = !DILocation(line: 57, column: 23, scope: !220)
!224 = !DILocalVariable(name: "__dummy", scope: !225, file: !151, line: 57, type: !27)
!225 = distinct !DILexicalBlock(scope: !211, file: !151, line: 57, column: 23)
!226 = !DILocation(line: 57, column: 23, scope: !225)
!227 = !DILocalVariable(name: "__dummy2", scope: !225, file: !151, line: 57, type: !27)
!228 = !DILocation(line: 57, column: 23, scope: !211)
!229 = !DILocation(line: 164, column: 11, scope: !204, inlinedAt: !210)
!230 = !DILocation(line: 164, column: 17, scope: !204, inlinedAt: !210)
!231 = !DILocation(line: 164, column: 9, scope: !204, inlinedAt: !210)
!232 = !DILocation(line: 57, column: 23, scope: !200)
!233 = !DILocation(line: 57, column: 9, scope: !200)
!234 = !DILocation(line: 57, column: 2, scope: !200)
!235 = distinct !DISubprogram(name: "acpi_ut_remove_interface", scope: !3, file: !3, line: 236, type: !160, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!236 = !DILocalVariable(name: "interface_name", arg: 1, scope: !235, file: !3, line: 236, type: !162)
!237 = !DILocation(line: 236, column: 50, scope: !235)
!238 = !DILocalVariable(name: "previous_interface", scope: !235, file: !3, line: 238, type: !43)
!239 = !DILocation(line: 238, column: 30, scope: !235)
!240 = !DILocalVariable(name: "next_interface", scope: !235, file: !3, line: 239, type: !43)
!241 = !DILocation(line: 239, column: 30, scope: !235)
!242 = !DILocation(line: 241, column: 40, scope: !235)
!243 = !DILocation(line: 241, column: 38, scope: !235)
!244 = !DILocation(line: 241, column: 21, scope: !235)
!245 = !DILocation(line: 242, column: 2, scope: !235)
!246 = !DILocation(line: 242, column: 9, scope: !235)
!247 = !DILocation(line: 243, column: 15, scope: !248)
!248 = distinct !DILexicalBlock(scope: !249, file: !3, line: 243, column: 7)
!249 = distinct !DILexicalBlock(scope: !235, file: !3, line: 242, column: 25)
!250 = !DILocation(line: 243, column: 31, scope: !248)
!251 = !DILocation(line: 243, column: 47, scope: !248)
!252 = !DILocation(line: 243, column: 8, scope: !248)
!253 = !DILocation(line: 243, column: 7, scope: !249)
!254 = !DILocation(line: 248, column: 8, scope: !255)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 248, column: 8)
!256 = distinct !DILexicalBlock(scope: !248, file: !3, line: 243, column: 54)
!257 = !DILocation(line: 248, column: 24, scope: !255)
!258 = !DILocation(line: 248, column: 30, scope: !255)
!259 = !DILocation(line: 248, column: 8, scope: !256)
!260 = !DILocation(line: 252, column: 9, scope: !261)
!261 = distinct !DILexicalBlock(scope: !262, file: !3, line: 252, column: 9)
!262 = distinct !DILexicalBlock(scope: !255, file: !3, line: 248, column: 50)
!263 = !DILocation(line: 252, column: 31, scope: !261)
!264 = !DILocation(line: 252, column: 28, scope: !261)
!265 = !DILocation(line: 252, column: 9, scope: !262)
!266 = !DILocation(line: 254, column: 10, scope: !267)
!267 = distinct !DILexicalBlock(scope: !261, file: !3, line: 252, column: 47)
!268 = !DILocation(line: 254, column: 26, scope: !267)
!269 = !DILocation(line: 253, column: 36, scope: !267)
!270 = !DILocation(line: 255, column: 5, scope: !267)
!271 = !DILocation(line: 257, column: 10, scope: !272)
!272 = distinct !DILexicalBlock(scope: !261, file: !3, line: 255, column: 12)
!273 = !DILocation(line: 257, column: 26, scope: !272)
!274 = !DILocation(line: 256, column: 6, scope: !272)
!275 = !DILocation(line: 256, column: 26, scope: !272)
!276 = !DILocation(line: 256, column: 31, scope: !272)
!277 = !DILocation(line: 260, column: 5, scope: !262)
!278 = !DILocation(line: 261, column: 5, scope: !262)
!279 = !DILocation(line: 262, column: 4, scope: !262)
!280 = !DILocation(line: 267, column: 9, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 267, column: 9)
!282 = distinct !DILexicalBlock(scope: !255, file: !3, line: 262, column: 11)
!283 = !DILocation(line: 267, column: 25, scope: !281)
!284 = !DILocation(line: 267, column: 31, scope: !281)
!285 = !DILocation(line: 267, column: 9, scope: !282)
!286 = !DILocation(line: 268, column: 6, scope: !287)
!287 = distinct !DILexicalBlock(scope: !281, file: !3, line: 267, column: 51)
!288 = !DILocation(line: 271, column: 5, scope: !282)
!289 = !DILocation(line: 271, column: 21, scope: !282)
!290 = !DILocation(line: 271, column: 27, scope: !282)
!291 = !DILocation(line: 274, column: 4, scope: !256)
!292 = !DILocation(line: 277, column: 24, scope: !249)
!293 = !DILocation(line: 277, column: 22, scope: !249)
!294 = !DILocation(line: 278, column: 20, scope: !249)
!295 = !DILocation(line: 278, column: 36, scope: !249)
!296 = !DILocation(line: 278, column: 18, scope: !249)
!297 = distinct !{!297, !245, !298}
!298 = !DILocation(line: 279, column: 2, scope: !235)
!299 = !DILocation(line: 283, column: 2, scope: !235)
!300 = !DILocation(line: 284, column: 1, scope: !235)
!301 = distinct !DISubprogram(name: "acpi_ut_update_interfaces", scope: !3, file: !3, line: 301, type: !302, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!302 = !DISubroutineType(types: !303)
!303 = !{!21, !45}
!304 = !DILocalVariable(name: "action", arg: 1, scope: !301, file: !3, line: 301, type: !45)
!305 = !DILocation(line: 301, column: 42, scope: !301)
!306 = !DILocalVariable(name: "next_interface", scope: !301, file: !3, line: 303, type: !43)
!307 = !DILocation(line: 303, column: 30, scope: !301)
!308 = !DILocation(line: 305, column: 19, scope: !301)
!309 = !DILocation(line: 305, column: 17, scope: !301)
!310 = !DILocation(line: 306, column: 2, scope: !301)
!311 = !DILocation(line: 306, column: 9, scope: !301)
!312 = !DILocation(line: 307, column: 9, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !3, line: 307, column: 7)
!314 = distinct !DILexicalBlock(scope: !301, file: !3, line: 306, column: 25)
!315 = !DILocation(line: 307, column: 25, scope: !313)
!316 = !DILocation(line: 307, column: 31, scope: !313)
!317 = !DILocation(line: 307, column: 51, scope: !313)
!318 = !DILocation(line: 308, column: 9, scope: !313)
!319 = !DILocation(line: 308, column: 16, scope: !313)
!320 = !DILocation(line: 308, column: 41, scope: !313)
!321 = !DILocation(line: 309, column: 10, scope: !313)
!322 = !DILocation(line: 309, column: 26, scope: !313)
!323 = !DILocation(line: 309, column: 32, scope: !313)
!324 = !DILocation(line: 309, column: 52, scope: !313)
!325 = !DILocation(line: 310, column: 9, scope: !313)
!326 = !DILocation(line: 310, column: 16, scope: !313)
!327 = !DILocation(line: 307, column: 7, scope: !314)
!328 = !DILocation(line: 311, column: 8, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !3, line: 311, column: 8)
!330 = distinct !DILexicalBlock(scope: !313, file: !3, line: 310, column: 41)
!331 = !DILocation(line: 311, column: 15, scope: !329)
!332 = !DILocation(line: 311, column: 8, scope: !330)
!333 = !DILocation(line: 315, column: 5, scope: !334)
!334 = distinct !DILexicalBlock(scope: !329, file: !3, line: 311, column: 42)
!335 = !DILocation(line: 315, column: 21, scope: !334)
!336 = !DILocation(line: 315, column: 27, scope: !334)
!337 = !DILocation(line: 316, column: 4, scope: !334)
!338 = !DILocation(line: 319, column: 5, scope: !339)
!339 = distinct !DILexicalBlock(scope: !329, file: !3, line: 316, column: 11)
!340 = !DILocation(line: 319, column: 21, scope: !339)
!341 = !DILocation(line: 319, column: 27, scope: !339)
!342 = !DILocation(line: 321, column: 3, scope: !330)
!343 = !DILocation(line: 323, column: 20, scope: !314)
!344 = !DILocation(line: 323, column: 36, scope: !314)
!345 = !DILocation(line: 323, column: 18, scope: !314)
!346 = distinct !{!346, !310, !347}
!347 = !DILocation(line: 324, column: 2, scope: !301)
!348 = !DILocation(line: 326, column: 2, scope: !301)
!349 = distinct !DISubprogram(name: "acpi_ut_get_interface", scope: !3, file: !3, line: 342, type: !350, scopeLine: 343, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!350 = !DISubroutineType(types: !351)
!351 = !{!43, !162}
!352 = !DILocalVariable(name: "interface_name", arg: 1, scope: !349, file: !3, line: 342, type: !162)
!353 = !DILocation(line: 342, column: 63, scope: !349)
!354 = !DILocalVariable(name: "next_interface", scope: !349, file: !3, line: 344, type: !43)
!355 = !DILocation(line: 344, column: 30, scope: !349)
!356 = !DILocation(line: 346, column: 19, scope: !349)
!357 = !DILocation(line: 346, column: 17, scope: !349)
!358 = !DILocation(line: 347, column: 2, scope: !349)
!359 = !DILocation(line: 347, column: 9, scope: !349)
!360 = !DILocation(line: 348, column: 15, scope: !361)
!361 = distinct !DILexicalBlock(scope: !362, file: !3, line: 348, column: 7)
!362 = distinct !DILexicalBlock(scope: !349, file: !3, line: 347, column: 25)
!363 = !DILocation(line: 348, column: 31, scope: !361)
!364 = !DILocation(line: 348, column: 47, scope: !361)
!365 = !DILocation(line: 348, column: 8, scope: !361)
!366 = !DILocation(line: 348, column: 7, scope: !362)
!367 = !DILocation(line: 349, column: 12, scope: !368)
!368 = distinct !DILexicalBlock(scope: !361, file: !3, line: 348, column: 54)
!369 = !DILocation(line: 349, column: 4, scope: !368)
!370 = !DILocation(line: 352, column: 20, scope: !362)
!371 = !DILocation(line: 352, column: 36, scope: !362)
!372 = !DILocation(line: 352, column: 18, scope: !362)
!373 = distinct !{!373, !358, !374}
!374 = !DILocation(line: 353, column: 2, scope: !349)
!375 = !DILocation(line: 355, column: 2, scope: !349)
!376 = !DILocation(line: 356, column: 1, scope: !349)
!377 = distinct !DISubprogram(name: "acpi_ut_osi_implementation", scope: !3, file: !3, line: 383, type: !378, scopeLine: 384, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !60)
!378 = !DISubroutineType(types: !379)
!379 = !{!21, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !382, line: 37, size: 9024, elements: !383)
!382 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!383 = !{!384, !385, !386, !387, !391, !392, !393, !394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !406, !407, !408, !409, !410, !1083, !1084, !1085, !1086, !1087, !1091, !1093, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1134}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !381, file: !382, line: 38, baseType: !380, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !381, file: !382, line: 39, baseType: !45, size: 8, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !381, file: !382, line: 40, baseType: !45, size: 8, offset: 72)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !381, file: !382, line: 41, baseType: !388, size: 16, offset: 80)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !17, line: 19, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !19, line: 24, baseType: !390)
!390 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !381, file: !382, line: 42, baseType: !45, size: 8, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !381, file: !382, line: 43, baseType: !45, size: 8, offset: 104)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !381, file: !382, line: 44, baseType: !45, size: 8, offset: 112)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !381, file: !382, line: 45, baseType: !395, size: 16, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !15, line: 445, baseType: !388)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !381, file: !382, line: 46, baseType: !45, size: 8, offset: 144)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !381, file: !382, line: 47, baseType: !45, size: 8, offset: 152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !381, file: !382, line: 48, baseType: !45, size: 8, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !381, file: !382, line: 49, baseType: !45, size: 8, offset: 168)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !381, file: !382, line: 50, baseType: !45, size: 8, offset: 176)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !381, file: !382, line: 51, baseType: !45, size: 8, offset: 184)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !381, file: !382, line: 52, baseType: !45, size: 8, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !381, file: !382, line: 53, baseType: !45, size: 8, offset: 200)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !381, file: !382, line: 54, baseType: !405, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !381, file: !382, line: 55, baseType: !22, size: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !381, file: !382, line: 56, baseType: !22, size: 32, offset: 352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !381, file: !382, line: 57, baseType: !22, size: 32, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !381, file: !382, line: 58, baseType: !22, size: 32, offset: 416)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !381, file: !382, line: 60, baseType: !411, size: 640, offset: 448)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !38, line: 893, size: 640, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !980, !981, !1081, !1082}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !411, file: !38, line: 894, baseType: !405, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !411, file: !38, line: 895, baseType: !405, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !411, file: !38, line: 896, baseType: !405, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !411, file: !38, line: 897, baseType: !405, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !411, file: !38, line: 898, baseType: !405, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !411, file: !38, line: 899, baseType: !419, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !38, line: 875, size: 1600, elements: !421)
!421 = !{!422, !923, !939}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !420, file: !38, line: 876, baseType: !423, size: 448)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !38, line: 828, size: 448, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !913, !922}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !423, file: !38, line: 829, baseType: !419, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !423, file: !38, line: 829, baseType: !45, size: 8, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !423, file: !38, line: 829, baseType: !45, size: 8, offset: 72)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !423, file: !38, line: 829, baseType: !388, size: 16, offset: 80)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !423, file: !38, line: 829, baseType: !405, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !423, file: !38, line: 829, baseType: !419, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !423, file: !38, line: 829, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !38, line: 133, size: 384, elements: !434)
!434 = !{!435, !897, !898, !899, !900, !909, !910, !911, !912}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !433, file: !38, line: 134, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !438, line: 367, size: 576, elements: !439)
!438 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440, !448, !461, !471, !484, !498, !507, !531, !560, !575, !588, !667, !679, !693, !703, !721, !743, !762, !781, !800, !817, !843, !860, !873, !887, !896}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !437, file: !438, line: 368, baseType: !441, size: 128)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !438, line: 73, size: 128, elements: !442)
!442 = !{!443, !444, !445, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !441, file: !438, line: 74, baseType: !436, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !441, file: !438, line: 74, baseType: !45, size: 8, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !438, line: 74, baseType: !45, size: 8, offset: 72)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !441, file: !438, line: 74, baseType: !388, size: 16, offset: 80)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !441, file: !438, line: 74, baseType: !45, size: 8, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !437, file: !438, line: 369, baseType: !449, size: 192)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !438, line: 76, size: 192, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !460}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !449, file: !438, line: 77, baseType: !436, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !449, file: !438, line: 77, baseType: !45, size: 8, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !438, line: 77, baseType: !45, size: 8, offset: 72)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !449, file: !438, line: 77, baseType: !388, size: 16, offset: 80)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !438, line: 77, baseType: !45, size: 8, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !449, file: !438, line: 77, baseType: !457, size: 24, offset: 104)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 24, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 3)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !449, file: !438, line: 78, baseType: !16, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !437, file: !438, line: 370, baseType: !462, size: 256)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !438, line: 93, size: 256, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !462, file: !438, line: 94, baseType: !436, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !462, file: !438, line: 94, baseType: !45, size: 8, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !438, line: 94, baseType: !45, size: 8, offset: 72)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !462, file: !438, line: 94, baseType: !388, size: 16, offset: 80)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !462, file: !438, line: 94, baseType: !45, size: 8, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !462, file: !438, line: 94, baseType: !41, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !462, file: !438, line: 94, baseType: !22, size: 32, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !437, file: !438, line: 371, baseType: !472, size: 384)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !438, line: 97, size: 384, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !472, file: !438, line: 98, baseType: !436, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !472, file: !438, line: 98, baseType: !45, size: 8, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !438, line: 98, baseType: !45, size: 8, offset: 72)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !472, file: !438, line: 98, baseType: !388, size: 16, offset: 80)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !472, file: !438, line: 98, baseType: !45, size: 8, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !472, file: !438, line: 98, baseType: !405, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !472, file: !438, line: 98, baseType: !22, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !472, file: !438, line: 99, baseType: !22, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !472, file: !438, line: 100, baseType: !405, size: 64, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !472, file: !438, line: 101, baseType: !432, size: 64, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !437, file: !438, line: 372, baseType: !485, size: 384)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !438, line: 104, size: 384, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !495, !496, !497}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !485, file: !438, line: 105, baseType: !436, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !485, file: !438, line: 105, baseType: !45, size: 8, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !438, line: 105, baseType: !45, size: 8, offset: 72)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !485, file: !438, line: 105, baseType: !388, size: 16, offset: 80)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !485, file: !438, line: 105, baseType: !45, size: 8, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !485, file: !438, line: 105, baseType: !432, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !485, file: !438, line: 106, baseType: !494, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !485, file: !438, line: 107, baseType: !405, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !485, file: !438, line: 108, baseType: !22, size: 32, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !485, file: !438, line: 109, baseType: !22, size: 32, offset: 352)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !437, file: !438, line: 373, baseType: !499, size: 192)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !438, line: 118, size: 192, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !499, file: !438, line: 119, baseType: !436, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !499, file: !438, line: 119, baseType: !45, size: 8, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !499, file: !438, line: 119, baseType: !45, size: 8, offset: 72)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !499, file: !438, line: 119, baseType: !388, size: 16, offset: 80)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !499, file: !438, line: 119, baseType: !45, size: 8, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !499, file: !438, line: 119, baseType: !26, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !437, file: !438, line: 374, baseType: !508, size: 448)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !438, line: 143, size: 448, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !528, !529, !530}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !508, file: !438, line: 144, baseType: !436, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !508, file: !438, line: 144, baseType: !45, size: 8, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !508, file: !438, line: 144, baseType: !45, size: 8, offset: 72)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !508, file: !438, line: 144, baseType: !388, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !508, file: !438, line: 144, baseType: !45, size: 8, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !508, file: !438, line: 144, baseType: !45, size: 8, offset: 104)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !508, file: !438, line: 145, baseType: !45, size: 8, offset: 112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !508, file: !438, line: 146, baseType: !45, size: 8, offset: 120)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !508, file: !438, line: 147, baseType: !436, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !508, file: !438, line: 148, baseType: !436, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !508, file: !438, line: 149, baseType: !405, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !508, file: !438, line: 153, baseType: !522, size: 64, offset: 320)
!522 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !438, line: 150, size: 64, elements: !523)
!523 = !{!524, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !522, file: !438, line: 151, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !38, line: 248, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !522, file: !438, line: 152, baseType: !436, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !508, file: !438, line: 155, baseType: !22, size: 32, offset: 384)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !508, file: !438, line: 156, baseType: !395, size: 16, offset: 416)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !508, file: !438, line: 157, baseType: !45, size: 8, offset: 432)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !437, file: !438, line: 375, baseType: !532, size: 576)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !438, line: 122, size: 576, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !556, !557, !558, !559}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !532, file: !438, line: 123, baseType: !436, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !532, file: !438, line: 123, baseType: !45, size: 8, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !532, file: !438, line: 123, baseType: !45, size: 8, offset: 72)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !532, file: !438, line: 123, baseType: !388, size: 16, offset: 80)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !532, file: !438, line: 123, baseType: !45, size: 8, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !532, file: !438, line: 123, baseType: !45, size: 8, offset: 104)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !532, file: !438, line: 124, baseType: !388, size: 16, offset: 112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !532, file: !438, line: 125, baseType: !26, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !532, file: !438, line: 126, baseType: !16, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !532, file: !438, line: 127, baseType: !544, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !38, line: 620, size: 320, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !545, file: !38, line: 621, baseType: !26, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !545, file: !38, line: 621, baseType: !45, size: 8, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !38, line: 621, baseType: !45, size: 8, offset: 72)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !545, file: !38, line: 621, baseType: !388, size: 16, offset: 80)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !545, file: !38, line: 621, baseType: !388, size: 16, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !545, file: !38, line: 621, baseType: !45, size: 8, offset: 112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !545, file: !38, line: 622, baseType: !380, size: 64, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !545, file: !38, line: 623, baseType: !436, size: 64, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !545, file: !38, line: 624, baseType: !16, size: 64, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !532, file: !438, line: 128, baseType: !436, size: 64, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !438, line: 129, baseType: !436, size: 64, offset: 384)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !532, file: !438, line: 130, baseType: !432, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !532, file: !438, line: 131, baseType: !45, size: 8, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !437, file: !438, line: 376, baseType: !561, size: 448)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !438, line: 134, size: 448, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !574}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !561, file: !438, line: 135, baseType: !436, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !561, file: !438, line: 135, baseType: !45, size: 8, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !561, file: !438, line: 135, baseType: !45, size: 8, offset: 72)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !561, file: !438, line: 135, baseType: !388, size: 16, offset: 80)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !438, line: 135, baseType: !45, size: 8, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !561, file: !438, line: 135, baseType: !45, size: 8, offset: 104)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !561, file: !438, line: 136, baseType: !432, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !561, file: !438, line: 137, baseType: !436, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !561, file: !438, line: 138, baseType: !436, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !561, file: !438, line: 139, baseType: !573, size: 64, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !15, line: 129, baseType: !16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !561, file: !438, line: 140, baseType: !22, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !437, file: !438, line: 377, baseType: !576, size: 320)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !438, line: 184, size: 320, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !587}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !576, file: !438, line: 185, baseType: !436, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !576, file: !438, line: 185, baseType: !45, size: 8, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !576, file: !438, line: 185, baseType: !45, size: 8, offset: 72)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !576, file: !438, line: 185, baseType: !388, size: 16, offset: 80)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !576, file: !438, line: 185, baseType: !45, size: 8, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !576, file: !438, line: 185, baseType: !584, size: 128, offset: 128)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 128, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 2)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !576, file: !438, line: 185, baseType: !436, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !437, file: !438, line: 378, baseType: !589, size: 384)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !438, line: 187, size: 384, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !589, file: !438, line: 188, baseType: !436, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !589, file: !438, line: 188, baseType: !45, size: 8, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !589, file: !438, line: 188, baseType: !45, size: 8, offset: 72)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !589, file: !438, line: 188, baseType: !388, size: 16, offset: 80)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !589, file: !438, line: 188, baseType: !45, size: 8, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !589, file: !438, line: 189, baseType: !584, size: 128, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !589, file: !438, line: 189, baseType: !436, size: 64, offset: 256)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !589, file: !438, line: 189, baseType: !599, size: 64, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !38, line: 480, size: 576, elements: !601)
!601 = !{!602, !603, !604, !605, !613, !628, !661, !662, !663, !664, !665, !666}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !600, file: !38, line: 481, baseType: !432, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !600, file: !38, line: 482, baseType: !599, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !600, file: !38, line: 483, baseType: !599, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !600, file: !38, line: 484, baseType: !606, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !38, line: 497, size: 256, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !607, file: !38, line: 498, baseType: !606, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !607, file: !38, line: 499, baseType: !606, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !607, file: !38, line: 500, baseType: !599, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !607, file: !38, line: 501, baseType: !22, size: 32, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !600, file: !38, line: 485, baseType: !614, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !38, line: 466, size: 320, elements: !616)
!616 = !{!617, !622, !623, !624, !625, !626, !627}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !615, file: !38, line: 467, baseType: !618, size: 128)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !38, line: 459, size: 128, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !618, file: !38, line: 460, baseType: !45, size: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !618, file: !38, line: 461, baseType: !16, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !615, file: !38, line: 468, baseType: !618, size: 128, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !615, file: !38, line: 469, baseType: !388, size: 16, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !615, file: !38, line: 470, baseType: !45, size: 8, offset: 272)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !615, file: !38, line: 471, baseType: !45, size: 8, offset: 280)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !615, file: !38, line: 472, baseType: !45, size: 8, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !615, file: !38, line: 473, baseType: !45, size: 8, offset: 296)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !600, file: !38, line: 486, baseType: !629, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !38, line: 448, size: 192, elements: !631)
!631 = !{!632, !656, !657, !658, !659, !660}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !630, file: !38, line: 449, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !38, line: 438, size: 64, elements: !634)
!634 = !{!635, !636, !650}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !633, file: !38, line: 439, baseType: !432, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !633, file: !38, line: 440, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !38, line: 419, size: 256, elements: !639)
!639 = !{!640, !646, !647, !648, !649}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !638, file: !38, line: 420, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !15, line: 1049, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!22, !645, !22, !26}
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !15, line: 424, baseType: !26)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !638, file: !38, line: 421, baseType: !26, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !638, file: !38, line: 422, baseType: !432, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !638, file: !38, line: 423, baseType: !45, size: 8, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !638, file: !38, line: 424, baseType: !45, size: 8, offset: 200)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !633, file: !38, line: 441, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !38, line: 429, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !652, file: !38, line: 430, baseType: !432, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !38, line: 431, baseType: !651, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !630, file: !38, line: 450, baseType: !614, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !38, line: 451, baseType: !45, size: 8, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !630, file: !38, line: 452, baseType: !45, size: 8, offset: 136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !630, file: !38, line: 453, baseType: !45, size: 8, offset: 144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !630, file: !38, line: 454, baseType: !45, size: 8, offset: 152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !600, file: !38, line: 487, baseType: !16, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !600, file: !38, line: 488, baseType: !22, size: 32, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !600, file: !38, line: 489, baseType: !388, size: 16, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !600, file: !38, line: 490, baseType: !388, size: 16, offset: 496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !600, file: !38, line: 491, baseType: !45, size: 8, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !600, file: !38, line: 492, baseType: !45, size: 8, offset: 520)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !437, file: !438, line: 379, baseType: !668, size: 384)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !438, line: 192, size: 384, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !668, file: !438, line: 193, baseType: !436, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !668, file: !438, line: 193, baseType: !45, size: 8, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !438, line: 193, baseType: !45, size: 8, offset: 72)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !668, file: !438, line: 193, baseType: !388, size: 16, offset: 80)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !668, file: !438, line: 193, baseType: !45, size: 8, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !668, file: !438, line: 193, baseType: !584, size: 128, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !668, file: !438, line: 193, baseType: !436, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !668, file: !438, line: 193, baseType: !22, size: 32, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !668, file: !438, line: 194, baseType: !22, size: 32, offset: 352)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !437, file: !438, line: 380, baseType: !680, size: 384)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !438, line: 197, size: 384, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !680, file: !438, line: 198, baseType: !436, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !680, file: !438, line: 198, baseType: !45, size: 8, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !680, file: !438, line: 198, baseType: !45, size: 8, offset: 72)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !680, file: !438, line: 198, baseType: !388, size: 16, offset: 80)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !680, file: !438, line: 198, baseType: !45, size: 8, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !680, file: !438, line: 200, baseType: !45, size: 8, offset: 104)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !680, file: !438, line: 201, baseType: !45, size: 8, offset: 112)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !680, file: !438, line: 202, baseType: !584, size: 128, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !680, file: !438, line: 202, baseType: !436, size: 64, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !680, file: !438, line: 202, baseType: !692, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !15, line: 128, baseType: !16)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !437, file: !438, line: 381, baseType: !694, size: 320)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !438, line: 205, size: 320, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !694, file: !438, line: 206, baseType: !436, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !694, file: !438, line: 206, baseType: !45, size: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !438, line: 206, baseType: !45, size: 8, offset: 72)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !694, file: !438, line: 206, baseType: !388, size: 16, offset: 80)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !438, line: 206, baseType: !45, size: 8, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !694, file: !438, line: 206, baseType: !584, size: 128, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !694, file: !438, line: 206, baseType: !436, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !437, file: !438, line: 382, baseType: !704, size: 384)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !438, line: 233, size: 384, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !704, file: !438, line: 234, baseType: !436, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 72)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !704, file: !438, line: 234, baseType: !388, size: 16, offset: 80)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 104)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 112)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 120)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !704, file: !438, line: 234, baseType: !432, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !704, file: !438, line: 234, baseType: !22, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !704, file: !438, line: 234, baseType: !22, size: 32, offset: 224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !704, file: !438, line: 234, baseType: !22, size: 32, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !704, file: !438, line: 234, baseType: !45, size: 8, offset: 296)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !704, file: !438, line: 234, baseType: !436, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !437, file: !438, line: 383, baseType: !722, size: 576)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !438, line: 237, size: 576, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !722, file: !438, line: 238, baseType: !436, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 72)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !722, file: !438, line: 238, baseType: !388, size: 16, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 104)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 112)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 120)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !722, file: !438, line: 238, baseType: !432, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !722, file: !438, line: 238, baseType: !22, size: 32, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !722, file: !438, line: 238, baseType: !22, size: 32, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !722, file: !438, line: 238, baseType: !22, size: 32, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 288)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !722, file: !438, line: 238, baseType: !45, size: 8, offset: 296)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !722, file: !438, line: 238, baseType: !388, size: 16, offset: 304)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !722, file: !438, line: 239, baseType: !436, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !722, file: !438, line: 240, baseType: !405, size: 64, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !722, file: !438, line: 241, baseType: !388, size: 16, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !722, file: !438, line: 242, baseType: !405, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !437, file: !438, line: 384, baseType: !744, size: 384)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !438, line: 262, size: 384, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !744, file: !438, line: 263, baseType: !436, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 72)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !744, file: !438, line: 263, baseType: !388, size: 16, offset: 80)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 104)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 112)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 120)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !438, line: 263, baseType: !432, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !744, file: !438, line: 263, baseType: !22, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !744, file: !438, line: 263, baseType: !22, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !744, file: !438, line: 263, baseType: !22, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 296)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !744, file: !438, line: 263, baseType: !45, size: 8, offset: 304)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !744, file: !438, line: 264, baseType: !436, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !437, file: !438, line: 385, baseType: !763, size: 448)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !438, line: 245, size: 448, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !763, file: !438, line: 246, baseType: !436, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 72)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !763, file: !438, line: 246, baseType: !388, size: 16, offset: 80)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 104)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 120)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !763, file: !438, line: 246, baseType: !432, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !763, file: !438, line: 246, baseType: !22, size: 32, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !763, file: !438, line: 246, baseType: !22, size: 32, offset: 224)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !763, file: !438, line: 246, baseType: !22, size: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !763, file: !438, line: 246, baseType: !45, size: 8, offset: 296)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !763, file: !438, line: 246, baseType: !436, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !763, file: !438, line: 247, baseType: !436, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !437, file: !438, line: 386, baseType: !782, size: 448)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !438, line: 250, size: 448, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !782, file: !438, line: 251, baseType: !436, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 72)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !782, file: !438, line: 251, baseType: !388, size: 16, offset: 80)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 104)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 112)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 120)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !782, file: !438, line: 251, baseType: !432, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !782, file: !438, line: 251, baseType: !22, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !782, file: !438, line: 251, baseType: !22, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !782, file: !438, line: 251, baseType: !22, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 288)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !782, file: !438, line: 251, baseType: !45, size: 8, offset: 296)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !782, file: !438, line: 256, baseType: !436, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !782, file: !438, line: 257, baseType: !436, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !437, file: !438, line: 387, baseType: !801, size: 512)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !438, line: 273, size: 512, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809, !810, !815, !816}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !801, file: !438, line: 274, baseType: !436, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !801, file: !438, line: 274, baseType: !45, size: 8, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !801, file: !438, line: 274, baseType: !45, size: 8, offset: 72)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !801, file: !438, line: 274, baseType: !388, size: 16, offset: 80)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !801, file: !438, line: 274, baseType: !45, size: 8, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !801, file: !438, line: 274, baseType: !432, size: 64, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !801, file: !438, line: 275, baseType: !22, size: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !801, file: !438, line: 276, baseType: !811, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_notify_handler", file: !15, line: 1052, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !645, !22, !26}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !801, file: !438, line: 277, baseType: !26, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !438, line: 278, baseType: !584, size: 128, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !437, file: !438, line: 388, baseType: !818, size: 512)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_addr_handler", file: !438, line: 281, size: 512, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !833, !834, !835, !841, !842}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !818, file: !438, line: 282, baseType: !436, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !818, file: !438, line: 282, baseType: !45, size: 8, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !818, file: !438, line: 282, baseType: !45, size: 8, offset: 72)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !818, file: !438, line: 282, baseType: !388, size: 16, offset: 80)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !818, file: !438, line: 282, baseType: !45, size: 8, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !818, file: !438, line: 282, baseType: !45, size: 8, offset: 104)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "handler_flags", scope: !818, file: !438, line: 283, baseType: !45, size: 8, offset: 112)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !818, file: !438, line: 284, baseType: !828, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_handler", file: !15, line: 1084, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!21, !22, !573, !22, !832, !26, !26}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !818, file: !438, line: 285, baseType: !432, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !818, file: !438, line: 286, baseType: !26, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !818, file: !438, line: 287, baseType: !836, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_setup", file: !15, line: 1102, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DISubroutineType(types: !839)
!839 = !{!21, !645, !22, !26, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "region_list", scope: !818, file: !438, line: 288, baseType: !436, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !438, line: 289, baseType: !436, size: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !437, file: !438, line: 389, baseType: !844, size: 512)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_reference", file: !438, line: 307, size: 512, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !844, file: !438, line: 308, baseType: !436, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !844, file: !438, line: 308, baseType: !45, size: 8, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !844, file: !438, line: 308, baseType: !45, size: 8, offset: 72)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !844, file: !438, line: 308, baseType: !388, size: 16, offset: 80)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !844, file: !438, line: 308, baseType: !45, size: 8, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !844, file: !438, line: 308, baseType: !45, size: 8, offset: 104)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "target_type", scope: !844, file: !438, line: 309, baseType: !45, size: 8, offset: 112)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "resolved", scope: !844, file: !438, line: 310, baseType: !45, size: 8, offset: 120)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !844, file: !438, line: 311, baseType: !26, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !844, file: !438, line: 312, baseType: !432, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "where", scope: !844, file: !438, line: 313, baseType: !494, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "index_pointer", scope: !844, file: !438, line: 314, baseType: !405, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !844, file: !438, line: 315, baseType: !405, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !844, file: !438, line: 316, baseType: !22, size: 32, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !437, file: !438, line: 390, baseType: !861, size: 448)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_extra", file: !438, line: 340, size: 448, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !861, file: !438, line: 341, baseType: !436, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !861, file: !438, line: 341, baseType: !45, size: 8, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !861, file: !438, line: 341, baseType: !45, size: 8, offset: 72)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !861, file: !438, line: 341, baseType: !388, size: 16, offset: 80)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !861, file: !438, line: 341, baseType: !45, size: 8, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "method_REG", scope: !861, file: !438, line: 341, baseType: !432, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "scope_node", scope: !861, file: !438, line: 342, baseType: !432, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "region_context", scope: !861, file: !438, line: 343, baseType: !26, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !861, file: !438, line: 344, baseType: !405, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !861, file: !438, line: 345, baseType: !22, size: 32, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !438, line: 391, baseType: !874, size: 256)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_data", file: !438, line: 350, size: 256, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !886}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !874, file: !438, line: 351, baseType: !436, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !874, file: !438, line: 351, baseType: !45, size: 8, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !438, line: 351, baseType: !45, size: 8, offset: 72)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !874, file: !438, line: 351, baseType: !388, size: 16, offset: 80)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !874, file: !438, line: 351, baseType: !45, size: 8, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !874, file: !438, line: 351, baseType: !882, size: 64, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_object_handler", file: !15, line: 1055, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{null, !645, !26}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !874, file: !438, line: 352, baseType: !26, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !437, file: !438, line: 392, baseType: !888, size: 192)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_cache_list", file: !438, line: 357, size: 192, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !888, file: !438, line: 358, baseType: !436, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !888, file: !438, line: 358, baseType: !45, size: 8, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !888, file: !438, line: 358, baseType: !45, size: 8, offset: 72)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !888, file: !438, line: 358, baseType: !388, size: 16, offset: 80)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !888, file: !438, line: 358, baseType: !45, size: 8, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !888, file: !438, line: 358, baseType: !436, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !437, file: !438, line: 399, baseType: !433, size: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !433, file: !38, line: 135, baseType: !45, size: 8, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !433, file: !38, line: 136, baseType: !45, size: 8, offset: 72)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !433, file: !38, line: 137, baseType: !388, size: 16, offset: 80)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !433, file: !38, line: 138, baseType: !901, size: 32, offset: 96)
!901 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_name_union", file: !902, line: 327, size: 32, elements: !903)
!902 = !DIFile(filename: "./include/acpi/actbl.h", directory: "/home/lizy2001/genbc/linux")
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !901, file: !902, line: 328, baseType: !22, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !901, file: !902, line: 329, baseType: !906, size: 32)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 32, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 4)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !433, file: !38, line: 139, baseType: !432, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !433, file: !38, line: 140, baseType: !432, size: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "peer", scope: !433, file: !38, line: 141, baseType: !432, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !433, file: !38, line: 142, baseType: !395, size: 16, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !423, file: !38, line: 829, baseType: !914, size: 64, offset: 320)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_value", file: !38, line: 716, size: 64, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !914, file: !38, line: 717, baseType: !16, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !914, file: !38, line: 718, baseType: !22, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !914, file: !38, line: 719, baseType: !41, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !914, file: !38, line: 720, baseType: !405, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !38, line: 721, baseType: !41, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !914, file: !38, line: 722, baseType: !419, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !423, file: !38, line: 829, baseType: !45, size: 8, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !420, file: !38, line: 877, baseType: !924, size: 640)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_named", file: !38, line: 835, size: 640, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !924, file: !38, line: 836, baseType: !419, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !924, file: !38, line: 836, baseType: !45, size: 8, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !924, file: !38, line: 836, baseType: !45, size: 8, offset: 72)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !924, file: !38, line: 836, baseType: !388, size: 16, offset: 80)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !924, file: !38, line: 836, baseType: !405, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !38, line: 836, baseType: !419, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !924, file: !38, line: 836, baseType: !432, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !924, file: !38, line: 836, baseType: !914, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !924, file: !38, line: 836, baseType: !45, size: 8, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !924, file: !38, line: 836, baseType: !41, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !924, file: !38, line: 837, baseType: !405, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !924, file: !38, line: 838, baseType: !22, size: 32, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !38, line: 839, baseType: !22, size: 32, offset: 608)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "asl", scope: !420, file: !38, line: 878, baseType: !940, size: 1600)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_asl", file: !38, line: 846, size: 1600, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !940, file: !38, line: 847, baseType: !419, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !940, file: !38, line: 847, baseType: !45, size: 8, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !38, line: 847, baseType: !45, size: 8, offset: 72)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !940, file: !38, line: 847, baseType: !388, size: 16, offset: 80)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !940, file: !38, line: 847, baseType: !405, size: 64, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !940, file: !38, line: 847, baseType: !419, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !940, file: !38, line: 847, baseType: !432, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !940, file: !38, line: 847, baseType: !914, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "arg_list_length", scope: !940, file: !38, line: 847, baseType: !45, size: 8, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !940, file: !38, line: 847, baseType: !419, size: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "parent_method", scope: !940, file: !38, line: 848, baseType: !419, size: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !940, file: !38, line: 849, baseType: !41, size: 64, offset: 576)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "file_changed", scope: !940, file: !38, line: 850, baseType: !45, size: 8, offset: 640)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "parent_filename", scope: !940, file: !38, line: 851, baseType: !41, size: 64, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "external_name", scope: !940, file: !38, line: 852, baseType: !41, size: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "namepath", scope: !940, file: !38, line: 853, baseType: !41, size: 64, offset: 832)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name_seg", scope: !940, file: !38, line: 854, baseType: !906, size: 32, offset: 896)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "extra_value", scope: !940, file: !38, line: 855, baseType: !22, size: 32, offset: 928)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !940, file: !38, line: 856, baseType: !22, size: 32, offset: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "line_number", scope: !940, file: !38, line: 857, baseType: !22, size: 32, offset: 992)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "logical_line_number", scope: !940, file: !38, line: 858, baseType: !22, size: 32, offset: 1024)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "logical_byte_offset", scope: !940, file: !38, line: 859, baseType: !22, size: 32, offset: 1056)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "end_line", scope: !940, file: !38, line: 860, baseType: !22, size: 32, offset: 1088)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "end_logical_line", scope: !940, file: !38, line: 861, baseType: !22, size: 32, offset: 1120)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "acpi_btype", scope: !940, file: !38, line: 862, baseType: !22, size: 32, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !940, file: !38, line: 863, baseType: !22, size: 32, offset: 1184)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "aml_subtree_length", scope: !940, file: !38, line: 864, baseType: !22, size: 32, offset: 1216)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_length", scope: !940, file: !38, line: 865, baseType: !22, size: 32, offset: 1248)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "final_aml_offset", scope: !940, file: !38, line: 866, baseType: !22, size: 32, offset: 1280)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "compile_flags", scope: !940, file: !38, line: 867, baseType: !22, size: 32, offset: 1312)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "parse_opcode", scope: !940, file: !38, line: 868, baseType: !388, size: 16, offset: 1344)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode_length", scope: !940, file: !38, line: 869, baseType: !45, size: 8, offset: 1360)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "aml_pkg_len_bytes", scope: !940, file: !38, line: 870, baseType: !45, size: 8, offset: 1368)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !940, file: !38, line: 871, baseType: !45, size: 8, offset: 1376)
