; ModuleID = '../bcout/drivers/acpi/acpica/utresrc.llvm.bc'
source_filename = "drivers/acpi/acpica/utresrc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.acpi_walk_state = type { %struct.acpi_walk_state*, i8, i8, i16, i8, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8*, i32, i32, i32, i32, %struct.acpi_parse_state, i32, i32, i16, i8, [7 x %struct.acpi_namespace_node], [8 x %struct.acpi_namespace_node], [9 x %union.acpi_operand_object*], %union.acpi_operand_object**, i8*, %union.acpi_operand_object**, %union.acpi_generic_state*, %struct.acpi_namespace_node*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, %union.acpi_parse_object*, %union.acpi_operand_object*, %struct.acpi_namespace_node*, i8*, %union.acpi_parse_object*, %struct.acpi_opcode_info*, %union.acpi_parse_object*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_operand_object*, %union.acpi_generic_state*, %union.acpi_parse_object*, %union.acpi_parse_object*, %struct.acpi_thread_state*, i32 (%struct.acpi_walk_state*, %union.acpi_parse_object**)*, i32 (%struct.acpi_walk_state*)* }
%struct.acpi_parse_state = type { i8*, i8*, i8*, i8*, i8*, %union.acpi_parse_object*, %struct.acpi_namespace_node*, %union.acpi_generic_state*, %union.acpi_parse_object*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "acpi_gbl_resource_aml_sizes", scope: !2, file: !3, line: 19, type: !365, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !356, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/acpi/acpica/utresrc.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !13, !17, !14, !18, !353, !354, !32, !355}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !7, line: 421, baseType: !8)
!7 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !9, line: 21, baseType: !10)
!9 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !11, line: 27, baseType: !12)
!11 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !9, line: 17, baseType: !15)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !11, line: 21, baseType: !16)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "aml_resource", file: !20, line: 478, size: 448, elements: !21)
!20 = !DIFile(filename: "drivers/acpi/acpica/amlresrc.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !23, !27, !35, !41, !47, !52, !56, !65, !71, !78, !82, !87, !97, !110, !115, !125, !133, !146, !159, !172, !188, !199, !216, !230, !247, !264, !276, !290, !304, !315, !328, !342, !350, !351, !352}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !19, file: !20, line: 481, baseType: !14, size: 8)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "small_header", scope: !19, file: !20, line: 482, baseType: !24, size: 8)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_small_header", file: !20, line: 114, size: 8, elements: !25)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !24, file: !20, line: 115, baseType: !14, size: 8)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "large_header", scope: !19, file: !20, line: 483, baseType: !28, size: 24)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_large_header", file: !20, line: 174, size: 24, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !28, file: !20, line: 175, baseType: !14, size: 8)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !28, file: !20, line: 175, baseType: !32, size: 16, offset: 8)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !9, line: 19, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !11, line: 24, baseType: !34)
!34 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !19, file: !20, line: 487, baseType: !36, size: 32)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_irq", file: !20, line: 117, size: 32, elements: !37)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !36, file: !20, line: 118, baseType: !14, size: 8)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "irq_mask", scope: !36, file: !20, line: 118, baseType: !32, size: 16, offset: 8)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !20, line: 119, baseType: !14, size: 8, offset: 24)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !19, file: !20, line: 488, baseType: !42, size: 24)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_dma", file: !20, line: 126, size: 24, elements: !43)
!43 = !{!44, !45, !46}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !42, file: !20, line: 127, baseType: !14, size: 8)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "dma_channel_mask", scope: !42, file: !20, line: 127, baseType: !14, size: 8, offset: 8)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !42, file: !20, line: 128, baseType: !14, size: 8, offset: 16)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "start_dpf", scope: !19, file: !20, line: 489, baseType: !48, size: 16)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_start_dependent", file: !20, line: 131, size: 16, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !48, file: !20, line: 132, baseType: !14, size: 8)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !48, file: !20, line: 132, baseType: !14, size: 8, offset: 8)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "end_dpf", scope: !19, file: !20, line: 490, baseType: !53, size: 8)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_end_dependent", file: !20, line: 138, size: 8, elements: !54)
!54 = !{!55}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !53, file: !20, line: 139, baseType: !14, size: 8)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !19, file: !20, line: 491, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_io", file: !20, line: 141, size: 64, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !57, file: !20, line: 142, baseType: !14, size: 8)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !57, file: !20, line: 142, baseType: !14, size: 8, offset: 8)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !57, file: !20, line: 143, baseType: !32, size: 16, offset: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !57, file: !20, line: 144, baseType: !32, size: 16, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !57, file: !20, line: 145, baseType: !14, size: 8, offset: 48)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !57, file: !20, line: 146, baseType: !14, size: 8, offset: 56)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_io", scope: !19, file: !20, line: 492, baseType: !66, size: 32)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_io", file: !20, line: 149, size: 32, elements: !67)
!67 = !{!68, !69, !70}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !66, file: !20, line: 150, baseType: !14, size: 8)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !66, file: !20, line: 150, baseType: !32, size: 16, offset: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !66, file: !20, line: 151, baseType: !14, size: 8, offset: 24)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_dma", scope: !19, file: !20, line: 493, baseType: !72, size: 48)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_dma", file: !20, line: 161, size: 48, elements: !73)
!73 = !{!74, !75, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !72, file: !20, line: 162, baseType: !14, size: 8)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "request_lines", scope: !72, file: !20, line: 162, baseType: !32, size: 16, offset: 8)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !72, file: !20, line: 163, baseType: !32, size: 16, offset: 24)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !72, file: !20, line: 164, baseType: !14, size: 8, offset: 40)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_small", scope: !19, file: !20, line: 494, baseType: !79, size: 8)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_vendor_small", file: !20, line: 154, size: 8, elements: !80)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !79, file: !20, line: 155, baseType: !14, size: 8)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "end_tag", scope: !19, file: !20, line: 495, baseType: !83, size: 16)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_end_tag", file: !20, line: 157, size: 16, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !83, file: !20, line: 158, baseType: !14, size: 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !83, file: !20, line: 158, baseType: !14, size: 8, offset: 8)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "memory24", scope: !19, file: !20, line: 499, baseType: !88, size: 96)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_memory24", file: !20, line: 183, size: 96, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !88, file: !20, line: 184, baseType: !14, size: 8)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !88, file: !20, line: 184, baseType: !32, size: 16, offset: 8)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !88, file: !20, line: 184, baseType: !14, size: 8, offset: 24)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !88, file: !20, line: 185, baseType: !32, size: 16, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !88, file: !20, line: 186, baseType: !32, size: 16, offset: 48)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !88, file: !20, line: 187, baseType: !32, size: 16, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !88, file: !20, line: 188, baseType: !32, size: 16, offset: 80)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "generic_reg", scope: !19, file: !20, line: 500, baseType: !98, size: 120)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_generic_register", file: !20, line: 264, size: 120, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !98, file: !20, line: 265, baseType: !14, size: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !98, file: !20, line: 265, baseType: !32, size: 16, offset: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "address_space_id", scope: !98, file: !20, line: 265, baseType: !14, size: 8, offset: 24)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bit_width", scope: !98, file: !20, line: 266, baseType: !14, size: 8, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !98, file: !20, line: 267, baseType: !14, size: 8, offset: 40)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "access_size", scope: !98, file: !20, line: 268, baseType: !14, size: 8, offset: 48)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !98, file: !20, line: 269, baseType: !107, size: 64, offset: 56)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !9, line: 23, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !11, line: 31, baseType: !109)
!109 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_large", scope: !19, file: !20, line: 501, baseType: !111, size: 24)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_vendor_large", file: !20, line: 191, size: 24, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !111, file: !20, line: 192, baseType: !14, size: 8)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !111, file: !20, line: 192, baseType: !32, size: 16, offset: 8)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "memory32", scope: !19, file: !20, line: 502, baseType: !116, size: 160)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_memory32", file: !20, line: 194, size: 160, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !116, file: !20, line: 195, baseType: !14, size: 8)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !116, file: !20, line: 195, baseType: !32, size: 16, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !116, file: !20, line: 195, baseType: !14, size: 8, offset: 24)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !116, file: !20, line: 196, baseType: !8, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !116, file: !20, line: 197, baseType: !8, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !116, file: !20, line: 198, baseType: !8, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !116, file: !20, line: 199, baseType: !8, size: 32, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_memory32", scope: !19, file: !20, line: 503, baseType: !126, size: 96)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_fixed_memory32", file: !20, line: 202, size: 96, elements: !127)
!127 = !{!128, !129, !130, !131, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !126, file: !20, line: 203, baseType: !14, size: 8)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !126, file: !20, line: 203, baseType: !32, size: 16, offset: 8)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !20, line: 203, baseType: !14, size: 8, offset: 24)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !126, file: !20, line: 204, baseType: !8, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !126, file: !20, line: 205, baseType: !8, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "address16", scope: !19, file: !20, line: 504, baseType: !134, size: 128)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address16", file: !20, line: 248, size: 128, elements: !135)
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !134, file: !20, line: 249, baseType: !14, size: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !134, file: !20, line: 249, baseType: !32, size: 16, offset: 8)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !134, file: !20, line: 250, baseType: !14, size: 8, offset: 24)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !134, file: !20, line: 250, baseType: !14, size: 8, offset: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !134, file: !20, line: 250, baseType: !14, size: 8, offset: 40)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !134, file: !20, line: 250, baseType: !32, size: 16, offset: 48)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !134, file: !20, line: 251, baseType: !32, size: 16, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !134, file: !20, line: 252, baseType: !32, size: 16, offset: 80)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !134, file: !20, line: 253, baseType: !32, size: 16, offset: 96)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !134, file: !20, line: 254, baseType: !32, size: 16, offset: 112)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "address32", scope: !19, file: !20, line: 505, baseType: !147, size: 208)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address32", file: !20, line: 239, size: 208, elements: !148)
!148 = !{!149, !150, !151, !152, !153, !154, !155, !156, !157, !158}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !147, file: !20, line: 240, baseType: !14, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !147, file: !20, line: 240, baseType: !32, size: 16, offset: 8)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !147, file: !20, line: 241, baseType: !14, size: 8, offset: 24)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !147, file: !20, line: 241, baseType: !14, size: 8, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !147, file: !20, line: 241, baseType: !14, size: 8, offset: 40)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !147, file: !20, line: 241, baseType: !8, size: 32, offset: 48)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !147, file: !20, line: 242, baseType: !8, size: 32, offset: 80)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !147, file: !20, line: 243, baseType: !8, size: 32, offset: 112)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !147, file: !20, line: 244, baseType: !8, size: 32, offset: 144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !147, file: !20, line: 245, baseType: !8, size: 32, offset: 176)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "address64", scope: !19, file: !20, line: 506, baseType: !160, size: 368)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address64", file: !20, line: 230, size: 368, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !160, file: !20, line: 231, baseType: !14, size: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !160, file: !20, line: 231, baseType: !32, size: 16, offset: 8)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !160, file: !20, line: 232, baseType: !14, size: 8, offset: 24)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !160, file: !20, line: 232, baseType: !14, size: 8, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !160, file: !20, line: 232, baseType: !14, size: 8, offset: 40)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !160, file: !20, line: 232, baseType: !107, size: 64, offset: 48)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !160, file: !20, line: 233, baseType: !107, size: 64, offset: 112)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !160, file: !20, line: 234, baseType: !107, size: 64, offset: 176)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !160, file: !20, line: 235, baseType: !107, size: 64, offset: 240)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !160, file: !20, line: 236, baseType: !107, size: 64, offset: 304)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ext_address64", scope: !19, file: !20, line: 507, baseType: !173, size: 448)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_extended_address64", file: !20, line: 216, size: 448, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !173, file: !20, line: 217, baseType: !14, size: 8)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !173, file: !20, line: 217, baseType: !32, size: 16, offset: 8)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !173, file: !20, line: 218, baseType: !14, size: 8, offset: 24)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !173, file: !20, line: 218, baseType: !14, size: 8, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !173, file: !20, line: 218, baseType: !14, size: 8, offset: 40)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "revision_ID", scope: !173, file: !20, line: 218, baseType: !14, size: 8, offset: 48)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !173, file: !20, line: 219, baseType: !14, size: 8, offset: 56)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "granularity", scope: !173, file: !20, line: 220, baseType: !107, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !173, file: !20, line: 221, baseType: !107, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !173, file: !20, line: 222, baseType: !107, size: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "translation_offset", scope: !173, file: !20, line: 223, baseType: !107, size: 64, offset: 256)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "address_length", scope: !173, file: !20, line: 224, baseType: !107, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific", scope: !173, file: !20, line: 225, baseType: !107, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "extended_irq", scope: !19, file: !20, line: 508, baseType: !189, size: 72)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_extended_irq", file: !20, line: 257, size: 72, elements: !190)
!190 = !{!191, !192, !193, !194, !195}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !189, file: !20, line: 258, baseType: !14, size: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !189, file: !20, line: 258, baseType: !32, size: 16, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !20, line: 258, baseType: !14, size: 8, offset: 24)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !189, file: !20, line: 259, baseType: !14, size: 8, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "interrupts", scope: !189, file: !20, line: 260, baseType: !196, size: 32, offset: 40)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "gpio", scope: !19, file: !20, line: 509, baseType: !200, size: 184)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_gpio", file: !20, line: 274, size: 184, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !200, file: !20, line: 275, baseType: !14, size: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !200, file: !20, line: 275, baseType: !32, size: 16, offset: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !200, file: !20, line: 275, baseType: !14, size: 8, offset: 24)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "connection_type", scope: !200, file: !20, line: 276, baseType: !14, size: 8, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !200, file: !20, line: 277, baseType: !32, size: 16, offset: 40)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "int_flags", scope: !200, file: !20, line: 278, baseType: !32, size: 16, offset: 56)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !200, file: !20, line: 279, baseType: !14, size: 8, offset: 72)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "drive_strength", scope: !200, file: !20, line: 280, baseType: !32, size: 16, offset: 80)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_timeout", scope: !200, file: !20, line: 281, baseType: !32, size: 16, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !200, file: !20, line: 282, baseType: !32, size: 16, offset: 112)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !200, file: !20, line: 283, baseType: !14, size: 8, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !200, file: !20, line: 284, baseType: !32, size: 16, offset: 136)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !200, file: !20, line: 285, baseType: !32, size: 16, offset: 152)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !200, file: !20, line: 286, baseType: !32, size: 16, offset: 168)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i2c_serial_bus", scope: !19, file: !20, line: 510, baseType: !217, size: 144)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_i2c_serialbus", file: !20, line: 325, size: 144, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !217, file: !20, line: 326, baseType: !14, size: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !217, file: !20, line: 326, baseType: !32, size: 16, offset: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !217, file: !20, line: 327, baseType: !14, size: 8, offset: 24)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !217, file: !20, line: 327, baseType: !14, size: 8, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !20, line: 327, baseType: !14, size: 8, offset: 40)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !217, file: !20, line: 327, baseType: !14, size: 8, offset: 48)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !217, file: !20, line: 327, baseType: !32, size: 16, offset: 56)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !217, file: !20, line: 327, baseType: !14, size: 8, offset: 72)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !217, file: !20, line: 327, baseType: !32, size: 16, offset: 80)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !217, file: !20, line: 327, baseType: !8, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "slave_address", scope: !217, file: !20, line: 328, baseType: !32, size: 16, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "spi_serial_bus", scope: !19, file: !20, line: 511, baseType: !231, size: 168)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_spi_serialbus", file: !20, line: 340, size: 168, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !231, file: !20, line: 341, baseType: !14, size: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !231, file: !20, line: 341, baseType: !32, size: 16, offset: 8)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !231, file: !20, line: 342, baseType: !14, size: 8, offset: 24)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !231, file: !20, line: 342, baseType: !14, size: 8, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !20, line: 342, baseType: !14, size: 8, offset: 40)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !231, file: !20, line: 342, baseType: !14, size: 8, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !231, file: !20, line: 342, baseType: !32, size: 16, offset: 56)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !231, file: !20, line: 342, baseType: !14, size: 8, offset: 72)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !231, file: !20, line: 342, baseType: !32, size: 16, offset: 80)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "connection_speed", scope: !231, file: !20, line: 342, baseType: !8, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_length", scope: !231, file: !20, line: 343, baseType: !14, size: 8, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "clock_phase", scope: !231, file: !20, line: 344, baseType: !14, size: 8, offset: 136)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "clock_polarity", scope: !231, file: !20, line: 345, baseType: !14, size: 8, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "device_selection", scope: !231, file: !20, line: 346, baseType: !32, size: 16, offset: 152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "uart_serial_bus", scope: !19, file: !20, line: 512, baseType: !248, size: 176)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_uart_serialbus", file: !20, line: 358, size: 176, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !248, file: !20, line: 359, baseType: !14, size: 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !248, file: !20, line: 359, baseType: !32, size: 16, offset: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !248, file: !20, line: 360, baseType: !14, size: 8, offset: 24)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !248, file: !20, line: 360, baseType: !14, size: 8, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !248, file: !20, line: 360, baseType: !14, size: 8, offset: 40)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !248, file: !20, line: 360, baseType: !14, size: 8, offset: 48)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !248, file: !20, line: 360, baseType: !32, size: 16, offset: 56)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !248, file: !20, line: 360, baseType: !14, size: 8, offset: 72)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !248, file: !20, line: 360, baseType: !32, size: 16, offset: 80)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "default_baud_rate", scope: !248, file: !20, line: 360, baseType: !8, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !248, file: !20, line: 361, baseType: !32, size: 16, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !248, file: !20, line: 362, baseType: !32, size: 16, offset: 144)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !248, file: !20, line: 363, baseType: !14, size: 8, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "lines_enabled", scope: !248, file: !20, line: 364, baseType: !14, size: 8, offset: 168)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "common_serial_bus", scope: !19, file: !20, line: 513, baseType: !265, size: 96)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_common_serialbus", file: !20, line: 322, size: 96, elements: !266)
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !265, file: !20, line: 323, baseType: !14, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !265, file: !20, line: 323, baseType: !32, size: 16, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !265, file: !20, line: 323, baseType: !14, size: 8, offset: 24)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !265, file: !20, line: 323, baseType: !14, size: 8, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !20, line: 323, baseType: !14, size: 8, offset: 40)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !20, line: 323, baseType: !14, size: 8, offset: 48)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "type_specific_flags", scope: !265, file: !20, line: 323, baseType: !32, size: 16, offset: 56)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type_revision_id", scope: !265, file: !20, line: 323, baseType: !14, size: 8, offset: 72)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "type_data_length", scope: !265, file: !20, line: 323, baseType: !32, size: 16, offset: 80)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pin_function", scope: !19, file: !20, line: 514, baseType: !277, size: 144)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_function", file: !20, line: 376, size: 144, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !277, file: !20, line: 377, baseType: !14, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !277, file: !20, line: 377, baseType: !32, size: 16, offset: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !277, file: !20, line: 377, baseType: !14, size: 8, offset: 24)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !277, file: !20, line: 378, baseType: !32, size: 16, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !277, file: !20, line: 379, baseType: !14, size: 8, offset: 48)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !277, file: !20, line: 380, baseType: !32, size: 16, offset: 56)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !277, file: !20, line: 381, baseType: !32, size: 16, offset: 72)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !277, file: !20, line: 382, baseType: !14, size: 8, offset: 88)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !277, file: !20, line: 383, baseType: !32, size: 16, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !277, file: !20, line: 384, baseType: !32, size: 16, offset: 112)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !277, file: !20, line: 385, baseType: !32, size: 16, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config", scope: !19, file: !20, line: 515, baseType: !291, size: 160)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_config", file: !20, line: 396, size: 160, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !291, file: !20, line: 397, baseType: !14, size: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !291, file: !20, line: 397, baseType: !32, size: 16, offset: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !291, file: !20, line: 397, baseType: !14, size: 8, offset: 24)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !291, file: !20, line: 398, baseType: !32, size: 16, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !291, file: !20, line: 399, baseType: !14, size: 8, offset: 48)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !291, file: !20, line: 400, baseType: !8, size: 32, offset: 56)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !291, file: !20, line: 401, baseType: !32, size: 16, offset: 88)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !291, file: !20, line: 402, baseType: !14, size: 8, offset: 104)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !291, file: !20, line: 403, baseType: !32, size: 16, offset: 112)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !291, file: !20, line: 404, baseType: !32, size: 16, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !291, file: !20, line: 405, baseType: !32, size: 16, offset: 144)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group", scope: !19, file: !20, line: 516, baseType: !305, size: 112)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_group", file: !20, line: 416, size: 112, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !305, file: !20, line: 417, baseType: !14, size: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !305, file: !20, line: 417, baseType: !32, size: 16, offset: 8)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !305, file: !20, line: 417, baseType: !14, size: 8, offset: 24)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !305, file: !20, line: 418, baseType: !32, size: 16, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pin_table_offset", scope: !305, file: !20, line: 419, baseType: !32, size: 16, offset: 48)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "label_offset", scope: !305, file: !20, line: 420, baseType: !32, size: 16, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !305, file: !20, line: 421, baseType: !32, size: 16, offset: 80)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !305, file: !20, line: 422, baseType: !32, size: 16, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_function", scope: !19, file: !20, line: 517, baseType: !316, size: 136)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_group_function", file: !20, line: 433, size: 136, elements: !317)
!317 = !{!318, !319, !320, !321, !322, !323, !324, !325, !326, !327}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !316, file: !20, line: 434, baseType: !14, size: 8)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !316, file: !20, line: 434, baseType: !32, size: 16, offset: 8)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !316, file: !20, line: 434, baseType: !14, size: 8, offset: 24)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !316, file: !20, line: 435, baseType: !32, size: 16, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "function_number", scope: !316, file: !20, line: 436, baseType: !32, size: 16, offset: 48)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !316, file: !20, line: 437, baseType: !14, size: 8, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !316, file: !20, line: 438, baseType: !32, size: 16, offset: 72)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_label_offset", scope: !316, file: !20, line: 439, baseType: !32, size: 16, offset: 88)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !316, file: !20, line: 440, baseType: !32, size: 16, offset: 104)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !316, file: !20, line: 441, baseType: !32, size: 16, offset: 120)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pin_group_config", scope: !19, file: !20, line: 518, baseType: !329, size: 160)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_pin_group_config", file: !20, line: 452, size: 160, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !329, file: !20, line: 453, baseType: !14, size: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !329, file: !20, line: 453, baseType: !32, size: 16, offset: 8)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "revision_id", scope: !329, file: !20, line: 453, baseType: !14, size: 8, offset: 24)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !329, file: !20, line: 454, baseType: !32, size: 16, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_type", scope: !329, file: !20, line: 455, baseType: !14, size: 8, offset: 48)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pin_config_value", scope: !329, file: !20, line: 456, baseType: !8, size: 32, offset: 56)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_index", scope: !329, file: !20, line: 457, baseType: !14, size: 8, offset: 88)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_offset", scope: !329, file: !20, line: 458, baseType: !32, size: 16, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "res_source_label_offset", scope: !329, file: !20, line: 459, baseType: !32, size: 16, offset: 112)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_offset", scope: !329, file: !20, line: 460, baseType: !32, size: 16, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vendor_length", scope: !329, file: !20, line: 461, baseType: !32, size: 16, offset: 144)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !19, file: !20, line: 522, baseType: !343, size: 48)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "aml_resource_address", file: !20, line: 213, size: 48, elements: !344)
!344 = !{!345, !346, !347, !348, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !343, file: !20, line: 214, baseType: !14, size: 8)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !343, file: !20, line: 214, baseType: !32, size: 16, offset: 8)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "resource_type", scope: !343, file: !20, line: 214, baseType: !14, size: 8, offset: 24)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !343, file: !20, line: 214, baseType: !14, size: 8, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "specific_flags", scope: !343, file: !20, line: 214, baseType: !14, size: 8, offset: 40)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dword_item", scope: !19, file: !20, line: 523, baseType: !8, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "word_item", scope: !19, file: !20, line: 524, baseType: !32, size: 16)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "byte_item", scope: !19, file: !20, line: 525, baseType: !14, size: 8)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !7, line: 127, baseType: !107)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!356 = !{!0, !357, !363, !368}
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "acpi_gbl_resource_aml_serial_bus_sizes", scope: !2, file: !3, line: 62, type: !359, isLocal: false, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 32, elements: !361)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!361 = !{!362}
!362 = !DISubrange(count: 4)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "acpi_gbl_resource_types", scope: !2, file: !3, line: 75, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 280, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 35)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "_acpi_module_name", scope: !2, file: !3, line: 13, type: !370, isLocal: true, isDefinition: true)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 64, elements: !373)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!373 = !{!374}
!374 = !DISubrange(count: 8)
!375 = !{i32 7, !"Dwarf Version", i32 4}
!376 = !{i32 2, !"Debug Info Version", i32 3}
!377 = !{i32 1, !"wchar_size", i32 2}
!378 = !{i32 1, !"Code Model", i32 2}
!379 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!380 = distinct !DISubprogram(name: "acpi_ut_walk_aml_resources", scope: !3, file: !3, line: 137, type: !381, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!381 = !DISubroutineType(types: !382)
!382 = !{!6, !383, !13, !354, !1134, !355}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_walk_state", file: !385, line: 37, size: 9024, elements: !386)
!385 = !DIFile(filename: "drivers/acpi/acpica/acstruct.h", directory: "/home/lizy2001/genbc/linux")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !1081, !1082, !1083, !1084, !1085, !1089, !1091, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1132}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !385, line: 38, baseType: !383, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !384, file: !385, line: 39, baseType: !14, size: 8, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "walk_type", scope: !384, file: !385, line: 40, baseType: !14, size: 8, offset: 72)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !384, file: !385, line: 41, baseType: !32, size: 16, offset: 80)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next_op_info", scope: !384, file: !385, line: 42, baseType: !14, size: 8, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_operands", scope: !384, file: !385, line: 43, baseType: !14, size: 8, offset: 104)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "operand_index", scope: !384, file: !385, line: 44, baseType: !14, size: 8, offset: 112)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !384, file: !385, line: 45, baseType: !395, size: 16, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_owner_id", file: !7, line: 445, baseType: !32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_predicate", scope: !384, file: !385, line: 46, baseType: !14, size: 8, offset: 144)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "current_result", scope: !384, file: !385, line: 47, baseType: !14, size: 8, offset: 152)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "return_used", scope: !384, file: !385, line: 48, baseType: !14, size: 8, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "scope_depth", scope: !384, file: !385, line: 49, baseType: !14, size: 8, offset: 168)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pass_number", scope: !384, file: !385, line: 50, baseType: !14, size: 8, offset: 176)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "namespace_override", scope: !384, file: !385, line: 51, baseType: !14, size: 8, offset: 184)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "result_size", scope: !384, file: !385, line: 52, baseType: !14, size: 8, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "result_count", scope: !384, file: !385, line: 53, baseType: !14, size: 8, offset: 200)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !384, file: !385, line: 54, baseType: !13, size: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "arg_types", scope: !384, file: !385, line: 55, baseType: !8, size: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "method_breakpoint", scope: !384, file: !385, line: 56, baseType: !8, size: 32, offset: 352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "user_breakpoint", scope: !384, file: !385, line: 57, baseType: !8, size: 32, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "parse_flags", scope: !384, file: !385, line: 58, baseType: !8, size: 32, offset: 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "parser_state", scope: !384, file: !385, line: 60, baseType: !410, size: 640, offset: 448)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_state", file: !411, line: 893, size: 640, elements: !412)
!411 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!412 = !{!413, !414, !415, !416, !417, !418, !980, !981, !1079, !1080}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !410, file: !411, line: 894, baseType: !13, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !410, file: !411, line: 895, baseType: !13, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "aml_end", scope: !410, file: !411, line: 896, baseType: !13, size: 64, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_start", scope: !410, file: !411, line: 897, baseType: !13, size: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_end", scope: !410, file: !411, line: 898, baseType: !13, size: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "start_op", scope: !410, file: !411, line: 899, baseType: !419, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_parse_object", file: !411, line: 875, size: 1600, elements: !421)
!421 = !{!422, !923, !939}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !420, file: !411, line: 876, baseType: !423, size: 448)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_parse_obj_common", file: !411, line: 828, size: 448, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !913, !922}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !423, file: !411, line: 829, baseType: !419, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !423, file: !411, line: 829, baseType: !14, size: 8, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !423, file: !411, line: 829, baseType: !14, size: 8, offset: 72)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "aml_opcode", scope: !423, file: !411, line: 829, baseType: !32, size: 16, offset: 80)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "aml", scope: !423, file: !411, line: 829, baseType: !13, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !423, file: !411, line: 829, baseType: !419, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !423, file: !411, line: 829, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_namespace_node", file: !411, line: 133, size: 384, elements: !434)
!434 = !{!435, !899, !900, !901, !902, !909, !910, !911, !912}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !433, file: !411, line: 134, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_operand_object", file: !438, line: 367, size: 576, elements: !439)
!438 = !DIFile(filename: "drivers/acpi/acpica/acobject.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440, !448, !461, !472, !485, !499, !508, !534, !563, !578, !591, !670, !682, !696, !706, !724, !746, !765, !784, !803, !820, !845, !862, !875, !889, !898}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !437, file: !438, line: 368, baseType: !441, size: 128)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_common", file: !438, line: 73, size: 128, elements: !442)
!442 = !{!443, !444, !445, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !441, file: !438, line: 74, baseType: !436, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !441, file: !438, line: 74, baseType: !14, size: 8, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !438, line: 74, baseType: !14, size: 8, offset: 72)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !441, file: !438, line: 74, baseType: !32, size: 16, offset: 80)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !441, file: !438, line: 74, baseType: !14, size: 8, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !437, file: !438, line: 369, baseType: !449, size: 192)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_integer", file: !438, line: 76, size: 192, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !460}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !449, file: !438, line: 77, baseType: !436, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !449, file: !438, line: 77, baseType: !14, size: 8, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !438, line: 77, baseType: !14, size: 8, offset: 72)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !449, file: !438, line: 77, baseType: !32, size: 16, offset: 80)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !449, file: !438, line: 77, baseType: !14, size: 8, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !449, file: !438, line: 77, baseType: !457, size: 24, offset: 104)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 24, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 3)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !449, file: !438, line: 78, baseType: !107, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !437, file: !438, line: 370, baseType: !462, size: 256)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_string", file: !438, line: 93, size: 256, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !471}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !462, file: !438, line: 94, baseType: !436, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !462, file: !438, line: 94, baseType: !14, size: 8, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !438, line: 94, baseType: !14, size: 8, offset: 72)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !462, file: !438, line: 94, baseType: !32, size: 16, offset: 80)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !462, file: !438, line: 94, baseType: !14, size: 8, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !462, file: !438, line: 94, baseType: !470, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !462, file: !438, line: 94, baseType: !8, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !437, file: !438, line: 371, baseType: !473, size: 384)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer", file: !438, line: 97, size: 384, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !473, file: !438, line: 98, baseType: !436, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !473, file: !438, line: 98, baseType: !14, size: 8, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !473, file: !438, line: 98, baseType: !14, size: 8, offset: 72)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !473, file: !438, line: 98, baseType: !32, size: 16, offset: 80)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !473, file: !438, line: 98, baseType: !14, size: 8, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !473, file: !438, line: 98, baseType: !13, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !473, file: !438, line: 98, baseType: !8, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !473, file: !438, line: 99, baseType: !8, size: 32, offset: 224)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !473, file: !438, line: 100, baseType: !13, size: 64, offset: 256)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !438, line: 101, baseType: !432, size: 64, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "package", scope: !437, file: !438, line: 372, baseType: !486, size: 384)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_package", file: !438, line: 104, size: 384, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !496, !497, !498}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !486, file: !438, line: 105, baseType: !436, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !486, file: !438, line: 105, baseType: !14, size: 8, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !438, line: 105, baseType: !14, size: 8, offset: 72)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !486, file: !438, line: 105, baseType: !32, size: 16, offset: 80)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !486, file: !438, line: 105, baseType: !14, size: 8, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !486, file: !438, line: 105, baseType: !432, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !486, file: !438, line: 106, baseType: !495, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !486, file: !438, line: 107, baseType: !13, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !486, file: !438, line: 108, baseType: !8, size: 32, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !486, file: !438, line: 109, baseType: !8, size: 32, offset: 352)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "event", scope: !437, file: !438, line: 373, baseType: !500, size: 192)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_event", file: !438, line: 118, size: 192, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !500, file: !438, line: 119, baseType: !436, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !500, file: !438, line: 119, baseType: !14, size: 8, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !438, line: 119, baseType: !14, size: 8, offset: 72)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !500, file: !438, line: 119, baseType: !32, size: 16, offset: 80)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !500, file: !438, line: 119, baseType: !14, size: 8, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "os_semaphore", scope: !500, file: !438, line: 119, baseType: !17, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !437, file: !438, line: 374, baseType: !509, size: 448)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_method", file: !438, line: 143, size: 448, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !531, !532, !533}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !509, file: !438, line: 144, baseType: !436, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !509, file: !438, line: 144, baseType: !14, size: 8, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !509, file: !438, line: 144, baseType: !14, size: 8, offset: 72)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !509, file: !438, line: 144, baseType: !32, size: 16, offset: 80)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !438, line: 144, baseType: !14, size: 8, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "info_flags", scope: !509, file: !438, line: 144, baseType: !14, size: 8, offset: 104)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "param_count", scope: !509, file: !438, line: 145, baseType: !14, size: 8, offset: 112)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !509, file: !438, line: 146, baseType: !14, size: 8, offset: 120)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !509, file: !438, line: 147, baseType: !436, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !509, file: !438, line: 148, baseType: !436, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "aml_start", scope: !509, file: !438, line: 149, baseType: !13, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !509, file: !438, line: 153, baseType: !523, size: 64, offset: 320)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !509, file: !438, line: 150, size: 64, elements: !524)
!524 = !{!525, !530}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "implementation", scope: !523, file: !438, line: 151, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_internal_method", file: !411, line: 248, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DISubroutineType(types: !529)
!529 = !{!6, !383}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !523, file: !438, line: 152, baseType: !436, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "aml_length", scope: !509, file: !438, line: 155, baseType: !8, size: 32, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "owner_id", scope: !509, file: !438, line: 156, baseType: !395, size: 16, offset: 416)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !509, file: !438, line: 157, baseType: !14, size: 8, offset: 432)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !437, file: !438, line: 375, baseType: !535, size: 576)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_mutex", file: !438, line: 122, size: 576, elements: !536)
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !559, !560, !561, !562}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !535, file: !438, line: 123, baseType: !436, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !535, file: !438, line: 123, baseType: !14, size: 8, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !535, file: !438, line: 123, baseType: !14, size: 8, offset: 72)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !535, file: !438, line: 123, baseType: !32, size: 16, offset: 80)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !438, line: 123, baseType: !14, size: 8, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !535, file: !438, line: 123, baseType: !14, size: 8, offset: 104)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "acquisition_depth", scope: !535, file: !438, line: 124, baseType: !32, size: 16, offset: 112)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "os_mutex", scope: !535, file: !438, line: 125, baseType: !17, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !535, file: !438, line: 126, baseType: !107, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "owner_thread", scope: !535, file: !438, line: 127, baseType: !547, size: 64, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_thread_state", file: !411, line: 620, size: 320, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !411, line: 621, baseType: !17, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !548, file: !411, line: 621, baseType: !14, size: 8, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !548, file: !411, line: 621, baseType: !14, size: 8, offset: 72)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !548, file: !411, line: 621, baseType: !32, size: 16, offset: 80)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !548, file: !411, line: 621, baseType: !32, size: 16, offset: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "current_sync_level", scope: !548, file: !411, line: 621, baseType: !14, size: 8, offset: 112)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "walk_state_list", scope: !548, file: !411, line: 622, baseType: !383, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "acquired_mutex_list", scope: !548, file: !411, line: 623, baseType: !436, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "thread_id", scope: !548, file: !411, line: 624, baseType: !107, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !535, file: !438, line: 128, baseType: !436, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !438, line: 129, baseType: !436, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !535, file: !438, line: 130, baseType: !432, size: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "original_sync_level", scope: !535, file: !438, line: 131, baseType: !14, size: 8, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !437, file: !438, line: 376, baseType: !564, size: 448)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region", file: !438, line: 134, size: 448, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !577}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !564, file: !438, line: 135, baseType: !436, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !564, file: !438, line: 135, baseType: !14, size: 8, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !564, file: !438, line: 135, baseType: !14, size: 8, offset: 72)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !564, file: !438, line: 135, baseType: !32, size: 16, offset: 80)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !564, file: !438, line: 135, baseType: !14, size: 8, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !564, file: !438, line: 135, baseType: !14, size: 8, offset: 104)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !564, file: !438, line: 136, baseType: !432, size: 64, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !564, file: !438, line: 137, baseType: !436, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !438, line: 138, baseType: !436, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !564, file: !438, line: 139, baseType: !576, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !7, line: 129, baseType: !107)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !564, file: !438, line: 140, baseType: !8, size: 32, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "common_notify", scope: !437, file: !438, line: 377, baseType: !579, size: 320)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_common", file: !438, line: 184, size: 320, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !590}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !579, file: !438, line: 185, baseType: !436, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !579, file: !438, line: 185, baseType: !14, size: 8, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !438, line: 185, baseType: !14, size: 8, offset: 72)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !579, file: !438, line: 185, baseType: !32, size: 16, offset: 80)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !438, line: 185, baseType: !14, size: 8, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !579, file: !438, line: 185, baseType: !587, size: 128, offset: 128)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 128, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 2)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !579, file: !438, line: 185, baseType: !436, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !437, file: !438, line: 378, baseType: !592, size: 384)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_device", file: !438, line: 187, size: 384, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !592, file: !438, line: 188, baseType: !436, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !592, file: !438, line: 188, baseType: !14, size: 8, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !438, line: 188, baseType: !14, size: 8, offset: 72)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !592, file: !438, line: 188, baseType: !32, size: 16, offset: 80)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !592, file: !438, line: 188, baseType: !14, size: 8, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !592, file: !438, line: 189, baseType: !587, size: 128, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !592, file: !438, line: 189, baseType: !436, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block", scope: !592, file: !438, line: 189, baseType: !602, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_block_info", file: !411, line: 480, size: 576, elements: !604)
!604 = !{!605, !606, !607, !608, !616, !631, !664, !665, !666, !667, !668, !669}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !603, file: !411, line: 481, baseType: !432, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !603, file: !411, line: 482, baseType: !602, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !603, file: !411, line: 483, baseType: !602, size: 64, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "xrupt_block", scope: !603, file: !411, line: 484, baseType: !609, size: 64, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_xrupt_info", file: !411, line: 497, size: 256, elements: !611)
!611 = !{!612, !613, !614, !615}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !610, file: !411, line: 498, baseType: !609, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !411, line: 499, baseType: !609, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_block_list_head", scope: !610, file: !411, line: 500, baseType: !602, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_number", scope: !610, file: !411, line: 501, baseType: !8, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !603, file: !411, line: 485, baseType: !617, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_register_info", file: !411, line: 466, size: 320, elements: !619)
!619 = !{!620, !625, !626, !627, !628, !629, !630}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "status_address", scope: !618, file: !411, line: 467, baseType: !621, size: 128)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_address", file: !411, line: 459, size: 128, elements: !622)
!622 = !{!623, !624}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !621, file: !411, line: 460, baseType: !14, size: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !621, file: !411, line: 461, baseType: !107, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "enable_address", scope: !618, file: !411, line: 468, baseType: !621, size: 128, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "base_gpe_number", scope: !618, file: !411, line: 469, baseType: !32, size: 16, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_wake", scope: !618, file: !411, line: 470, baseType: !14, size: 8, offset: 272)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "enable_for_run", scope: !618, file: !411, line: 471, baseType: !14, size: 8, offset: 280)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mask_for_run", scope: !618, file: !411, line: 472, baseType: !14, size: 8, offset: 288)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "enable_mask", scope: !618, file: !411, line: 473, baseType: !14, size: 8, offset: 296)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "event_info", scope: !603, file: !411, line: 486, baseType: !632, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_event_info", file: !411, line: 448, size: 192, elements: !634)
!634 = !{!635, !659, !660, !661, !662, !663}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dispatch", scope: !633, file: !411, line: 449, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "acpi_gpe_dispatch_info", file: !411, line: 438, size: 64, elements: !637)
!637 = !{!638, !639, !653}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !636, file: !411, line: 439, baseType: !432, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !636, file: !411, line: 440, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_handler_info", file: !411, line: 419, size: 256, elements: !642)
!642 = !{!643, !649, !650, !651, !652}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !641, file: !411, line: 420, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_gpe_handler", file: !7, line: 1049, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!8, !648, !8, !17}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_handle", file: !7, line: 424, baseType: !17)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !641, file: !411, line: 421, baseType: !17, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "method_node", scope: !641, file: !411, line: 422, baseType: !432, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "original_flags", scope: !641, file: !411, line: 423, baseType: !14, size: 8, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "originally_enabled", scope: !641, file: !411, line: 424, baseType: !14, size: 8, offset: 200)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !636, file: !411, line: 441, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_gpe_notify_info", file: !411, line: 429, size: 128, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "device_node", scope: !655, file: !411, line: 430, baseType: !432, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !655, file: !411, line: 431, baseType: !654, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "register_info", scope: !633, file: !411, line: 450, baseType: !617, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !411, line: 451, baseType: !14, size: 8, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_number", scope: !633, file: !411, line: 452, baseType: !14, size: 8, offset: 136)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "runtime_count", scope: !633, file: !411, line: 453, baseType: !14, size: 8, offset: 144)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "disable_for_dispatch", scope: !633, file: !411, line: 454, baseType: !14, size: 8, offset: 152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !603, file: !411, line: 487, baseType: !107, size: 64, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "register_count", scope: !603, file: !411, line: 488, baseType: !8, size: 32, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gpe_count", scope: !603, file: !411, line: 489, baseType: !32, size: 16, offset: 480)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "block_base_number", scope: !603, file: !411, line: 490, baseType: !32, size: 16, offset: 496)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "space_id", scope: !603, file: !411, line: 491, baseType: !14, size: 8, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !603, file: !411, line: 492, baseType: !14, size: 8, offset: 520)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "power_resource", scope: !437, file: !438, line: 379, baseType: !671, size: 384)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_power_resource", file: !438, line: 192, size: 384, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !671, file: !438, line: 193, baseType: !436, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !671, file: !438, line: 193, baseType: !14, size: 8, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !438, line: 193, baseType: !14, size: 8, offset: 72)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !671, file: !438, line: 193, baseType: !32, size: 16, offset: 80)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !671, file: !438, line: 193, baseType: !14, size: 8, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !671, file: !438, line: 193, baseType: !587, size: 128, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !671, file: !438, line: 193, baseType: !436, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "system_level", scope: !671, file: !438, line: 193, baseType: !8, size: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "resource_order", scope: !671, file: !438, line: 194, baseType: !8, size: 32, offset: 352)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "processor", scope: !437, file: !438, line: 380, baseType: !683, size: 384)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_processor", file: !438, line: 197, size: 384, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !683, file: !438, line: 198, baseType: !436, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !683, file: !438, line: 198, baseType: !14, size: 8, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !683, file: !438, line: 198, baseType: !14, size: 8, offset: 72)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !683, file: !438, line: 198, baseType: !32, size: 16, offset: 80)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !683, file: !438, line: 198, baseType: !14, size: 8, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "proc_id", scope: !683, file: !438, line: 200, baseType: !14, size: 8, offset: 104)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !683, file: !438, line: 201, baseType: !14, size: 8, offset: 112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !683, file: !438, line: 202, baseType: !587, size: 128, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !683, file: !438, line: 202, baseType: !436, size: 64, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !683, file: !438, line: 202, baseType: !695, size: 64, offset: 320)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_io_address", file: !7, line: 128, baseType: !107)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "thermal_zone", scope: !437, file: !438, line: 381, baseType: !697, size: 320)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_thermal_zone", file: !438, line: 205, size: 320, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !697, file: !438, line: 206, baseType: !436, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !697, file: !438, line: 206, baseType: !14, size: 8, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !697, file: !438, line: 206, baseType: !14, size: 8, offset: 72)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !697, file: !438, line: 206, baseType: !32, size: 16, offset: 80)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !697, file: !438, line: 206, baseType: !14, size: 8, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "notify_list", scope: !697, file: !438, line: 206, baseType: !587, size: 128, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !697, file: !438, line: 206, baseType: !436, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common_field", scope: !437, file: !438, line: 382, baseType: !707, size: 384)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_field_common", file: !438, line: 233, size: 384, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !707, file: !438, line: 234, baseType: !436, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 72)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !707, file: !438, line: 234, baseType: !32, size: 16, offset: 80)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 104)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 112)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 120)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !707, file: !438, line: 234, baseType: !432, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !707, file: !438, line: 234, baseType: !8, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !707, file: !438, line: 234, baseType: !8, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !707, file: !438, line: 234, baseType: !8, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !707, file: !438, line: 234, baseType: !14, size: 8, offset: 296)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !707, file: !438, line: 234, baseType: !436, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !437, file: !438, line: 383, baseType: !725, size: 576)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_region_field", file: !438, line: 237, size: 576, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !725, file: !438, line: 238, baseType: !436, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 72)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !725, file: !438, line: 238, baseType: !32, size: 16, offset: 80)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 104)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 112)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 120)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !725, file: !438, line: 238, baseType: !432, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !725, file: !438, line: 238, baseType: !8, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !725, file: !438, line: 238, baseType: !8, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !725, file: !438, line: 238, baseType: !8, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !725, file: !438, line: 238, baseType: !14, size: 8, offset: 296)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "resource_length", scope: !725, file: !438, line: 238, baseType: !32, size: 16, offset: 304)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !725, file: !438, line: 239, baseType: !436, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "resource_buffer", scope: !725, file: !438, line: 240, baseType: !13, size: 64, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pin_number_index", scope: !725, file: !438, line: 241, baseType: !32, size: 16, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "internal_pcc_buffer", scope: !725, file: !438, line: 242, baseType: !13, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_field", scope: !437, file: !438, line: 384, baseType: !747, size: 384)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_buffer_field", file: !438, line: 262, size: 384, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !747, file: !438, line: 263, baseType: !436, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 72)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !747, file: !438, line: 263, baseType: !32, size: 16, offset: 80)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 104)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 120)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !747, file: !438, line: 263, baseType: !432, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !747, file: !438, line: 263, baseType: !8, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !747, file: !438, line: 263, baseType: !8, size: 32, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !747, file: !438, line: 263, baseType: !8, size: 32, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 288)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 296)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "is_create_field", scope: !747, file: !438, line: 263, baseType: !14, size: 8, offset: 304)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_obj", scope: !747, file: !438, line: 264, baseType: !436, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bank_field", scope: !437, file: !438, line: 385, baseType: !766, size: 448)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_bank_field", file: !438, line: 245, size: 448, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !766, file: !438, line: 246, baseType: !436, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 72)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !766, file: !438, line: 246, baseType: !32, size: 16, offset: 80)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 120)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !766, file: !438, line: 246, baseType: !432, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !766, file: !438, line: 246, baseType: !8, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !766, file: !438, line: 246, baseType: !8, size: 32, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !766, file: !438, line: 246, baseType: !8, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !766, file: !438, line: 246, baseType: !14, size: 8, offset: 296)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "region_obj", scope: !766, file: !438, line: 246, baseType: !436, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bank_obj", scope: !766, file: !438, line: 247, baseType: !436, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "index_field", scope: !437, file: !438, line: 386, baseType: !785, size: 448)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_index_field", file: !438, line: 250, size: 448, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !785, file: !438, line: 251, baseType: !436, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 72)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !785, file: !438, line: 251, baseType: !32, size: 16, offset: 80)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "field_flags", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 104)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "attribute", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "access_byte_width", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 120)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !785, file: !438, line: 251, baseType: !432, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !785, file: !438, line: 251, baseType: !8, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "base_byte_offset", scope: !785, file: !438, line: 251, baseType: !8, size: 32, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !785, file: !438, line: 251, baseType: !8, size: 32, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "start_field_bit_offset", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 288)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "access_length", scope: !785, file: !438, line: 251, baseType: !14, size: 8, offset: 296)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "index_obj", scope: !785, file: !438, line: 256, baseType: !436, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "data_obj", scope: !785, file: !438, line: 257, baseType: !436, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !437, file: !438, line: 387, baseType: !804, size: 512)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_object_notify_handler", file: !438, line: 273, size: 512, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !818, !819}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "next_object", scope: !804, file: !438, line: 274, baseType: !436, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "descriptor_type", scope: !804, file: !438, line: 274, baseType: !14, size: 8, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !804, file: !438, line: 274, baseType: !14, size: 8, offset: 72)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !804, file: !438, line: 274, baseType: !32, size: 16, offset: 80)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !804, file: !438, line: 274, baseType: !14, size: 8, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !804, file: !438, line: 274, baseType: !432, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "handler_type", scope: !804, file: !438, line: 275, baseType: !8, size: 32, offset: 192)
