; ModuleID = '../bcout/drivers/acpi/acpica/utxface.llvm.bc'
source_filename = "drivers/acpi/acpica/utxface.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.kmem_cache = type opaque
%struct.paravirt_patch_template = type { %struct.pv_init_ops, %struct.pv_time_ops, %struct.pv_cpu_ops, %struct.pv_irq_ops, %struct.pv_mmu_ops, %struct.pv_lock_ops }
%struct.pv_init_ops = type { i32 (i8, i8*, i64, i32)* }
%struct.pv_time_ops = type { i64 ()*, i64 (i32)* }
%struct.pv_cpu_ops = type { void ()*, i64 (i32)*, void (i32, i64)*, i64 ()*, void (i64)*, void (i64)*, void ()*, void (%struct.desc_ptr*)*, void (%struct.desc_ptr*)*, void (i8*, i32)*, i64 ()*, void (%struct.thread_struct*, i32)*, void (i32)*, void (%struct.desc_struct*, i32, i8*)*, void (%struct.desc_struct*, i32, i8*, i32)*, void (%struct.gate_struct*, i32, %struct.gate_struct*)*, void (%struct.desc_struct*, i32)*, void (%struct.desc_struct*, i32)*, void (i64)*, void ()*, void ()*, void ()*, void (i32*, i32*, i32*, i32*)*, i64 (i32)*, void (i32, i32, i32)*, i64 (i32, i32*)*, i32 (i32, i32, i32)*, i64 (i32)*, void ()*, void ()*, void ()*, void (%struct.task_struct*)*, void (%struct.task_struct*)* }
%struct.desc_ptr = type <{ i16, i64 }>
%struct.thread_struct = type { [3 x %struct.desc_struct], i64, i16, i16, i16, i16, i64, i64, [4 x %struct.perf_event*], i64, i64, i64, i64, i64, %struct.io_bitmap*, i64, i8, [47 x i8], %struct.fpu }

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/acpi/acpica/utxface.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !4, line: 305, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!11 = !{!12, !14, !18, !19, !20, !24, !26}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_status", file: !13, line: 421, baseType: !14)
!13 = !DIFile(filename: "./include/acpi/actypes.h", directory: "/home/lizy2001/genbc/linux")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !15, line: 21, baseType: !16)
!15 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !5)
!17 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_size", file: !13, line: 127, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !15, line: 23, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !23)
!23 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !25, line: 148, baseType: !5)
!25 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!26 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !{!"rsp"}
!28 = !{i32 7, !"Dwarf Version", i32 4}
!29 = !{i32 2, !"Debug Info Version", i32 3}
!30 = !{i32 1, !"wchar_size", i32 2}
!31 = !{i32 1, !"Code Model", i32 2}
!32 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!33 = distinct !DISubprogram(name: "acpi_terminate", scope: !1, file: !1, line: 30, type: !34, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!34 = !DISubroutineType(types: !35)
!35 = !{!12}
!36 = !{}
!37 = !DILocalVariable(name: "status", scope: !33, file: !1, line: 32, type: !12)
!38 = !DILocation(line: 32, column: 14, scope: !33)
!39 = !DILocation(line: 38, column: 2, scope: !33)
!40 = !DILocation(line: 42, column: 2, scope: !33)
!41 = !DILocation(line: 46, column: 11, scope: !33)
!42 = !DILocation(line: 46, column: 9, scope: !33)
!43 = !DILocation(line: 47, column: 2, scope: !33)
!44 = distinct !DISubprogram(name: "acpi_purge_cached_objects", scope: !1, file: !1, line: 233, type: !34, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!45 = !DILocation(line: 237, column: 28, scope: !44)
!46 = !DILocation(line: 237, column: 8, scope: !44)
!47 = !DILocation(line: 238, column: 28, scope: !44)
!48 = !DILocation(line: 238, column: 8, scope: !44)
!49 = !DILocation(line: 239, column: 28, scope: !44)
!50 = !DILocation(line: 239, column: 8, scope: !44)
!51 = !DILocation(line: 240, column: 28, scope: !44)
!52 = !DILocation(line: 240, column: 8, scope: !44)
!53 = !DILocation(line: 242, column: 2, scope: !44)
!54 = distinct !DISubprogram(name: "acpi_install_interface", scope: !1, file: !1, line: 258, type: !55, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!55 = !DISubroutineType(types: !56)
!56 = !{!12, !57}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_string", file: !13, line: 423, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DILocalVariable(name: "interface_name", arg: 1, scope: !54, file: !1, line: 258, type: !57)
!61 = !DILocation(line: 258, column: 48, scope: !54)
!62 = !DILocalVariable(name: "status", scope: !54, file: !1, line: 260, type: !12)
!63 = !DILocation(line: 260, column: 14, scope: !54)
!64 = !DILocalVariable(name: "interface_info", scope: !54, file: !1, line: 261, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_interface_info", file: !67, line: 1045, size: 192, elements: !68)
!67 = !DIFile(filename: "drivers/acpi/acpica/aclocal.h", directory: "/home/lizy2001/genbc/linux")
!68 = !{!69, !70, !71, !75}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !67, line: 1046, baseType: !58, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !67, line: 1047, baseType: !65, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !66, file: !67, line: 1048, baseType: !72, size: 8, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !15, line: 17, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !74)
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !66, file: !67, line: 1049, baseType: !72, size: 8, offset: 136)
!76 = !DILocation(line: 261, column: 30, scope: !54)
!77 = !DILocation(line: 265, column: 7, scope: !78)
!78 = distinct !DILexicalBlock(scope: !54, file: !1, line: 265, column: 6)
!79 = !DILocation(line: 265, column: 22, scope: !78)
!80 = !DILocation(line: 265, column: 33, scope: !78)
!81 = !DILocation(line: 265, column: 26, scope: !78)
!82 = !DILocation(line: 265, column: 49, scope: !78)
!83 = !DILocation(line: 265, column: 6, scope: !54)
!84 = !DILocation(line: 266, column: 3, scope: !85)
!85 = distinct !DILexicalBlock(scope: !78, file: !1, line: 265, column: 56)
!86 = !DILocation(line: 269, column: 11, scope: !54)
!87 = !DILocation(line: 269, column: 9, scope: !54)
!88 = !DILocation(line: 270, column: 6, scope: !89)
!89 = distinct !DILexicalBlock(scope: !54, file: !1, line: 270, column: 6)
!90 = !DILocation(line: 270, column: 6, scope: !54)
!91 = !DILocation(line: 271, column: 11, scope: !92)
!92 = distinct !DILexicalBlock(scope: !89, file: !1, line: 270, column: 28)
!93 = !DILocation(line: 271, column: 3, scope: !92)
!94 = !DILocation(line: 276, column: 41, scope: !54)
!95 = !DILocation(line: 276, column: 19, scope: !54)
!96 = !DILocation(line: 276, column: 17, scope: !54)
!97 = !DILocation(line: 277, column: 6, scope: !98)
!98 = distinct !DILexicalBlock(scope: !54, file: !1, line: 277, column: 6)
!99 = !DILocation(line: 277, column: 6, scope: !54)
!100 = !DILocation(line: 282, column: 7, scope: !101)
!101 = distinct !DILexicalBlock(scope: !102, file: !1, line: 282, column: 7)
!102 = distinct !DILexicalBlock(scope: !98, file: !1, line: 277, column: 22)
!103 = !DILocation(line: 282, column: 23, scope: !101)
!104 = !DILocation(line: 282, column: 29, scope: !101)
!105 = !DILocation(line: 282, column: 7, scope: !102)
!106 = !DILocation(line: 283, column: 4, scope: !107)
!107 = distinct !DILexicalBlock(scope: !101, file: !1, line: 282, column: 49)
!108 = !DILocation(line: 283, column: 20, scope: !107)
!109 = !DILocation(line: 283, column: 26, scope: !107)
!110 = !DILocation(line: 284, column: 11, scope: !107)
!111 = !DILocation(line: 285, column: 3, scope: !107)
!112 = !DILocation(line: 286, column: 11, scope: !113)
!113 = distinct !DILexicalBlock(scope: !101, file: !1, line: 285, column: 10)
!114 = !DILocation(line: 288, column: 2, scope: !102)
!115 = !DILocation(line: 291, column: 38, scope: !116)
!116 = distinct !DILexicalBlock(scope: !98, file: !1, line: 288, column: 9)
!117 = !DILocation(line: 291, column: 12, scope: !116)
!118 = !DILocation(line: 291, column: 10, scope: !116)
!119 = !DILocation(line: 294, column: 2, scope: !54)
!120 = !DILocation(line: 295, column: 10, scope: !54)
!121 = !DILocation(line: 295, column: 2, scope: !54)
!122 = !DILocation(line: 296, column: 1, scope: !54)
!123 = distinct !DISubprogram(name: "acpi_remove_interface", scope: !1, file: !1, line: 311, type: !55, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!124 = !DILocalVariable(name: "interface_name", arg: 1, scope: !123, file: !1, line: 311, type: !57)
!125 = !DILocation(line: 311, column: 47, scope: !123)
!126 = !DILocalVariable(name: "status", scope: !123, file: !1, line: 313, type: !12)
!127 = !DILocation(line: 313, column: 14, scope: !123)
!128 = !DILocation(line: 317, column: 7, scope: !129)
!129 = distinct !DILexicalBlock(scope: !123, file: !1, line: 317, column: 6)
!130 = !DILocation(line: 317, column: 22, scope: !129)
!131 = !DILocation(line: 317, column: 33, scope: !129)
!132 = !DILocation(line: 317, column: 26, scope: !129)
!133 = !DILocation(line: 317, column: 49, scope: !129)
!134 = !DILocation(line: 317, column: 6, scope: !123)
!135 = !DILocation(line: 318, column: 3, scope: !136)
!136 = distinct !DILexicalBlock(scope: !129, file: !1, line: 317, column: 56)
!137 = !DILocation(line: 321, column: 11, scope: !123)
!138 = !DILocation(line: 321, column: 9, scope: !123)
!139 = !DILocation(line: 322, column: 6, scope: !140)
!140 = distinct !DILexicalBlock(scope: !123, file: !1, line: 322, column: 6)
!141 = !DILocation(line: 322, column: 6, scope: !123)
!142 = !DILocation(line: 323, column: 11, scope: !143)
!143 = distinct !DILexicalBlock(scope: !140, file: !1, line: 322, column: 28)
!144 = !DILocation(line: 323, column: 3, scope: !143)
!145 = !DILocation(line: 326, column: 36, scope: !123)
!146 = !DILocation(line: 326, column: 11, scope: !123)
!147 = !DILocation(line: 326, column: 9, scope: !123)
!148 = !DILocation(line: 328, column: 2, scope: !123)
!149 = !DILocation(line: 329, column: 10, scope: !123)
!150 = !DILocation(line: 329, column: 2, scope: !123)
!151 = !DILocation(line: 330, column: 1, scope: !123)
!152 = distinct !DISubprogram(name: "acpi_install_interface_handler", scope: !1, file: !1, line: 348, type: !153, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!153 = !DISubroutineType(types: !154)
!154 = !{!12, !155}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_interface_handler", file: !13, line: 1116, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!14, !57, !14}
!159 = !DILocalVariable(name: "handler", arg: 1, scope: !152, file: !1, line: 348, type: !155)
!160 = !DILocation(line: 348, column: 67, scope: !152)
!161 = !DILocalVariable(name: "status", scope: !152, file: !1, line: 350, type: !12)
!162 = !DILocation(line: 350, column: 14, scope: !152)
!163 = !DILocation(line: 352, column: 11, scope: !152)
!164 = !DILocation(line: 352, column: 9, scope: !152)
!165 = !DILocation(line: 353, column: 6, scope: !166)
!166 = distinct !DILexicalBlock(scope: !152, file: !1, line: 353, column: 6)
!167 = !DILocation(line: 353, column: 6, scope: !152)
!168 = !DILocation(line: 354, column: 11, scope: !169)
!169 = distinct !DILexicalBlock(scope: !166, file: !1, line: 353, column: 28)
!170 = !DILocation(line: 354, column: 3, scope: !169)
!171 = !DILocation(line: 357, column: 6, scope: !172)
!172 = distinct !DILexicalBlock(scope: !152, file: !1, line: 357, column: 6)
!173 = !DILocation(line: 357, column: 14, scope: !172)
!174 = !DILocation(line: 357, column: 17, scope: !172)
!175 = !DILocation(line: 357, column: 6, scope: !152)
!176 = !DILocation(line: 358, column: 10, scope: !177)
!177 = distinct !DILexicalBlock(scope: !172, file: !1, line: 357, column: 45)
!178 = !DILocation(line: 359, column: 2, scope: !177)
!179 = !DILocation(line: 360, column: 32, scope: !180)
!180 = distinct !DILexicalBlock(scope: !172, file: !1, line: 359, column: 9)
!181 = !DILocation(line: 360, column: 30, scope: !180)
!182 = !DILocation(line: 363, column: 2, scope: !152)
!183 = !DILocation(line: 364, column: 10, scope: !152)
!184 = !DILocation(line: 364, column: 2, scope: !152)
!185 = !DILocation(line: 365, column: 1, scope: !152)
!186 = distinct !DISubprogram(name: "acpi_update_interfaces", scope: !1, file: !1, line: 382, type: !187, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!187 = !DISubroutineType(types: !188)
!188 = !{!12, !72}
!189 = !DILocalVariable(name: "action", arg: 1, scope: !186, file: !1, line: 382, type: !72)
!190 = !DILocation(line: 382, column: 39, scope: !186)
!191 = !DILocalVariable(name: "status", scope: !186, file: !1, line: 384, type: !12)
!192 = !DILocation(line: 384, column: 14, scope: !186)
!193 = !DILocation(line: 386, column: 11, scope: !186)
!194 = !DILocation(line: 386, column: 9, scope: !186)
!195 = !DILocation(line: 387, column: 6, scope: !196)
!196 = distinct !DILexicalBlock(scope: !186, file: !1, line: 387, column: 6)
!197 = !DILocation(line: 387, column: 6, scope: !186)
!198 = !DILocation(line: 388, column: 11, scope: !199)
!199 = distinct !DILexicalBlock(scope: !196, file: !1, line: 387, column: 28)
!200 = !DILocation(line: 388, column: 3, scope: !199)
!201 = !DILocation(line: 391, column: 37, scope: !186)
!202 = !DILocation(line: 391, column: 11, scope: !186)
!203 = !DILocation(line: 391, column: 9, scope: !186)
!204 = !DILocation(line: 393, column: 2, scope: !186)
!205 = !DILocation(line: 394, column: 10, scope: !186)
!206 = !DILocation(line: 394, column: 2, scope: !186)
!207 = !DILocation(line: 395, column: 1, scope: !186)
!208 = distinct !DISubprogram(name: "acpi_check_address_range", scope: !1, file: !1, line: 414, type: !209, scopeLine: 417, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!209 = !DISubroutineType(types: !210)
!210 = !{!14, !211, !212, !20, !72}
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_adr_space_type", file: !13, line: 805, baseType: !72)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "acpi_physical_address", file: !13, line: 129, baseType: !21)
!213 = !DILocalVariable(name: "space_id", arg: 1, scope: !208, file: !1, line: 414, type: !211)
!214 = !DILocation(line: 414, column: 46, scope: !208)
!215 = !DILocalVariable(name: "address", arg: 2, scope: !208, file: !1, line: 415, type: !212)
!216 = !DILocation(line: 415, column: 27, scope: !208)
!217 = !DILocalVariable(name: "length", arg: 3, scope: !208, file: !1, line: 416, type: !20)
!218 = !DILocation(line: 416, column: 15, scope: !208)
!219 = !DILocalVariable(name: "warn", arg: 4, scope: !208, file: !1, line: 416, type: !72)
!220 = !DILocation(line: 416, column: 26, scope: !208)
!221 = !DILocalVariable(name: "overlaps", scope: !208, file: !1, line: 418, type: !14)
!222 = !DILocation(line: 418, column: 6, scope: !208)
!223 = !DILocalVariable(name: "status", scope: !208, file: !1, line: 419, type: !12)
!224 = !DILocation(line: 419, column: 14, scope: !208)
!225 = !DILocation(line: 421, column: 11, scope: !208)
!226 = !DILocation(line: 421, column: 9, scope: !208)
!227 = !DILocation(line: 422, column: 6, scope: !228)
!228 = distinct !DILexicalBlock(scope: !208, file: !1, line: 422, column: 6)
!229 = !DILocation(line: 422, column: 6, scope: !208)
!230 = !DILocation(line: 423, column: 3, scope: !231)
!231 = distinct !DILexicalBlock(scope: !228, file: !1, line: 422, column: 28)
!232 = !DILocation(line: 426, column: 41, scope: !208)
!233 = !DILocation(line: 426, column: 51, scope: !208)
!234 = !DILocation(line: 427, column: 18, scope: !208)
!235 = !DILocation(line: 427, column: 13, scope: !208)
!236 = !DILocation(line: 427, column: 26, scope: !208)
!237 = !DILocation(line: 426, column: 13, scope: !208)
!238 = !DILocation(line: 426, column: 11, scope: !208)
!239 = !DILocation(line: 429, column: 8, scope: !208)
!240 = !DILocation(line: 430, column: 10, scope: !208)
!241 = !DILocation(line: 430, column: 2, scope: !208)
!242 = !DILocation(line: 431, column: 1, scope: !208)
!243 = distinct !DISubprogram(name: "acpi_decode_pld_buffer", scope: !1, file: !1, line: 451, type: !244, scopeLine: 453, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !36)
!244 = !DISubroutineType(types: !245)
!245 = !{!12, !246, !20, !247}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acpi_pld_info", file: !250, line: 77, size: 272, elements: !251)
!250 = !DIFile(filename: "./include/acpi/acbuffer.h", directory: "/home/lizy2001/genbc/linux")
!251 = !{!252, !253, !254, !255, !256, !257, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !249, file: !250, line: 78, baseType: !72, size: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_color", scope: !249, file: !250, line: 79, baseType: !72, size: 8, offset: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !249, file: !250, line: 80, baseType: !72, size: 8, offset: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !249, file: !250, line: 81, baseType: !72, size: 8, offset: 24)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !249, file: !250, line: 82, baseType: !72, size: 8, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !249, file: !250, line: 83, baseType: !258, size: 16, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !15, line: 19, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !249, file: !250, line: 84, baseType: !258, size: 16, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "user_visible", scope: !249, file: !250, line: 85, baseType: !72, size: 8, offset: 80)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dock", scope: !249, file: !250, line: 86, baseType: !72, size: 8, offset: 88)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "lid", scope: !249, file: !250, line: 87, baseType: !72, size: 8, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "panel", scope: !249, file: !250, line: 88, baseType: !72, size: 8, offset: 104)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_position", scope: !249, file: !250, line: 89, baseType: !72, size: 8, offset: 112)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "horizontal_position", scope: !249, file: !250, line: 90, baseType: !72, size: 8, offset: 120)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !249, file: !250, line: 91, baseType: !72, size: 8, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "group_orientation", scope: !249, file: !250, line: 92, baseType: !72, size: 8, offset: 136)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "group_token", scope: !249, file: !250, line: 93, baseType: !72, size: 8, offset: 144)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "group_position", scope: !249, file: !250, line: 94, baseType: !72, size: 8, offset: 152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bay", scope: !249, file: !250, line: 95, baseType: !72, size: 8, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ejectable", scope: !249, file: !250, line: 96, baseType: !72, size: 8, offset: 168)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ospm_eject_required", scope: !249, file: !250, line: 97, baseType: !72, size: 8, offset: 176)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "cabinet_number", scope: !249, file: !250, line: 98, baseType: !72, size: 8, offset: 184)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "card_cage_number", scope: !249, file: !250, line: 99, baseType: !72, size: 8, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !249, file: !250, line: 100, baseType: !72, size: 8, offset: 200)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !249, file: !250, line: 101, baseType: !72, size: 8, offset: 208)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !249, file: !250, line: 102, baseType: !72, size: 8, offset: 216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !249, file: !250, line: 103, baseType: !72, size: 8, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_offset", scope: !249, file: !250, line: 104, baseType: !258, size: 16, offset: 240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "horizontal_offset", scope: !249, file: !250, line: 105, baseType: !258, size: 16, offset: 256)
!283 = !DILocalVariable(name: "in_buffer", arg: 1, scope: !243, file: !1, line: 451, type: !246)
!284 = !DILocation(line: 451, column: 28, scope: !243)
!285 = !DILocalVariable(name: "length", arg: 2, scope: !243, file: !1, line: 452, type: !20)
!286 = !DILocation(line: 452, column: 20, scope: !243)
!287 = !DILocalVariable(name: "return_buffer", arg: 3, scope: !243, file: !1, line: 452, type: !247)
!288 = !DILocation(line: 452, column: 51, scope: !243)
!289 = !DILocalVariable(name: "pld_info", scope: !243, file: !1, line: 454, type: !248)
!290 = !DILocation(line: 454, column: 24, scope: !243)
!291 = !DILocalVariable(name: "buffer", scope: !243, file: !1, line: 455, type: !18)
!292 = !DILocation(line: 455, column: 7, scope: !243)
!293 = !DILocation(line: 455, column: 16, scope: !243)
!294 = !DILocalVariable(name: "dword", scope: !243, file: !1, line: 456, type: !14)
!295 = !DILocation(line: 456, column: 6, scope: !243)
!296 = !DILocation(line: 460, column: 7, scope: !297)
!297 = distinct !DILexicalBlock(scope: !243, file: !1, line: 460, column: 6)
!298 = !DILocation(line: 460, column: 17, scope: !297)
!299 = !DILocation(line: 460, column: 21, scope: !297)
!300 = !DILocation(line: 461, column: 6, scope: !297)
!301 = !DILocation(line: 461, column: 10, scope: !297)
!302 = !DILocation(line: 461, column: 17, scope: !297)
!303 = !DILocation(line: 460, column: 6, scope: !243)
!304 = !DILocation(line: 462, column: 3, scope: !305)
!305 = distinct !DILexicalBlock(scope: !297, file: !1, line: 461, column: 47)
!306 = !DILocation(line: 465, column: 13, scope: !243)
!307 = !DILocation(line: 465, column: 11, scope: !243)
!308 = !DILocation(line: 466, column: 7, scope: !309)
!309 = distinct !DILexicalBlock(scope: !243, file: !1, line: 466, column: 6)
!310 = !DILocation(line: 466, column: 6, scope: !243)
!311 = !DILocation(line: 467, column: 3, scope: !312)
!312 = distinct !DILexicalBlock(scope: !309, file: !1, line: 466, column: 17)
!313 = !DILocation(line: 472, column: 2, scope: !243)
!314 = !DILocation(line: 473, column: 23, scope: !243)
!315 = !DILocation(line: 473, column: 2, scope: !243)
!316 = !DILocation(line: 473, column: 12, scope: !243)
!317 = !DILocation(line: 473, column: 21, scope: !243)
!318 = !DILocation(line: 474, column: 27, scope: !243)
!319 = !DILocation(line: 474, column: 2, scope: !243)
!320 = !DILocation(line: 474, column: 12, scope: !243)
!321 = !DILocation(line: 474, column: 25, scope: !243)
!322 = !DILocation(line: 475, column: 18, scope: !243)
!323 = !DILocation(line: 475, column: 2, scope: !243)
!324 = !DILocation(line: 475, column: 12, scope: !243)
!325 = !DILocation(line: 475, column: 16, scope: !243)
!326 = !DILocation(line: 476, column: 20, scope: !243)
!327 = !DILocation(line: 476, column: 2, scope: !243)
!328 = !DILocation(line: 476, column: 12, scope: !243)
!329 = !DILocation(line: 476, column: 18, scope: !243)
!330 = !DILocation(line: 477, column: 19, scope: !243)
!331 = !DILocation(line: 477, column: 2, scope: !243)
!332 = !DILocation(line: 477, column: 12, scope: !243)
!333 = !DILocation(line: 477, column: 17, scope: !243)
!334 = !DILocation(line: 481, column: 2, scope: !243)
!335 = !DILocation(line: 482, column: 20, scope: !243)
!336 = !DILocation(line: 482, column: 2, scope: !243)
!337 = !DILocation(line: 482, column: 12, scope: !243)
!338 = !DILocation(line: 482, column: 18, scope: !243)
!339 = !DILocation(line: 483, column: 21, scope: !243)
!340 = !DILocation(line: 483, column: 2, scope: !243)
!341 = !DILocation(line: 483, column: 12, scope: !243)
!342 = !DILocation(line: 483, column: 19, scope: !243)
!343 = !DILocation(line: 487, column: 2, scope: !243)
!344 = !DILocation(line: 488, column: 27, scope: !243)
!345 = !DILocation(line: 488, column: 2, scope: !243)
!346 = !DILocation(line: 488, column: 12, scope: !243)
!347 = !DILocation(line: 488, column: 25, scope: !243)
