; ModuleID = '../bcout/drivers/media/usb/dvb-usb/cxusb.llvm.bc'
source_filename = "drivers/media/usb/dvb-usb/cxusb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_cxusb_driver_init6:\09\09\09"
module asm ".long\09cxusb_driver_init - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.kernel_param_ops = type { i32, i32 (i8*, %struct.kernel_param*)*, i32 (i8*, %struct.kernel_param*)*, void (i8*)* }
%struct.kernel_param = type { i8*, %struct.module*, %struct.kernel_param_ops*, i16, i8, i8, %union.anon }
%struct.module = type opaque
%union.anon = type { i8* }
%struct.kparam_array = type { i32, i32, i32*, %struct.kernel_param_ops*, i8* }
%struct.usb_driver = type { i8*, i32 (%struct.usb_interface*, %struct.usb_device_id*)*, void (%struct.usb_interface*)*, i32 (%struct.usb_interface*, i32, i8*)*, i32 (%struct.usb_interface*, i32)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, i32 (%struct.usb_interface*)*, %struct.usb_device_id*, %struct.attribute_group**, %struct.usb_dynids, %struct.usbdrv_wrap, i8 }
%struct.usb_interface = type { %struct.usb_host_interface*, %struct.usb_host_interface*, i32, %struct.usb_interface_assoc_descriptor*, i32, i32, i8, %struct.device, %struct.device*, %struct.work_struct }

!238 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!239 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!240 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!241 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !230, line: 602, baseType: !7, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249}
!244 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!245 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!246 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!247 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!248 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!249 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !230, line: 615, baseType: !7, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!255 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !230, line: 626, baseType: !7, size: 32, elements: !257)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!259 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!260 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!261 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!262 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !230, line: 638, baseType: !7, size: 32, elements: !264)
!264 = !{!265, !266}
!265 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !230, line: 647, baseType: !7, size: 32, elements: !268)
!268 = !{!269, !270}
!269 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!270 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !272, line: 54, baseType: !7, size: 32, elements: !273)
!272 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!273 = !{!274, !275, !276, !277}
!274 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !52, line: 423, baseType: !7, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!283 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!284 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !285, file: !52, line: 2085, baseType: !7, size: 32, elements: !7250)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !52, line: 1858, size: 15808, elements: !286)
!286 = !{!287, !292, !315, !332, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !349, !357, !358, !359, !360, !361, !362, !363, !364, !365, !391, !401, !402, !403, !408, !409, !413, !416, !5846, !6362, !6366, !6406, !6407, !6408, !6409, !6410, !6411, !6412, !6413, !6414, !6415, !6416, !6417, !6418, !6419, !6420, !6421, !6422, !6423, !6424, !6425, !6426, !6427, !6428, !6429, !6430, !6431, !6432, !6437, !6438, !6439, !6440, !6441, !6442, !6443, !6446, !6495, !6498, !6501, !6504, !6505, !6518, !6519, !6520, !6521, !6522, !6523, !6530, !6531, !6565, !6566, !6567, !6568, !6569, !6570, !6571, !6572, !6573, !6576, !6577, !6578, !6579, !6580, !6581, !6582, !6583, !6584, !6589, !6590, !6591, !6596, !6633, !7205, !7207, !7208, !7212, !7213, !7214, !7215, !7221, !7223, !7226, !7229, !7231, !7232, !7233, !7234, !7235, !7239, !7242}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !285, file: !52, line: 1859, baseType: !288, size: 128)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 128, elements: !290)
!289 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!290 = !{!291}
!291 = !DISubrange(count: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !285, file: !52, line: 1860, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !52, line: 938, size: 384, elements: !295)
!295 = !{!296, !304, !310, !312}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !294, file: !52, line: 939, baseType: !297, size: 128)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !298, line: 186, size: 128, elements: !299)
!298 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !298, line: 187, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !297, file: !298, line: 187, baseType: !303, size: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !294, file: !52, line: 940, baseType: !305, size: 128, offset: 128)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !298, line: 178, size: 128, elements: !306)
!306 = !{!307, !309}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !298, line: 179, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !305, file: !298, line: 179, baseType: !308, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !294, file: !52, line: 941, baseType: !311, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !52, line: 942, baseType: !313, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !285, file: !52, line: 1861, baseType: !316, size: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !52, line: 930, size: 128, elements: !318)
!318 = !{!319, !328}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !317, file: !52, line: 931, baseType: !320, size: 128, align: 64)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !298, line: 216, size: 128, align: 64, elements: !321)
!321 = !{!322, !324}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !320, file: !298, line: 217, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !320, file: !298, line: 218, baseType: !325, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !323}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !317, file: !52, line: 932, baseType: !329, offset: 128)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: -1)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !285, file: !52, line: 1866, baseType: !333, size: 64, offset: 256)
!333 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !285, file: !52, line: 1867, baseType: !333, size: 64, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !285, file: !52, line: 1868, baseType: !333, size: 64, offset: 384)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !285, file: !52, line: 1869, baseType: !53, size: 32, offset: 448)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !285, file: !52, line: 1877, baseType: !333, size: 64, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !285, file: !52, line: 1879, baseType: !305, size: 128, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !285, file: !52, line: 1880, baseType: !305, size: 128, offset: 704)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !285, file: !52, line: 1881, baseType: !305, size: 128, offset: 832)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !285, file: !52, line: 1882, baseType: !305, size: 128, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !285, file: !52, line: 1883, baseType: !305, size: 128, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !285, file: !52, line: 1884, baseType: !305, size: 128, offset: 1216)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !285, file: !52, line: 1889, baseType: !345, size: 256, offset: 1344)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !52, line: 1886, size: 256, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !345, file: !52, line: 1887, baseType: !305, size: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !345, file: !52, line: 1888, baseType: !305, size: 128, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !285, file: !52, line: 1891, baseType: !350, size: 64, offset: 1600)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !351, line: 12, baseType: !352)
!351 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !353, line: 23, baseType: !354)
!353 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !355, line: 31, baseType: !356)
!355 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!356 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !285, file: !52, line: 1892, baseType: !350, size: 64, offset: 1664)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !285, file: !52, line: 1893, baseType: !350, size: 64, offset: 1728)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !285, file: !52, line: 1894, baseType: !350, size: 64, offset: 1792)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !285, file: !52, line: 1895, baseType: !350, size: 64, offset: 1856)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !285, file: !52, line: 1896, baseType: !350, size: 64, offset: 1920)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !285, file: !52, line: 1897, baseType: !350, size: 64, offset: 1984)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !285, file: !52, line: 1899, baseType: !53, size: 32, offset: 2048)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !285, file: !52, line: 1900, baseType: !53, size: 32, offset: 2080)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !285, file: !52, line: 1902, baseType: !366, size: 1472, offset: 2112)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !52, line: 169, size: 1472, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !366, file: !52, line: 170, baseType: !333, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !366, file: !52, line: 171, baseType: !333, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !366, file: !52, line: 172, baseType: !333, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !366, file: !52, line: 173, baseType: !333, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !366, file: !52, line: 174, baseType: !333, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !366, file: !52, line: 175, baseType: !333, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !366, file: !52, line: 176, baseType: !333, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !366, file: !52, line: 177, baseType: !333, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !366, file: !52, line: 178, baseType: !333, size: 64, offset: 512)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !366, file: !52, line: 179, baseType: !333, size: 64, offset: 576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !366, file: !52, line: 180, baseType: !333, size: 64, offset: 640)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !366, file: !52, line: 181, baseType: !333, size: 64, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !366, file: !52, line: 182, baseType: !333, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !366, file: !52, line: 183, baseType: !333, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !366, file: !52, line: 184, baseType: !333, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !366, file: !52, line: 185, baseType: !333, size: 64, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !366, file: !52, line: 186, baseType: !333, size: 64, offset: 1024)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !366, file: !52, line: 187, baseType: !333, size: 64, offset: 1088)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !366, file: !52, line: 188, baseType: !333, size: 64, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !366, file: !52, line: 189, baseType: !333, size: 64, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !366, file: !52, line: 190, baseType: !333, size: 64, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !366, file: !52, line: 191, baseType: !333, size: 64, offset: 1344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !366, file: !52, line: 192, baseType: !333, size: 64, offset: 1408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !285, file: !52, line: 1904, baseType: !392, size: 64, offset: 3584)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !393, line: 13, baseType: !394)
!393 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !298, line: 175, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 173, size: 64, elements: !396)
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !395, file: !298, line: 174, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !353, line: 22, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !355, line: 30, baseType: !400)
!400 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !285, file: !52, line: 1905, baseType: !392, size: 64, offset: 3648)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !285, file: !52, line: 1906, baseType: !392, size: 64, offset: 3712)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !285, file: !52, line: 1909, baseType: !404, size: 32, offset: 3776)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !298, line: 168, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 166, size: 32, elements: !406)
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !405, file: !298, line: 167, baseType: !53, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !285, file: !52, line: 1910, baseType: !404, size: 32, offset: 3808)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !285, file: !52, line: 1913, baseType: !410, size: 64, offset: 3840)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !52, line: 1913, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !285, file: !52, line: 1914, baseType: !414, size: 64, offset: 3904)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !52, line: 1914, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !285, file: !52, line: 1916, baseType: !417, size: 64, offset: 3968)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !52, line: 1283, size: 4416, elements: !420)
!420 = !{!421, !425, !429, !430, !431, !594, !598, !603, !607, !608, !613, !614, !737, !742, !746, !752, !756, !788, !796, !800, !805, !809, !810, !816, !820, !824, !828, !829, !851, !855, !870, !881, !885, !894, !898, !899, !903, !924, !928, !932, !936, !940, !947, !951, !969, !973, !1023, !1027, !1032, !1036, !1040, !1044, !1054, !1055, !1064, !1070, !1071, !1075, !1079, !1083, !1087, !1088, !1092, !1093, !5806, !5826, !5830, !5836, !5842}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !419, file: !52, line: 1284, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DISubroutineType(types: !424)
!424 = !{!53, !311}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !419, file: !52, line: 1285, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !311}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !419, file: !52, line: 1286, baseType: !422, size: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !419, file: !52, line: 1287, baseType: !422, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !419, file: !52, line: 1288, baseType: !432, size: 64, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!435, !436, !311}
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !52, line: 120, baseType: !51)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !438, line: 713, size: 1600, elements: !439)
!438 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!439 = !{!440, !462, !470, !477, !481, !493, !494, !495, !498, !499, !500, !506, !507, !508, !509, !510, !511, !512, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !552, !553, !554, !555, !557, !558, !563, !568, !573, !574, !575, !576, !577, !578, !579, !580, !581, !583, !584, !586, !587, !588}
!440 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 714, baseType: !441, size: 192)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 714, size: 192, elements: !442)
!442 = !{!443, !453, !461}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !438, line: 715, baseType: !444, size: 192)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !438, line: 715, size: 192, elements: !445)
!445 = !{!446, !447, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !438, line: 717, baseType: !436, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !444, file: !438, line: 718, baseType: !436, size: 64, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !444, file: !438, line: 720, baseType: !449, size: 64, offset: 128)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !444, file: !438, line: 720, size: 64, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !449, file: !438, line: 721, baseType: !311, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !449, file: !438, line: 726, baseType: !333, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !441, file: !438, line: 729, baseType: !454, size: 192, align: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !455, line: 24, size: 192, align: 64, elements: !456)
!455 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!456 = !{!457, !458, !460}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !454, file: !455, line: 25, baseType: !333, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !454, file: !455, line: 26, baseType: !459, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !454, file: !455, line: 27, baseType: !459, size: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !441, file: !438, line: 730, baseType: !305, size: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 733, baseType: !463, size: 64, offset: 192)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 733, size: 64, elements: !464)
!464 = !{!465, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !463, file: !438, line: 734, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !468, line: 19, flags: DIFlagFwdDecl)
!468 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !463, file: !438, line: 735, baseType: !53, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 738, baseType: !471, size: 64, offset: 256)
!471 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 738, size: 64, elements: !472)
!472 = !{!473, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !471, file: !438, line: 739, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !475, line: 29, baseType: !398)
!475 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!476 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !471, file: !438, line: 740, baseType: !352, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !437, file: !438, line: 748, baseType: !478, size: 384, align: 64, offset: 320)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 384, elements: !479)
!479 = !{!480}
!480 = !DISubrange(count: 48)
!481 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 750, baseType: !482, size: 128, offset: 704)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 750, size: 128, elements: !483)
!483 = !{!484, !492}
!484 = !DIDerivedType(tag: DW_TAG_member, scope: !482, file: !438, line: 751, baseType: !485, size: 128)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !438, line: 751, size: 128, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !485, file: !438, line: 752, baseType: !333, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !485, file: !438, line: 753, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !436}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !482, file: !438, line: 755, baseType: !305, size: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !437, file: !438, line: 761, baseType: !7, size: 32, offset: 832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !437, file: !438, line: 762, baseType: !7, size: 32, offset: 864)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !437, file: !438, line: 763, baseType: !496, size: 16, offset: 896)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !355, line: 24, baseType: !497)
!497 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !437, file: !438, line: 764, baseType: !496, size: 16, offset: 912)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !437, file: !438, line: 769, baseType: !496, size: 16, offset: 928)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !437, file: !438, line: 780, baseType: !501, offset: 944)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, elements: !504)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !355, line: 21, baseType: !503)
!503 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!504 = !{!505}
!505 = !DISubrange(count: 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !437, file: !438, line: 782, baseType: !502, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !437, file: !438, line: 783, baseType: !502, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !437, file: !438, line: 784, baseType: !502, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !437, file: !438, line: 785, baseType: !502, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !437, file: !438, line: 786, baseType: !502, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !437, file: !438, line: 787, baseType: !502, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !437, file: !438, line: 795, baseType: !513, offset: 960)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, elements: !504)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !355, line: 27, baseType: !7)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !437, file: !438, line: 807, baseType: !501, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !437, file: !438, line: 809, baseType: !502, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !437, file: !438, line: 810, baseType: !502, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !437, file: !438, line: 811, baseType: !502, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !437, file: !438, line: 812, baseType: !502, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !437, file: !438, line: 813, baseType: !502, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !437, file: !438, line: 815, baseType: !502, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !437, file: !438, line: 816, baseType: !502, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !437, file: !438, line: 817, baseType: !502, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !437, file: !438, line: 818, baseType: !502, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !437, file: !438, line: 819, baseType: !502, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !437, file: !438, line: 821, baseType: !502, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !437, file: !438, line: 822, baseType: !502, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !437, file: !438, line: 823, baseType: !502, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !437, file: !438, line: 832, baseType: !501, offset: 976)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !437, file: !438, line: 834, baseType: !502, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !437, file: !438, line: 835, baseType: !502, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !437, file: !438, line: 836, baseType: !502, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !437, file: !438, line: 837, baseType: !502, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !437, file: !438, line: 838, baseType: !502, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !437, file: !438, line: 840, baseType: !502, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !437, file: !438, line: 843, baseType: !502, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !437, file: !438, line: 844, baseType: !502, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !437, file: !438, line: 845, baseType: !502, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !437, file: !438, line: 847, baseType: !502, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !437, file: !438, line: 848, baseType: !502, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!541 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 866, baseType: !542, size: 32, offset: 992)
!542 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 866, size: 32, elements: !543)
!543 = !{!544, !547}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !542, file: !438, line: 867, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !546, line: 37, baseType: !514)
!546 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!547 = !DIDerivedType(tag: DW_TAG_member, scope: !542, file: !438, line: 868, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !542, file: !438, line: 868, size: 32, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !548, file: !438, line: 869, baseType: !496, size: 16)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !548, file: !438, line: 870, baseType: !496, size: 16, offset: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !437, file: !438, line: 873, baseType: !514, size: 32, offset: 1024)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !437, file: !438, line: 874, baseType: !53, size: 32, offset: 1056)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !437, file: !438, line: 875, baseType: !514, size: 32, offset: 1088)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !437, file: !438, line: 876, baseType: !556, size: 16, offset: 1120)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !546, line: 30, baseType: !496)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !437, file: !438, line: 877, baseType: !496, size: 16, offset: 1136)
!558 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 879, baseType: !559, size: 32, offset: 1152)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 879, size: 32, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !559, file: !438, line: 880, baseType: !7, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !559, file: !438, line: 881, baseType: !7, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 888, baseType: !564, size: 32, offset: 1184)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 888, size: 32, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !564, file: !438, line: 889, baseType: !514, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !564, file: !438, line: 890, baseType: !514, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !437, file: !438, line: 893, baseType: !569, size: 16, offset: 1216)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !437, file: !438, line: 893, size: 16, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !569, file: !438, line: 894, baseType: !556, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !569, file: !438, line: 895, baseType: !502, size: 8)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !437, file: !438, line: 898, baseType: !496, size: 16, offset: 1232)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !437, file: !438, line: 899, baseType: !496, size: 16, offset: 1248)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !437, file: !438, line: 900, baseType: !496, size: 16, offset: 1264)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !437, file: !438, line: 902, baseType: !556, size: 16, offset: 1280)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !437, file: !438, line: 903, baseType: !496, size: 16, offset: 1296)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !437, file: !438, line: 904, baseType: !496, size: 16, offset: 1312)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !437, file: !438, line: 905, baseType: !496, size: 16, offset: 1328)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !437, file: !438, line: 908, baseType: !513, offset: 1344)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !437, file: !438, line: 912, baseType: !582, size: 32, offset: 1344)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !438, line: 606, baseType: !7)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !437, file: !438, line: 913, baseType: !582, size: 32, offset: 1376)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !437, file: !438, line: 914, baseType: !585, size: 64, offset: 1408)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !437, file: !438, line: 915, baseType: !585, size: 64, offset: 1472)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !437, file: !438, line: 916, baseType: !7, size: 32, offset: 1536)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !437, file: !438, line: 917, baseType: !589, size: 32, offset: 1568)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !590, line: 113, baseType: !591)
!590 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !590, line: 111, size: 32, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !591, file: !590, line: 112, baseType: !404, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !419, file: !52, line: 1290, baseType: !595, size: 64, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!350, !436, !311, !350}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !419, file: !52, line: 1293, baseType: !599, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !311, !436, !311}
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !353, line: 19, baseType: !496)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !419, file: !52, line: 1296, baseType: !604, size: 64, offset: 448)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !311, !53}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !419, file: !52, line: 1298, baseType: !426, size: 64, offset: 512)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !419, file: !52, line: 1299, baseType: !609, size: 64, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!53, !311, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !419, file: !52, line: 1301, baseType: !422, size: 64, offset: 640)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !419, file: !52, line: 1302, baseType: !615, size: 64, offset: 704)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!53, !311, !618, !53}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !620, line: 234, size: 320, elements: !621)
!620 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!621 = !{!622, !626}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !619, file: !620, line: 239, baseType: !623, size: 128)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !619, file: !620, line: 236, size: 128, elements: !624)
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !623, file: !620, line: 238, baseType: !288, size: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !619, file: !620, line: 255, baseType: !627, size: 192, offset: 128)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !619, file: !620, line: 241, size: 192, elements: !628)
!628 = !{!629, !641, !642, !643, !644, !645, !647, !648, !649, !658, !659, !660, !661}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !627, file: !620, line: 242, baseType: !630, size: 128)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !631, line: 32, size: 128, elements: !632)
!631 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!632 = !{!633, !637}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !630, file: !631, line: 33, baseType: !634, size: 16)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !631, line: 26, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !636, line: 10, baseType: !497)
!636 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!637 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !630, file: !631, line: 34, baseType: !638, size: 112, offset: 16)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 112, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 14)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !627, file: !620, line: 243, baseType: !630, size: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !627, file: !620, line: 244, baseType: !630, size: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !627, file: !620, line: 245, baseType: !630, size: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !627, file: !620, line: 246, baseType: !630, size: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !627, file: !620, line: 247, baseType: !646, size: 16)
!646 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !627, file: !620, line: 248, baseType: !53, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !627, file: !620, line: 249, baseType: !53, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !627, file: !620, line: 250, baseType: !650, size: 192)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !620, line: 196, size: 192, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !650, file: !620, line: 197, baseType: !333, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !650, file: !620, line: 198, baseType: !333, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !650, file: !620, line: 199, baseType: !497, size: 16, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !650, file: !620, line: 200, baseType: !503, size: 8, offset: 144)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !650, file: !620, line: 201, baseType: !503, size: 8, offset: 152)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !650, file: !620, line: 202, baseType: !503, size: 8, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !627, file: !620, line: 251, baseType: !288, size: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !627, file: !620, line: 252, baseType: !288, size: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !627, file: !620, line: 253, baseType: !612, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !627, file: !620, line: 254, baseType: !662, size: 128)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !620, line: 207, size: 128, elements: !663)
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !620, line: 208, baseType: !7, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !662, file: !620, line: 209, baseType: !7, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !662, file: !620, line: 222, baseType: !667, size: 64, offset: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !662, file: !620, line: 210, size: 64, elements: !668)
!668 = !{!669, !677, !684, !696, !702, !709, !720, !728}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !667, file: !620, line: 212, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !672, line: 56, baseType: !673)
!672 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 53, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !673, file: !672, line: 54, baseType: !497, size: 16)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !673, file: !672, line: 55, baseType: !497, size: 16, offset: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !667, file: !620, line: 213, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !672, line: 80, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 77, size: 64, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !680, file: !672, line: 78, baseType: !7, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !680, file: !672, line: 79, baseType: !7, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !667, file: !620, line: 214, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !672, line: 66, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 58, size: 192, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !687, file: !672, line: 59, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !687, file: !672, line: 60, baseType: !7, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !687, file: !672, line: 61, baseType: !7, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !687, file: !672, line: 62, baseType: !7, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !687, file: !672, line: 63, baseType: !7, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !687, file: !672, line: 64, baseType: !497, size: 16, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !687, file: !672, line: 65, baseType: !497, size: 16, offset: 176)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !667, file: !620, line: 215, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !672, line: 70, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 68, size: 32, elements: !700)
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !699, file: !672, line: 69, baseType: !7, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !667, file: !620, line: 216, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !672, line: 75, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 72, size: 160, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !705, file: !672, line: 73, baseType: !7, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !705, file: !672, line: 74, baseType: !288, size: 128, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !667, file: !620, line: 217, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !672, line: 89, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 82, size: 192, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !712, file: !672, line: 83, baseType: !497, size: 16)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !712, file: !672, line: 84, baseType: !7, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !712, file: !672, line: 85, baseType: !7, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !712, file: !672, line: 86, baseType: !7, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !712, file: !672, line: 87, baseType: !7, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !712, file: !672, line: 88, baseType: !7, size: 32, offset: 160)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !667, file: !620, line: 220, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !672, line: 44, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 40, size: 96, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !723, file: !672, line: 41, baseType: !7, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !723, file: !672, line: 42, baseType: !7, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !723, file: !672, line: 43, baseType: !497, size: 16, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !667, file: !620, line: 221, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !672, line: 51, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !672, line: 46, size: 128, elements: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !731, file: !672, line: 47, baseType: !7, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !731, file: !672, line: 48, baseType: !7, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !731, file: !672, line: 49, baseType: !497, size: 16, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !731, file: !672, line: 50, baseType: !7, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !419, file: !52, line: 1304, baseType: !738, size: 64, offset: 768)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!53, !311, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !419, file: !52, line: 1306, baseType: !743, size: 64, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!53, !311, !53}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !419, file: !52, line: 1308, baseType: !747, size: 64, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!53, !311, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !52, line: 206, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !419, file: !52, line: 1310, baseType: !753, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !311, !7}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !419, file: !52, line: 1313, baseType: !757, size: 64, offset: 1024)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !311, !760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !762, line: 214, size: 1536, elements: !763)
!762 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !761, file: !762, line: 215, baseType: !354, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !761, file: !762, line: 216, baseType: !354, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !761, file: !762, line: 217, baseType: !354, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !761, file: !762, line: 218, baseType: !354, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !761, file: !762, line: 219, baseType: !354, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !761, file: !762, line: 220, baseType: !354, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !761, file: !762, line: 221, baseType: !354, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !761, file: !762, line: 222, baseType: !354, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !761, file: !762, line: 223, baseType: !354, size: 64, offset: 512)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !761, file: !762, line: 224, baseType: !354, size: 64, offset: 576)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !761, file: !762, line: 227, baseType: !354, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !761, file: !762, line: 228, baseType: !354, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !761, file: !762, line: 229, baseType: !354, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !761, file: !762, line: 230, baseType: !354, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !761, file: !762, line: 231, baseType: !354, size: 64, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !761, file: !762, line: 232, baseType: !354, size: 64, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !761, file: !762, line: 235, baseType: !354, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !761, file: !762, line: 236, baseType: !354, size: 64, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !761, file: !762, line: 237, baseType: !354, size: 64, offset: 1152)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !761, file: !762, line: 238, baseType: !354, size: 64, offset: 1216)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !761, file: !762, line: 239, baseType: !354, size: 64, offset: 1280)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !761, file: !762, line: 242, baseType: !354, size: 64, offset: 1344)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !761, file: !762, line: 243, baseType: !354, size: 64, offset: 1408)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !761, file: !762, line: 244, baseType: !354, size: 64, offset: 1472)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !419, file: !52, line: 1315, baseType: !789, size: 64, offset: 1088)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !794, !53}
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !298, line: 30, baseType: !793)
!793 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !419, file: !52, line: 1316, baseType: !797, size: 64, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!53, !53, !794, !612}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !419, file: !52, line: 1319, baseType: !801, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!804, !311}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !419, file: !52, line: 1321, baseType: !806, size: 64, offset: 1280)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DISubroutineType(types: !808)
!808 = !{!53, !311, !556, !602}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !419, file: !52, line: 1323, baseType: !806, size: 64, offset: 1344)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !419, file: !52, line: 1331, baseType: !811, size: 64, offset: 1408)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!53, !311, !53, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !353, line: 17, baseType: !502)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !419, file: !52, line: 1333, baseType: !817, size: 64, offset: 1472)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!53, !311, !53, !602, !815, !556}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !419, file: !52, line: 1336, baseType: !821, size: 64, offset: 1536)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{!53, !311, !53, !53, !53}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !419, file: !52, line: 1339, baseType: !825, size: 64, offset: 1600)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DISubroutineType(types: !827)
!827 = !{!53, !311, !53, !792}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !419, file: !52, line: 1341, baseType: !825, size: 64, offset: 1664)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !419, file: !52, line: 1343, baseType: !830, size: 64, offset: 1728)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{!53, !311, !53, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !835, line: 20, size: 576, elements: !836)
!835 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!836 = !{!837, !838, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !834, file: !835, line: 21, baseType: !514, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !834, file: !835, line: 22, baseType: !839, size: 256, offset: 32)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 256, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !834, file: !835, line: 23, baseType: !514, size: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !834, file: !835, line: 24, baseType: !514, size: 32, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !834, file: !835, line: 25, baseType: !514, size: 32, offset: 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !834, file: !835, line: 26, baseType: !514, size: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !834, file: !835, line: 27, baseType: !514, size: 32, offset: 416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !834, file: !835, line: 28, baseType: !514, size: 32, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !834, file: !835, line: 29, baseType: !514, size: 32, offset: 480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !834, file: !835, line: 30, baseType: !514, size: 32, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !834, file: !835, line: 31, baseType: !556, size: 16, offset: 544)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !419, file: !52, line: 1346, baseType: !852, size: 64, offset: 1792)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DISubroutineType(types: !854)
!854 = !{!53, !311, !53, !53}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !419, file: !52, line: 1348, baseType: !856, size: 64, offset: 1856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!53, !311, !53, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !835, line: 9, size: 512, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !860, file: !835, line: 10, baseType: !354, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !860, file: !835, line: 11, baseType: !354, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !860, file: !835, line: 12, baseType: !354, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !860, file: !835, line: 13, baseType: !354, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !860, file: !835, line: 14, baseType: !354, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !860, file: !835, line: 15, baseType: !354, size: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !860, file: !835, line: 16, baseType: !354, size: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !860, file: !835, line: 17, baseType: !354, size: 64, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !419, file: !52, line: 1352, baseType: !871, size: 64, offset: 1920)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!53, !311, !53, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !877, line: 213, size: 32, elements: !878)
!877 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !876, file: !877, line: 214, baseType: !496, size: 16)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !876, file: !877, line: 215, baseType: !496, size: 16, offset: 16)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !419, file: !52, line: 1355, baseType: !882, size: 64, offset: 1984)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!53, !311, !53, !436}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !419, file: !52, line: 1357, baseType: !886, size: 64, offset: 2048)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!53, !311, !53, !889, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !762, line: 956, size: 128, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !890, file: !762, line: 957, baseType: !514, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !890, file: !762, line: 958, baseType: !354, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !419, file: !52, line: 1361, baseType: !895, size: 64, offset: 2112)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!53, !311, !53, !352, !53}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !419, file: !52, line: 1364, baseType: !825, size: 64, offset: 2176)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !419, file: !52, line: 1367, baseType: !900, size: 64, offset: 2240)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{!53, !311, !58, !612}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !419, file: !52, line: 1400, baseType: !904, size: 64, offset: 2304)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!53, !311, !311, !907}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !909, line: 75, size: 384, elements: !910)
!909 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!910 = !{!911, !912, !915, !919, !923}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !908, file: !909, line: 76, baseType: !313, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !908, file: !909, line: 77, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !908, file: !909, line: 78, baseType: !916, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !909, line: 78, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !908, file: !909, line: 79, baseType: !920, size: 160, offset: 192)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 160, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 20)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !908, file: !909, line: 80, baseType: !815, size: 8, offset: 352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !419, file: !52, line: 1403, baseType: !925, size: 64, offset: 2368)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!53, !311, !311}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !419, file: !52, line: 1405, baseType: !929, size: 64, offset: 2432)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!311, !311, !436, !792}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !419, file: !52, line: 1408, baseType: !933, size: 64, offset: 2496)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!350, !311, !350}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !419, file: !52, line: 1410, baseType: !937, size: 64, offset: 2560)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!53, !311, !350}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !419, file: !52, line: 1412, baseType: !941, size: 64, offset: 2624)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!53, !311, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !946, line: 35, flags: DIFlagFwdDecl)
!946 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !419, file: !52, line: 1414, baseType: !948, size: 64, offset: 2688)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !311, !944}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !419, file: !52, line: 1417, baseType: !952, size: 64, offset: 2752)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!53, !955, !874, !311, !967, !602, !602, !907}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !957, line: 8, size: 96, elements: !958)
!957 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!958 = !{!959, !960, !961, !962, !964, !965, !966}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !956, file: !957, line: 9, baseType: !502, size: 8)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !956, file: !957, line: 10, baseType: !502, size: 8, offset: 8)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !956, file: !957, line: 11, baseType: !496, size: 16, offset: 16)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !956, file: !957, line: 12, baseType: !963, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !355, line: 26, baseType: !53)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !956, file: !957, line: 13, baseType: !496, size: 16, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !956, file: !957, line: 14, baseType: !502, size: 8, offset: 80)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !956, file: !957, line: 15, baseType: !502, size: 8, offset: 88)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !419, file: !52, line: 1424, baseType: !970, size: 64, offset: 2816)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!53, !955, !874, !311, !967, !602}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !419, file: !52, line: 1429, baseType: !974, size: 64, offset: 2880)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!53, !436, !977, !311, !311, !1022}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !909, line: 203, size: 1024, elements: !979)
!979 = !{!980, !981, !991, !995, !999, !1000, !1004, !1005, !1006, !1007, !1009, !1010, !1011, !1012}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !978, file: !909, line: 204, baseType: !436, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !978, file: !909, line: 205, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !877, line: 44, size: 128, elements: !985)
!985 = !{!986, !987, !988, !989, !990}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !984, file: !877, line: 45, baseType: !514, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !984, file: !877, line: 46, baseType: !496, size: 16, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !984, file: !877, line: 47, baseType: !496, size: 16, offset: 48)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !984, file: !877, line: 48, baseType: !514, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !984, file: !877, line: 49, baseType: !514, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !978, file: !909, line: 206, baseType: !992, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!53, !436, !977}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !978, file: !909, line: 208, baseType: !996, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!53, !977}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !978, file: !909, line: 209, baseType: !612, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !978, file: !909, line: 211, baseType: !1001, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1003, line: 76, flags: DIFlagFwdDecl)
!1003 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !978, file: !909, line: 212, baseType: !907, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !978, file: !909, line: 213, baseType: !602, size: 16, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !978, file: !909, line: 214, baseType: !602, size: 16, offset: 464)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !978, file: !909, line: 215, baseType: !1008, size: 32, offset: 480)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !353, line: 21, baseType: !514)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !978, file: !909, line: 216, baseType: !7, size: 32, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !978, file: !909, line: 216, baseType: !7, size: 32, offset: 544)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !978, file: !909, line: 217, baseType: !792, size: 8, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, scope: !978, file: !909, line: 218, baseType: !1013, size: 384, offset: 640)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !978, file: !909, line: 218, size: 384, elements: !1014)
!1014 = !{!1015, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1013, file: !909, line: 219, baseType: !1016, size: 384)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 384, elements: !479)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1013, file: !909, line: 224, baseType: !1018, size: 384)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 384, elements: !1020)
!1019 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1020 = !{!1021}
!1021 = !DISubrange(count: 6)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !419, file: !52, line: 1434, baseType: !1024, size: 64, offset: 2944)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!53, !436, !874, !311, !967, !602, !1008, !1008, !907}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !419, file: !52, line: 1440, baseType: !1028, size: 64, offset: 3008)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!53, !311, !1031, !602, !907}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !419, file: !52, line: 1444, baseType: !1033, size: 64, offset: 3072)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!53, !436, !1008, !1008, !311, !1008, !53}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !419, file: !52, line: 1449, baseType: !1037, size: 64, offset: 3136)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!53, !311, !1031, !602}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !419, file: !52, line: 1452, baseType: !1041, size: 64, offset: 3200)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!53, !311, !792}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !419, file: !52, line: 1454, baseType: !1045, size: 64, offset: 3264)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!53, !311, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !52, line: 820, size: 264, elements: !1050)
!1050 = !{!1051, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1049, file: !52, line: 821, baseType: !1052, size: 256)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 256, elements: !840)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1049, file: !52, line: 822, baseType: !503, size: 8, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !419, file: !52, line: 1456, baseType: !1045, size: 64, offset: 3328)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !419, file: !52, line: 1458, baseType: !1056, size: 64, offset: 3392)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!53, !311, !1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !298, line: 55, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1062, line: 72, baseType: !1063)
!1062 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1062, line: 16, baseType: !333)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !419, file: !52, line: 1460, baseType: !1065, size: 64, offset: 3456)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{null, !311, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !52, line: 67, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !419, file: !52, line: 1462, baseType: !1065, size: 64, offset: 3520)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !419, file: !52, line: 1464, baseType: !1072, size: 64, offset: 3584)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!612, !311, !311}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !419, file: !52, line: 1466, baseType: !1076, size: 64, offset: 3648)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{null, !311, !612}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !419, file: !52, line: 1469, baseType: !1080, size: 64, offset: 3712)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!53, !311, !53, !1008}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !419, file: !52, line: 1472, baseType: !1084, size: 64, offset: 3776)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!53, !794}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !419, file: !52, line: 1473, baseType: !1041, size: 64, offset: 3840)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !419, file: !52, line: 1475, baseType: !1089, size: 64, offset: 3904)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!53, !311, !436}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !419, file: !52, line: 1477, baseType: !604, size: 64, offset: 3968)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !419, file: !52, line: 1479, baseType: !1094, size: 64, offset: 4032)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!53, !311, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !52, line: 894, size: 256, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1098, file: !52, line: 895, baseType: !78, size: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, scope: !1098, file: !52, line: 896, baseType: !1102, size: 192, offset: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1098, file: !52, line: 896, size: 192, elements: !1103)
!1103 = !{!1104, !1113, !5799}
!1104 = !DIDerivedType(tag: DW_TAG_member, scope: !1102, file: !52, line: 898, baseType: !1105, size: 192)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1102, file: !52, line: 898, size: 192, elements: !1106)
!1106 = !{!1107, !1108, !1112}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1105, file: !52, line: 899, baseType: !1008, size: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1105, file: !52, line: 900, baseType: !1109, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1111, line: 11, flags: DIFlagFwdDecl)
!1111 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1105, file: !52, line: 901, baseType: !907, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, scope: !1102, file: !52, line: 904, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1102, file: !52, line: 904, size: 64, elements: !1115)
!1115 = !{!1116}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1114, file: !52, line: 905, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !86, line: 222, size: 2560, elements: !1119)
!1119 = !{!1120, !5778, !5779, !5797, !5798}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1118, file: !86, line: 223, baseType: !1121, size: 2048)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !86, line: 141, size: 2048, elements: !1122)
!1122 = !{!1123, !5752, !5753, !5754, !5755, !5756, !5757, !5758, !5759, !5760, !5761, !5762, !5763, !5764, !5769, !5770, !5771, !5772, !5773, !5774, !5775, !5776, !5777}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1121, file: !86, line: 145, baseType: !1124, size: 64, align: 512)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !86, line: 54, size: 2368, elements: !1127)
!1127 = !{!1128, !1327, !1332, !5424, !5428, !5432, !5433, !5437, !5443, !5444, !5445, !5446, !5447, !5451, !5455, !5459, !5460, !5461, !5465, !5466, !5478, !5482, !5486, !5498, !5687, !5691, !5695, !5700, !5704, !5708, !5712, !5718, !5722, !5729, !5733, !5735, !5736}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1126, file: !86, line: 56, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!53, !1132}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !117, line: 483, size: 960, align: 64, elements: !1134)
!1134 = !{!1135, !1151, !1162, !1173, !1197, !1203, !1211, !1228, !1241, !1247, !1256, !1261, !1269, !1281, !1301, !1308, !1312, !1316, !1321}
!1135 = !DIDerivedType(tag: DW_TAG_member, scope: !1133, file: !117, line: 484, baseType: !1136, size: 512)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1133, file: !117, line: 484, size: 512, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1136, file: !117, line: 485, baseType: !514, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1136, file: !117, line: 486, baseType: !514, size: 32, offset: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1136, file: !117, line: 487, baseType: !514, size: 32, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1136, file: !117, line: 488, baseType: !514, size: 32, offset: 96)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1136, file: !117, line: 489, baseType: !514, size: 32, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1136, file: !117, line: 492, baseType: !514, size: 32, offset: 160)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1136, file: !117, line: 493, baseType: !514, size: 32, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1136, file: !117, line: 496, baseType: !288, size: 128, offset: 224)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1136, file: !117, line: 497, baseType: !514, size: 32, offset: 352)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1136, file: !117, line: 498, baseType: !514, size: 32, offset: 384)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1136, file: !117, line: 499, baseType: !514, size: 32, offset: 416)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1136, file: !117, line: 500, baseType: !514, size: 32, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1136, file: !117, line: 501, baseType: !514, size: 32, offset: 480)
!1151 = !DIDerivedType(tag: DW_TAG_member, scope: !1133, file: !117, line: 507, baseType: !1152, size: 256)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1133, file: !117, line: 507, size: 256, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1161}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1152, file: !117, line: 508, baseType: !514, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1152, file: !117, line: 509, baseType: !354, size: 64, align: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, scope: !1152, file: !117, line: 510, baseType: !1157, size: 64, offset: 128)
!1157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1152, file: !117, line: 510, size: 64, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1157, file: !117, line: 511, baseType: !354, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1157, file: !117, line: 512, baseType: !354, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1152, file: !117, line: 514, baseType: !354, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1133, file: !117, line: 532, baseType: !1163, size: 448)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1133, file: !117, line: 517, size: 448, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1163, file: !117, line: 518, baseType: !354, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1163, file: !117, line: 521, baseType: !354, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1163, file: !117, line: 522, baseType: !354, size: 64, align: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1163, file: !117, line: 523, baseType: !354, size: 64, align: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1163, file: !117, line: 524, baseType: !514, size: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1163, file: !117, line: 529, baseType: !514, size: 32, offset: 288)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1163, file: !117, line: 530, baseType: !354, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1163, file: !117, line: 531, baseType: !354, size: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, scope: !1133, file: !117, line: 534, baseType: !1174, size: 960)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1133, file: !117, line: 534, size: 960, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1174, file: !117, line: 535, baseType: !514, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1174, file: !117, line: 536, baseType: !514, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1174, file: !117, line: 537, baseType: !354, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1174, file: !117, line: 538, baseType: !354, size: 64, align: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1174, file: !117, line: 539, baseType: !514, size: 32, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1174, file: !117, line: 540, baseType: !514, size: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1174, file: !117, line: 541, baseType: !354, size: 64, align: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1174, file: !117, line: 542, baseType: !514, size: 32, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1174, file: !117, line: 543, baseType: !514, size: 32, offset: 352)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1174, file: !117, line: 544, baseType: !288, size: 128, offset: 384)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1174, file: !117, line: 545, baseType: !514, size: 32, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1174, file: !117, line: 550, baseType: !514, size: 32, offset: 544)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1174, file: !117, line: 551, baseType: !514, size: 32, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1174, file: !117, line: 552, baseType: !514, size: 32, offset: 608)
