; ModuleID = '../bcout/drivers/media/usb/dvb-usb/dvb-usb-dvb.llvm.bc'
source_filename = "drivers/media/usb/dvb-usb/dvb-usb-dvb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dvb_usb_adapter = type { %struct.dvb_usb_device*, %struct.dvb_usb_adapter_properties, i32, i8, i32, %struct.dvb_adapter, %struct.dmxdev, %struct.dvb_demux, %struct.dvb_net, [3 x %struct.dvb_usb_fe_adapter], i32, i32, i8* }
%struct.dvb_usb_device = type { %struct.dvb_usb_device_properties, %struct.dvb_usb_device_description*, %struct.usb_device*, i32, i32, %struct.mutex, %struct.mutex, %struct.mutex, %struct.i2c_adapter, i32, [2 x %struct.dvb_usb_adapter], %struct.rc_dev*, %struct.input_dev*, [64 x i8], %struct.delayed_work, i32, i32, %struct.module*, i8* }
%struct.dvb_usb_device_properties = type { i32, i32, i32 (%struct.usb_device*, %struct.firmware*)*, i8*, i32, i32, i32 (%struct.dvb_usb_device*)*, void (%struct.dvb_usb_device*)*, i32, [2 x %struct.dvb_usb_adapter_properties], i32 (%struct.dvb_usb_device*, i32)*, i32 (%struct.dvb_usb_device*, i8*)*, i32 (%struct.usb_device*, %struct.dvb_usb_device_properties*, %struct.dvb_usb_device_description**, i32*)*, %struct.anon.145, %struct.i2c_algorithm*, i32, i32, i32, [12 x %struct.dvb_usb_device_description] }
%struct.firmware = type { i64, i8*, i8* }
%struct.anon.145 = type { i32, %struct.dvb_rc_legacy, %struct.dvb_rc }

!236 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!237 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!238 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!239 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !228, line: 602, baseType: !5, size: 32, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247}
!242 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!243 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!244 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!245 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!246 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!247 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !228, line: 615, baseType: !5, size: 32, elements: !249)
!249 = !{!250, !251, !252, !253}
!250 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!253 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !228, line: 626, baseType: !5, size: 32, elements: !255)
!255 = !{!256, !257, !258, !259, !260}
!256 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!257 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!258 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!259 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!260 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !228, line: 638, baseType: !5, size: 32, elements: !262)
!262 = !{!263, !264}
!263 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!264 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !228, line: 647, baseType: !5, size: 32, elements: !266)
!266 = !{!267, !268}
!267 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!269 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !270, line: 54, baseType: !5, size: 32, elements: !271)
!270 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!271 = !{!272, !273, !274, !275}
!272 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!273 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!274 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!275 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !50, line: 423, baseType: !5, size: 32, elements: !277)
!277 = !{!278, !279, !280, !281}
!278 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!279 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!280 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!281 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!282 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !283, file: !50, line: 2085, baseType: !5, size: 32, elements: !7248)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !50, line: 1858, size: 15808, elements: !284)
!284 = !{!285, !290, !313, !330, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !347, !355, !356, !357, !358, !359, !360, !361, !362, !363, !389, !399, !400, !401, !406, !407, !411, !414, !5844, !6360, !6364, !6404, !6405, !6406, !6407, !6408, !6409, !6410, !6411, !6412, !6413, !6414, !6415, !6416, !6417, !6418, !6419, !6420, !6421, !6422, !6423, !6424, !6425, !6426, !6427, !6428, !6429, !6430, !6435, !6436, !6437, !6438, !6439, !6440, !6441, !6444, !6493, !6496, !6499, !6502, !6503, !6516, !6517, !6518, !6519, !6520, !6521, !6528, !6529, !6563, !6564, !6565, !6566, !6567, !6568, !6569, !6570, !6571, !6574, !6575, !6576, !6577, !6578, !6579, !6580, !6581, !6582, !6587, !6588, !6589, !6594, !6631, !7203, !7205, !7206, !7210, !7211, !7212, !7213, !7219, !7221, !7224, !7227, !7229, !7230, !7231, !7232, !7233, !7237, !7240}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !283, file: !50, line: 1859, baseType: !286, size: 128)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 128, elements: !288)
!287 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!288 = !{!289}
!289 = !DISubrange(count: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !283, file: !50, line: 1860, baseType: !291, size: 64, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !50, line: 938, size: 384, elements: !293)
!293 = !{!294, !302, !308, !310}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !292, file: !50, line: 939, baseType: !295, size: 128)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !296, line: 186, size: 128, elements: !297)
!296 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!297 = !{!298, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !296, line: 187, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !295, file: !296, line: 187, baseType: !301, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !292, file: !50, line: 940, baseType: !303, size: 128, offset: 128)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !296, line: 178, size: 128, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !296, line: 179, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !303, file: !296, line: 179, baseType: !306, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !292, file: !50, line: 941, baseType: !309, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !292, file: !50, line: 942, baseType: !311, size: 64, offset: 320)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !283, file: !50, line: 1861, baseType: !314, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !50, line: 930, size: 128, elements: !316)
!316 = !{!317, !326}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !315, file: !50, line: 931, baseType: !318, size: 128, align: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !296, line: 216, size: 128, align: 64, elements: !319)
!319 = !{!320, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !296, line: 217, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !318, file: !296, line: 218, baseType: !323, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DISubroutineType(types: !325)
!325 = !{null, !321}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !315, file: !50, line: 932, baseType: !327, offset: 128)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: -1)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !283, file: !50, line: 1866, baseType: !331, size: 64, offset: 256)
!331 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !283, file: !50, line: 1867, baseType: !331, size: 64, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !283, file: !50, line: 1868, baseType: !331, size: 64, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !283, file: !50, line: 1869, baseType: !51, size: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !283, file: !50, line: 1877, baseType: !331, size: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !283, file: !50, line: 1879, baseType: !303, size: 128, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !283, file: !50, line: 1880, baseType: !303, size: 128, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !283, file: !50, line: 1881, baseType: !303, size: 128, offset: 832)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !283, file: !50, line: 1882, baseType: !303, size: 128, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !283, file: !50, line: 1883, baseType: !303, size: 128, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !283, file: !50, line: 1884, baseType: !303, size: 128, offset: 1216)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !283, file: !50, line: 1889, baseType: !343, size: 256, offset: 1344)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !283, file: !50, line: 1886, size: 256, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !343, file: !50, line: 1887, baseType: !303, size: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !343, file: !50, line: 1888, baseType: !303, size: 128, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !283, file: !50, line: 1891, baseType: !348, size: 64, offset: 1600)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !349, line: 12, baseType: !350)
!349 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !351, line: 23, baseType: !352)
!351 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !353, line: 31, baseType: !354)
!353 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!354 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !283, file: !50, line: 1892, baseType: !348, size: 64, offset: 1664)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !283, file: !50, line: 1893, baseType: !348, size: 64, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !283, file: !50, line: 1894, baseType: !348, size: 64, offset: 1792)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !283, file: !50, line: 1895, baseType: !348, size: 64, offset: 1856)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !283, file: !50, line: 1896, baseType: !348, size: 64, offset: 1920)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !283, file: !50, line: 1897, baseType: !348, size: 64, offset: 1984)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !283, file: !50, line: 1899, baseType: !51, size: 32, offset: 2048)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !283, file: !50, line: 1900, baseType: !51, size: 32, offset: 2080)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !283, file: !50, line: 1902, baseType: !364, size: 1472, offset: 2112)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !50, line: 169, size: 1472, elements: !365)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !364, file: !50, line: 170, baseType: !331, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !364, file: !50, line: 171, baseType: !331, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !364, file: !50, line: 172, baseType: !331, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !364, file: !50, line: 173, baseType: !331, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !364, file: !50, line: 174, baseType: !331, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !364, file: !50, line: 175, baseType: !331, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !364, file: !50, line: 176, baseType: !331, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !364, file: !50, line: 177, baseType: !331, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !364, file: !50, line: 178, baseType: !331, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !364, file: !50, line: 179, baseType: !331, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !364, file: !50, line: 180, baseType: !331, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !364, file: !50, line: 181, baseType: !331, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !364, file: !50, line: 182, baseType: !331, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !364, file: !50, line: 183, baseType: !331, size: 64, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !364, file: !50, line: 184, baseType: !331, size: 64, offset: 896)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !364, file: !50, line: 185, baseType: !331, size: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !364, file: !50, line: 186, baseType: !331, size: 64, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !364, file: !50, line: 187, baseType: !331, size: 64, offset: 1088)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !364, file: !50, line: 188, baseType: !331, size: 64, offset: 1152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !364, file: !50, line: 189, baseType: !331, size: 64, offset: 1216)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !364, file: !50, line: 190, baseType: !331, size: 64, offset: 1280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !364, file: !50, line: 191, baseType: !331, size: 64, offset: 1344)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !364, file: !50, line: 192, baseType: !331, size: 64, offset: 1408)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !283, file: !50, line: 1904, baseType: !390, size: 64, offset: 3584)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !391, line: 13, baseType: !392)
!391 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !296, line: 175, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 173, size: 64, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !393, file: !296, line: 174, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !351, line: 22, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !353, line: 30, baseType: !398)
!398 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !283, file: !50, line: 1905, baseType: !390, size: 64, offset: 3648)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !283, file: !50, line: 1906, baseType: !390, size: 64, offset: 3712)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !283, file: !50, line: 1909, baseType: !402, size: 32, offset: 3776)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !296, line: 168, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 166, size: 32, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !403, file: !296, line: 167, baseType: !51, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !283, file: !50, line: 1910, baseType: !402, size: 32, offset: 3808)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !283, file: !50, line: 1913, baseType: !408, size: 64, offset: 3840)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !50, line: 1913, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !283, file: !50, line: 1914, baseType: !412, size: 64, offset: 3904)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !50, line: 1914, flags: DIFlagFwdDecl)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !283, file: !50, line: 1916, baseType: !415, size: 64, offset: 3968)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !50, line: 1283, size: 4416, elements: !418)
!418 = !{!419, !423, !427, !428, !429, !592, !596, !601, !605, !606, !611, !612, !735, !740, !744, !750, !754, !786, !794, !798, !803, !807, !808, !814, !818, !822, !826, !827, !849, !853, !868, !879, !883, !892, !896, !897, !901, !922, !926, !930, !934, !938, !945, !949, !967, !971, !1021, !1025, !1030, !1034, !1038, !1042, !1052, !1053, !1062, !1068, !1069, !1073, !1077, !1081, !1085, !1086, !1090, !1091, !5804, !5824, !5828, !5834, !5840}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !417, file: !50, line: 1284, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DISubroutineType(types: !422)
!422 = !{!51, !309}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !417, file: !50, line: 1285, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !309}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !417, file: !50, line: 1286, baseType: !420, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !417, file: !50, line: 1287, baseType: !420, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !417, file: !50, line: 1288, baseType: !430, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !434, !309}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !50, line: 120, baseType: !49)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !436, line: 713, size: 1600, elements: !437)
!436 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!437 = !{!438, !460, !468, !475, !479, !491, !492, !493, !496, !497, !498, !504, !505, !506, !507, !508, !509, !510, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !550, !551, !552, !553, !555, !556, !561, !566, !571, !572, !573, !574, !575, !576, !577, !578, !579, !581, !582, !584, !585, !586}
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 714, baseType: !439, size: 192)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 714, size: 192, elements: !440)
!440 = !{!441, !451, !459}
!441 = !DIDerivedType(tag: DW_TAG_member, scope: !439, file: !436, line: 715, baseType: !442, size: 192)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !436, line: 715, size: 192, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !436, line: 717, baseType: !434, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !442, file: !436, line: 718, baseType: !434, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, scope: !442, file: !436, line: 720, baseType: !447, size: 64, offset: 128)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !442, file: !436, line: 720, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !447, file: !436, line: 721, baseType: !309, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !447, file: !436, line: 726, baseType: !331, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !439, file: !436, line: 729, baseType: !452, size: 192, align: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !453, line: 24, size: 192, align: 64, elements: !454)
!453 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!454 = !{!455, !456, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !452, file: !453, line: 25, baseType: !331, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !452, file: !453, line: 26, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !452, file: !453, line: 27, baseType: !457, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !439, file: !436, line: 730, baseType: !303, size: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 733, baseType: !461, size: 64, offset: 192)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 733, size: 64, elements: !462)
!462 = !{!463, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !461, file: !436, line: 734, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !466, line: 19, flags: DIFlagFwdDecl)
!466 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !461, file: !436, line: 735, baseType: !51, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 738, baseType: !469, size: 64, offset: 256)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 738, size: 64, elements: !470)
!470 = !{!471, !474}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !469, file: !436, line: 739, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !473, line: 29, baseType: !396)
!473 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!474 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !469, file: !436, line: 740, baseType: !350, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !435, file: !436, line: 748, baseType: !476, size: 384, align: 64, offset: 320)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 384, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 48)
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 750, baseType: !480, size: 128, offset: 704)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 750, size: 128, elements: !481)
!481 = !{!482, !490}
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !480, file: !436, line: 751, baseType: !483, size: 128)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !480, file: !436, line: 751, size: 128, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !483, file: !436, line: 752, baseType: !331, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !483, file: !436, line: 753, baseType: !487, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !434}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !480, file: !436, line: 755, baseType: !303, size: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !435, file: !436, line: 761, baseType: !5, size: 32, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !435, file: !436, line: 762, baseType: !5, size: 32, offset: 864)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !435, file: !436, line: 763, baseType: !494, size: 16, offset: 896)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !353, line: 24, baseType: !495)
!495 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !435, file: !436, line: 764, baseType: !494, size: 16, offset: 912)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !435, file: !436, line: 769, baseType: !494, size: 16, offset: 928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !435, file: !436, line: 780, baseType: !499, offset: 944)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, elements: !502)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !353, line: 21, baseType: !501)
!501 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!502 = !{!503}
!503 = !DISubrange(count: 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !435, file: !436, line: 782, baseType: !500, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !435, file: !436, line: 783, baseType: !500, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !435, file: !436, line: 784, baseType: !500, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !435, file: !436, line: 785, baseType: !500, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !435, file: !436, line: 786, baseType: !500, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !435, file: !436, line: 787, baseType: !500, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !435, file: !436, line: 795, baseType: !511, offset: 960)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, elements: !502)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !353, line: 27, baseType: !5)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !435, file: !436, line: 807, baseType: !499, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !435, file: !436, line: 809, baseType: !500, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !435, file: !436, line: 810, baseType: !500, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !435, file: !436, line: 811, baseType: !500, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !435, file: !436, line: 812, baseType: !500, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !435, file: !436, line: 813, baseType: !500, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !435, file: !436, line: 815, baseType: !500, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !435, file: !436, line: 816, baseType: !500, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !435, file: !436, line: 817, baseType: !500, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !435, file: !436, line: 818, baseType: !500, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !435, file: !436, line: 819, baseType: !500, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !435, file: !436, line: 821, baseType: !500, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !435, file: !436, line: 822, baseType: !500, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !435, file: !436, line: 823, baseType: !500, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !435, file: !436, line: 832, baseType: !499, offset: 976)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !435, file: !436, line: 834, baseType: !500, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !435, file: !436, line: 835, baseType: !500, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !435, file: !436, line: 836, baseType: !500, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !435, file: !436, line: 837, baseType: !500, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !435, file: !436, line: 838, baseType: !500, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !435, file: !436, line: 840, baseType: !500, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !435, file: !436, line: 843, baseType: !500, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !435, file: !436, line: 844, baseType: !500, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !435, file: !436, line: 845, baseType: !500, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !435, file: !436, line: 847, baseType: !500, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !435, file: !436, line: 848, baseType: !500, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!539 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 866, baseType: !540, size: 32, offset: 992)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 866, size: 32, elements: !541)
!541 = !{!542, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !540, file: !436, line: 867, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !544, line: 37, baseType: !512)
!544 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!545 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !436, line: 868, baseType: !546, size: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !436, line: 868, size: 32, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !546, file: !436, line: 869, baseType: !494, size: 16)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !546, file: !436, line: 870, baseType: !494, size: 16, offset: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !435, file: !436, line: 873, baseType: !512, size: 32, offset: 1024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !435, file: !436, line: 874, baseType: !51, size: 32, offset: 1056)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !435, file: !436, line: 875, baseType: !512, size: 32, offset: 1088)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !435, file: !436, line: 876, baseType: !554, size: 16, offset: 1120)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !544, line: 30, baseType: !494)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !435, file: !436, line: 877, baseType: !494, size: 16, offset: 1136)
!556 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 879, baseType: !557, size: 32, offset: 1152)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 879, size: 32, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !557, file: !436, line: 880, baseType: !5, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !557, file: !436, line: 881, baseType: !5, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 888, baseType: !562, size: 32, offset: 1184)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 888, size: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !562, file: !436, line: 889, baseType: !512, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !562, file: !436, line: 890, baseType: !512, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !436, line: 893, baseType: !567, size: 16, offset: 1216)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !435, file: !436, line: 893, size: 16, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !567, file: !436, line: 894, baseType: !554, size: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !567, file: !436, line: 895, baseType: !500, size: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !435, file: !436, line: 898, baseType: !494, size: 16, offset: 1232)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !435, file: !436, line: 899, baseType: !494, size: 16, offset: 1248)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !435, file: !436, line: 900, baseType: !494, size: 16, offset: 1264)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !435, file: !436, line: 902, baseType: !554, size: 16, offset: 1280)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !435, file: !436, line: 903, baseType: !494, size: 16, offset: 1296)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !435, file: !436, line: 904, baseType: !494, size: 16, offset: 1312)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !435, file: !436, line: 905, baseType: !494, size: 16, offset: 1328)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !435, file: !436, line: 908, baseType: !511, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !435, file: !436, line: 912, baseType: !580, size: 32, offset: 1344)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !436, line: 606, baseType: !5)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !435, file: !436, line: 913, baseType: !580, size: 32, offset: 1376)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !435, file: !436, line: 914, baseType: !583, size: 64, offset: 1408)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !435, file: !436, line: 915, baseType: !583, size: 64, offset: 1472)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !435, file: !436, line: 916, baseType: !5, size: 32, offset: 1536)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !435, file: !436, line: 917, baseType: !587, size: 32, offset: 1568)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !588, line: 113, baseType: !589)
!588 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !588, line: 111, size: 32, elements: !590)
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !589, file: !588, line: 112, baseType: !402, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !417, file: !50, line: 1290, baseType: !593, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!348, !434, !309, !348}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !417, file: !50, line: 1293, baseType: !597, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!600, !309, !434, !309}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !351, line: 19, baseType: !494)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !417, file: !50, line: 1296, baseType: !602, size: 64, offset: 448)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !309, !51}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !417, file: !50, line: 1298, baseType: !424, size: 64, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !417, file: !50, line: 1299, baseType: !607, size: 64, offset: 576)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!51, !309, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !417, file: !50, line: 1301, baseType: !420, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !417, file: !50, line: 1302, baseType: !613, size: 64, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!51, !309, !616, !51}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !618, line: 234, size: 320, elements: !619)
!618 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!619 = !{!620, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !617, file: !618, line: 239, baseType: !621, size: 128)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !618, line: 236, size: 128, elements: !622)
!622 = !{!623}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !621, file: !618, line: 238, baseType: !286, size: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !617, file: !618, line: 255, baseType: !625, size: 192, offset: 128)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !617, file: !618, line: 241, size: 192, elements: !626)
!626 = !{!627, !639, !640, !641, !642, !643, !645, !646, !647, !656, !657, !658, !659}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !625, file: !618, line: 242, baseType: !628, size: 128)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !629, line: 32, size: 128, elements: !630)
!629 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!630 = !{!631, !635}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !628, file: !629, line: 33, baseType: !632, size: 16)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !629, line: 26, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !634, line: 10, baseType: !495)
!634 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !628, file: !629, line: 34, baseType: !636, size: 112, offset: 16)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 112, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 14)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !625, file: !618, line: 243, baseType: !628, size: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !625, file: !618, line: 244, baseType: !628, size: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !625, file: !618, line: 245, baseType: !628, size: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !625, file: !618, line: 246, baseType: !628, size: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !625, file: !618, line: 247, baseType: !644, size: 16)
!644 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !625, file: !618, line: 248, baseType: !51, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !625, file: !618, line: 249, baseType: !51, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !625, file: !618, line: 250, baseType: !648, size: 192)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !618, line: 196, size: 192, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !648, file: !618, line: 197, baseType: !331, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !648, file: !618, line: 198, baseType: !331, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !648, file: !618, line: 199, baseType: !495, size: 16, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !648, file: !618, line: 200, baseType: !501, size: 8, offset: 144)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !648, file: !618, line: 201, baseType: !501, size: 8, offset: 152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !648, file: !618, line: 202, baseType: !501, size: 8, offset: 160)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !625, file: !618, line: 251, baseType: !286, size: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !625, file: !618, line: 252, baseType: !286, size: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !625, file: !618, line: 253, baseType: !610, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !625, file: !618, line: 254, baseType: !660, size: 128)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !618, line: 207, size: 128, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !618, line: 208, baseType: !5, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !660, file: !618, line: 209, baseType: !5, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !660, file: !618, line: 222, baseType: !665, size: 64, offset: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !660, file: !618, line: 210, size: 64, elements: !666)
!666 = !{!667, !675, !682, !694, !700, !707, !718, !726}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !665, file: !618, line: 212, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !670, line: 56, baseType: !671)
!670 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 53, size: 32, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !671, file: !670, line: 54, baseType: !495, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !671, file: !670, line: 55, baseType: !495, size: 16, offset: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !665, file: !618, line: 213, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !670, line: 80, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 77, size: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !678, file: !670, line: 78, baseType: !5, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !678, file: !670, line: 79, baseType: !5, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !665, file: !618, line: 214, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !670, line: 66, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 58, size: 192, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !685, file: !670, line: 59, baseType: !5, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !685, file: !670, line: 60, baseType: !5, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !685, file: !670, line: 61, baseType: !5, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !685, file: !670, line: 62, baseType: !5, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !685, file: !670, line: 63, baseType: !5, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !685, file: !670, line: 64, baseType: !495, size: 16, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !685, file: !670, line: 65, baseType: !495, size: 16, offset: 176)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !665, file: !618, line: 215, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !670, line: 70, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 68, size: 32, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !697, file: !670, line: 69, baseType: !5, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !665, file: !618, line: 216, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !670, line: 75, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 72, size: 160, elements: !704)
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !703, file: !670, line: 73, baseType: !5, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !703, file: !670, line: 74, baseType: !286, size: 128, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !665, file: !618, line: 217, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !670, line: 89, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 82, size: 192, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !710, file: !670, line: 83, baseType: !495, size: 16)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !710, file: !670, line: 84, baseType: !5, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !710, file: !670, line: 85, baseType: !5, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !710, file: !670, line: 86, baseType: !5, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !710, file: !670, line: 87, baseType: !5, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !710, file: !670, line: 88, baseType: !5, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !665, file: !618, line: 220, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !670, line: 44, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 40, size: 96, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !721, file: !670, line: 41, baseType: !5, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !721, file: !670, line: 42, baseType: !5, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !721, file: !670, line: 43, baseType: !495, size: 16, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !665, file: !618, line: 221, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !670, line: 51, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 46, size: 128, elements: !730)
!730 = !{!731, !732, !733, !734}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !729, file: !670, line: 47, baseType: !5, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !729, file: !670, line: 48, baseType: !5, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !729, file: !670, line: 49, baseType: !495, size: 16, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !729, file: !670, line: 50, baseType: !5, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !417, file: !50, line: 1304, baseType: !736, size: 64, offset: 768)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!51, !309, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !417, file: !50, line: 1306, baseType: !741, size: 64, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!51, !309, !51}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !417, file: !50, line: 1308, baseType: !745, size: 64, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!51, !309, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !50, line: 206, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !417, file: !50, line: 1310, baseType: !751, size: 64, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !309, !5}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !417, file: !50, line: 1313, baseType: !755, size: 64, offset: 1024)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !309, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !760, line: 214, size: 1536, elements: !761)
!760 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !759, file: !760, line: 215, baseType: !352, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !759, file: !760, line: 216, baseType: !352, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !759, file: !760, line: 217, baseType: !352, size: 64, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !759, file: !760, line: 218, baseType: !352, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !759, file: !760, line: 219, baseType: !352, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !759, file: !760, line: 220, baseType: !352, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !759, file: !760, line: 221, baseType: !352, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !759, file: !760, line: 222, baseType: !352, size: 64, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !759, file: !760, line: 223, baseType: !352, size: 64, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !759, file: !760, line: 224, baseType: !352, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !759, file: !760, line: 227, baseType: !352, size: 64, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !759, file: !760, line: 228, baseType: !352, size: 64, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !759, file: !760, line: 229, baseType: !352, size: 64, offset: 768)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !759, file: !760, line: 230, baseType: !352, size: 64, offset: 832)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !759, file: !760, line: 231, baseType: !352, size: 64, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !759, file: !760, line: 232, baseType: !352, size: 64, offset: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !759, file: !760, line: 235, baseType: !352, size: 64, offset: 1024)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !759, file: !760, line: 236, baseType: !352, size: 64, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !759, file: !760, line: 237, baseType: !352, size: 64, offset: 1152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !759, file: !760, line: 238, baseType: !352, size: 64, offset: 1216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !759, file: !760, line: 239, baseType: !352, size: 64, offset: 1280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !759, file: !760, line: 242, baseType: !352, size: 64, offset: 1344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !759, file: !760, line: 243, baseType: !352, size: 64, offset: 1408)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !759, file: !760, line: 244, baseType: !352, size: 64, offset: 1472)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !417, file: !50, line: 1315, baseType: !787, size: 64, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!790, !792, !51}
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !296, line: 30, baseType: !791)
!791 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !417, file: !50, line: 1316, baseType: !795, size: 64, offset: 1152)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!51, !51, !792, !610}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !417, file: !50, line: 1319, baseType: !799, size: 64, offset: 1216)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !309}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !417, file: !50, line: 1321, baseType: !804, size: 64, offset: 1280)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!51, !309, !554, !600}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !417, file: !50, line: 1323, baseType: !804, size: 64, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !417, file: !50, line: 1331, baseType: !809, size: 64, offset: 1408)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{!51, !309, !51, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !351, line: 17, baseType: !500)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !417, file: !50, line: 1333, baseType: !815, size: 64, offset: 1472)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{!51, !309, !51, !600, !813, !554}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !417, file: !50, line: 1336, baseType: !819, size: 64, offset: 1536)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DISubroutineType(types: !821)
!821 = !{!51, !309, !51, !51, !51}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !417, file: !50, line: 1339, baseType: !823, size: 64, offset: 1600)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!51, !309, !51, !790}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !417, file: !50, line: 1341, baseType: !823, size: 64, offset: 1664)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !417, file: !50, line: 1343, baseType: !828, size: 64, offset: 1728)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!51, !309, !51, !831}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !833, line: 20, size: 576, elements: !834)
!833 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!834 = !{!835, !836, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !832, file: !833, line: 21, baseType: !512, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !832, file: !833, line: 22, baseType: !837, size: 256, offset: 32)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 256, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !832, file: !833, line: 23, baseType: !512, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !832, file: !833, line: 24, baseType: !512, size: 32, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !832, file: !833, line: 25, baseType: !512, size: 32, offset: 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !832, file: !833, line: 26, baseType: !512, size: 32, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !832, file: !833, line: 27, baseType: !512, size: 32, offset: 416)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !832, file: !833, line: 28, baseType: !512, size: 32, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !832, file: !833, line: 29, baseType: !512, size: 32, offset: 480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !832, file: !833, line: 30, baseType: !512, size: 32, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !832, file: !833, line: 31, baseType: !554, size: 16, offset: 544)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !417, file: !50, line: 1346, baseType: !850, size: 64, offset: 1792)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!51, !309, !51, !51}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !417, file: !50, line: 1348, baseType: !854, size: 64, offset: 1856)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DISubroutineType(types: !856)
!856 = !{!51, !309, !51, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !833, line: 9, size: 512, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !858, file: !833, line: 10, baseType: !352, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !858, file: !833, line: 11, baseType: !352, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !858, file: !833, line: 12, baseType: !352, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !858, file: !833, line: 13, baseType: !352, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !858, file: !833, line: 14, baseType: !352, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !858, file: !833, line: 15, baseType: !352, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !858, file: !833, line: 16, baseType: !352, size: 64, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !858, file: !833, line: 17, baseType: !352, size: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !417, file: !50, line: 1352, baseType: !869, size: 64, offset: 1920)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!51, !309, !51, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !875, line: 213, size: 32, elements: !876)
!875 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !874, file: !875, line: 214, baseType: !494, size: 16)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !874, file: !875, line: 215, baseType: !494, size: 16, offset: 16)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !417, file: !50, line: 1355, baseType: !880, size: 64, offset: 1984)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{!51, !309, !51, !434}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !417, file: !50, line: 1357, baseType: !884, size: 64, offset: 2048)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{!51, !309, !51, !887, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !760, line: 956, size: 128, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !888, file: !760, line: 957, baseType: !512, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !888, file: !760, line: 958, baseType: !352, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !417, file: !50, line: 1361, baseType: !893, size: 64, offset: 2112)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!51, !309, !51, !350, !51}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !417, file: !50, line: 1364, baseType: !823, size: 64, offset: 2176)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !417, file: !50, line: 1367, baseType: !898, size: 64, offset: 2240)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!51, !309, !56, !610}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !417, file: !50, line: 1400, baseType: !902, size: 64, offset: 2304)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!51, !309, !309, !905}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !907, line: 75, size: 384, elements: !908)
!907 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!908 = !{!909, !910, !913, !917, !921}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !906, file: !907, line: 76, baseType: !311, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !906, file: !907, line: 77, baseType: !911, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !906, file: !907, line: 78, baseType: !914, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !907, line: 78, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !906, file: !907, line: 79, baseType: !918, size: 160, offset: 192)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 160, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 20)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !906, file: !907, line: 80, baseType: !813, size: 8, offset: 352)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !417, file: !50, line: 1403, baseType: !923, size: 64, offset: 2368)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!51, !309, !309}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !417, file: !50, line: 1405, baseType: !927, size: 64, offset: 2432)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!309, !309, !434, !790}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !417, file: !50, line: 1408, baseType: !931, size: 64, offset: 2496)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{!348, !309, !348}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !417, file: !50, line: 1410, baseType: !935, size: 64, offset: 2560)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!51, !309, !348}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !417, file: !50, line: 1412, baseType: !939, size: 64, offset: 2624)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!51, !309, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !944, line: 35, flags: DIFlagFwdDecl)
!944 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !417, file: !50, line: 1414, baseType: !946, size: 64, offset: 2688)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !309, !942}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !417, file: !50, line: 1417, baseType: !950, size: 64, offset: 2752)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!51, !953, !872, !309, !965, !600, !600, !905}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !955, line: 8, size: 96, elements: !956)
!955 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!956 = !{!957, !958, !959, !960, !962, !963, !964}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !954, file: !955, line: 9, baseType: !500, size: 8)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !954, file: !955, line: 10, baseType: !500, size: 8, offset: 8)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !954, file: !955, line: 11, baseType: !494, size: 16, offset: 16)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !954, file: !955, line: 12, baseType: !961, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !353, line: 26, baseType: !51)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !954, file: !955, line: 13, baseType: !494, size: 16, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !954, file: !955, line: 14, baseType: !500, size: 8, offset: 80)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !954, file: !955, line: 15, baseType: !500, size: 8, offset: 88)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !417, file: !50, line: 1424, baseType: !968, size: 64, offset: 2816)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!51, !953, !872, !309, !965, !600}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !417, file: !50, line: 1429, baseType: !972, size: 64, offset: 2880)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!51, !434, !975, !309, !309, !1020}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !907, line: 203, size: 1024, elements: !977)
!977 = !{!978, !979, !989, !993, !997, !998, !1002, !1003, !1004, !1005, !1007, !1008, !1009, !1010}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !976, file: !907, line: 204, baseType: !434, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !976, file: !907, line: 205, baseType: !980, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !875, line: 44, size: 128, elements: !983)
!983 = !{!984, !985, !986, !987, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !982, file: !875, line: 45, baseType: !512, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !982, file: !875, line: 46, baseType: !494, size: 16, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !982, file: !875, line: 47, baseType: !494, size: 16, offset: 48)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !982, file: !875, line: 48, baseType: !512, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !982, file: !875, line: 49, baseType: !512, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !976, file: !907, line: 206, baseType: !990, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!51, !434, !975}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !976, file: !907, line: 208, baseType: !994, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!51, !975}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !907, line: 209, baseType: !610, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !976, file: !907, line: 211, baseType: !999, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1001, line: 76, flags: DIFlagFwdDecl)
!1001 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !976, file: !907, line: 212, baseType: !905, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !976, file: !907, line: 213, baseType: !600, size: 16, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !976, file: !907, line: 214, baseType: !600, size: 16, offset: 464)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !976, file: !907, line: 215, baseType: !1006, size: 32, offset: 480)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !351, line: 21, baseType: !512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !976, file: !907, line: 216, baseType: !5, size: 32, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !976, file: !907, line: 216, baseType: !5, size: 32, offset: 544)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !976, file: !907, line: 217, baseType: !790, size: 8, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, scope: !976, file: !907, line: 218, baseType: !1011, size: 384, offset: 640)
!1011 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !976, file: !907, line: 218, size: 384, elements: !1012)
!1012 = !{!1013, !1015}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1011, file: !907, line: 219, baseType: !1014, size: 384)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 384, elements: !477)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1011, file: !907, line: 224, baseType: !1016, size: 384)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 384, elements: !1018)
!1017 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1018 = !{!1019}
!1019 = !DISubrange(count: 6)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !417, file: !50, line: 1434, baseType: !1022, size: 64, offset: 2944)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!51, !434, !872, !309, !965, !600, !1006, !1006, !905}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !417, file: !50, line: 1440, baseType: !1026, size: 64, offset: 3008)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!51, !309, !1029, !600, !905}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !417, file: !50, line: 1444, baseType: !1031, size: 64, offset: 3072)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!51, !434, !1006, !1006, !309, !1006, !51}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !417, file: !50, line: 1449, baseType: !1035, size: 64, offset: 3136)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!51, !309, !1029, !600}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !417, file: !50, line: 1452, baseType: !1039, size: 64, offset: 3200)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!51, !309, !790}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !417, file: !50, line: 1454, baseType: !1043, size: 64, offset: 3264)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!51, !309, !1046}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !50, line: 820, size: 264, elements: !1048)
!1048 = !{!1049, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1047, file: !50, line: 821, baseType: !1050, size: 256)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 256, elements: !838)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1047, file: !50, line: 822, baseType: !501, size: 8, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !417, file: !50, line: 1456, baseType: !1043, size: 64, offset: 3328)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !417, file: !50, line: 1458, baseType: !1054, size: 64, offset: 3392)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!51, !309, !1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !296, line: 55, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1060, line: 72, baseType: !1061)
!1060 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1060, line: 16, baseType: !331)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !417, file: !50, line: 1460, baseType: !1063, size: 64, offset: 3456)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !309, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !50, line: 67, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !417, file: !50, line: 1462, baseType: !1063, size: 64, offset: 3520)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !417, file: !50, line: 1464, baseType: !1070, size: 64, offset: 3584)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!610, !309, !309}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !417, file: !50, line: 1466, baseType: !1074, size: 64, offset: 3648)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !309, !610}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !417, file: !50, line: 1469, baseType: !1078, size: 64, offset: 3712)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!51, !309, !51, !1006}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !417, file: !50, line: 1472, baseType: !1082, size: 64, offset: 3776)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!51, !792}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !417, file: !50, line: 1473, baseType: !1039, size: 64, offset: 3840)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !417, file: !50, line: 1475, baseType: !1087, size: 64, offset: 3904)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!51, !309, !434}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !417, file: !50, line: 1477, baseType: !602, size: 64, offset: 3968)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !417, file: !50, line: 1479, baseType: !1092, size: 64, offset: 4032)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!51, !309, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !50, line: 894, size: 256, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1096, file: !50, line: 895, baseType: !76, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, scope: !1096, file: !50, line: 896, baseType: !1100, size: 192, offset: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1096, file: !50, line: 896, size: 192, elements: !1101)
!1101 = !{!1102, !1111, !5797}
!1102 = !DIDerivedType(tag: DW_TAG_member, scope: !1100, file: !50, line: 898, baseType: !1103, size: 192)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1100, file: !50, line: 898, size: 192, elements: !1104)
!1104 = !{!1105, !1106, !1110}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1103, file: !50, line: 899, baseType: !1006, size: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1103, file: !50, line: 900, baseType: !1107, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1109, line: 11, flags: DIFlagFwdDecl)
!1109 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1103, file: !50, line: 901, baseType: !905, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, scope: !1100, file: !50, line: 904, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1100, file: !50, line: 904, size: 64, elements: !1113)
!1113 = !{!1114}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1112, file: !50, line: 905, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !84, line: 222, size: 2560, elements: !1117)
!1117 = !{!1118, !5776, !5777, !5795, !5796}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1116, file: !84, line: 223, baseType: !1119, size: 2048)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !84, line: 141, size: 2048, elements: !1120)
!1120 = !{!1121, !5750, !5751, !5752, !5753, !5754, !5755, !5756, !5757, !5758, !5759, !5760, !5761, !5762, !5767, !5768, !5769, !5770, !5771, !5772, !5773, !5774, !5775}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1119, file: !84, line: 145, baseType: !1122, size: 64, align: 512)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !84, line: 54, size: 2368, elements: !1125)
!1125 = !{!1126, !1325, !1330, !5422, !5426, !5430, !5431, !5435, !5441, !5442, !5443, !5444, !5445, !5449, !5453, !5457, !5458, !5459, !5463, !5464, !5476, !5480, !5484, !5496, !5685, !5689, !5693, !5698, !5702, !5706, !5710, !5716, !5720, !5727, !5731, !5733, !5734}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1124, file: !84, line: 56, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!51, !1130}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !115, line: 483, size: 960, align: 64, elements: !1132)
!1132 = !{!1133, !1149, !1160, !1171, !1195, !1201, !1209, !1226, !1239, !1245, !1254, !1259, !1267, !1279, !1299, !1306, !1310, !1314, !1319}
!1133 = !DIDerivedType(tag: DW_TAG_member, scope: !1131, file: !115, line: 484, baseType: !1134, size: 512)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1131, file: !115, line: 484, size: 512, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1134, file: !115, line: 485, baseType: !512, size: 32)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1134, file: !115, line: 486, baseType: !512, size: 32, offset: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1134, file: !115, line: 487, baseType: !512, size: 32, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1134, file: !115, line: 488, baseType: !512, size: 32, offset: 96)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1134, file: !115, line: 489, baseType: !512, size: 32, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1134, file: !115, line: 492, baseType: !512, size: 32, offset: 160)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1134, file: !115, line: 493, baseType: !512, size: 32, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1134, file: !115, line: 496, baseType: !286, size: 128, offset: 224)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1134, file: !115, line: 497, baseType: !512, size: 32, offset: 352)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1134, file: !115, line: 498, baseType: !512, size: 32, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1134, file: !115, line: 499, baseType: !512, size: 32, offset: 416)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1134, file: !115, line: 500, baseType: !512, size: 32, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1134, file: !115, line: 501, baseType: !512, size: 32, offset: 480)
!1149 = !DIDerivedType(tag: DW_TAG_member, scope: !1131, file: !115, line: 507, baseType: !1150, size: 256)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1131, file: !115, line: 507, size: 256, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1159}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1150, file: !115, line: 508, baseType: !512, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1150, file: !115, line: 509, baseType: !352, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, scope: !1150, file: !115, line: 510, baseType: !1155, size: 64, offset: 128)
!1155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1150, file: !115, line: 510, size: 64, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1155, file: !115, line: 511, baseType: !352, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1155, file: !115, line: 512, baseType: !352, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1150, file: !115, line: 514, baseType: !352, size: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1131, file: !115, line: 532, baseType: !1161, size: 448)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1131, file: !115, line: 517, size: 448, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1161, file: !115, line: 518, baseType: !352, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1161, file: !115, line: 521, baseType: !352, size: 64, align: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1161, file: !115, line: 522, baseType: !352, size: 64, align: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1161, file: !115, line: 523, baseType: !352, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1161, file: !115, line: 524, baseType: !512, size: 32, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1161, file: !115, line: 529, baseType: !512, size: 32, offset: 288)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1161, file: !115, line: 530, baseType: !352, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !115, line: 531, baseType: !352, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, scope: !1131, file: !115, line: 534, baseType: !1172, size: 960)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1131, file: !115, line: 534, size: 960, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1172, file: !115, line: 535, baseType: !512, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1172, file: !115, line: 536, baseType: !512, size: 32, offset: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1172, file: !115, line: 537, baseType: !352, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1172, file: !115, line: 538, baseType: !352, size: 64, align: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1172, file: !115, line: 539, baseType: !512, size: 32, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1172, file: !115, line: 540, baseType: !512, size: 32, offset: 224)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1172, file: !115, line: 541, baseType: !352, size: 64, align: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1172, file: !115, line: 542, baseType: !512, size: 32, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1172, file: !115, line: 543, baseType: !512, size: 32, offset: 352)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1172, file: !115, line: 544, baseType: !286, size: 128, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "prog_ifindex", scope: !1172, file: !115, line: 545, baseType: !512, size: 32, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "expected_attach_type", scope: !1172, file: !115, line: 550, baseType: !512, size: 32, offset: 544)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "prog_btf_fd", scope: !1172, file: !115, line: 551, baseType: !512, size: 32, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "func_info_rec_size", scope: !1172, file: !115, line: 552, baseType: !512, size: 32, offset: 608)
