; ModuleID = '../bcout/drivers/media/usb/dvb-usb/vp702x-fe.llvm.bc'
source_filename = "drivers/media/usb/dvb-usb/vp702x-fe.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.dvb_frontend_ops = type { %struct.dvb_frontend_internal_info, [8 x i8], void (%struct.dvb_frontend*)*, void (%struct.dvb_frontend*)*, void (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, i8*, i32)*, i32 (%struct.dvb_frontend*, i1, i32, i32*, i32*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.dvb_frontend_tune_settings*)*, i32 (%struct.dvb_frontend*, %struct.dtv_frontend_properties*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i16*)*, i32 (%struct.dvb_frontend*, i32*)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*, %struct.dvb_diseqc_master_cmd*)*, i32 (%struct.dvb_frontend*, %struct.dvb_diseqc_slave_reply*)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i64)*, i32 (%struct.dvb_frontend*, i64)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*, i32)*, i32 (%struct.dvb_frontend*)*, i32 (%struct.dvb_frontend*)*, %struct.dvb_tuner_ops, %struct.analog_demod_ops }

!394 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_EEPROM_ISSUE", value: 6, isUnsigned: true)
!395 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_CALIBRATION_FAILURE", value: 7, isUnsigned: true)
!396 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_POWER_BUDGET_EXCEEDED", value: 8, isUnsigned: true)
!397 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_STATE_OVERHEAT", value: 9, isUnsigned: true)
!398 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_autoneg", file: !386, line: 602, baseType: !7, size: 32, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405}
!400 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED", value: 1, isUnsigned: true)
!401 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_ACK_NOT_RECEIVED", value: 2, isUnsigned: true)
!402 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NEXT_PAGE_EXCHANGE_FAILED", value: 3, isUnsigned: true)
!403 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_PARTNER_DETECTED_FORCE_MODE", value: 4, isUnsigned: true)
!404 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_FEC_MISMATCH_DURING_OVERRIDE", value: 5, isUnsigned: true)
!405 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_AN_NO_HCD", value: 6, isUnsigned: true)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_training", file: !386, line: 615, baseType: !7, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411}
!408 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_FRAME_LOCK_NOT_ACQUIRED", value: 1, isUnsigned: true)
!409 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_INHIBIT_TIMEOUT", value: 2, isUnsigned: true)
!410 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_KR_LINK_PARTNER_DID_NOT_SET_RECEIVER_READY", value: 3, isUnsigned: true)
!411 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LT_REMOTE_FAULT", value: 4, isUnsigned: true)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_link_logical_mismatch", file: !386, line: 626, baseType: !7, size: 32, elements: !413)
!413 = !{!414, !415, !416, !417, !418}
!414 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_BLOCK_LOCK", value: 1, isUnsigned: true)
!415 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_ACQUIRE_AM_LOCK", value: 2, isUnsigned: true)
!416 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_PCS_DID_NOT_GET_ALIGN_STATUS", value: 3, isUnsigned: true)
!417 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_FC_FEC_IS_NOT_LOCKED", value: 4, isUnsigned: true)
!418 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_LLM_RS_FEC_IS_NOT_LOCKED", value: 5, isUnsigned: true)
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_bad_signal_integrity", file: !386, line: 638, baseType: !7, size: 32, elements: !420)
!420 = !{!421, !422}
!421 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_LARGE_NUMBER_OF_PHYSICAL_ERRORS", value: 1, isUnsigned: true)
!422 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_BSI_UNSUPPORTED_RATE", value: 2, isUnsigned: true)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_link_ext_substate_cable_issue", file: !386, line: 647, baseType: !7, size: 32, elements: !424)
!424 = !{!425, !426}
!425 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_UNSUPPORTED_CABLE", value: 1, isUnsigned: true)
!426 = !DIEnumerator(name: "ETHTOOL_LINK_EXT_SUBSTATE_CI_CABLE_TEST_FAILURE", value: 2, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ethtool_phys_id_state", file: !428, line: 54, baseType: !7, size: 32, elements: !429)
!428 = !DIFile(filename: "./include/linux/ethtool.h", directory: "/home/lizy2001/genbc/linux")
!429 = !{!430, !431, !432, !433}
!430 = !DIEnumerator(name: "ETHTOOL_ID_INACTIVE", value: 0, isUnsigned: true)
!431 = !DIEnumerator(name: "ETHTOOL_ID_ACTIVE", value: 1, isUnsigned: true)
!432 = !DIEnumerator(name: "ETHTOOL_ID_ON", value: 2, isUnsigned: true)
!433 = !DIEnumerator(name: "ETHTOOL_ID_OFF", value: 3, isUnsigned: true)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_handler_result", file: !208, line: 423, baseType: !7, size: 32, elements: !435)
!435 = !{!436, !437, !438, !439}
!436 = !DIEnumerator(name: "RX_HANDLER_CONSUMED", value: 0, isUnsigned: true)
!437 = !DIEnumerator(name: "RX_HANDLER_ANOTHER", value: 1, isUnsigned: true)
!438 = !DIEnumerator(name: "RX_HANDLER_EXACT", value: 2, isUnsigned: true)
!439 = !DIEnumerator(name: "RX_HANDLER_PASS", value: 3, isUnsigned: true)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !441, file: !208, line: 2085, baseType: !7, size: 32, elements: !7406)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device", file: !208, line: 1858, size: 15808, elements: !442)
!442 = !{!443, !448, !471, !488, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !505, !513, !514, !515, !516, !517, !518, !519, !520, !521, !547, !557, !558, !559, !564, !565, !569, !572, !6002, !6518, !6522, !6562, !6563, !6564, !6565, !6566, !6567, !6568, !6569, !6570, !6571, !6572, !6573, !6574, !6575, !6576, !6577, !6578, !6579, !6580, !6581, !6582, !6583, !6584, !6585, !6586, !6587, !6588, !6593, !6594, !6595, !6596, !6597, !6598, !6599, !6602, !6651, !6654, !6657, !6660, !6661, !6674, !6675, !6676, !6677, !6678, !6679, !6686, !6687, !6721, !6722, !6723, !6724, !6725, !6726, !6727, !6728, !6729, !6732, !6733, !6734, !6735, !6736, !6737, !6738, !6739, !6740, !6745, !6746, !6747, !6752, !6789, !7361, !7363, !7364, !7368, !7369, !7370, !7371, !7377, !7379, !7382, !7385, !7387, !7388, !7389, !7390, !7391, !7395, !7398}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !208, line: 1859, baseType: !444, size: 128)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 128, elements: !446)
!445 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!446 = !{!447}
!447 = !DISubrange(count: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name_node", scope: !441, file: !208, line: 1860, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_name_node", file: !208, line: 938, size: 384, elements: !451)
!451 = !{!452, !460, !466, !468}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "hlist", scope: !450, file: !208, line: 939, baseType: !453, size: 128)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !454, line: 186, size: 128, elements: !455)
!454 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !453, file: !454, line: 187, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !453, file: !454, line: 187, baseType: !459, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !450, file: !208, line: 940, baseType: !461, size: 128, offset: 128)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !454, line: 178, size: 128, elements: !462)
!462 = !{!463, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !461, file: !454, line: 179, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !461, file: !454, line: 179, baseType: !464, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !450, file: !208, line: 941, baseType: !467, size: 64, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !208, line: 942, baseType: !469, size: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !441, file: !208, line: 1861, baseType: !472, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ifalias", file: !208, line: 930, size: 128, elements: !474)
!474 = !{!475, !484}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rcuhead", scope: !473, file: !208, line: 931, baseType: !476, size: 128, align: 64)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !454, line: 216, size: 128, align: 64, elements: !477)
!477 = !{!478, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !476, file: !454, line: 217, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !476, file: !454, line: 218, baseType: !481, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !479}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ifalias", scope: !473, file: !208, line: 932, baseType: !485, offset: 128)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, elements: !486)
!486 = !{!487}
!487 = !DISubrange(count: -1)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !441, file: !208, line: 1866, baseType: !489, size: 64, offset: 256)
!489 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !441, file: !208, line: 1867, baseType: !489, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !441, file: !208, line: 1868, baseType: !489, size: 64, offset: 384)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !441, file: !208, line: 1869, baseType: !209, size: 32, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !441, file: !208, line: 1877, baseType: !489, size: 64, offset: 512)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dev_list", scope: !441, file: !208, line: 1879, baseType: !461, size: 128, offset: 576)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "napi_list", scope: !441, file: !208, line: 1880, baseType: !461, size: 128, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "unreg_list", scope: !441, file: !208, line: 1881, baseType: !461, size: 128, offset: 832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "close_list", scope: !441, file: !208, line: 1882, baseType: !461, size: 128, offset: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_all", scope: !441, file: !208, line: 1883, baseType: !461, size: 128, offset: 1088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ptype_specific", scope: !441, file: !208, line: 1884, baseType: !461, size: 128, offset: 1216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !441, file: !208, line: 1889, baseType: !501, size: 256, offset: 1344)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !208, line: 1886, size: 256, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "upper", scope: !501, file: !208, line: 1887, baseType: !461, size: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lower", scope: !501, file: !208, line: 1888, baseType: !461, size: 128, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !441, file: !208, line: 1891, baseType: !506, size: 64, offset: 1600)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_features_t", file: !507, line: 12, baseType: !508)
!507 = !DIFile(filename: "./include/linux/netdev_features.h", directory: "/home/lizy2001/genbc/linux")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !509, line: 23, baseType: !510)
!509 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !511, line: 31, baseType: !512)
!511 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!512 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "hw_features", scope: !441, file: !208, line: 1892, baseType: !506, size: 64, offset: 1664)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "wanted_features", scope: !441, file: !208, line: 1893, baseType: !506, size: 64, offset: 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_features", scope: !441, file: !208, line: 1894, baseType: !506, size: 64, offset: 1792)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "hw_enc_features", scope: !441, file: !208, line: 1895, baseType: !506, size: 64, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mpls_features", scope: !441, file: !208, line: 1896, baseType: !506, size: 64, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gso_partial_features", scope: !441, file: !208, line: 1897, baseType: !506, size: 64, offset: 1984)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !441, file: !208, line: 1899, baseType: !209, size: 32, offset: 2048)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !441, file: !208, line: 1900, baseType: !209, size: 32, offset: 2080)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !441, file: !208, line: 1902, baseType: !522, size: 1472, offset: 2112)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !208, line: 169, size: 1472, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !522, file: !208, line: 170, baseType: !489, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !522, file: !208, line: 171, baseType: !489, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !522, file: !208, line: 172, baseType: !489, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !522, file: !208, line: 173, baseType: !489, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !522, file: !208, line: 174, baseType: !489, size: 64, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !522, file: !208, line: 175, baseType: !489, size: 64, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !522, file: !208, line: 176, baseType: !489, size: 64, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !522, file: !208, line: 177, baseType: !489, size: 64, offset: 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !522, file: !208, line: 178, baseType: !489, size: 64, offset: 512)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !522, file: !208, line: 179, baseType: !489, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !522, file: !208, line: 180, baseType: !489, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !522, file: !208, line: 181, baseType: !489, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !522, file: !208, line: 182, baseType: !489, size: 64, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !522, file: !208, line: 183, baseType: !489, size: 64, offset: 832)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !522, file: !208, line: 184, baseType: !489, size: 64, offset: 896)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !522, file: !208, line: 185, baseType: !489, size: 64, offset: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !522, file: !208, line: 186, baseType: !489, size: 64, offset: 1024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !522, file: !208, line: 187, baseType: !489, size: 64, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !522, file: !208, line: 188, baseType: !489, size: 64, offset: 1152)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !522, file: !208, line: 189, baseType: !489, size: 64, offset: 1216)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !522, file: !208, line: 190, baseType: !489, size: 64, offset: 1280)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !522, file: !208, line: 191, baseType: !489, size: 64, offset: 1344)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !522, file: !208, line: 192, baseType: !489, size: 64, offset: 1408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !441, file: !208, line: 1904, baseType: !548, size: 64, offset: 3584)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !549, line: 13, baseType: !550)
!549 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/lizy2001/genbc/linux")
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !454, line: 175, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 173, size: 64, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !551, file: !454, line: 174, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !509, line: 22, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !511, line: 30, baseType: !556)
!556 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !441, file: !208, line: 1905, baseType: !548, size: 64, offset: 3648)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !441, file: !208, line: 1906, baseType: !548, size: 64, offset: 3712)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_up_count", scope: !441, file: !208, line: 1909, baseType: !560, size: 32, offset: 3776)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !454, line: 168, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !454, line: 166, size: 32, elements: !562)
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !561, file: !454, line: 167, baseType: !209, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "carrier_down_count", scope: !441, file: !208, line: 1910, baseType: !560, size: 32, offset: 3808)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_handlers", scope: !441, file: !208, line: 1913, baseType: !566, size: 64, offset: 3840)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_handler_def", file: !208, line: 1913, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "wireless_data", scope: !441, file: !208, line: 1914, baseType: !570, size: 64, offset: 3904)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "iw_public_data", file: !208, line: 1914, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "netdev_ops", scope: !441, file: !208, line: 1916, baseType: !573, size: 64, offset: 3968)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_ops", file: !208, line: 1283, size: 4416, elements: !576)
!576 = !{!577, !581, !585, !586, !587, !750, !754, !759, !763, !764, !769, !770, !893, !898, !902, !908, !912, !944, !952, !956, !961, !965, !966, !972, !976, !980, !984, !985, !1007, !1011, !1026, !1037, !1041, !1050, !1054, !1055, !1059, !1080, !1084, !1088, !1092, !1096, !1103, !1107, !1125, !1129, !1179, !1183, !1188, !1192, !1196, !1200, !1210, !1211, !1220, !1226, !1227, !1231, !1235, !1239, !1243, !1244, !1248, !1249, !5962, !5982, !5986, !5992, !5998}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_init", scope: !575, file: !208, line: 1284, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!209, !467}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_uninit", scope: !575, file: !208, line: 1285, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !467}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_open", scope: !575, file: !208, line: 1286, baseType: !578, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_stop", scope: !575, file: !208, line: 1287, baseType: !578, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_start_xmit", scope: !575, file: !208, line: 1288, baseType: !588, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!591, !592, !467}
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "netdev_tx_t", file: !208, line: 120, baseType: !207)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sk_buff", file: !594, line: 713, size: 1600, elements: !595)
!594 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!595 = !{!596, !618, !626, !633, !637, !649, !650, !651, !654, !655, !656, !662, !663, !664, !665, !666, !667, !668, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !708, !709, !710, !711, !713, !714, !719, !724, !729, !730, !731, !732, !733, !734, !735, !736, !737, !739, !740, !742, !743, !744}
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 714, baseType: !597, size: 192)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 714, size: 192, elements: !598)
!598 = !{!599, !609, !617}
!599 = !DIDerivedType(tag: DW_TAG_member, scope: !597, file: !594, line: 715, baseType: !600, size: 192)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !594, line: 715, size: 192, elements: !601)
!601 = !{!602, !603, !604}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !600, file: !594, line: 717, baseType: !592, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !600, file: !594, line: 718, baseType: !592, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, scope: !600, file: !594, line: 720, baseType: !605, size: 64, offset: 128)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !600, file: !594, line: 720, size: 64, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !605, file: !594, line: 721, baseType: !467, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dev_scratch", scope: !605, file: !594, line: 726, baseType: !489, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rbnode", scope: !597, file: !594, line: 729, baseType: !610, size: 192, align: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !611, line: 24, size: 192, align: 64, elements: !612)
!611 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/lizy2001/genbc/linux")
!612 = !{!613, !614, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !610, file: !611, line: 25, baseType: !489, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !610, file: !611, line: 26, baseType: !615, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !610, file: !611, line: 27, baseType: !615, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !597, file: !594, line: 730, baseType: !461, size: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 733, baseType: !619, size: 64, offset: 192)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 733, size: 64, elements: !620)
!620 = !{!621, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !619, file: !594, line: 734, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !624, line: 19, flags: DIFlagFwdDecl)
!624 = !DIFile(filename: "./include/linux/kobject_ns.h", directory: "/home/lizy2001/genbc/linux")
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ip_defrag_offset", scope: !619, file: !594, line: 735, baseType: !209, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 738, baseType: !627, size: 64, offset: 256)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 738, size: 64, elements: !628)
!628 = !{!629, !632}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !627, file: !594, line: 739, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !631, line: 29, baseType: !554)
!631 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!632 = !DIDerivedType(tag: DW_TAG_member, name: "skb_mstamp_ns", scope: !627, file: !594, line: 740, baseType: !508, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !593, file: !594, line: 748, baseType: !634, size: 384, align: 64, offset: 320)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 384, elements: !635)
!635 = !{!636}
!636 = !DISubrange(count: 48)
!637 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 750, baseType: !638, size: 128, offset: 704)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 750, size: 128, elements: !639)
!639 = !{!640, !648}
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !638, file: !594, line: 751, baseType: !641, size: 128)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !638, file: !594, line: 751, size: 128, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_skb_refdst", scope: !641, file: !594, line: 752, baseType: !489, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !641, file: !594, line: 753, baseType: !645, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !592}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "tcp_tsorted_anchor", scope: !638, file: !594, line: 755, baseType: !461, size: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !593, file: !594, line: 761, baseType: !7, size: 32, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !593, file: !594, line: 762, baseType: !7, size: 32, offset: 864)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mac_len", scope: !593, file: !594, line: 763, baseType: !652, size: 16, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !511, line: 24, baseType: !653)
!653 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_len", scope: !593, file: !594, line: 764, baseType: !652, size: 16, offset: 912)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !593, file: !594, line: 769, baseType: !652, size: 16, offset: 928)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "__cloned_offset", scope: !593, file: !594, line: 780, baseType: !657, offset: 944)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, elements: !660)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !511, line: 21, baseType: !659)
!659 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!660 = !{!661}
!661 = !DISubrange(count: 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cloned", scope: !593, file: !594, line: 782, baseType: !658, size: 1, offset: 944, flags: DIFlagBitField, extraData: i64 944)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nohdr", scope: !593, file: !594, line: 783, baseType: !658, size: 1, offset: 945, flags: DIFlagBitField, extraData: i64 944)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fclone", scope: !593, file: !594, line: 784, baseType: !658, size: 2, offset: 946, flags: DIFlagBitField, extraData: i64 944)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "peeked", scope: !593, file: !594, line: 785, baseType: !658, size: 1, offset: 948, flags: DIFlagBitField, extraData: i64 944)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "head_frag", scope: !593, file: !594, line: 786, baseType: !658, size: 1, offset: 949, flags: DIFlagBitField, extraData: i64 944)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pfmemalloc", scope: !593, file: !594, line: 787, baseType: !658, size: 1, offset: 950, flags: DIFlagBitField, extraData: i64 944)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "headers_start", scope: !593, file: !594, line: 795, baseType: !669, offset: 960)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, elements: !660)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !511, line: 27, baseType: !7)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_type_offset", scope: !593, file: !594, line: 807, baseType: !657, offset: 960)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !593, file: !594, line: 809, baseType: !658, size: 3, offset: 960, flags: DIFlagBitField, extraData: i64 960)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_df", scope: !593, file: !594, line: 810, baseType: !658, size: 1, offset: 963, flags: DIFlagBitField, extraData: i64 960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "nf_trace", scope: !593, file: !594, line: 811, baseType: !658, size: 1, offset: 964, flags: DIFlagBitField, extraData: i64 960)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ip_summed", scope: !593, file: !594, line: 812, baseType: !658, size: 2, offset: 965, flags: DIFlagBitField, extraData: i64 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ooo_okay", scope: !593, file: !594, line: 813, baseType: !658, size: 1, offset: 967, flags: DIFlagBitField, extraData: i64 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "l4_hash", scope: !593, file: !594, line: 815, baseType: !658, size: 1, offset: 968, flags: DIFlagBitField, extraData: i64 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "sw_hash", scope: !593, file: !594, line: 816, baseType: !658, size: 1, offset: 969, flags: DIFlagBitField, extraData: i64 960)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked_valid", scope: !593, file: !594, line: 817, baseType: !658, size: 1, offset: 970, flags: DIFlagBitField, extraData: i64 960)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "wifi_acked", scope: !593, file: !594, line: 818, baseType: !658, size: 1, offset: 971, flags: DIFlagBitField, extraData: i64 960)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "no_fcs", scope: !593, file: !594, line: 819, baseType: !658, size: 1, offset: 972, flags: DIFlagBitField, extraData: i64 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "encapsulation", scope: !593, file: !594, line: 821, baseType: !658, size: 1, offset: 973, flags: DIFlagBitField, extraData: i64 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "encap_hdr_csum", scope: !593, file: !594, line: 822, baseType: !658, size: 1, offset: 974, flags: DIFlagBitField, extraData: i64 960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "csum_valid", scope: !593, file: !594, line: 823, baseType: !658, size: 1, offset: 975, flags: DIFlagBitField, extraData: i64 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "__pkt_vlan_present_offset", scope: !593, file: !594, line: 832, baseType: !657, offset: 976)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !593, file: !594, line: 834, baseType: !658, size: 1, offset: 976, flags: DIFlagBitField, extraData: i64 976)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "csum_complete_sw", scope: !593, file: !594, line: 835, baseType: !658, size: 1, offset: 977, flags: DIFlagBitField, extraData: i64 976)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "csum_level", scope: !593, file: !594, line: 836, baseType: !658, size: 2, offset: 978, flags: DIFlagBitField, extraData: i64 976)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "csum_not_inet", scope: !593, file: !594, line: 837, baseType: !658, size: 1, offset: 980, flags: DIFlagBitField, extraData: i64 976)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dst_pending_confirm", scope: !593, file: !594, line: 838, baseType: !658, size: 1, offset: 981, flags: DIFlagBitField, extraData: i64 976)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ndisc_nodetype", scope: !593, file: !594, line: 840, baseType: !658, size: 2, offset: 982, flags: DIFlagBitField, extraData: i64 976)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ipvs_property", scope: !593, file: !594, line: 843, baseType: !658, size: 1, offset: 984, flags: DIFlagBitField, extraData: i64 976)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol_type", scope: !593, file: !594, line: 844, baseType: !658, size: 1, offset: 985, flags: DIFlagBitField, extraData: i64 976)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "remcsum_offload", scope: !593, file: !594, line: 845, baseType: !658, size: 1, offset: 986, flags: DIFlagBitField, extraData: i64 976)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "offload_fwd_mark", scope: !593, file: !594, line: 847, baseType: !658, size: 1, offset: 987, flags: DIFlagBitField, extraData: i64 976)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "offload_l3_fwd_mark", scope: !593, file: !594, line: 848, baseType: !658, size: 1, offset: 988, flags: DIFlagBitField, extraData: i64 976)
!697 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 866, baseType: !698, size: 32, offset: 992)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 866, size: 32, elements: !699)
!699 = !{!700, !703}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !698, file: !594, line: 867, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !702, line: 37, baseType: !670)
!702 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !698, file: !594, line: 868, baseType: !704, size: 32)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !698, file: !594, line: 868, size: 32, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "csum_start", scope: !704, file: !594, line: 869, baseType: !652, size: 16)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "csum_offset", scope: !704, file: !594, line: 870, baseType: !652, size: 16, offset: 16)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !593, file: !594, line: 873, baseType: !670, size: 32, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "skb_iif", scope: !593, file: !594, line: 874, baseType: !209, size: 32, offset: 1056)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !593, file: !594, line: 875, baseType: !670, size: 32, offset: 1088)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !593, file: !594, line: 876, baseType: !712, size: 16, offset: 1120)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !702, line: 30, baseType: !652)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !593, file: !594, line: 877, baseType: !652, size: 16, offset: 1136)
!714 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 879, baseType: !715, size: 32, offset: 1152)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 879, size: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !715, file: !594, line: 880, baseType: !7, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sender_cpu", scope: !715, file: !594, line: 881, baseType: !7, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 888, baseType: !720, size: 32, offset: 1184)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 888, size: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !720, file: !594, line: 889, baseType: !670, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_tailroom", scope: !720, file: !594, line: 890, baseType: !670, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, scope: !593, file: !594, line: 893, baseType: !725, size: 16, offset: 1216)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !593, file: !594, line: 893, size: 16, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "inner_protocol", scope: !725, file: !594, line: 894, baseType: !712, size: 16)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "inner_ipproto", scope: !725, file: !594, line: 895, baseType: !658, size: 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "inner_transport_header", scope: !593, file: !594, line: 898, baseType: !652, size: 16, offset: 1232)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "inner_network_header", scope: !593, file: !594, line: 899, baseType: !652, size: 16, offset: 1248)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "inner_mac_header", scope: !593, file: !594, line: 900, baseType: !652, size: 16, offset: 1264)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !593, file: !594, line: 902, baseType: !712, size: 16, offset: 1280)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "transport_header", scope: !593, file: !594, line: 903, baseType: !652, size: 16, offset: 1296)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "network_header", scope: !593, file: !594, line: 904, baseType: !652, size: 16, offset: 1312)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mac_header", scope: !593, file: !594, line: 905, baseType: !652, size: 16, offset: 1328)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "headers_end", scope: !593, file: !594, line: 908, baseType: !669, offset: 1344)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !593, file: !594, line: 912, baseType: !738, size: 32, offset: 1344)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "sk_buff_data_t", file: !594, line: 606, baseType: !7)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !593, file: !594, line: 913, baseType: !738, size: 32, offset: 1376)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !593, file: !594, line: 914, baseType: !741, size: 64, offset: 1408)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !593, file: !594, line: 915, baseType: !741, size: 64, offset: 1472)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "truesize", scope: !593, file: !594, line: 916, baseType: !7, size: 32, offset: 1536)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !593, file: !594, line: 917, baseType: !745, size: 32, offset: 1568)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !746, line: 113, baseType: !747)
!746 = !DIFile(filename: "./include/linux/refcount.h", directory: "/home/lizy2001/genbc/linux")
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !746, line: 111, size: 32, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !747, file: !746, line: 112, baseType: !560, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_features_check", scope: !575, file: !208, line: 1290, baseType: !751, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!506, !592, !467, !506}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_select_queue", scope: !575, file: !208, line: 1293, baseType: !755, size: 64, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !467, !592, !467}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !509, line: 19, baseType: !652)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_rx_flags", scope: !575, file: !208, line: 1296, baseType: !760, size: 64, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !467, !209}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_mode", scope: !575, file: !208, line: 1298, baseType: !582, size: 64, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_mac_address", scope: !575, file: !208, line: 1299, baseType: !765, size: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!209, !467, !768}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_validate_addr", scope: !575, file: !208, line: 1301, baseType: !578, size: 64, offset: 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_do_ioctl", scope: !575, file: !208, line: 1302, baseType: !771, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!209, !467, !774, !209}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifreq", file: !776, line: 234, size: 320, elements: !777)
!776 = !DIFile(filename: "./include/uapi/linux/if.h", directory: "/home/lizy2001/genbc/linux")
!777 = !{!778, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifrn", scope: !775, file: !776, line: 239, baseType: !779, size: 128)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 236, size: 128, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ifrn_name", scope: !779, file: !776, line: 238, baseType: !444, size: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ifr_ifru", scope: !775, file: !776, line: 255, baseType: !783, size: 192, offset: 128)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !775, file: !776, line: 241, size: 192, elements: !784)
!784 = !{!785, !797, !798, !799, !800, !801, !803, !804, !805, !814, !815, !816, !817}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_addr", scope: !783, file: !776, line: 242, baseType: !786, size: 128)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !787, line: 32, size: 128, elements: !788)
!787 = !DIFile(filename: "./include/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!788 = !{!789, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !786, file: !787, line: 33, baseType: !790, size: 16)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !787, line: 26, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_sa_family_t", file: !792, line: 10, baseType: !653)
!792 = !DIFile(filename: "./include/uapi/linux/socket.h", directory: "/home/lizy2001/genbc/linux")
!793 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !786, file: !787, line: 34, baseType: !794, size: 112, offset: 16)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 112, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 14)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_dstaddr", scope: !783, file: !776, line: 243, baseType: !786, size: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_broadaddr", scope: !783, file: !776, line: 244, baseType: !786, size: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_netmask", scope: !783, file: !776, line: 245, baseType: !786, size: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_hwaddr", scope: !783, file: !776, line: 246, baseType: !786, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_flags", scope: !783, file: !776, line: 247, baseType: !802, size: 16)
!802 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_ivalue", scope: !783, file: !776, line: 248, baseType: !209, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_mtu", scope: !783, file: !776, line: 249, baseType: !209, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_map", scope: !783, file: !776, line: 250, baseType: !806, size: 192)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifmap", file: !776, line: 196, size: 192, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !806, file: !776, line: 197, baseType: !489, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !806, file: !776, line: 198, baseType: !489, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !806, file: !776, line: 199, baseType: !653, size: 16, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !806, file: !776, line: 200, baseType: !659, size: 8, offset: 144)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dma", scope: !806, file: !776, line: 201, baseType: !659, size: 8, offset: 152)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !806, file: !776, line: 202, baseType: !659, size: 8, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_slave", scope: !783, file: !776, line: 251, baseType: !444, size: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_newname", scope: !783, file: !776, line: 252, baseType: !444, size: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_data", scope: !783, file: !776, line: 253, baseType: !768, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ifru_settings", scope: !783, file: !776, line: 254, baseType: !818, size: 128)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "if_settings", file: !776, line: 207, size: 128, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !818, file: !776, line: 208, baseType: !7, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !818, file: !776, line: 209, baseType: !7, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ifs_ifsu", scope: !818, file: !776, line: 222, baseType: !823, size: 64, offset: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !818, file: !776, line: 210, size: 64, elements: !824)
!824 = !{!825, !833, !840, !852, !858, !865, !876, !884}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "raw_hdlc", scope: !823, file: !776, line: 212, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_hdlc_proto", file: !828, line: 56, baseType: !829)
!828 = !DIFile(filename: "./include/uapi/linux/hdlc/ioctl.h", directory: "/home/lizy2001/genbc/linux")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 53, size: 32, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !829, file: !828, line: 54, baseType: !653, size: 16)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !829, file: !828, line: 55, baseType: !653, size: 16, offset: 16)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cisco", scope: !823, file: !776, line: 213, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "cisco_proto", file: !828, line: 80, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 77, size: 64, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "interval", scope: !836, file: !828, line: 78, baseType: !7, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !836, file: !828, line: 79, baseType: !7, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fr", scope: !823, file: !776, line: 214, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto", file: !828, line: 66, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 58, size: 192, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "t391", scope: !843, file: !828, line: 59, baseType: !7, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "t392", scope: !843, file: !828, line: 60, baseType: !7, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "n391", scope: !843, file: !828, line: 61, baseType: !7, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "n392", scope: !843, file: !828, line: 62, baseType: !7, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "n393", scope: !843, file: !828, line: 63, baseType: !7, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lmi", scope: !843, file: !828, line: 64, baseType: !653, size: 16, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !843, file: !828, line: 65, baseType: !653, size: 16, offset: 176)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc", scope: !823, file: !776, line: 215, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc", file: !828, line: 70, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 68, size: 32, elements: !856)
!856 = !{!857}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !855, file: !828, line: 69, baseType: !7, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "fr_pvc_info", scope: !823, file: !776, line: 216, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "fr_proto_pvc_info", file: !828, line: 75, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 72, size: 160, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dlci", scope: !861, file: !828, line: 73, baseType: !7, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !861, file: !828, line: 74, baseType: !444, size: 128, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "x25", scope: !823, file: !776, line: 217, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "x25_hdlc_proto", file: !828, line: 89, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 82, size: 192, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dce", scope: !868, file: !828, line: 83, baseType: !653, size: 16)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "modulo", scope: !868, file: !828, line: 84, baseType: !7, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !868, file: !828, line: 85, baseType: !7, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "t1", scope: !868, file: !828, line: 86, baseType: !7, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "t2", scope: !868, file: !828, line: 87, baseType: !7, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "n2", scope: !868, file: !828, line: 88, baseType: !7, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !823, file: !776, line: 220, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "sync_serial_settings", file: !828, line: 44, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 40, size: 96, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !879, file: !828, line: 41, baseType: !7, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !879, file: !828, line: 42, baseType: !7, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !879, file: !828, line: 43, baseType: !653, size: 16, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "te1", scope: !823, file: !776, line: 221, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "te1_settings", file: !828, line: 51, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 46, size: 128, elements: !888)
!888 = !{!889, !890, !891, !892}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "clock_rate", scope: !887, file: !828, line: 47, baseType: !7, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "clock_type", scope: !887, file: !828, line: 48, baseType: !7, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "loopback", scope: !887, file: !828, line: 49, baseType: !653, size: 16, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "slot_map", scope: !887, file: !828, line: 50, baseType: !7, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_config", scope: !575, file: !208, line: 1304, baseType: !894, size: 64, offset: 768)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!209, !467, !897}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_mtu", scope: !575, file: !208, line: 1306, baseType: !899, size: 64, offset: 832)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!209, !467, !209}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_setup", scope: !575, file: !208, line: 1308, baseType: !903, size: 64, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{!209, !467, !906}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_structure_type, name: "neigh_parms", file: !208, line: 206, flags: DIFlagFwdDecl)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_tx_timeout", scope: !575, file: !208, line: 1310, baseType: !909, size: 64, offset: 960)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !467, !7}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats64", scope: !575, file: !208, line: 1313, baseType: !913, size: 64, offset: 1024)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !467, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtnl_link_stats64", file: !918, line: 214, size: 1536, elements: !919)
!918 = !DIFile(filename: "./include/uapi/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !917, file: !918, line: 215, baseType: !510, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !917, file: !918, line: 216, baseType: !510, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !917, file: !918, line: 217, baseType: !510, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !917, file: !918, line: 218, baseType: !510, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !917, file: !918, line: 219, baseType: !510, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !917, file: !918, line: 220, baseType: !510, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !917, file: !918, line: 221, baseType: !510, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !917, file: !918, line: 222, baseType: !510, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !917, file: !918, line: 223, baseType: !510, size: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !917, file: !918, line: 224, baseType: !510, size: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !917, file: !918, line: 227, baseType: !510, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !917, file: !918, line: 228, baseType: !510, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !917, file: !918, line: 229, baseType: !510, size: 64, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !917, file: !918, line: 230, baseType: !510, size: 64, offset: 832)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !917, file: !918, line: 231, baseType: !510, size: 64, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !917, file: !918, line: 232, baseType: !510, size: 64, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !917, file: !918, line: 235, baseType: !510, size: 64, offset: 1024)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !917, file: !918, line: 236, baseType: !510, size: 64, offset: 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !917, file: !918, line: 237, baseType: !510, size: 64, offset: 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !917, file: !918, line: 238, baseType: !510, size: 64, offset: 1216)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !917, file: !918, line: 239, baseType: !510, size: 64, offset: 1280)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !917, file: !918, line: 242, baseType: !510, size: 64, offset: 1344)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !917, file: !918, line: 243, baseType: !510, size: 64, offset: 1408)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rx_nohandler", scope: !917, file: !918, line: 244, baseType: !510, size: 64, offset: 1472)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_has_offload_stats", scope: !575, file: !208, line: 1315, baseType: !945, size: 64, offset: 1088)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!948, !950, !209}
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !454, line: 30, baseType: !949)
!949 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_offload_stats", scope: !575, file: !208, line: 1316, baseType: !953, size: 64, offset: 1152)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!209, !209, !950, !768}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_stats", scope: !575, file: !208, line: 1319, baseType: !957, size: 64, offset: 1216)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!960, !467}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_add_vid", scope: !575, file: !208, line: 1321, baseType: !962, size: 64, offset: 1280)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!209, !467, !712, !758}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_vlan_rx_kill_vid", scope: !575, file: !208, line: 1323, baseType: !962, size: 64, offset: 1344)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_mac", scope: !575, file: !208, line: 1331, baseType: !967, size: 64, offset: 1408)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!209, !467, !209, !970}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !509, line: 17, baseType: !658)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_vlan", scope: !575, file: !208, line: 1333, baseType: !973, size: 64, offset: 1472)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!209, !467, !209, !758, !971, !712}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rate", scope: !575, file: !208, line: 1336, baseType: !977, size: 64, offset: 1536)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!209, !467, !209, !209, !209}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_spoofchk", scope: !575, file: !208, line: 1339, baseType: !981, size: 64, offset: 1600)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!209, !467, !209, !948}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_trust", scope: !575, file: !208, line: 1341, baseType: !981, size: 64, offset: 1664)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_config", scope: !575, file: !208, line: 1343, baseType: !986, size: 64, offset: 1728)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!209, !467, !209, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_info", file: !991, line: 20, size: 576, elements: !992)
!991 = !DIFile(filename: "./include/linux/if_link.h", directory: "/home/lizy2001/genbc/linux")
!992 = !{!993, !994, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !990, file: !991, line: 21, baseType: !670, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !990, file: !991, line: 22, baseType: !995, size: 256, offset: 32)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 256, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "vlan", scope: !990, file: !991, line: 23, baseType: !670, size: 32, offset: 288)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !990, file: !991, line: 24, baseType: !670, size: 32, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "spoofchk", scope: !990, file: !991, line: 25, baseType: !670, size: 32, offset: 352)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "linkstate", scope: !990, file: !991, line: 26, baseType: !670, size: 32, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "min_tx_rate", scope: !990, file: !991, line: 27, baseType: !670, size: 32, offset: 416)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "max_tx_rate", scope: !990, file: !991, line: 28, baseType: !670, size: 32, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "rss_query_en", scope: !990, file: !991, line: 29, baseType: !670, size: 32, offset: 480)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "trusted", scope: !990, file: !991, line: 30, baseType: !670, size: 32, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !990, file: !991, line: 31, baseType: !712, size: 16, offset: 544)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_link_state", scope: !575, file: !208, line: 1346, baseType: !1008, size: 64, offset: 1792)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!209, !467, !209, !209}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_stats", scope: !575, file: !208, line: 1348, baseType: !1012, size: 64, offset: 1856)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!209, !467, !209, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_stats", file: !991, line: 9, size: 512, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !1016, file: !991, line: 10, baseType: !510, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !1016, file: !991, line: 11, baseType: !510, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !1016, file: !991, line: 12, baseType: !510, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !1016, file: !991, line: 13, baseType: !510, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "broadcast", scope: !1016, file: !991, line: 14, baseType: !510, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !1016, file: !991, line: 15, baseType: !510, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !1016, file: !991, line: 16, baseType: !510, size: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !1016, file: !991, line: 17, baseType: !510, size: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_port", scope: !575, file: !208, line: 1352, baseType: !1027, size: 64, offset: 1920)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!209, !467, !209, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlattr", file: !1033, line: 213, size: 32, elements: !1034)
!1033 = !DIFile(filename: "./include/uapi/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "nla_len", scope: !1032, file: !1033, line: 214, baseType: !652, size: 16)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "nla_type", scope: !1032, file: !1033, line: 215, baseType: !652, size: 16, offset: 16)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_port", scope: !575, file: !208, line: 1355, baseType: !1038, size: 64, offset: 1984)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!209, !467, !209, !592}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_vf_guid", scope: !575, file: !208, line: 1357, baseType: !1042, size: 64, offset: 2048)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!209, !467, !209, !1045, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ifla_vf_guid", file: !918, line: 956, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vf", scope: !1046, file: !918, line: 957, baseType: !670, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "guid", scope: !1046, file: !918, line: 958, baseType: !510, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_guid", scope: !575, file: !208, line: 1361, baseType: !1051, size: 64, offset: 2112)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!209, !467, !209, !508, !209}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_vf_rss_query_en", scope: !575, file: !208, line: 1364, baseType: !981, size: 64, offset: 2176)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_setup_tc", scope: !575, file: !208, line: 1367, baseType: !1056, size: 64, offset: 2240)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!209, !467, !214, !768}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_add_slave", scope: !575, file: !208, line: 1400, baseType: !1060, size: 64, offset: 2304)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!209, !467, !467, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_ext_ack", file: !1065, line: 75, size: 384, elements: !1066)
!1065 = !DIFile(filename: "./include/linux/netlink.h", directory: "/home/lizy2001/genbc/linux")
!1066 = !{!1067, !1068, !1071, !1075, !1079}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_msg", scope: !1064, file: !1065, line: 76, baseType: !469, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bad_attr", scope: !1064, file: !1065, line: 77, baseType: !1069, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !1064, file: !1065, line: 78, baseType: !1072, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "nla_policy", file: !1065, line: 78, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "cookie", scope: !1064, file: !1065, line: 79, baseType: !1076, size: 160, offset: 192)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 160, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 20)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "cookie_len", scope: !1064, file: !1065, line: 80, baseType: !971, size: 8, offset: 352)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_del_slave", scope: !575, file: !208, line: 1403, baseType: !1081, size: 64, offset: 2368)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!209, !467, !467}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_xmit_slave", scope: !575, file: !208, line: 1405, baseType: !1085, size: 64, offset: 2432)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!467, !467, !592, !948}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fix_features", scope: !575, file: !208, line: 1408, baseType: !1089, size: 64, offset: 2496)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!506, !467, !506}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_features", scope: !575, file: !208, line: 1410, baseType: !1093, size: 64, offset: 2560)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!209, !467, !506}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_construct", scope: !575, file: !208, line: 1412, baseType: !1097, size: 64, offset: 2624)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!209, !467, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "neighbour", file: !1102, line: 35, flags: DIFlagFwdDecl)
!1102 = !DIFile(filename: "./include/net/dst_ops.h", directory: "/home/lizy2001/genbc/linux")
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_neigh_destroy", scope: !575, file: !208, line: 1414, baseType: !1104, size: 64, offset: 2688)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !467, !1100}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_add", scope: !575, file: !208, line: 1417, baseType: !1108, size: 64, offset: 2752)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!209, !1111, !1030, !467, !1123, !758, !758, !1063}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ndmsg", file: !1113, line: 8, size: 96, elements: !1114)
!1113 = !DIFile(filename: "./include/uapi/linux/neighbour.h", directory: "/home/lizy2001/genbc/linux")
!1114 = !{!1115, !1116, !1117, !1118, !1120, !1121, !1122}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_family", scope: !1112, file: !1113, line: 9, baseType: !658, size: 8)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad1", scope: !1112, file: !1113, line: 10, baseType: !658, size: 8, offset: 8)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_pad2", scope: !1112, file: !1113, line: 11, baseType: !652, size: 16, offset: 16)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_ifindex", scope: !1112, file: !1113, line: 12, baseType: !1119, size: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !511, line: 26, baseType: !209)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_state", scope: !1112, file: !1113, line: 13, baseType: !652, size: 16, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_flags", scope: !1112, file: !1113, line: 14, baseType: !658, size: 8, offset: 80)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ndm_type", scope: !1112, file: !1113, line: 15, baseType: !658, size: 8, offset: 88)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_del", scope: !575, file: !208, line: 1424, baseType: !1126, size: 64, offset: 2816)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!209, !1111, !1030, !467, !1123, !758}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_dump", scope: !575, file: !208, line: 1429, baseType: !1130, size: 64, offset: 2880)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!209, !592, !1133, !467, !467, !1178}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netlink_callback", file: !1065, line: 203, size: 1024, elements: !1135)
!1135 = !{!1136, !1137, !1147, !1151, !1155, !1156, !1160, !1161, !1162, !1163, !1165, !1166, !1167, !1168}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "skb", scope: !1134, file: !1065, line: 204, baseType: !592, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nlh", scope: !1134, file: !1065, line: 205, baseType: !1138, size: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nlmsghdr", file: !1033, line: 44, size: 128, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_len", scope: !1140, file: !1033, line: 45, baseType: !670, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_type", scope: !1140, file: !1033, line: 46, baseType: !652, size: 16, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_flags", scope: !1140, file: !1033, line: 47, baseType: !652, size: 16, offset: 48)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_seq", scope: !1140, file: !1033, line: 48, baseType: !670, size: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nlmsg_pid", scope: !1140, file: !1033, line: 49, baseType: !670, size: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "dump", scope: !1134, file: !1065, line: 206, baseType: !1148, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!209, !592, !1133}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1134, file: !1065, line: 208, baseType: !1152, size: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!209, !1133}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !1065, line: 209, baseType: !768, size: 64, offset: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1134, file: !1065, line: 211, baseType: !1157, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !1159, line: 76, flags: DIFlagFwdDecl)
!1159 = !DIFile(filename: "./arch/x86/include/asm/alternative.h", directory: "/home/lizy2001/genbc/linux")
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1134, file: !1065, line: 212, baseType: !1063, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1134, file: !1065, line: 213, baseType: !758, size: 16, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "answer_flags", scope: !1134, file: !1065, line: 214, baseType: !758, size: 16, offset: 464)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "min_dump_alloc", scope: !1134, file: !1065, line: 215, baseType: !1164, size: 32, offset: 480)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !509, line: 21, baseType: !670)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "prev_seq", scope: !1134, file: !1065, line: 216, baseType: !7, size: 32, offset: 512)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1134, file: !1065, line: 216, baseType: !7, size: 32, offset: 544)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "strict_check", scope: !1134, file: !1065, line: 217, baseType: !948, size: 8, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_member, scope: !1134, file: !1065, line: 218, baseType: !1169, size: 384, offset: 640)
!1169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1134, file: !1065, line: 218, size: 384, elements: !1170)
!1170 = !{!1171, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1169, file: !1065, line: 219, baseType: !1172, size: 384)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 384, elements: !635)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1169, file: !1065, line: 224, baseType: !1174, size: 384)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 384, elements: !1176)
!1175 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1176 = !{!1177}
!1177 = !DISubrange(count: 6)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fdb_get", scope: !575, file: !208, line: 1434, baseType: !1180, size: 64, offset: 2944)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!209, !592, !1030, !467, !1123, !758, !1164, !1164, !1063}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_setlink", scope: !575, file: !208, line: 1440, baseType: !1184, size: 64, offset: 3008)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!209, !467, !1187, !758, !1063}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_getlink", scope: !575, file: !208, line: 1444, baseType: !1189, size: 64, offset: 3072)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!209, !592, !1164, !1164, !467, !1164, !209}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bridge_dellink", scope: !575, file: !208, line: 1449, baseType: !1193, size: 64, offset: 3136)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!209, !467, !1187, !758}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_carrier", scope: !575, file: !208, line: 1452, baseType: !1197, size: 64, offset: 3200)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!209, !467, !948}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_id", scope: !575, file: !208, line: 1454, baseType: !1201, size: 64, offset: 3264)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!209, !467, !1204}
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_phys_item_id", file: !208, line: 820, size: 264, elements: !1206)
!1206 = !{!1207, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1205, file: !208, line: 821, baseType: !1208, size: 256)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 256, elements: !996)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "id_len", scope: !1205, file: !208, line: 822, baseType: !659, size: 8, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_port_parent_id", scope: !575, file: !208, line: 1456, baseType: !1201, size: 64, offset: 3328)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_phys_port_name", scope: !575, file: !208, line: 1458, baseType: !1212, size: 64, offset: 3392)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!209, !467, !1215, !1216}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !454, line: 55, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1218, line: 72, baseType: !1219)
!1218 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1218, line: 16, baseType: !489)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_add", scope: !575, file: !208, line: 1460, baseType: !1221, size: 64, offset: 3456)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{null, !467, !1224}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "udp_tunnel_info", file: !208, line: 67, flags: DIFlagFwdDecl)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_udp_tunnel_del", scope: !575, file: !208, line: 1462, baseType: !1221, size: 64, offset: 3520)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_add_station", scope: !575, file: !208, line: 1464, baseType: !1228, size: 64, offset: 3584)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!768, !467, !467}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_dfwd_del_station", scope: !575, file: !208, line: 1466, baseType: !1232, size: 64, offset: 3648)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !467, !768}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_tx_maxrate", scope: !575, file: !208, line: 1469, baseType: !1236, size: 64, offset: 3712)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!209, !467, !209, !1164}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_get_iflink", scope: !575, file: !208, line: 1472, baseType: !1240, size: 64, offset: 3776)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!209, !950}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_change_proto_down", scope: !575, file: !208, line: 1473, baseType: !1197, size: 64, offset: 3840)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_fill_metadata_dst", scope: !575, file: !208, line: 1475, baseType: !1245, size: 64, offset: 3904)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!209, !467, !592}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_set_rx_headroom", scope: !575, file: !208, line: 1477, baseType: !760, size: 64, offset: 3968)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ndo_bpf", scope: !575, file: !208, line: 1479, baseType: !1250, size: 64, offset: 4032)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!209, !467, !1253}
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "netdev_bpf", file: !208, line: 894, size: 256, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !1254, file: !208, line: 895, baseType: !234, size: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, scope: !1254, file: !208, line: 896, baseType: !1258, size: 192, offset: 64)
!1258 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1254, file: !208, line: 896, size: 192, elements: !1259)
!1259 = !{!1260, !1269, !5955}
!1260 = !DIDerivedType(tag: DW_TAG_member, scope: !1258, file: !208, line: 898, baseType: !1261, size: 192)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1258, file: !208, line: 898, size: 192, elements: !1262)
!1262 = !{!1263, !1264, !1268}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1261, file: !208, line: 899, baseType: !1164, size: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "prog", scope: !1261, file: !208, line: 900, baseType: !1265, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_prog", file: !1267, line: 11, flags: DIFlagFwdDecl)
!1267 = !DIFile(filename: "./include/net/flow_dissector.h", directory: "/home/lizy2001/genbc/linux")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extack", scope: !1261, file: !208, line: 901, baseType: !1063, size: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, scope: !1258, file: !208, line: 904, baseType: !1270, size: 64)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1258, file: !208, line: 904, size: 64, elements: !1271)
!1271 = !{!1272}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "offmap", scope: !1270, file: !208, line: 905, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_offloaded_map", file: !242, line: 222, size: 2560, elements: !1275)
!1275 = !{!1276, !5934, !5935, !5953, !5954}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !1274, file: !242, line: 223, baseType: !1277, size: 2048)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map", file: !242, line: 141, size: 2048, elements: !1278)
!1278 = !{!1279, !5908, !5909, !5910, !5911, !5912, !5913, !5914, !5915, !5916, !5917, !5918, !5919, !5920, !5925, !5926, !5927, !5928, !5929, !5930, !5931, !5932, !5933}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1277, file: !242, line: 145, baseType: !1280, size: 64, align: 512)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_ops", file: !242, line: 54, size: 2368, elements: !1283)
!1283 = !{!1284, !1483, !1488, !5580, !5584, !5588, !5589, !5593, !5599, !5600, !5601, !5602, !5603, !5607, !5611, !5615, !5616, !5617, !5621, !5622, !5634, !5638, !5642, !5654, !5843, !5847, !5851, !5856, !5860, !5864, !5868, !5874, !5878, !5885, !5889, !5891, !5892}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "map_alloc_check", scope: !1282, file: !242, line: 56, baseType: !1285, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!209, !1288}
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "bpf_attr", file: !273, line: 483, size: 960, align: 64, elements: !1290)
!1290 = !{!1291, !1307, !1318, !1329, !1353, !1359, !1367, !1384, !1397, !1403, !1412, !1417, !1425, !1437, !1457, !1464, !1468, !1472, !1477}
!1291 = !DIDerivedType(tag: DW_TAG_member, scope: !1289, file: !273, line: 484, baseType: !1292, size: 512)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1289, file: !273, line: 484, size: 512, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "map_type", scope: !1292, file: !273, line: 485, baseType: !670, size: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !1292, file: !273, line: 486, baseType: !670, size: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !1292, file: !273, line: 487, baseType: !670, size: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !1292, file: !273, line: 488, baseType: !670, size: 32, offset: 96)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !1292, file: !273, line: 489, baseType: !670, size: 32, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_fd", scope: !1292, file: !273, line: 492, baseType: !670, size: 32, offset: 160)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !1292, file: !273, line: 493, baseType: !670, size: 32, offset: 192)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "map_name", scope: !1292, file: !273, line: 496, baseType: !444, size: 128, offset: 224)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "map_ifindex", scope: !1292, file: !273, line: 497, baseType: !670, size: 32, offset: 352)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "btf_fd", scope: !1292, file: !273, line: 498, baseType: !670, size: 32, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "btf_key_type_id", scope: !1292, file: !273, line: 499, baseType: !670, size: 32, offset: 416)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "btf_value_type_id", scope: !1292, file: !273, line: 500, baseType: !670, size: 32, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "btf_vmlinux_value_type_id", scope: !1292, file: !273, line: 501, baseType: !670, size: 32, offset: 480)
!1307 = !DIDerivedType(tag: DW_TAG_member, scope: !1289, file: !273, line: 507, baseType: !1308, size: 256)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1289, file: !273, line: 507, size: 256, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1317}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1308, file: !273, line: 508, baseType: !670, size: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1308, file: !273, line: 509, baseType: !510, size: 64, align: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, scope: !1308, file: !273, line: 510, baseType: !1313, size: 64, offset: 128)
!1313 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1308, file: !273, line: 510, size: 64, elements: !1314)
!1314 = !{!1315, !1316}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1313, file: !273, line: 511, baseType: !510, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "next_key", scope: !1313, file: !273, line: 512, baseType: !510, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1308, file: !273, line: 514, baseType: !510, size: 64, offset: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "batch", scope: !1289, file: !273, line: 532, baseType: !1319, size: 448)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1289, file: !273, line: 517, size: 448, elements: !1320)
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "in_batch", scope: !1319, file: !273, line: 518, baseType: !510, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "out_batch", scope: !1319, file: !273, line: 521, baseType: !510, size: 64, align: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !1319, file: !273, line: 522, baseType: !510, size: 64, align: 64, offset: 128)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1319, file: !273, line: 523, baseType: !510, size: 64, align: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1319, file: !273, line: 524, baseType: !670, size: 32, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "map_fd", scope: !1319, file: !273, line: 529, baseType: !670, size: 32, offset: 288)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "elem_flags", scope: !1319, file: !273, line: 530, baseType: !510, size: 64, offset: 320)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !273, line: 531, baseType: !510, size: 64, offset: 384)
!1329 = !DIDerivedType(tag: DW_TAG_member, scope: !1289, file: !273, line: 534, baseType: !1330, size: 960)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1289, file: !273, line: 534, size: 960, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "prog_type", scope: !1330, file: !273, line: 535, baseType: !670, size: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "insn_cnt", scope: !1330, file: !273, line: 536, baseType: !670, size: 32, offset: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1330, file: !273, line: 537, baseType: !510, size: 64, align: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "license", scope: !1330, file: !273, line: 538, baseType: !510, size: 64, align: 64, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !1330, file: !273, line: 539, baseType: !670, size: 32, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "log_size", scope: !1330, file: !273, line: 540, baseType: !670, size: 32, offset: 224)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "log_buf", scope: !1330, file: !273, line: 541, baseType: !510, size: 64, align: 64, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "kern_version", scope: !1330, file: !273, line: 542, baseType: !670, size: 32, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "prog_flags", scope: !1330, file: !273, line: 543, baseType: !670, size: 32, offset: 352)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "prog_name", scope: !1330, file: !273, line: 544, baseType: !444, size: 128, offset: 384)
