; ModuleID = '../bcout/drivers/scsi/myrb.llvm.bc'
source_filename = "drivers/scsi/myrb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

module asm ".section\09\22.initcall6.init\22, \22a\22\09"
module asm "__initcall_myrb_init_module6:\09\09\09"
module asm ".long\09myrb_init_module - .\09\09\09"
module asm ".previous\09\09\09\09\09"

%struct.myrb_privdata = type { i32 (%struct.pci_dev*, %struct.myrb_hba*, i8*)*, i32 (i32, i8*)*, i32 }
%struct.pci_dev = type <{ %struct.list_head, %struct.pci_bus*, %struct.pci_bus*, i8*, %struct.proc_dir_entry*, %struct.pci_slot*, i32, i16, i16, i16, i16, i32, i8, i8, i8, i8, i8, i8, i8, i8, i16, [6 x i8], i64*, %struct.pci_driver*, i64, %struct.device_dma_parameters, i32, i8, i8, i24, [2 x i8], i32, i32, [4 x i8], %struct.pcie_link_state*, i8, [3 x i8], i32, i8, [3 x i8], i32, %struct.device, i32, i32, [17 x %struct.resource], i8, [5 x i8], i16, %struct.atomic_t, [16 x i32], [4 x i8], %struct.hlist_head, %struct.bin_attribute*, i32, [4 x i8], [17 x %struct.bin_attribute*], [17 x %struct.bin_attribute*], %struct.attribute_group**, %struct.pci_vpd*, %union.anon.66, i16, i8, i8, i16, [2 x i8], i64, i64, i8*, i64 }>
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!181 = !DIEnumerator(name: "MYRB_CMD_GET_LDRV_ELEMENT", value: 85, isUnsigned: true)
!182 = !DIEnumerator(name: "MYRB_CMD_GET_LDEV_INFO", value: 25, isUnsigned: true)
!183 = !DIEnumerator(name: "MYRB_CMD_IOPORTREAD", value: 57, isUnsigned: true)
!184 = !DIEnumerator(name: "MYRB_CMD_IOPORTWRITE", value: 58, isUnsigned: true)
!185 = !DIEnumerator(name: "MYRB_CMD_GET_SD_STATS", value: 62, isUnsigned: true)
!186 = !DIEnumerator(name: "MYRB_CMD_GET_PD_STATS", value: 63, isUnsigned: true)
!187 = !DIEnumerator(name: "MYRB_CMD_EVENT_LOG_OPERATION", value: 114, isUnsigned: true)
!188 = !DIEnumerator(name: "MYRB_CMD_START_DEVICE", value: 16, isUnsigned: true)
!189 = !DIEnumerator(name: "MYRB_CMD_GET_DEVICE_STATE", value: 80, isUnsigned: true)
!190 = !DIEnumerator(name: "MYRB_CMD_STOP_CHANNEL", value: 19, isUnsigned: true)
!191 = !DIEnumerator(name: "MYRB_CMD_START_CHANNEL", value: 18, isUnsigned: true)
!192 = !DIEnumerator(name: "MYRB_CMD_RESET_CHANNEL", value: 26, isUnsigned: true)
!193 = !DIEnumerator(name: "MYRB_CMD_REBUILD", value: 9, isUnsigned: true)
!194 = !DIEnumerator(name: "MYRB_CMD_REBUILD_ASYNC", value: 22, isUnsigned: true)
!195 = !DIEnumerator(name: "MYRB_CMD_CHECK_CONSISTENCY", value: 15, isUnsigned: true)
!196 = !DIEnumerator(name: "MYRB_CMD_CHECK_CONSISTENCY_ASYNC", value: 30, isUnsigned: true)
!197 = !DIEnumerator(name: "MYRB_CMD_REBUILD_STAT", value: 12, isUnsigned: true)
!198 = !DIEnumerator(name: "MYRB_CMD_GET_REBUILD_PROGRESS", value: 39, isUnsigned: true)
!199 = !DIEnumerator(name: "MYRB_CMD_REBUILD_CONTROL", value: 31, isUnsigned: true)
!200 = !DIEnumerator(name: "MYRB_CMD_READ_BADBLOCK_TABLE", value: 11, isUnsigned: true)
!201 = !DIEnumerator(name: "MYRB_CMD_READ_BADDATA_TABLE", value: 37, isUnsigned: true)
!202 = !DIEnumerator(name: "MYRB_CMD_CLEAR_BADDATA_TABLE", value: 38, isUnsigned: true)
!203 = !DIEnumerator(name: "MYRB_CMD_GET_ERROR_TABLE", value: 23, isUnsigned: true)
!204 = !DIEnumerator(name: "MYRB_CMD_ADD_CAPACITY_ASYNC", value: 42, isUnsigned: true)
!205 = !DIEnumerator(name: "MYRB_CMD_BGI_CONTROL", value: 43, isUnsigned: true)
!206 = !DIEnumerator(name: "MYRB_CMD_READ_CONFIG2", value: 61, isUnsigned: true)
!207 = !DIEnumerator(name: "MYRB_CMD_WRITE_CONFIG2", value: 60, isUnsigned: true)
!208 = !DIEnumerator(name: "MYRB_CMD_READ_CONFIG_ONDISK", value: 74, isUnsigned: true)
!209 = !DIEnumerator(name: "MYRB_CMD_WRITE_CONFIG_ONDISK", value: 75, isUnsigned: true)
!210 = !DIEnumerator(name: "MYRB_CMD_READ_CONFIG", value: 78, isUnsigned: true)
!211 = !DIEnumerator(name: "MYRB_CMD_READ_BACKUP_CONFIG", value: 77, isUnsigned: true)
!212 = !DIEnumerator(name: "MYRB_CMD_WRITE_CONFIG", value: 79, isUnsigned: true)
!213 = !DIEnumerator(name: "MYRB_CMD_ADD_CONFIG", value: 76, isUnsigned: true)
!214 = !DIEnumerator(name: "MYRB_CMD_READ_CONFIG_LABEL", value: 72, isUnsigned: true)
!215 = !DIEnumerator(name: "MYRB_CMD_WRITE_CONFIG_LABEL", value: 73, isUnsigned: true)
!216 = !DIEnumerator(name: "MYRB_CMD_LOAD_IMAGE", value: 32, isUnsigned: true)
!217 = !DIEnumerator(name: "MYRB_CMD_STORE_IMAGE", value: 33, isUnsigned: true)
!218 = !DIEnumerator(name: "MYRB_CMD_PROGRAM_IMAGE", value: 34, isUnsigned: true)
!219 = !DIEnumerator(name: "MYRB_CMD_SET_DIAGNOSTIC_MODE", value: 49, isUnsigned: true)
!220 = !DIEnumerator(name: "MYRB_CMD_RUN_DIAGNOSTIC", value: 50, isUnsigned: true)
!221 = !DIEnumerator(name: "MYRB_CMD_GET_SUBSYS_DATA", value: 112, isUnsigned: true)
!222 = !DIEnumerator(name: "MYRB_CMD_SET_SUBSYS_PARAM", value: 113, isUnsigned: true)
!223 = !DIEnumerator(name: "MYRB_CMD_ENQUIRY_OLD", value: 5, isUnsigned: true)
!224 = !DIEnumerator(name: "MYRB_CMD_GET_DEVICE_STATE_OLD", value: 20, isUnsigned: true)
!225 = !DIEnumerator(name: "MYRB_CMD_READ_OLD", value: 2, isUnsigned: true)
!226 = !DIEnumerator(name: "MYRB_CMD_WRITE_OLD", value: 3, isUnsigned: true)
!227 = !DIEnumerator(name: "MYRB_CMD_READ_SG_OLD", value: 130, isUnsigned: true)
!228 = !DIEnumerator(name: "MYRB_CMD_WRITE_SG_OLD", value: 131, isUnsigned: true)
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "myrb_devstate", file: !164, line: 336, baseType: !165, size: 8, elements: !230)
!230 = !{!231, !232, !233, !234, !235, !236}
!231 = !DIEnumerator(name: "MYRB_DEVICE_DEAD", value: 0, isUnsigned: true)
!232 = !DIEnumerator(name: "MYRB_DEVICE_WO", value: 2, isUnsigned: true)
!233 = !DIEnumerator(name: "MYRB_DEVICE_ONLINE", value: 3, isUnsigned: true)
!234 = !DIEnumerator(name: "MYRB_DEVICE_CRITICAL", value: 4, isUnsigned: true)
!235 = !DIEnumerator(name: "MYRB_DEVICE_STANDBY", value: 16, isUnsigned: true)
!236 = !DIEnumerator(name: "MYRB_DEVICE_OFFLINE", value: 255, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !238, file: !164, line: 653, baseType: !165, size: 8, elements: !371)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 643, size: 128, elements: !358)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "myrb_cmd_mbox", file: !164, line: 574, size: 128, elements: !240)
!240 = !{!241, !245, !249, !258, !274, !286, !298, !312, !327, !337, !347, !348}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !239, file: !164, line: 575, baseType: !242, size: 128)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 4)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !239, file: !164, line: 576, baseType: !246, size: 128)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 128, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 16)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !239, file: !164, line: 581, baseType: !250, size: 128)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 577, size: 128, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !250, file: !164, line: 578, baseType: !163, size: 8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !250, file: !164, line: 579, baseType: !165, size: 8, offset: 8)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd", scope: !250, file: !164, line: 580, baseType: !255, size: 112, offset: 16)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 112, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 14)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type3", scope: !239, file: !164, line: 588, baseType: !259, size: 128)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 582, size: 128, elements: !260)
!260 = !{!261, !262, !263, !267, !272}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !259, file: !164, line: 583, baseType: !163, size: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !259, file: !164, line: 584, baseType: !165, size: 8, offset: 8)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !259, file: !164, line: 585, baseType: !264, size: 48, offset: 16)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 48, elements: !265)
!265 = !{!266}
!266 = !DISubrange(count: 6)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !259, file: !164, line: 586, baseType: !268, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !269, line: 21, baseType: !270)
!269 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !271, line: 27, baseType: !7)
!271 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !259, file: !164, line: 587, baseType: !273, size: 32, offset: 96)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 32, elements: !243)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type3B", scope: !239, file: !164, line: 596, baseType: !275, size: 128)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 589, size: 128, elements: !276)
!276 = !{!277, !278, !279, !280, !284, !285}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !275, file: !164, line: 590, baseType: !163, size: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !275, file: !164, line: 591, baseType: !165, size: 8, offset: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "optype", scope: !275, file: !164, line: 592, baseType: !165, size: 8, offset: 16)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !275, file: !164, line: 593, baseType: !281, size: 40, offset: 24)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 40, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 5)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !275, file: !164, line: 594, baseType: !268, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !275, file: !164, line: 595, baseType: !273, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "type3C", scope: !239, file: !164, line: 604, baseType: !287, size: 128)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 597, size: 128, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !287, file: !164, line: 598, baseType: !163, size: 8)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !287, file: !164, line: 599, baseType: !165, size: 8, offset: 8)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !287, file: !164, line: 600, baseType: !281, size: 40, offset: 16)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_num", scope: !287, file: !164, line: 601, baseType: !165, size: 6, offset: 56, flags: DIFlagBitField, extraData: i64 56)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "auto_restore", scope: !287, file: !164, line: 602, baseType: !165, size: 1, offset: 62, flags: DIFlagBitField, extraData: i64 56)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !287, file: !164, line: 603, baseType: !295, size: 64, offset: 64)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 64, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 8)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type3D", scope: !239, file: !164, line: 614, baseType: !299, size: 128)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 605, size: 128, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !310, !311}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !299, file: !164, line: 606, baseType: !163, size: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !299, file: !164, line: 607, baseType: !165, size: 8, offset: 8)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !299, file: !164, line: 608, baseType: !165, size: 8, offset: 16)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !299, file: !164, line: 609, baseType: !165, size: 8, offset: 24)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !299, file: !164, line: 610, baseType: !229, size: 8, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !299, file: !164, line: 611, baseType: !307, size: 24, offset: 40)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 24, elements: !308)
!308 = !{!309}
!309 = !DISubrange(count: 3)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !299, file: !164, line: 612, baseType: !268, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !299, file: !164, line: 613, baseType: !273, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type3E", scope: !239, file: !164, line: 624, baseType: !313, size: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 615, size: 128, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !321, !325, !326}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !313, file: !164, line: 616, baseType: !163, size: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !313, file: !164, line: 617, baseType: !165, size: 8, offset: 8)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "optype", scope: !313, file: !164, line: 618, baseType: !165, size: 8, offset: 16)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "opqual", scope: !313, file: !164, line: 619, baseType: !165, size: 8, offset: 24)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ev_seq", scope: !313, file: !164, line: 620, baseType: !320, size: 16, offset: 32)
!320 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !313, file: !164, line: 621, baseType: !322, size: 16, offset: 48)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 16, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 2)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !313, file: !164, line: 622, baseType: !268, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !313, file: !164, line: 623, baseType: !273, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "type3R", scope: !239, file: !164, line: 633, baseType: !328, size: 128)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 625, size: 128, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !328, file: !164, line: 626, baseType: !163, size: 8)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !164, line: 627, baseType: !165, size: 8, offset: 8)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !328, file: !164, line: 628, baseType: !322, size: 16, offset: 16)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rbld_rate", scope: !328, file: !164, line: 629, baseType: !165, size: 8, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !328, file: !164, line: 630, baseType: !307, size: 24, offset: 40)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !328, file: !164, line: 631, baseType: !268, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !328, file: !164, line: 632, baseType: !273, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type4", scope: !239, file: !164, line: 642, baseType: !338, size: 128)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 634, size: 128, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !346}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !338, file: !164, line: 635, baseType: !163, size: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !164, line: 636, baseType: !165, size: 8, offset: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_len", scope: !338, file: !164, line: 637, baseType: !320, size: 16, offset: 16)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !338, file: !164, line: 638, baseType: !7, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !338, file: !164, line: 639, baseType: !268, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_num", scope: !338, file: !164, line: 640, baseType: !165, size: 8, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd", scope: !338, file: !164, line: 641, baseType: !307, size: 24, offset: 104)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type5", scope: !239, file: !164, line: 660, baseType: !238, size: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "typeX", scope: !239, file: !164, line: 669, baseType: !349, size: 128)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !164, line: 661, size: 128, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !349, file: !164, line: 662, baseType: !163, size: 8)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !349, file: !164, line: 663, baseType: !165, size: 8, offset: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "opcode2", scope: !349, file: !164, line: 664, baseType: !165, size: 8, offset: 16)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !349, file: !164, line: 665, baseType: !165, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cmd_mbox_addr", scope: !349, file: !164, line: 666, baseType: !268, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stat_mbox_addr", scope: !349, file: !164, line: 667, baseType: !268, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !349, file: !164, line: 668, baseType: !273, size: 32, offset: 96)
!358 = !{!359, !360, !361, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !238, file: !164, line: 644, baseType: !163, size: 8)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !238, file: !164, line: 645, baseType: !165, size: 8, offset: 8)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !238, file: !164, line: 649, baseType: !362, size: 16, offset: 16)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !238, file: !164, line: 646, size: 16, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_len", scope: !362, file: !164, line: 647, baseType: !320, size: 11, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_num", scope: !362, file: !164, line: 648, baseType: !165, size: 5, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lba", scope: !238, file: !164, line: 650, baseType: !7, size: 32, offset: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !238, file: !164, line: 651, baseType: !268, size: 32, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "sg_count", scope: !238, file: !164, line: 652, baseType: !165, size: 6, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sg_type", scope: !238, file: !164, line: 658, baseType: !237, size: 2, offset: 102, flags: DIFlagBitField, extraData: i64 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd", scope: !238, file: !164, line: 659, baseType: !307, size: 24, offset: 104)
!371 = !{!372, !373, !374, !375}
!372 = !DIEnumerator(name: "MYRB_SGL_ADDR32_COUNT32", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "MYRB_SGL_ADDR32_COUNT16", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "MYRB_SGL_COUNT32_ADDR32", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "MYRB_SGL_COUNT16_ADDR32", value: 3, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !377, file: !164, line: 533, baseType: !165, size: 8, elements: !408)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_dcdb", file: !164, line: 530, size: 704, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !391, !392, !393, !394, !395, !396, !397, !398, !402, !406, !407}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !377, file: !164, line: 531, baseType: !7, size: 4, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !377, file: !164, line: 532, baseType: !7, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "data_xfer", scope: !377, file: !164, line: 538, baseType: !376, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "early_status", scope: !377, file: !164, line: 539, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !377, file: !164, line: 540, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !377, file: !164, line: 546, baseType: !385, size: 2, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !377, file: !164, line: 541, baseType: !165, size: 8, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIEnumerator(name: "MYRB_DCDB_TMO_24_HRS", value: 0, isUnsigned: true)
!388 = !DIEnumerator(name: "MYRB_DCDB_TMO_10_SECS", value: 1, isUnsigned: true)
!389 = !DIEnumerator(name: "MYRB_DCDB_TMO_60_SECS", value: 2, isUnsigned: true)
!390 = !DIEnumerator(name: "MYRB_DCDB_TMO_10_MINS", value: 3, isUnsigned: true)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "no_autosense", scope: !377, file: !164, line: 547, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "allow_disconnect", scope: !377, file: !164, line: 548, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_len_lo", scope: !377, file: !164, line: 549, baseType: !320, size: 16, offset: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dma_addr", scope: !377, file: !164, line: 550, baseType: !268, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cdb_len", scope: !377, file: !164, line: 551, baseType: !165, size: 4, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_len_hi4", scope: !377, file: !164, line: 552, baseType: !165, size: 4, offset: 68, flags: DIFlagBitField, extraData: i64 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sense_len", scope: !377, file: !164, line: 553, baseType: !165, size: 8, offset: 72)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "cdb", scope: !377, file: !164, line: 554, baseType: !399, size: 96, offset: 80)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 96, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 12)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sense", scope: !377, file: !164, line: 555, baseType: !403, size: 512, offset: 176)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 512, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !377, file: !164, line: 556, baseType: !165, size: 8, offset: 688)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !377, file: !164, line: 557, baseType: !165, size: 8, offset: 696)
!408 = !{!409, !410, !411, !412}
!409 = !DIEnumerator(name: "MYRB_DCDB_XFER_NONE", value: 0, isUnsigned: true)
!410 = !DIEnumerator(name: "MYRB_DCDB_XFER_DEVICE_TO_SYSTEM", value: 1, isUnsigned: true)
!411 = !DIEnumerator(name: "MYRB_DCDB_XFER_SYSTEM_TO_DEVICE", value: 2, isUnsigned: true)
!412 = !DIEnumerator(name: "MYRB_DCDB_XFER_ILLEGAL", value: 3, isUnsigned: true)
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !414, file: !164, line: 175, baseType: !165, size: 8, elements: !460)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_enquiry", file: !164, line: 162, size: 2048, elements: !415)
!415 = !{!416, !417, !418, !422, !423, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !448, !456}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_count", scope: !414, file: !164, line: 163, baseType: !165, size: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !414, file: !164, line: 164, baseType: !7, size: 24, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_sizes", scope: !414, file: !164, line: 165, baseType: !419, size: 1024, offset: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flash_age", scope: !414, file: !164, line: 166, baseType: !320, size: 16, offset: 1056)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !414, file: !164, line: 171, baseType: !424, size: 8, offset: 1072)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !164, line: 167, size: 8, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "deferred", scope: !424, file: !164, line: 168, baseType: !165, size: 1, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "low_bat", scope: !424, file: !164, line: 169, baseType: !165, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !424, file: !164, line: 170, baseType: !165, size: 6, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !414, file: !164, line: 172, baseType: !165, size: 8, offset: 1080, flags: DIFlagBitField, extraData: i64 1080)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "fw_minor_version", scope: !414, file: !164, line: 173, baseType: !165, size: 8, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fw_major_version", scope: !414, file: !164, line: 174, baseType: !165, size: 8, offset: 1096)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rbld", scope: !414, file: !164, line: 185, baseType: !413, size: 8, offset: 1104)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "max_tcq", scope: !414, file: !164, line: 186, baseType: !165, size: 8, offset: 1112)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_offline", scope: !414, file: !164, line: 187, baseType: !165, size: 8, offset: 1120)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd4", scope: !414, file: !164, line: 188, baseType: !165, size: 8, offset: 1128, flags: DIFlagBitField, extraData: i64 1128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ev_seq", scope: !414, file: !164, line: 189, baseType: !320, size: 16, offset: 1136)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_critical", scope: !414, file: !164, line: 190, baseType: !165, size: 8, offset: 1152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd5", scope: !414, file: !164, line: 191, baseType: !7, size: 24, offset: 1160, flags: DIFlagBitField, extraData: i64 1160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pdev_dead", scope: !414, file: !164, line: 192, baseType: !165, size: 8, offset: 1184)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd6", scope: !414, file: !164, line: 193, baseType: !165, size: 8, offset: 1192, flags: DIFlagBitField, extraData: i64 1192)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rbld_count", scope: !414, file: !164, line: 194, baseType: !165, size: 8, offset: 1200)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "misc", scope: !414, file: !164, line: 199, baseType: !443, size: 8, offset: 1208)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !164, line: 195, size: 8, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd7", scope: !443, file: !164, line: 196, baseType: !165, size: 3, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bbu_present", scope: !443, file: !164, line: 197, baseType: !165, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd8", scope: !443, file: !164, line: 198, baseType: !165, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "dead_drives", scope: !414, file: !164, line: 203, baseType: !449, size: 336, offset: 1216)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 336, elements: !454)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !164, line: 200, size: 16, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !450, file: !164, line: 201, baseType: !165, size: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !450, file: !164, line: 202, baseType: !165, size: 8, offset: 8)
!454 = !{!455}
!455 = !DISubrange(count: 21)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd9", scope: !414, file: !164, line: 204, baseType: !457, size: 496, offset: 1552)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 496, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 62)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469}
!461 = !DIEnumerator(name: "MYRB_NO_STDBY_RBLD_OR_CHECK_IN_PROGRESS", value: 0, isUnsigned: true)
!462 = !DIEnumerator(name: "MYRB_STDBY_RBLD_IN_PROGRESS", value: 1, isUnsigned: true)
!463 = !DIEnumerator(name: "MYRB_BG_RBLD_IN_PROGRESS", value: 2, isUnsigned: true)
!464 = !DIEnumerator(name: "MYRB_BG_CHECK_IN_PROGRESS", value: 3, isUnsigned: true)
!465 = !DIEnumerator(name: "MYRB_STDBY_RBLD_COMPLETED_WITH_ERROR", value: 255, isUnsigned: true)
!466 = !DIEnumerator(name: "MYRB_BG_RBLD_OR_CHECK_FAILED_DRIVE_FAILED", value: 240, isUnsigned: true)
!467 = !DIEnumerator(name: "MYRB_BG_RBLD_OR_CHECK_FAILED_LDEV_FAILED", value: 241, isUnsigned: true)
!468 = !DIEnumerator(name: "MYRB_BG_RBLD_OR_CHECK_FAILED_OTHER", value: 242, isUnsigned: true)
!469 = !DIEnumerator(name: "MYRB_BG_RBLD_OR_CHECK_SUCCESS_TERMINATED", value: 243, isUnsigned: true)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !471, file: !164, line: 434, baseType: !165, size: 8, elements: !480)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_bgi_status", file: !164, line: 428, size: 256, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_size", scope: !471, file: !164, line: 429, baseType: !7, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_done", scope: !471, file: !164, line: 430, baseType: !7, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !471, file: !164, line: 431, baseType: !399, size: 96, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_num", scope: !471, file: !164, line: 432, baseType: !7, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "raid_level", scope: !471, file: !164, line: 433, baseType: !165, size: 8, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !471, file: !164, line: 440, baseType: !470, size: 8, offset: 200)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !471, file: !164, line: 441, baseType: !264, size: 48, offset: 208)
!480 = !{!481, !482, !483, !484, !485}
!481 = !DIEnumerator(name: "MYRB_BGI_INVALID", value: 0, isUnsigned: true)
!482 = !DIEnumerator(name: "MYRB_BGI_STARTED", value: 2, isUnsigned: true)
!483 = !DIEnumerator(name: "MYRB_BGI_INPROGRESS", value: 4, isUnsigned: true)
!484 = !DIEnumerator(name: "MYRB_BGI_SUSPENDED", value: 5, isUnsigned: true)
!485 = !DIEnumerator(name: "MYRB_BGI_CANCELLED", value: 6, isUnsigned: true)
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "irqreturn", file: !487, line: 11, baseType: !7, size: 32, elements: !488)
!487 = !DIFile(filename: "./include/linux/irqreturn.h", directory: "/home/lizy2001/genbc/linux")
!488 = !{!489, !490, !491}
!489 = !DIEnumerator(name: "IRQ_NONE", value: 0, isUnsigned: true)
!490 = !DIEnumerator(name: "IRQ_HANDLED", value: 1, isUnsigned: true)
!491 = !DIEnumerator(name: "IRQ_WAKE_THREAD", value: 2, isUnsigned: true)
!492 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DAC960_LA_reg_offset", file: !164, line: 781, baseType: !7, size: 32, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!494 = !DIEnumerator(name: "DAC960_LA_IRQMASK_OFFSET", value: 52, isUnsigned: true)
!495 = !DIEnumerator(name: "DAC960_LA_CMDOP_OFFSET", value: 80, isUnsigned: true)
!496 = !DIEnumerator(name: "DAC960_LA_CMDID_OFFSET", value: 81, isUnsigned: true)
!497 = !DIEnumerator(name: "DAC960_LA_MBOX2_OFFSET", value: 82, isUnsigned: true)
!498 = !DIEnumerator(name: "DAC960_LA_MBOX3_OFFSET", value: 83, isUnsigned: true)
!499 = !DIEnumerator(name: "DAC960_LA_MBOX4_OFFSET", value: 84, isUnsigned: true)
!500 = !DIEnumerator(name: "DAC960_LA_MBOX5_OFFSET", value: 85, isUnsigned: true)
!501 = !DIEnumerator(name: "DAC960_LA_MBOX6_OFFSET", value: 86, isUnsigned: true)
!502 = !DIEnumerator(name: "DAC960_LA_MBOX7_OFFSET", value: 87, isUnsigned: true)
!503 = !DIEnumerator(name: "DAC960_LA_MBOX8_OFFSET", value: 88, isUnsigned: true)
!504 = !DIEnumerator(name: "DAC960_LA_MBOX9_OFFSET", value: 89, isUnsigned: true)
!505 = !DIEnumerator(name: "DAC960_LA_MBOX10_OFFSET", value: 90, isUnsigned: true)
!506 = !DIEnumerator(name: "DAC960_LA_MBOX11_OFFSET", value: 91, isUnsigned: true)
!507 = !DIEnumerator(name: "DAC960_LA_MBOX12_OFFSET", value: 92, isUnsigned: true)
!508 = !DIEnumerator(name: "DAC960_LA_STSID_OFFSET", value: 93, isUnsigned: true)
!509 = !DIEnumerator(name: "DAC960_LA_STS_OFFSET", value: 94, isUnsigned: true)
!510 = !DIEnumerator(name: "DAC960_LA_IDB_OFFSET", value: 96, isUnsigned: true)
!511 = !DIEnumerator(name: "DAC960_LA_ODB_OFFSET", value: 97, isUnsigned: true)
!512 = !DIEnumerator(name: "DAC960_LA_ERRSTS_OFFSET", value: 99, isUnsigned: true)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 10, baseType: !7, size: 32, elements: !515)
!514 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!515 = !{!516, !517}
!516 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!517 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!518 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !519, line: 460, baseType: !7, size: 32, elements: !520)
!519 = !DIFile(filename: "./include/linux/blk-mq.h", directory: "/home/lizy2001/genbc/linux")
!520 = !{!521, !522}
!521 = !DIEnumerator(name: "BLK_MQ_UNIQUE_TAG_BITS", value: 16, isUnsigned: true)
!522 = !DIEnumerator(name: "BLK_MQ_UNIQUE_TAG_MASK", value: 65535, isUnsigned: true)
!523 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DAC960_PG_reg_offset", file: !164, line: 838, baseType: !7, size: 32, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!525 = !DIEnumerator(name: "DAC960_PG_IDB_OFFSET", value: 32, isUnsigned: true)
!526 = !DIEnumerator(name: "DAC960_PG_ODB_OFFSET", value: 44, isUnsigned: true)
!527 = !DIEnumerator(name: "DAC960_PG_IRQMASK_OFFSET", value: 52, isUnsigned: true)
!528 = !DIEnumerator(name: "DAC960_PG_CMDOP_OFFSET", value: 4096, isUnsigned: true)
!529 = !DIEnumerator(name: "DAC960_PG_CMDID_OFFSET", value: 4097, isUnsigned: true)
!530 = !DIEnumerator(name: "DAC960_PG_MBOX2_OFFSET", value: 4098, isUnsigned: true)
!531 = !DIEnumerator(name: "DAC960_PG_MBOX3_OFFSET", value: 4099, isUnsigned: true)
!532 = !DIEnumerator(name: "DAC960_PG_MBOX4_OFFSET", value: 4100, isUnsigned: true)
!533 = !DIEnumerator(name: "DAC960_PG_MBOX5_OFFSET", value: 4101, isUnsigned: true)
!534 = !DIEnumerator(name: "DAC960_PG_MBOX6_OFFSET", value: 4102, isUnsigned: true)
!535 = !DIEnumerator(name: "DAC960_PG_MBOX7_OFFSET", value: 4103, isUnsigned: true)
!536 = !DIEnumerator(name: "DAC960_PG_MBOX8_OFFSET", value: 4104, isUnsigned: true)
!537 = !DIEnumerator(name: "DAC960_PG_MBOX9_OFFSET", value: 4105, isUnsigned: true)
!538 = !DIEnumerator(name: "DAC960_PG_MBOX10_OFFSET", value: 4106, isUnsigned: true)
!539 = !DIEnumerator(name: "DAC960_PG_MBOX11_OFFSET", value: 4107, isUnsigned: true)
!540 = !DIEnumerator(name: "DAC960_PG_MBOX12_OFFSET", value: 4108, isUnsigned: true)
!541 = !DIEnumerator(name: "DAC960_PG_STSID_OFFSET", value: 4120, isUnsigned: true)
!542 = !DIEnumerator(name: "DAC960_PG_STS_OFFSET", value: 4122, isUnsigned: true)
!543 = !DIEnumerator(name: "DAC960_PG_ERRSTS_OFFSET", value: 4159, isUnsigned: true)
!544 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DAC960_PD_reg_offset", file: !164, line: 897, baseType: !7, size: 32, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!546 = !DIEnumerator(name: "DAC960_PD_CMDOP_OFFSET", value: 0, isUnsigned: true)
!547 = !DIEnumerator(name: "DAC960_PD_CMDID_OFFSET", value: 1, isUnsigned: true)
!548 = !DIEnumerator(name: "DAC960_PD_MBOX2_OFFSET", value: 2, isUnsigned: true)
!549 = !DIEnumerator(name: "DAC960_PD_MBOX3_OFFSET", value: 3, isUnsigned: true)
!550 = !DIEnumerator(name: "DAC960_PD_MBOX4_OFFSET", value: 4, isUnsigned: true)
!551 = !DIEnumerator(name: "DAC960_PD_MBOX5_OFFSET", value: 5, isUnsigned: true)
!552 = !DIEnumerator(name: "DAC960_PD_MBOX6_OFFSET", value: 6, isUnsigned: true)
!553 = !DIEnumerator(name: "DAC960_PD_MBOX7_OFFSET", value: 7, isUnsigned: true)
!554 = !DIEnumerator(name: "DAC960_PD_MBOX8_OFFSET", value: 8, isUnsigned: true)
!555 = !DIEnumerator(name: "DAC960_PD_MBOX9_OFFSET", value: 9, isUnsigned: true)
!556 = !DIEnumerator(name: "DAC960_PD_MBOX10_OFFSET", value: 10, isUnsigned: true)
!557 = !DIEnumerator(name: "DAC960_PD_MBOX11_OFFSET", value: 11, isUnsigned: true)
!558 = !DIEnumerator(name: "DAC960_PD_MBOX12_OFFSET", value: 12, isUnsigned: true)
!559 = !DIEnumerator(name: "DAC960_PD_STSID_OFFSET", value: 13, isUnsigned: true)
!560 = !DIEnumerator(name: "DAC960_PD_STS_OFFSET", value: 14, isUnsigned: true)
!561 = !DIEnumerator(name: "DAC960_PD_ERRSTS_OFFSET", value: 63, isUnsigned: true)
!562 = !DIEnumerator(name: "DAC960_PD_IDB_OFFSET", value: 64, isUnsigned: true)
!563 = !DIEnumerator(name: "DAC960_PD_ODB_OFFSET", value: 65, isUnsigned: true)
!564 = !DIEnumerator(name: "DAC960_PD_IRQEN_OFFSET", value: 67, isUnsigned: true)
!565 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "raid_level", file: !566, line: 28, baseType: !7, size: 32, elements: !567)
!566 = !DIFile(filename: "./include/linux/raid_class.h", directory: "/home/lizy2001/genbc/linux")
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!568 = !DIEnumerator(name: "RAID_LEVEL_UNKNOWN", value: 0, isUnsigned: true)
!569 = !DIEnumerator(name: "RAID_LEVEL_LINEAR", value: 1, isUnsigned: true)
!570 = !DIEnumerator(name: "RAID_LEVEL_0", value: 2, isUnsigned: true)
!571 = !DIEnumerator(name: "RAID_LEVEL_1", value: 3, isUnsigned: true)
!572 = !DIEnumerator(name: "RAID_LEVEL_10", value: 4, isUnsigned: true)
!573 = !DIEnumerator(name: "RAID_LEVEL_1E", value: 5, isUnsigned: true)
!574 = !DIEnumerator(name: "RAID_LEVEL_3", value: 6, isUnsigned: true)
!575 = !DIEnumerator(name: "RAID_LEVEL_4", value: 7, isUnsigned: true)
!576 = !DIEnumerator(name: "RAID_LEVEL_5", value: 8, isUnsigned: true)
!577 = !DIEnumerator(name: "RAID_LEVEL_50", value: 9, isUnsigned: true)
!578 = !DIEnumerator(name: "RAID_LEVEL_6", value: 10, isUnsigned: true)
!579 = !DIEnumerator(name: "RAID_LEVEL_JBOD", value: 11, isUnsigned: true)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "kmalloc_cache_type", file: !581, line: 305, baseType: !7, size: 32, elements: !582)
!581 = !DIFile(filename: "./include/linux/slab.h", directory: "/home/lizy2001/genbc/linux")
!582 = !{!583, !584, !585, !586}
!583 = !DIEnumerator(name: "KMALLOC_NORMAL", value: 0, isUnsigned: true)
!584 = !DIEnumerator(name: "KMALLOC_RECLAIM", value: 1, isUnsigned: true)
!585 = !DIEnumerator(name: "KMALLOC_DMA", value: 2, isUnsigned: true)
!586 = !DIEnumerator(name: "NR_KMALLOC_TYPES", value: 3, isUnsigned: true)
!587 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "raid_state", file: !566, line: 20, baseType: !7, size: 32, elements: !588)
!588 = !{!589, !590, !591, !592, !593}
!589 = !DIEnumerator(name: "RAID_STATE_UNKNOWN", value: 0, isUnsigned: true)
!590 = !DIEnumerator(name: "RAID_STATE_ACTIVE", value: 1, isUnsigned: true)
!591 = !DIEnumerator(name: "RAID_STATE_DEGRADED", value: 2, isUnsigned: true)
!592 = !DIEnumerator(name: "RAID_STATE_RESYNCING", value: 3, isUnsigned: true)
!593 = !DIEnumerator(name: "RAID_STATE_OFFLINE", value: 4, isUnsigned: true)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !595, file: !164, line: 395, baseType: !165, size: 8, elements: !612)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_pdev_state", file: !164, line: 392, size: 120, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !595, file: !164, line: 393, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "devtype", scope: !595, file: !164, line: 400, baseType: !594, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !595, file: !164, line: 401, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fast20", scope: !595, file: !164, line: 402, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !595, file: !164, line: 403, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fast", scope: !595, file: !164, line: 404, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "wide", scope: !595, file: !164, line: 405, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tcq_supported", scope: !595, file: !164, line: 406, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !595, file: !164, line: 407, baseType: !229, size: 8, offset: 16)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !595, file: !164, line: 408, baseType: !7, size: 8, offset: 24, flags: DIFlagBitField, extraData: i64 24)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sync_multiplier", scope: !595, file: !164, line: 409, baseType: !7, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "sync_offset", scope: !595, file: !164, line: 410, baseType: !7, size: 5, offset: 64, flags: DIFlagBitField, extraData: i64 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !595, file: !164, line: 411, baseType: !7, size: 3, offset: 69, flags: DIFlagBitField, extraData: i64 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !595, file: !164, line: 412, baseType: !7, size: 32, offset: 72)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd4", scope: !595, file: !164, line: 413, baseType: !7, size: 16, offset: 104, flags: DIFlagBitField, extraData: i64 104)
!612 = !{!613, !614, !615, !616}
!613 = !DIEnumerator(name: "MYRB_TYPE_OTHER", value: 0, isUnsigned: true)
!614 = !DIEnumerator(name: "MYRB_TYPE_DISK", value: 1, isUnsigned: true)
!615 = !DIEnumerator(name: "MYRB_TYPE_TAPE", value: 2, isUnsigned: true)
!616 = !DIEnumerator(name: "MYRB_TYPE_CDROM_OR_WORM", value: 3, isUnsigned: true)
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "myrb_raidlevel", file: !164, line: 348, baseType: !165, size: 8, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624}
!619 = !DIEnumerator(name: "MYRB_RAID_LEVEL0", value: 0, isUnsigned: true)
!620 = !DIEnumerator(name: "MYRB_RAID_LEVEL1", value: 1, isUnsigned: true)
!621 = !DIEnumerator(name: "MYRB_RAID_LEVEL3", value: 3, isUnsigned: true)
!622 = !DIEnumerator(name: "MYRB_RAID_LEVEL5", value: 5, isUnsigned: true)
!623 = !DIEnumerator(name: "MYRB_RAID_LEVEL6", value: 6, isUnsigned: true)
!624 = !DIEnumerator(name: "MYRB_RAID_JBOD", value: 7, isUnsigned: true)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !626, file: !164, line: 212, baseType: !165, size: 8, elements: !752)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !164, line: 211, size: 32, elements: !735)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_enquiry2", file: !164, line: 210, size: 1024, elements: !628)
!628 = !{!629, !630, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !692, !693, !694, !695, !696, !697, !714, !715, !716, !725, !726, !734}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "hw", scope: !627, file: !164, line: 237, baseType: !626, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "fw", scope: !627, file: !164, line: 244, baseType: !631, size: 32, offset: 32)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !164, line: 239, size: 32, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "major_version", scope: !631, file: !164, line: 240, baseType: !165, size: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !631, file: !164, line: 241, baseType: !165, size: 8, offset: 8)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "turn_id", scope: !631, file: !164, line: 242, baseType: !165, size: 8, offset: 16)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "firmware_type", scope: !631, file: !164, line: 243, baseType: !637, size: 8, offset: 24)
!637 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !627, file: !164, line: 245, baseType: !7, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cfg_chan", scope: !627, file: !164, line: 246, baseType: !165, size: 8, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cur_chan", scope: !627, file: !164, line: 247, baseType: !165, size: 8, offset: 104)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "max_targets", scope: !627, file: !164, line: 248, baseType: !165, size: 8, offset: 112)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "max_tcq", scope: !627, file: !164, line: 249, baseType: !165, size: 8, offset: 120)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "max_ldev", scope: !627, file: !164, line: 250, baseType: !165, size: 8, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "max_arms", scope: !627, file: !164, line: 251, baseType: !165, size: 8, offset: 136)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "max_spans", scope: !627, file: !164, line: 252, baseType: !165, size: 8, offset: 144)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !627, file: !164, line: 253, baseType: !165, size: 8, offset: 152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !627, file: !164, line: 254, baseType: !7, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !627, file: !164, line: 255, baseType: !7, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !627, file: !164, line: 256, baseType: !7, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flash_size", scope: !627, file: !164, line: 257, baseType: !7, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "nvram_size", scope: !627, file: !164, line: 258, baseType: !7, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mem_type", scope: !627, file: !164, line: 275, baseType: !653, size: 16, offset: 320)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !164, line: 259, size: 16, elements: !654)
!654 = !{!655, !662, !669, !670, !671}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ram", scope: !653, file: !164, line: 265, baseType: !656, size: 3, flags: DIFlagBitField, extraData: i64 0)
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !653, file: !164, line: 260, baseType: !165, size: 8, elements: !657)
!657 = !{!658, !659, !660, !661}
!658 = !DIEnumerator(name: "MYRB_RAM_TYPE_DRAM", value: 0, isUnsigned: true)
!659 = !DIEnumerator(name: "MYRB_RAM_TYPE_EDO", value: 1, isUnsigned: true)
!660 = !DIEnumerator(name: "MYRB_RAM_TYPE_SDRAM", value: 2, isUnsigned: true)
!661 = !DIEnumerator(name: "MYRB_RAM_TYPE_Last", value: 7, isUnsigned: true)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ec", scope: !653, file: !164, line: 271, baseType: !663, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !653, file: !164, line: 266, baseType: !165, size: 8, elements: !664)
!664 = !{!665, !666, !667, !668}
!665 = !DIEnumerator(name: "MYRB_ERR_CORR_None", value: 0, isUnsigned: true)
!666 = !DIEnumerator(name: "MYRB_ERR_CORR_Parity", value: 1, isUnsigned: true)
!667 = !DIEnumerator(name: "MYRB_ERR_CORR_ECC", value: 2, isUnsigned: true)
!668 = !DIEnumerator(name: "MYRB_ERR_CORR_Last", value: 7, isUnsigned: true)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fast_page", scope: !653, file: !164, line: 272, baseType: !165, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "low_power", scope: !653, file: !164, line: 273, baseType: !165, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd4", scope: !653, file: !164, line: 274, baseType: !165, size: 8, offset: 8)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "clock_speed", scope: !627, file: !164, line: 276, baseType: !320, size: 16, offset: 336)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mem_speed", scope: !627, file: !164, line: 277, baseType: !320, size: 16, offset: 352)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "hw_speed", scope: !627, file: !164, line: 278, baseType: !320, size: 16, offset: 368)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd5", scope: !627, file: !164, line: 279, baseType: !399, size: 96, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_cmds", scope: !627, file: !164, line: 280, baseType: !320, size: 16, offset: 480)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "max_sge", scope: !627, file: !164, line: 281, baseType: !320, size: 16, offset: 496)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "max_drv_cmds", scope: !627, file: !164, line: 282, baseType: !320, size: 16, offset: 512)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "max_io_desc", scope: !627, file: !164, line: 283, baseType: !320, size: 16, offset: 528)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "max_sectors", scope: !627, file: !164, line: 284, baseType: !320, size: 16, offset: 544)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !627, file: !164, line: 285, baseType: !165, size: 8, offset: 560)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd6", scope: !627, file: !164, line: 286, baseType: !165, size: 8, offset: 568)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "scsi_tmo", scope: !627, file: !164, line: 287, baseType: !165, size: 8, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd7", scope: !627, file: !164, line: 288, baseType: !165, size: 8, offset: 584)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "min_freelines", scope: !627, file: !164, line: 289, baseType: !320, size: 16, offset: 592)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd8", scope: !627, file: !164, line: 290, baseType: !295, size: 64, offset: 608)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rbld_rate_const", scope: !627, file: !164, line: 291, baseType: !165, size: 8, offset: 672)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd9", scope: !627, file: !164, line: 292, baseType: !689, size: 88, offset: 680)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 88, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 11)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pdrv_block_size", scope: !627, file: !164, line: 293, baseType: !320, size: 16, offset: 768)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ldev_block_size", scope: !627, file: !164, line: 294, baseType: !320, size: 16, offset: 784)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max_blocks_per_cmd", scope: !627, file: !164, line: 295, baseType: !320, size: 16, offset: 800)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "block_factor", scope: !627, file: !164, line: 296, baseType: !320, size: 16, offset: 816)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cacheline_size", scope: !627, file: !164, line: 297, baseType: !320, size: 16, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "scsi_cap", scope: !627, file: !164, line: 311, baseType: !698, size: 8, offset: 848)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !164, line: 298, size: 8, elements: !699)
!699 = !{!700, !706, !712, !713}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "bus_width", scope: !698, file: !164, line: 303, baseType: !701, size: 2, flags: DIFlagBitField, extraData: i64 0)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !698, file: !164, line: 299, baseType: !165, size: 8, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIEnumerator(name: "MYRB_WIDTH_NARROW_8BIT", value: 0, isUnsigned: true)
!704 = !DIEnumerator(name: "MYRB_WIDTH_WIDE_16BIT", value: 1, isUnsigned: true)
!705 = !DIEnumerator(name: "MYRB_WIDTH_WIDE_32BIT", value: 2, isUnsigned: true)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bus_speed", scope: !698, file: !164, line: 308, baseType: !707, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!707 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !698, file: !164, line: 304, baseType: !165, size: 8, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIEnumerator(name: "MYRB_SCSI_SPEED_FAST", value: 0, isUnsigned: true)
!710 = !DIEnumerator(name: "MYRB_SCSI_SPEED_ULTRA", value: 1, isUnsigned: true)
!711 = !DIEnumerator(name: "MYRB_SCSI_SPEED_ULTRA2", value: 2, isUnsigned: true)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "differential", scope: !698, file: !164, line: 309, baseType: !165, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd10", scope: !698, file: !164, line: 310, baseType: !165, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd11", scope: !627, file: !164, line: 312, baseType: !281, size: 40, offset: 856)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fw_build", scope: !627, file: !164, line: 313, baseType: !320, size: 16, offset: 896)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "fault_mgmt", scope: !627, file: !164, line: 321, baseType: !717, size: 8, offset: 912)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !627, file: !164, line: 314, baseType: !165, size: 8, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724}
!719 = !DIEnumerator(name: "MYRB_FAULT_AEMI", value: 1, isUnsigned: true)
!720 = !DIEnumerator(name: "MYRB_FAULT_OEM1", value: 2, isUnsigned: true)
!721 = !DIEnumerator(name: "MYRB_FAULT_OEM2", value: 4, isUnsigned: true)
!722 = !DIEnumerator(name: "MYRB_FAULT_OEM3", value: 8, isUnsigned: true)
!723 = !DIEnumerator(name: "MYRB_FAULT_CONNER", value: 16, isUnsigned: true)
!724 = !DIEnumerator(name: "MYRB_FAULT_SAFTE", value: 32, isUnsigned: true)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd12", scope: !627, file: !164, line: 322, baseType: !165, size: 8, offset: 920)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fw_features", scope: !627, file: !164, line: 329, baseType: !727, size: 32, offset: 928)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !164, line: 323, size: 32, elements: !728)
!728 = !{!729, !730, !731, !732, !733}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "clustering", scope: !727, file: !164, line: 324, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "online_RAID_expansion", scope: !727, file: !164, line: 325, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "readahead", scope: !727, file: !164, line: 326, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bgi", scope: !727, file: !164, line: 327, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd13", scope: !727, file: !164, line: 328, baseType: !7, size: 28, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd14", scope: !627, file: !164, line: 330, baseType: !295, size: 64, offset: 960)
!735 = !{!736, !737, !738, !745}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "sub_model", scope: !626, file: !164, line: 223, baseType: !625, size: 8)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "actual_channels", scope: !626, file: !164, line: 224, baseType: !165, size: 8, offset: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !626, file: !164, line: 230, baseType: !739, size: 8, offset: 16)
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !626, file: !164, line: 225, baseType: !165, size: 8, elements: !740)
!740 = !{!741, !742, !743, !744}
!741 = !DIEnumerator(name: "MYRB_5_CHANNEL_BOARD", value: 1, isUnsigned: true)
!742 = !DIEnumerator(name: "MYRB_3_CHANNEL_BOARD", value: 2, isUnsigned: true)
!743 = !DIEnumerator(name: "MYRB_2_CHANNEL_BOARD", value: 3, isUnsigned: true)
!744 = !DIEnumerator(name: "MYRB_3_CHANNEL_ASIC_DAC", value: 4, isUnsigned: true)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "controller", scope: !626, file: !164, line: 236, baseType: !746, size: 8, offset: 24)
!746 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !626, file: !164, line: 231, baseType: !165, size: 8, elements: !747)
!747 = !{!748, !749, !750, !751}
!748 = !DIEnumerator(name: "MYRB_EISA_CONTROLLER", value: 1, isUnsigned: true)
!749 = !DIEnumerator(name: "MYRB_MCA_CONTROLLER", value: 2, isUnsigned: true)
!750 = !DIEnumerator(name: "MYRB_PCI_CONTROLLER", value: 3, isUnsigned: true)
!751 = !DIEnumerator(name: "MYRB_SCSI_TO_SCSI", value: 8, isUnsigned: true)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!753 = !DIEnumerator(name: "DAC960_V1_P_PD_PU", value: 1, isUnsigned: true)
!754 = !DIEnumerator(name: "DAC960_V1_PL", value: 2, isUnsigned: true)
!755 = !DIEnumerator(name: "DAC960_V1_PG", value: 16, isUnsigned: true)
!756 = !DIEnumerator(name: "DAC960_V1_PJ", value: 17, isUnsigned: true)
!757 = !DIEnumerator(name: "DAC960_V1_PR", value: 18, isUnsigned: true)
!758 = !DIEnumerator(name: "DAC960_V1_PT", value: 19, isUnsigned: true)
!759 = !DIEnumerator(name: "DAC960_V1_PTL0", value: 20, isUnsigned: true)
!760 = !DIEnumerator(name: "DAC960_V1_PRL", value: 21, isUnsigned: true)
!761 = !DIEnumerator(name: "DAC960_V1_PTL1", value: 22, isUnsigned: true)
!762 = !DIEnumerator(name: "DAC960_V1_1164P", value: 32, isUnsigned: true)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !764, file: !164, line: 469, baseType: !165, size: 8, elements: !837)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_config2", file: !164, line: 457, size: 512, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !808, !809, !810, !815, !816, !817, !821, !822, !823, !824, !831, !832, !836}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd1", scope: !764, file: !164, line: 458, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "active_negation", scope: !764, file: !164, line: 459, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd2", scope: !764, file: !164, line: 460, baseType: !7, size: 5, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "no_rescan_on_reset_during_scan", scope: !764, file: !164, line: 461, baseType: !7, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "StorageWorks_support", scope: !764, file: !164, line: 462, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "HewlettPackard_support", scope: !764, file: !164, line: 463, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "no_disconnect_on_first_command", scope: !764, file: !164, line: 464, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd3", scope: !764, file: !164, line: 465, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "AEMI_ARM", scope: !764, file: !164, line: 466, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "AEMI_OFM", scope: !764, file: !164, line: 467, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd4", scope: !764, file: !164, line: 468, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "OEMID", scope: !764, file: !164, line: 476, baseType: !763, size: 8, offset: 16)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "oem_model_number", scope: !764, file: !164, line: 477, baseType: !165, size: 8, offset: 24)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "physical_sector", scope: !764, file: !164, line: 478, baseType: !165, size: 8, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "logical_sector", scope: !764, file: !164, line: 479, baseType: !165, size: 8, offset: 40)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "block_factor", scope: !764, file: !164, line: 480, baseType: !165, size: 8, offset: 48)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "readahead_enabled", scope: !764, file: !164, line: 481, baseType: !7, size: 1, offset: 56, flags: DIFlagBitField, extraData: i64 56)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "low_BIOS_delay", scope: !764, file: !164, line: 482, baseType: !7, size: 1, offset: 57, flags: DIFlagBitField, extraData: i64 56)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd5", scope: !764, file: !164, line: 483, baseType: !7, size: 2, offset: 58, flags: DIFlagBitField, extraData: i64 56)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_reassign_to_one_sector", scope: !764, file: !164, line: 484, baseType: !7, size: 1, offset: 60, flags: DIFlagBitField, extraData: i64 56)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd6", scope: !764, file: !164, line: 485, baseType: !7, size: 1, offset: 61, flags: DIFlagBitField, extraData: i64 56)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "FUA_during_write_recovery", scope: !764, file: !164, line: 486, baseType: !7, size: 1, offset: 62, flags: DIFlagBitField, extraData: i64 56)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "enable_LeftSymmetricRAID5Algorithm", scope: !764, file: !164, line: 487, baseType: !7, size: 1, offset: 63, flags: DIFlagBitField, extraData: i64 56)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "default_rebuild_rate", scope: !764, file: !164, line: 488, baseType: !165, size: 8, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd7", scope: !764, file: !164, line: 489, baseType: !165, size: 8, offset: 72)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_per_cacheline", scope: !764, file: !164, line: 490, baseType: !165, size: 8, offset: 80)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_per_stripe", scope: !764, file: !164, line: 491, baseType: !165, size: 8, offset: 88)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "channelparam", scope: !764, file: !164, line: 503, baseType: !794, size: 48, offset: 96)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 48, elements: !265)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !764, file: !164, line: 492, size: 8, elements: !796)
!796 = !{!797, !804, !805, !806, !807}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !795, file: !164, line: 498, baseType: !798, size: 2, flags: DIFlagBitField, extraData: i64 0)
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !795, file: !164, line: 493, baseType: !165, size: 8, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIEnumerator(name: "MYRB_SPEED_ASYNC", value: 0, isUnsigned: true)
!801 = !DIEnumerator(name: "MYRB_SPEED_SYNC_8MHz", value: 1, isUnsigned: true)
!802 = !DIEnumerator(name: "MYRB_SPEED_SYNC_5MHz", value: 2, isUnsigned: true)
!803 = !DIEnumerator(name: "MYRB_SPEED_SYNC_10_OR_20MHz", value: 3, isUnsigned: true)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "force_8bit", scope: !795, file: !164, line: 499, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "disable_fast20", scope: !795, file: !164, line: 500, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd8", scope: !795, file: !164, line: 501, baseType: !7, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tcq", scope: !795, file: !164, line: 502, baseType: !7, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "SCSIInitiatorID", scope: !764, file: !164, line: 504, baseType: !165, size: 8, offset: 144)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd9", scope: !764, file: !164, line: 505, baseType: !165, size: 8, offset: 152)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !764, file: !164, line: 509, baseType: !811, size: 8, offset: 160)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !764, file: !164, line: 506, baseType: !165, size: 8, elements: !812)
!812 = !{!813, !814}
!813 = !DIEnumerator(name: "MYRB_STARTUP_CONTROLLER_SPINUP", value: 0, isUnsigned: true)
!814 = !DIEnumerator(name: "MYRB_STARTUP_POWERON_SPINUP", value: 1, isUnsigned: true)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "simultaneous_device_spinup_count", scope: !764, file: !164, line: 510, baseType: !165, size: 8, offset: 168)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "seconds_delay_between_spinups", scope: !764, file: !164, line: 511, baseType: !165, size: 8, offset: 176)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd10", scope: !764, file: !164, line: 512, baseType: !818, size: 232, offset: 184)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 232, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 29)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "BIOS_disabled", scope: !764, file: !164, line: 513, baseType: !7, size: 1, offset: 416, flags: DIFlagBitField, extraData: i64 416)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "CDROM_boot_enabled", scope: !764, file: !164, line: 514, baseType: !7, size: 1, offset: 417, flags: DIFlagBitField, extraData: i64 416)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd11", scope: !764, file: !164, line: 515, baseType: !7, size: 3, offset: 418, flags: DIFlagBitField, extraData: i64 416)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "drive_geometry", scope: !764, file: !164, line: 521, baseType: !825, size: 2, offset: 421, flags: DIFlagBitField, extraData: i64 416)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !764, file: !164, line: 516, baseType: !165, size: 8, elements: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DIEnumerator(name: "MYRB_GEOM_128_32", value: 0, isUnsigned: true)
!828 = !DIEnumerator(name: "MYRB_GEOM_255_63", value: 1, isUnsigned: true)
!829 = !DIEnumerator(name: "MYRB_GEOM_RESERVED1", value: 2, isUnsigned: true)
!830 = !DIEnumerator(name: "MYRB_GEOM_RESERVED2", value: 3, isUnsigned: true)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd12", scope: !764, file: !164, line: 522, baseType: !7, size: 1, offset: 423, flags: DIFlagBitField, extraData: i64 416)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rsvd13", scope: !764, file: !164, line: 523, baseType: !833, size: 72, offset: 424)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !165, size: 72, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 9)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "csum", scope: !764, file: !164, line: 524, baseType: !320, size: 16, offset: 496)
!837 = !{!838, !839, !840, !841, !842, !843}
!838 = !DIEnumerator(name: "MYRB_OEMID_MYLEX", value: 0, isUnsigned: true)
!839 = !DIEnumerator(name: "MYRB_OEMID_IBM", value: 8, isUnsigned: true)
!840 = !DIEnumerator(name: "MYRB_OEMID_HP", value: 10, isUnsigned: true)
!841 = !DIEnumerator(name: "MYRB_OEMID_DEC", value: 12, isUnsigned: true)
!842 = !DIEnumerator(name: "MYRB_OEMID_SIEMENS", value: 16, isUnsigned: true)
!843 = !DIEnumerator(name: "MYRB_OEMID_INTEL", value: 18, isUnsigned: true)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !845, line: 308, baseType: !7, size: 32, elements: !846)
!845 = !DIFile(filename: "./include/linux/workqueue.h", directory: "/home/lizy2001/genbc/linux")
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!847 = !DIEnumerator(name: "WQ_UNBOUND", value: 2, isUnsigned: true)
!848 = !DIEnumerator(name: "WQ_FREEZABLE", value: 4, isUnsigned: true)
!849 = !DIEnumerator(name: "WQ_MEM_RECLAIM", value: 8, isUnsigned: true)
!850 = !DIEnumerator(name: "WQ_HIGHPRI", value: 16, isUnsigned: true)
!851 = !DIEnumerator(name: "WQ_CPU_INTENSIVE", value: 32, isUnsigned: true)
!852 = !DIEnumerator(name: "WQ_SYSFS", value: 64, isUnsigned: true)
!853 = !DIEnumerator(name: "WQ_POWER_EFFICIENT", value: 128, isUnsigned: true)
!854 = !DIEnumerator(name: "__WQ_DRAINING", value: 65536, isUnsigned: true)
!855 = !DIEnumerator(name: "__WQ_ORDERED", value: 131072, isUnsigned: true)
!856 = !DIEnumerator(name: "__WQ_LEGACY", value: 262144, isUnsigned: true)
!857 = !DIEnumerator(name: "__WQ_ORDERED_EXPLICIT", value: 524288, isUnsigned: true)
!858 = !DIEnumerator(name: "WQ_MAX_ACTIVE", value: 512, isUnsigned: true)
!859 = !DIEnumerator(name: "WQ_MAX_UNBOUND_PER_CPU", value: 4, isUnsigned: true)
!860 = !DIEnumerator(name: "WQ_DFL_ACTIVE", value: 256, isUnsigned: true)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !845, line: 30, baseType: !862, size: 64, elements: !863)
!862 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!864 = !DIEnumerator(name: "WORK_STRUCT_PENDING_BIT", value: 0)
!865 = !DIEnumerator(name: "WORK_STRUCT_DELAYED_BIT", value: 1)
!866 = !DIEnumerator(name: "WORK_STRUCT_PWQ_BIT", value: 2)
!867 = !DIEnumerator(name: "WORK_STRUCT_LINKED_BIT", value: 3)
!868 = !DIEnumerator(name: "WORK_STRUCT_COLOR_SHIFT", value: 4)
!869 = !DIEnumerator(name: "WORK_STRUCT_COLOR_BITS", value: 4)
!870 = !DIEnumerator(name: "WORK_STRUCT_PENDING", value: 1)
!871 = !DIEnumerator(name: "WORK_STRUCT_DELAYED", value: 2)
!872 = !DIEnumerator(name: "WORK_STRUCT_PWQ", value: 4)
!873 = !DIEnumerator(name: "WORK_STRUCT_LINKED", value: 8)
!874 = !DIEnumerator(name: "WORK_STRUCT_STATIC", value: 0)
!875 = !DIEnumerator(name: "WORK_NR_COLORS", value: 15)
!876 = !DIEnumerator(name: "WORK_NO_COLOR", value: 15)
!877 = !DIEnumerator(name: "WORK_CPU_UNBOUND", value: 1)
!878 = !DIEnumerator(name: "WORK_STRUCT_FLAG_BITS", value: 8)
!879 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BASE", value: 4)
!880 = !DIEnumerator(name: "__WORK_OFFQ_CANCELING", value: 4)
!881 = !DIEnumerator(name: "WORK_OFFQ_CANCELING", value: 16)
!882 = !DIEnumerator(name: "WORK_OFFQ_FLAG_BITS", value: 1)
!883 = !DIEnumerator(name: "WORK_OFFQ_POOL_SHIFT", value: 5)
!884 = !DIEnumerator(name: "WORK_OFFQ_LEFT", value: 59)
!885 = !DIEnumerator(name: "WORK_OFFQ_POOL_BITS", value: 31)
!886 = !DIEnumerator(name: "WORK_OFFQ_POOL_NONE", value: 2147483647)
!887 = !DIEnumerator(name: "WORK_STRUCT_FLAG_MASK", value: 255)
!888 = !DIEnumerator(name: "WORK_STRUCT_WQ_DATA_MASK", value: -256)
!889 = !DIEnumerator(name: "WORK_STRUCT_NO_POOL", value: 68719476704)
!890 = !DIEnumerator(name: "WORK_BUSY_PENDING", value: 1)
!891 = !DIEnumerator(name: "WORK_BUSY_RUNNING", value: 2)
!892 = !DIEnumerator(name: "WORKER_DESC_LEN", value: 24)
!893 = !{!894, !896, !898, !900, !902, !903, !7, !905, !973, !268, !6312, !270, !6313, !6314, !1684, !6315, !6316, !6317, !320, !1761, !1545, !913, !6318, !5782, !5809, !862, !6319, !5760, !1405}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !165)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !897, line: 148, baseType: !7)
!897 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !320)
!902 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "myrb_privdata", file: !164, line: 952, size: 192, elements: !907)
!907 = !{!908, !6305, !6311}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "hw_init", scope: !906, file: !164, line: 953, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "myrb_hw_init_t", file: !164, line: 946, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!913, !914, !5760, !973}
!913 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_dev", file: !916, line: 309, size: 19264, elements: !917)
!916 = !DIFile(filename: "./include/linux/pci.h", directory: "/home/lizy2001/genbc/linux")
!917 = !{!918, !924, !5561, !5562, !5563, !5564, !5575, !5576, !5577, !5578, !5579, !5580, !5581, !5582, !5583, !5584, !5585, !5586, !5587, !5588, !5589, !5590, !5592, !5657, !5658, !5659, !5661, !5662, !5663, !5664, !5665, !5666, !5667, !5668, !5669, !5670, !5671, !5672, !5673, !5674, !5675, !5676, !5677, !5678, !5679, !5680, !5683, !5684, !5685, !5686, !5687, !5688, !5689, !5690, !5694, !5695, !5696, !5697, !5698, !5699, !5700, !5701, !5702, !5703, !5704, !5705, !5706, !5707, !5708, !5709, !5710, !5711, !5712, !5713, !5714, !5715, !5716, !5717, !5718, !5719, !5720, !5721, !5722, !5723, !5724, !5725, !5726, !5727, !5728, !5729, !5730, !5731, !5733, !5734, !5736, !5737, !5738, !5739, !5741, !5742, !5743, !5746, !5753, !5754, !5755, !5756, !5757, !5758, !5759}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "bus_list", scope: !915, file: !916, line: 310, baseType: !919, size: 128)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !897, line: 178, size: 128, elements: !920)
!920 = !{!921, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !919, file: !897, line: 179, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !919, file: !897, line: 179, baseType: !922, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !915, file: !916, line: 311, baseType: !925, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_bus", file: !916, line: 605, size: 8064, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934, !955, !956, !957, !983, !986, !987, !991, !992, !993, !994, !995, !999, !1000, !1002, !5557, !5558, !5559, !5560}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !926, file: !916, line: 606, baseType: !919, size: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !926, file: !916, line: 607, baseType: !925, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !926, file: !916, line: 608, baseType: !919, size: 128, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !926, file: !916, line: 609, baseType: !919, size: 128, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !926, file: !916, line: 610, baseType: !914, size: 64, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !926, file: !916, line: 611, baseType: !919, size: 128, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "resource", scope: !926, file: !916, line: 613, baseType: !935, size: 256, offset: 640)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, elements: !243)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "resource", file: !938, line: 20, size: 512, elements: !939)
!938 = !DIFile(filename: "./include/linux/ioport.h", directory: "/home/lizy2001/genbc/linux")
!939 = !{!940, !946, !947, !950, !951, !952, !953, !954}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !937, file: !938, line: 21, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "resource_size_t", file: !897, line: 158, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "phys_addr_t", file: !897, line: 153, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !269, line: 23, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !271, line: 31, baseType: !945)
!945 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !937, file: !938, line: 22, baseType: !941, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !938, line: 23, baseType: !948, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !938, line: 24, baseType: !902, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !937, file: !938, line: 25, baseType: !902, size: 64, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !937, file: !938, line: 26, baseType: !936, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !937, file: !938, line: 26, baseType: !936, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !937, file: !938, line: 26, baseType: !936, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "resources", scope: !926, file: !916, line: 614, baseType: !919, size: 128, offset: 896)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "busn_res", scope: !926, file: !916, line: 615, baseType: !937, size: 512, offset: 1024)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !926, file: !916, line: 617, baseType: !958, size: 64, offset: 1536)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pci_ops", file: !916, line: 731, size: 320, elements: !960)
!960 = !{!961, !965, !969, !974, !979}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "add_bus", scope: !959, file: !916, line: 732, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!913, !925}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "remove_bus", scope: !959, file: !916, line: 733, baseType: !966, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !925}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "map_bus", scope: !959, file: !916, line: 734, baseType: !970, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!973, !925, !7, !913}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !959, file: !916, line: 735, baseType: !975, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!913, !925, !7, !913, !913, !978}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !959, file: !916, line: 736, baseType: !980, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!913, !925, !7, !913, !913, !268}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "msi", scope: !926, file: !916, line: 618, baseType: !984, size: 64, offset: 1600)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "msi_controller", file: !916, line: 537, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "sysdata", scope: !926, file: !916, line: 619, baseType: !973, size: 64, offset: 1664)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "procdir", scope: !926, file: !916, line: 620, baseType: !988, size: 64, offset: 1728)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "proc_dir_entry", file: !990, line: 123, flags: DIFlagFwdDecl)
!990 = !DIFile(filename: "./include/linux/interrupt.h", directory: "/home/lizy2001/genbc/linux")
!991 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !926, file: !916, line: 622, baseType: !165, size: 8, offset: 1792)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "primary", scope: !926, file: !916, line: 623, baseType: !165, size: 8, offset: 1800)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "max_bus_speed", scope: !926, file: !916, line: 624, baseType: !165, size: 8, offset: 1808)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bus_speed", scope: !926, file: !916, line: 625, baseType: !165, size: 8, offset: 1816)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !926, file: !916, line: 630, baseType: !996, size: 384, offset: 1824)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 384, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 48)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bridge_ctl", scope: !926, file: !916, line: 632, baseType: !320, size: 16, offset: 2208)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "bus_flags", scope: !926, file: !916, line: 633, baseType: !1001, size: 16, offset: 2224)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "pci_bus_flags_t", file: !916, line: 237, baseType: !320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "bridge", scope: !926, file: !916, line: 634, baseType: !1003, size: 64, offset: 2240)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !114, line: 461, size: 5568, elements: !1005)
!1005 = !{!1006, !5125, !5126, !5129, !5130, !5180, !5269, !5270, !5271, !5272, !5273, !5282, !5376, !5389, !5392, !5393, !5397, !5399, !5400, !5401, !5405, !5411, !5412, !5415, !5419, !5509, !5510, !5511, !5512, !5513, !5545, !5546, !5547, !5550, !5553, !5554, !5555, !5556}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !1004, file: !114, line: 462, baseType: !1007, size: 512)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !1008, line: 64, size: 512, elements: !1009)
!1008 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/lizy2001/genbc/linux")
!1009 = !{!1010, !1011, !1012, !1014, !1070, !4992, !5119, !5120, !5121, !5122, !5123, !5124}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1007, file: !1008, line: 65, baseType: !948, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !1007, file: !1008, line: 66, baseType: !919, size: 128, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1007, file: !1008, line: 67, baseType: !1013, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !1007, file: !1008, line: 68, baseType: !1015, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !1008, line: 192, size: 704, elements: !1017)
!1017 = !{!1018, !1019, !1035, !1036}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1016, file: !1008, line: 193, baseType: !919, size: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !1016, file: !1008, line: 194, baseType: !1020, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !1021, line: 83, baseType: !1022)
!1021 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/lizy2001/genbc/linux")
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !1021, line: 71, elements: !1023)
!1023 = !{!1024}
!1024 = !DIDerivedType(tag: DW_TAG_member, scope: !1022, file: !1021, line: 72, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1022, file: !1021, line: 72, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !1025, file: !1021, line: 73, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !1021, line: 20, elements: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !1028, file: !1021, line: 21, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !1032, line: 25, baseType: !1033)
!1032 = !DIFile(filename: "./include/linux/spinlock_types_up.h", directory: "/home/lizy2001/genbc/linux")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1032, line: 25, elements: !1034)
!1034 = !{}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !1016, file: !1008, line: 195, baseType: !1007, size: 512, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !1016, file: !1008, line: 196, baseType: !1037, size: 64, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !1008, line: 156, size: 192, elements: !1040)
!1040 = !{!1041, !1046, !1051}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1039, file: !1008, line: 157, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!913, !1015, !1013}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1039, file: !1008, line: 158, baseType: !1047, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!948, !1015, !1013}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !1039, file: !1008, line: 159, baseType: !1052, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!913, !1015, !1013, !1056}
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !1008, line: 148, size: 20736, elements: !1058)
!1058 = !{!1059, !1062, !1064, !1065, !1069}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !1057, file: !1008, line: 149, baseType: !1060, size: 192)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 192, elements: !308)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !1057, file: !1008, line: 150, baseType: !1063, size: 4096, offset: 192)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 4096, elements: !404)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !1057, file: !1008, line: 151, baseType: !913, size: 32, offset: 4288)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1057, file: !1008, line: 152, baseType: !1066, size: 16384, offset: 4320)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 16384, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 2048)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !1057, file: !1008, line: 153, baseType: !913, size: 32, offset: 20704)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !1007, file: !1008, line: 69, baseType: !1071, size: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !1008, line: 138, size: 448, elements: !1073)
!1073 = !{!1074, !1078, !1105, !1107, !4954, !4982, !4986}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !1072, file: !1008, line: 139, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !1013}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !1072, file: !1008, line: 140, baseType: !1079, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !1082, line: 230, size: 128, elements: !1083)
!1082 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/lizy2001/genbc/linux")
!1083 = !{!1084, !1098}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !1081, file: !1082, line: 231, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!1088, !1013, !1092, !1061}
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !897, line: 60, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !1090, line: 73, baseType: !1091)
!1090 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !1090, line: 15, baseType: !862)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !1082, line: 30, size: 128, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !1082, line: 31, baseType: !948, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1093, file: !1082, line: 32, baseType: !1097, size: 16, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !897, line: 19, baseType: !320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !1081, file: !1082, line: 232, baseType: !1099, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!1088, !1013, !1092, !948, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !897, line: 55, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !1090, line: 72, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !1090, line: 16, baseType: !902)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !1072, file: !1008, line: 141, baseType: !1106, size: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "default_groups", scope: !1072, file: !1008, line: 142, baseType: !1108, size: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute_group", file: !1082, line: 84, size: 320, elements: !1112)
!1112 = !{!1113, !1114, !1118, !4951, !4952}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1111, file: !1082, line: 85, baseType: !948, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "is_visible", scope: !1111, file: !1082, line: 86, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!1097, !1013, !1092, !913}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "is_bin_visible", scope: !1111, file: !1082, line: 88, baseType: !1119, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!1097, !1013, !1122, !913}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bin_attribute", file: !1082, line: 168, size: 448, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !4946, !4947}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !1123, file: !1082, line: 169, baseType: !1093, size: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1123, file: !1082, line: 170, baseType: !1102, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "private", scope: !1123, file: !1082, line: 171, baseType: !973, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !1123, file: !1082, line: 172, baseType: !1129, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1088, !1132, !1013, !1122, !1061, !1303, !1102}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !85, line: 916, size: 1856, align: 32, elements: !1134)
!1134 = !{!1135, !1153, !4911, !4912, !4913, !4914, !4915, !4916, !4917, !4918, !4919, !4920, !4929, !4930, !4939, !4940, !4941, !4942, !4943, !4944, !4945}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !1133, file: !85, line: 920, baseType: !1136, size: 128)
!1136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1133, file: !85, line: 917, size: 128, elements: !1137)
!1137 = !{!1138, !1144}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !1136, file: !85, line: 918, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !1140, line: 58, size: 64, elements: !1141)
!1140 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/lizy2001/genbc/linux")
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1139, file: !1140, line: 59, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !1136, file: !85, line: 919, baseType: !1145, size: 128, align: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !897, line: 216, size: 128, align: 64, elements: !1146)
!1146 = !{!1147, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1145, file: !897, line: 217, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1145, file: !897, line: 218, baseType: !1150, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1148}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !1133, file: !85, line: 921, baseType: !1154, size: 128, offset: 128)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !1155, line: 8, size: 128, elements: !1156)
