; ModuleID = '../bcout/drivers/net/ethernet/mellanox/mlxfw/mlxfw_mfa2_tlv_multi.llvm.bc'
source_filename = "drivers/net/ethernet/mellanox/mlxfw/mlxfw_mfa2_tlv_multi.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.mlxfw_mfa2_tlv = type { i8, i8, i16, [0 x i8] }
%struct.mlxfw_mfa2_file = type { %struct.firmware*, %struct.mlxfw_mfa2_tlv*, i16, %struct.mlxfw_mfa2_tlv*, i16, i8*, i32 }
%struct.firmware = type { i64, i8*, i8* }
%struct.mlxfw_mfa2_tlv_multi = type { i16, i16 }

@.str = private unnamed_addr constant [27 x i8] c"\013MFA2: TLV parsing error\0A\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local %struct.mlxfw_mfa2_tlv* @mlxfw_mfa2_tlv_multi_child(%struct.mlxfw_mfa2_file* %mfa2_file, %struct.mlxfw_mfa2_tlv_multi* %multi) #0 !dbg !29 {
entry:
  %mfa2_file.addr = alloca %struct.mlxfw_mfa2_file*, align 8
  %multi.addr = alloca %struct.mlxfw_mfa2_tlv_multi*, align 8
  %multi_len = alloca i64, align 8
  store %struct.mlxfw_mfa2_file* %mfa2_file, %struct.mlxfw_mfa2_file** %mfa2_file.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.mlxfw_mfa2_file** %mfa2_file.addr, metadata !88, metadata !DIExpression()), !dbg !89
  store %struct.mlxfw_mfa2_tlv_multi* %multi, %struct.mlxfw_mfa2_tlv_multi** %multi.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.mlxfw_mfa2_tlv_multi** %multi.addr, metadata !90, metadata !DIExpression()), !dbg !91

!0 = distinct !DICompileUnit(language: DW_LANG_C89, file: !1, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !17, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxfw/mlxfw_mfa2_tlv_multi.c", directory: "/home/lizy2001/genbc/linux")
!2 = !{!3, !12}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mlxfw_mfa2_tlv_type", file: !4, line: 10, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxfw/mlxfw_mfa2_format.h", directory: "/home/lizy2001/genbc/linux")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "MLXFW_MFA2_TLV_MULTI_PART", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "MLXFW_MFA2_TLV_PACKAGE_DESCRIPTOR", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "MLXFW_MFA2_TLV_COMPONENT_DESCRIPTOR", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "MLXFW_MFA2_TLV_COMPONENT_PTR", value: 34, isUnsigned: true)
!11 = !DIEnumerator(name: "MLXFW_MFA2_TLV_PSID", value: 42, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 10, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "./include/linux/stddef.h", directory: "/home/lizy2001/genbc/linux")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "false", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "true", value: 1, isUnsigned: true)
!17 = !{!18, !19, !22}
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !20, line: 24, baseType: !21)
!20 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!21 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !23, line: 30, baseType: !19)
!23 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!24 = !{i32 7, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 2}
!27 = !{i32 1, !"Code Model", i32 2}
!28 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!29 = distinct !DISubprogram(name: "mlxfw_mfa2_tlv_multi_child", scope: !1, file: !1, line: 13, type: !30, scopeLine: 15, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !48, !81}
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxfw_mfa2_tlv", file: !35, line: 10, size: 32, elements: !36)
!35 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxfw/mlxfw_mfa2_tlv.h", directory: "/home/lizy2001/genbc/linux")
!36 = !{!37, !42, !43, !44}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !34, file: !35, line: 11, baseType: !38, size: 8)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !39, line: 17, baseType: !40)
!39 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !41)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !34, file: !35, line: 12, baseType: !38, size: 8, offset: 8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !35, line: 13, baseType: !22, size: 16, offset: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !35, line: 14, baseType: !45, offset: 32)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: -1)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxfw_mfa2_file", file: !51, line: 10, size: 448, elements: !52)
!51 = !DIFile(filename: "drivers/net/ethernet/mellanox/mlxfw/mlxfw_mfa2_file.h", directory: "/home/lizy2001/genbc/linux")
!52 = !{!53, !70, !71, !73, !74, !75, !78}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "fw", scope: !50, file: !51, line: 11, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "firmware", file: !57, line: 12, size: 192, elements: !58)
!57 = !DIFile(filename: "./include/linux/firmware.h", directory: "/home/lizy2001/genbc/linux")
!58 = !{!59, !66, !69}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !56, file: !57, line: 13, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 55, baseType: !62)
!61 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !63, line: 72, baseType: !64)
!63 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/lizy2001/genbc/linux")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !63, line: 16, baseType: !65)
!65 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !56, file: !57, line: 14, baseType: !67, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !56, file: !57, line: 17, baseType: !18, size: 64, offset: 128)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "first_dev", scope: !50, file: !51, line: 12, baseType: !32, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "dev_count", scope: !50, file: !51, line: 13, baseType: !72, size: 16, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !39, line: 19, baseType: !19)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "first_component", scope: !50, file: !51, line: 14, baseType: !32, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "component_count", scope: !50, file: !51, line: 15, baseType: !72, size: 16, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !50, file: !51, line: 16, baseType: !76, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "cb_archive_size", scope: !50, file: !51, line: 17, baseType: !79, size: 32, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !39, line: 21, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !5)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mlxfw_mfa2_tlv_multi", file: !4, line: 38, size: 32, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "num_extensions", scope: !83, file: !4, line: 39, baseType: !22, size: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "total_len", scope: !83, file: !4, line: 40, baseType: !22, size: 16, offset: 16)
!87 = !{}
!88 = !DILocalVariable(name: "mfa2_file", arg: 1, scope: !29, file: !1, line: 13, type: !48)
!89 = !DILocation(line: 13, column: 58, scope: !29)
!90 = !DILocalVariable(name: "multi", arg: 2, scope: !29, file: !1, line: 14, type: !81)
!91 = !DILocation(line: 14, column: 42, scope: !29)
!92 = !DILocalVariable(name: "multi_len", scope: !29, file: !1, line: 16, type: !60)
!93 = !DILocation(line: 16, column: 9, scope: !29)
!94 = !DILocation(line: 18, column: 12, scope: !29)
!95 = !DILocation(line: 19, column: 28, scope: !29)
!96 = !DILocation(line: 19, column: 48, scope: !29)
!97 = !DILocation(line: 19, column: 39, scope: !29)
!98 = !DILocation(line: 19, column: 56, scope: !29)
!99 = !DILocation(line: 19, column: 54, scope: !29)
!100 = !DILocation(line: 19, column: 9, scope: !29)
!101 = !DILocation(line: 19, column: 2, scope: !29)
!102 = distinct !DISubprogram(name: "mlxfw_mfa2_tlv_get", scope: !35, file: !35, line: 18, type: !103, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !87)
!103 = !DISubroutineType(types: !104)
!104 = !{!32, !48, !76}
!105 = !DILocalVariable(name: "mfa2_file", arg: 1, scope: !102, file: !35, line: 18, type: !48)
!106 = !DILocation(line: 18, column: 50, scope: !102)
!107 = !DILocalVariable(name: "ptr", arg: 2, scope: !102, file: !35, line: 18, type: !76)
!108 = !DILocation(line: 18, column: 73, scope: !102)
!109 = !DILocation(line: 20, column: 28, scope: !110)
!110 = distinct !DILexicalBlock(scope: !102, file: !35, line: 20, column: 6)
!111 = !DILocation(line: 20, column: 39, scope: !110)
!112 = !DILocation(line: 20, column: 7, scope: !110)
!113 = !DILocation(line: 20, column: 44, scope: !110)
!114 = !DILocation(line: 21, column: 28, scope: !110)
!115 = !DILocation(line: 21, column: 39, scope: !110)
!116 = !DILocation(line: 21, column: 43, scope: !110)
!117 = !DILocation(line: 21, column: 7, scope: !110)
!118 = !DILocation(line: 20, column: 6, scope: !102)
!119 = !DILocation(line: 22, column: 3, scope: !110)
!120 = !DILocation(line: 23, column: 9, scope: !102)
!121 = !DILocation(line: 23, column: 2, scope: !102)
!122 = !DILocation(line: 24, column: 1, scope: !102)
!123 = distinct !DISubprogram(name: "mlxfw_mfa2_tlv_next", scope: !1, file: !1, line: 23, type: !124, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!124 = !DISubroutineType(types: !125)
!125 = !{!32, !48, !32}
!126 = !DILocalVariable(name: "mfa2_file", arg: 1, scope: !123, file: !1, line: 23, type: !48)
!127 = !DILocation(line: 23, column: 51, scope: !123)
!128 = !DILocalVariable(name: "tlv", arg: 2, scope: !123, file: !1, line: 24, type: !32)
!129 = !DILocation(line: 24, column: 36, scope: !123)
!130 = !DILocalVariable(name: "multi", scope: !123, file: !1, line: 26, type: !81)
!131 = !DILocation(line: 26, column: 37, scope: !123)
!132 = !DILocalVariable(name: "tlv_len", scope: !123, file: !1, line: 27, type: !72)
!133 = !DILocation(line: 27, column: 6, scope: !123)
!134 = !DILocalVariable(name: "next", scope: !123, file: !1, line: 28, type: !18)
!135 = !DILocation(line: 28, column: 8, scope: !123)
!136 = !DILocation(line: 30, column: 12, scope: !123)
!137 = !DILocation(line: 30, column: 10, scope: !123)
!138 = !DILocation(line: 32, column: 6, scope: !139)
!139 = distinct !DILexicalBlock(scope: !123, file: !1, line: 32, column: 6)
!140 = !DILocation(line: 32, column: 11, scope: !139)
!141 = !DILocation(line: 32, column: 16, scope: !139)
!142 = !DILocation(line: 32, column: 6, scope: !123)
!143 = !DILocation(line: 33, column: 36, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !1, line: 32, column: 46)
!145 = !DILocation(line: 33, column: 47, scope: !144)
!146 = !DILocation(line: 33, column: 11, scope: !144)
!147 = !DILocation(line: 33, column: 9, scope: !144)
