; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/dwmac1000_dma.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/dwmac1000_dma.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_dma_ops = type { i32 (i8*)*, void (i8*, %struct.stmmac_dma_cfg*, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i64, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i64, i32)*, void (i8*, %struct.stmmac_axi*)*, void (i8*, i32*)*, void (i8*, i32, i32, i32, i8)*, void (i8*, i32, i32, i32, i8)*, void (i8*, %struct.stmmac_extra_stats*, i8*)*, void (i8*)*, void (i8*, i32, i1, i1)*, void (i8*, i32, i1, i1)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i32)*, i32 (i8*, %struct.stmmac_extra_stats*, i32)*, void (i8*, %struct.dma_features*)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i1, i32)*, void (i8*, i32, i8)*, void (i8*, i32, i32)*, void (i8*, i1, i32)*, i32 (i8*, i1, i32)* }
%struct.stmmac_dma_cfg = type { i32, i32, i32, i8, i32, i32, i8, i8 }
%struct.stmmac_axi = type { i8, i8, i32, i32, i8, [7 x i32], i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dwmac1000_dma_ops", scope: !2, file: !3, line: 263, type: !32, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !31, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/dwmac1000_dma.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rtc_control", file: !6, line: 315, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/dwmac1000.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "DMA_CONTROL_RTC_64", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "DMA_CONTROL_RTC_32", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "DMA_CONTROL_RTC_96", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "DMA_CONTROL_RTC_128", value: 24, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ttc_control", file: !6, line: 249, baseType: !7, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22}
!15 = !DIEnumerator(name: "DMA_CONTROL_TTC_64", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "DMA_CONTROL_TTC_128", value: 16384, isUnsigned: true)
!17 = !DIEnumerator(name: "DMA_CONTROL_TTC_192", value: 32768, isUnsigned: true)
!18 = !DIEnumerator(name: "DMA_CONTROL_TTC_256", value: 49152, isUnsigned: true)
!19 = !DIEnumerator(name: "DMA_CONTROL_TTC_40", value: 65536, isUnsigned: true)
!20 = !DIEnumerator(name: "DMA_CONTROL_TTC_32", value: 81920, isUnsigned: true)
!21 = !DIEnumerator(name: "DMA_CONTROL_TTC_24", value: 98304, isUnsigned: true)
!22 = !DIEnumerator(name: "DMA_CONTROL_TTC_16", value: 114688, isUnsigned: true)
!23 = !{!24, !26, !30}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !27, line: 21, baseType: !28)
!27 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !29, line: 27, baseType: !7)
!29 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!30 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!31 = !{!0}
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_dma_ops", file: !34, line: 169, size: 1856, elements: !35)
!34 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!35 = !{!36, !41, !60, !64, !72, !73, !92, !97, !104, !105, !227, !231, !235, !236, !240, !241, !242, !243, !247, !300, !304, !305, !306, !307, !308, !312, !316, !320, !321}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !33, file: !34, line: 171, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!30, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !33, file: !34, line: 172, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !40, !45, !30}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_dma_cfg", file: !47, line: 89, size: 224, elements: !48)
!47 = !DIFile(filename: "./include/linux/stmmac.h", directory: "/home/lizy2001/genbc/linux")
!48 = !{!49, !50, !51, !52, !56, !57, !58, !59}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "pbl", scope: !46, file: !47, line: 90, baseType: !30, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "txpbl", scope: !46, file: !47, line: 91, baseType: !30, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rxpbl", scope: !46, file: !47, line: 92, baseType: !30, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "pblx8", scope: !46, file: !47, line: 93, baseType: !53, size: 8, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !54, line: 30, baseType: !55)
!54 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!55 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_burst", scope: !46, file: !47, line: 94, baseType: !30, size: 32, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mixed_burst", scope: !46, file: !47, line: 95, baseType: !30, size: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "aal", scope: !46, file: !47, line: 96, baseType: !53, size: 8, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "eame", scope: !46, file: !47, line: 97, baseType: !53, size: 8, offset: 200)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "init_chan", scope: !33, file: !34, line: 174, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !40, !45, !26}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "init_rx_chan", scope: !33, file: !34, line: 176, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !40, !45, !68, !26}
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !54, line: 143, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !27, line: 23, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !29, line: 31, baseType: !71)
!71 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "init_tx_chan", scope: !33, file: !34, line: 179, baseType: !65, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "axi", scope: !33, file: !34, line: 183, baseType: !74, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !40, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_axi", file: !47, line: 101, size: 384, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !89, !90, !91}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "axi_lpi_en", scope: !78, file: !47, line: 102, baseType: !53, size: 8)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "axi_xit_frm", scope: !78, file: !47, line: 103, baseType: !53, size: 8, offset: 8)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "axi_wr_osr_lmt", scope: !78, file: !47, line: 104, baseType: !26, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "axi_rd_osr_lmt", scope: !78, file: !47, line: 105, baseType: !26, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "axi_kbbe", scope: !78, file: !47, line: 106, baseType: !53, size: 8, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "axi_blen", scope: !78, file: !47, line: 107, baseType: !86, size: 224, offset: 128)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 224, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 7)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "axi_fb", scope: !78, file: !47, line: 108, baseType: !53, size: 8, offset: 352)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "axi_mb", scope: !78, file: !47, line: 109, baseType: !53, size: 8, offset: 360)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "axi_rb", scope: !78, file: !47, line: 110, baseType: !53, size: 8, offset: 368)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dump_regs", scope: !33, file: !34, line: 185, baseType: !93, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !40, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dma_rx_mode", scope: !33, file: !34, line: 186, baseType: !98, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !40, !30, !26, !30, !101}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !27, line: 17, baseType: !102)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !29, line: 21, baseType: !103)
!103 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "dma_tx_mode", scope: !33, file: !34, line: 188, baseType: !98, size: 64, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "dma_diagnostic_fr", scope: !33, file: !34, line: 191, baseType: !106, size: 64, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !40, !109, !40}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !111, line: 61, size: 7680, elements: !112)
!111 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/common.h", directory: "/home/lizy2001/genbc/linux")
!112 = !{!113, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !110, file: !111, line: 63, baseType: !114, size: 64, align: 512)
!114 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !110, file: !111, line: 64, baseType: !114, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !110, file: !111, line: 65, baseType: !114, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !110, file: !111, line: 66, baseType: !114, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !110, file: !111, line: 67, baseType: !114, size: 64, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !110, file: !111, line: 68, baseType: !114, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !110, file: !111, line: 69, baseType: !114, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !110, file: !111, line: 70, baseType: !114, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !110, file: !111, line: 71, baseType: !114, size: 64, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !110, file: !111, line: 72, baseType: !114, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !110, file: !111, line: 74, baseType: !114, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !110, file: !111, line: 75, baseType: !114, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !110, file: !111, line: 76, baseType: !114, size: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !110, file: !111, line: 77, baseType: !114, size: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !110, file: !111, line: 78, baseType: !114, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !110, file: !111, line: 79, baseType: !114, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !110, file: !111, line: 80, baseType: !114, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !110, file: !111, line: 81, baseType: !114, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !110, file: !111, line: 82, baseType: !114, size: 64, offset: 1152)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !110, file: !111, line: 83, baseType: !114, size: 64, offset: 1216)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !110, file: !111, line: 84, baseType: !114, size: 64, offset: 1280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !110, file: !111, line: 85, baseType: !114, size: 64, offset: 1344)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !110, file: !111, line: 86, baseType: !114, size: 64, offset: 1408)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !110, file: !111, line: 87, baseType: !114, size: 64, offset: 1472)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !110, file: !111, line: 88, baseType: !114, size: 64, offset: 1536)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !110, file: !111, line: 89, baseType: !114, size: 64, offset: 1600)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !110, file: !111, line: 90, baseType: !114, size: 64, offset: 1664)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !110, file: !111, line: 91, baseType: !114, size: 64, offset: 1728)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !110, file: !111, line: 93, baseType: !114, size: 64, offset: 1792)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !110, file: !111, line: 94, baseType: !114, size: 64, offset: 1856)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !110, file: !111, line: 95, baseType: !114, size: 64, offset: 1920)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !110, file: !111, line: 96, baseType: !114, size: 64, offset: 1984)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !110, file: !111, line: 97, baseType: !114, size: 64, offset: 2048)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !110, file: !111, line: 98, baseType: !114, size: 64, offset: 2112)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !110, file: !111, line: 99, baseType: !114, size: 64, offset: 2176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !110, file: !111, line: 100, baseType: !114, size: 64, offset: 2240)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !110, file: !111, line: 101, baseType: !114, size: 64, offset: 2304)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !110, file: !111, line: 103, baseType: !114, size: 64, offset: 2368)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !110, file: !111, line: 104, baseType: !114, size: 64, offset: 2432)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !110, file: !111, line: 105, baseType: !114, size: 64, offset: 2496)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !110, file: !111, line: 106, baseType: !114, size: 64, offset: 2560)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !110, file: !111, line: 107, baseType: !114, size: 64, offset: 2624)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !110, file: !111, line: 108, baseType: !114, size: 64, offset: 2688)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !110, file: !111, line: 109, baseType: !114, size: 64, offset: 2752)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !110, file: !111, line: 110, baseType: !114, size: 64, offset: 2816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !110, file: !111, line: 111, baseType: !114, size: 64, offset: 2880)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !110, file: !111, line: 112, baseType: !114, size: 64, offset: 2944)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !110, file: !111, line: 113, baseType: !114, size: 64, offset: 3008)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !110, file: !111, line: 115, baseType: !114, size: 64, offset: 3072)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !110, file: !111, line: 116, baseType: !114, size: 64, offset: 3136)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !110, file: !111, line: 117, baseType: !114, size: 64, offset: 3200)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !110, file: !111, line: 119, baseType: !114, size: 64, offset: 3264)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !110, file: !111, line: 120, baseType: !114, size: 64, offset: 3328)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !110, file: !111, line: 121, baseType: !114, size: 64, offset: 3392)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !110, file: !111, line: 122, baseType: !114, size: 64, offset: 3456)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !110, file: !111, line: 123, baseType: !114, size: 64, offset: 3520)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !110, file: !111, line: 125, baseType: !114, size: 64, offset: 3584)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !110, file: !111, line: 126, baseType: !114, size: 64, offset: 3648)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !110, file: !111, line: 127, baseType: !114, size: 64, offset: 3712)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !110, file: !111, line: 128, baseType: !114, size: 64, offset: 3776)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !110, file: !111, line: 129, baseType: !114, size: 64, offset: 3840)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !110, file: !111, line: 130, baseType: !114, size: 64, offset: 3904)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !110, file: !111, line: 131, baseType: !114, size: 64, offset: 3968)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !110, file: !111, line: 132, baseType: !114, size: 64, offset: 4032)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !110, file: !111, line: 133, baseType: !114, size: 64, offset: 4096)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !110, file: !111, line: 134, baseType: !114, size: 64, offset: 4160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !110, file: !111, line: 135, baseType: !114, size: 64, offset: 4224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !110, file: !111, line: 136, baseType: !114, size: 64, offset: 4288)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !110, file: !111, line: 137, baseType: !114, size: 64, offset: 4352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !110, file: !111, line: 138, baseType: !114, size: 64, offset: 4416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !110, file: !111, line: 139, baseType: !114, size: 64, offset: 4480)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !110, file: !111, line: 140, baseType: !114, size: 64, offset: 4544)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !110, file: !111, line: 141, baseType: !114, size: 64, offset: 4608)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !110, file: !111, line: 142, baseType: !114, size: 64, offset: 4672)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !110, file: !111, line: 143, baseType: !114, size: 64, offset: 4736)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !110, file: !111, line: 144, baseType: !114, size: 64, offset: 4800)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !110, file: !111, line: 145, baseType: !114, size: 64, offset: 4864)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !110, file: !111, line: 146, baseType: !114, size: 64, offset: 4928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !110, file: !111, line: 147, baseType: !114, size: 64, offset: 4992)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !110, file: !111, line: 148, baseType: !114, size: 64, offset: 5056)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !110, file: !111, line: 149, baseType: !114, size: 64, offset: 5120)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !110, file: !111, line: 151, baseType: !114, size: 64, offset: 5184)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !110, file: !111, line: 152, baseType: !114, size: 64, offset: 5248)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !110, file: !111, line: 153, baseType: !114, size: 64, offset: 5312)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !110, file: !111, line: 154, baseType: !114, size: 64, offset: 5376)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !110, file: !111, line: 155, baseType: !114, size: 64, offset: 5440)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !110, file: !111, line: 156, baseType: !114, size: 64, offset: 5504)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !110, file: !111, line: 158, baseType: !114, size: 64, offset: 5568)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !110, file: !111, line: 159, baseType: !114, size: 64, offset: 5632)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !110, file: !111, line: 160, baseType: !114, size: 64, offset: 5696)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !110, file: !111, line: 161, baseType: !114, size: 64, offset: 5760)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !110, file: !111, line: 162, baseType: !114, size: 64, offset: 5824)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !110, file: !111, line: 163, baseType: !114, size: 64, offset: 5888)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !110, file: !111, line: 164, baseType: !114, size: 64, offset: 5952)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !110, file: !111, line: 165, baseType: !114, size: 64, offset: 6016)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !110, file: !111, line: 166, baseType: !114, size: 64, offset: 6080)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !110, file: !111, line: 167, baseType: !114, size: 64, offset: 6144)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !110, file: !111, line: 168, baseType: !114, size: 64, offset: 6208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !110, file: !111, line: 169, baseType: !114, size: 64, offset: 6272)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !110, file: !111, line: 170, baseType: !114, size: 64, offset: 6336)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !110, file: !111, line: 171, baseType: !114, size: 64, offset: 6400)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !110, file: !111, line: 172, baseType: !114, size: 64, offset: 6464)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !110, file: !111, line: 173, baseType: !114, size: 64, offset: 6528)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !110, file: !111, line: 174, baseType: !114, size: 64, offset: 6592)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !110, file: !111, line: 175, baseType: !114, size: 64, offset: 6656)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !110, file: !111, line: 176, baseType: !114, size: 64, offset: 6720)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !110, file: !111, line: 177, baseType: !114, size: 64, offset: 6784)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !110, file: !111, line: 178, baseType: !114, size: 64, offset: 6848)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !110, file: !111, line: 179, baseType: !114, size: 64, offset: 6912)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !110, file: !111, line: 180, baseType: !114, size: 64, offset: 6976)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !110, file: !111, line: 181, baseType: !114, size: 64, offset: 7040)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !110, file: !111, line: 183, baseType: !114, size: 64, offset: 7104)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !110, file: !111, line: 184, baseType: !114, size: 64, offset: 7168)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dma_transmission", scope: !33, file: !34, line: 193, baseType: !228, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !40}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dma_irq", scope: !33, file: !34, line: 194, baseType: !232, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !40, !26, !53, !53}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dma_irq", scope: !33, file: !34, line: 196, baseType: !232, size: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "start_tx", scope: !33, file: !34, line: 198, baseType: !237, size: 64, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !40, !26}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "stop_tx", scope: !33, file: !34, line: 199, baseType: !237, size: 64, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "start_rx", scope: !33, file: !34, line: 200, baseType: !237, size: 64, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "stop_rx", scope: !33, file: !34, line: 201, baseType: !237, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "dma_interrupt", scope: !33, file: !34, line: 202, baseType: !244, size: 64, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{!30, !40, !109, !26}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "get_hw_feature", scope: !33, file: !34, line: 205, baseType: !248, size: 64, offset: 1152)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !40, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_features", file: !111, line: 326, size: 1472, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mbps_10_100", scope: !252, file: !111, line: 327, baseType: !7, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "mbps_1000", scope: !252, file: !111, line: 328, baseType: !7, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "half_duplex", scope: !252, file: !111, line: 329, baseType: !7, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hash_filter", scope: !252, file: !111, line: 330, baseType: !7, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "multi_addr", scope: !252, file: !111, line: 331, baseType: !7, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", scope: !252, file: !111, line: 332, baseType: !7, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "sma_mdio", scope: !252, file: !111, line: 333, baseType: !7, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pmt_remote_wake_up", scope: !252, file: !111, line: 334, baseType: !7, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pmt_magic_frame", scope: !252, file: !111, line: 335, baseType: !7, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rmon", scope: !252, file: !111, line: 336, baseType: !7, size: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "time_stamp", scope: !252, file: !111, line: 338, baseType: !7, size: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "atime_stamp", scope: !252, file: !111, line: 340, baseType: !7, size: 32, offset: 352)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "eee", scope: !252, file: !111, line: 342, baseType: !7, size: 32, offset: 384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "av", scope: !252, file: !111, line: 343, baseType: !7, size: 32, offset: 416)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "hash_tb_sz", scope: !252, file: !111, line: 344, baseType: !7, size: 32, offset: 448)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tsoen", scope: !252, file: !111, line: 345, baseType: !7, size: 32, offset: 480)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coe", scope: !252, file: !111, line: 347, baseType: !7, size: 32, offset: 512)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe", scope: !252, file: !111, line: 348, baseType: !7, size: 32, offset: 544)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe_type1", scope: !252, file: !111, line: 349, baseType: !7, size: 32, offset: 576)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe_type2", scope: !252, file: !111, line: 350, baseType: !7, size: 32, offset: 608)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "rxfifo_over_2048", scope: !252, file: !111, line: 351, baseType: !7, size: 32, offset: 640)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "number_rx_channel", scope: !252, file: !111, line: 353, baseType: !7, size: 32, offset: 672)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "number_tx_channel", scope: !252, file: !111, line: 354, baseType: !7, size: 32, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "number_rx_queues", scope: !252, file: !111, line: 356, baseType: !7, size: 32, offset: 736)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "number_tx_queues", scope: !252, file: !111, line: 357, baseType: !7, size: 32, offset: 768)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pps_out_num", scope: !252, file: !111, line: 359, baseType: !7, size: 32, offset: 800)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "enh_desc", scope: !252, file: !111, line: 361, baseType: !7, size: 32, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !252, file: !111, line: 363, baseType: !7, size: 32, offset: 864)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !252, file: !111, line: 364, baseType: !7, size: 32, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "asp", scope: !252, file: !111, line: 366, baseType: !7, size: 32, offset: 928)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "frpsel", scope: !252, file: !111, line: 368, baseType: !7, size: 32, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "frpbs", scope: !252, file: !111, line: 369, baseType: !7, size: 32, offset: 992)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "frpes", scope: !252, file: !111, line: 370, baseType: !7, size: 32, offset: 1024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "addr64", scope: !252, file: !111, line: 371, baseType: !7, size: 32, offset: 1056)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rssen", scope: !252, file: !111, line: 372, baseType: !7, size: 32, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vlhash", scope: !252, file: !111, line: 373, baseType: !7, size: 32, offset: 1120)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sphen", scope: !252, file: !111, line: 374, baseType: !7, size: 32, offset: 1152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "vlins", scope: !252, file: !111, line: 375, baseType: !7, size: 32, offset: 1184)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dvlan", scope: !252, file: !111, line: 376, baseType: !7, size: 32, offset: 1216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "l3l4fnum", scope: !252, file: !111, line: 377, baseType: !7, size: 32, offset: 1248)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arpoffsel", scope: !252, file: !111, line: 378, baseType: !7, size: 32, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "estwid", scope: !252, file: !111, line: 380, baseType: !7, size: 32, offset: 1312)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "estdep", scope: !252, file: !111, line: 381, baseType: !7, size: 32, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "estsel", scope: !252, file: !111, line: 382, baseType: !7, size: 32, offset: 1376)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fpesel", scope: !252, file: !111, line: 383, baseType: !7, size: 32, offset: 1408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbssel", scope: !252, file: !111, line: 384, baseType: !7, size: 32, offset: 1440)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !33, file: !34, line: 208, baseType: !301, size: 64, offset: 1216)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !40, !26, !26}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_ring_len", scope: !33, file: !34, line: 209, baseType: !301, size: 64, offset: 1280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_ring_len", scope: !33, file: !34, line: 210, baseType: !301, size: 64, offset: 1344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_tail_ptr", scope: !33, file: !34, line: 211, baseType: !301, size: 64, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_tail_ptr", scope: !33, file: !34, line: 212, baseType: !301, size: 64, offset: 1472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tso", scope: !33, file: !34, line: 213, baseType: !309, size: 64, offset: 1536)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !40, !53, !26}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "qmode", scope: !33, file: !34, line: 214, baseType: !313, size: 64, offset: 1600)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !40, !26, !101}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "set_bfsize", scope: !33, file: !34, line: 215, baseType: !317, size: 64, offset: 1664)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !40, !30, !26}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "enable_sph", scope: !33, file: !34, line: 216, baseType: !309, size: 64, offset: 1728)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tbs", scope: !33, file: !34, line: 217, baseType: !322, size: 64, offset: 1792)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!30, !40, !53, !26}
!325 = !{i32 7, !"Dwarf Version", i32 4}
!326 = !{i32 2, !"Debug Info Version", i32 3}
!327 = !{i32 1, !"wchar_size", i32 2}
!328 = !{i32 1, !"Code Model", i32 2}
!329 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!330 = distinct !DISubprogram(name: "dwmac1000_dma_init", scope: !3, file: !3, line: 73, type: !43, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !331)
!331 = !{}
!332 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !330, file: !3, line: 73, type: !40)
!333 = !DILocation(line: 73, column: 46, scope: !330)
!334 = !DILocalVariable(name: "dma_cfg", arg: 2, scope: !330, file: !3, line: 74, type: !45)
!335 = !DILocation(line: 74, column: 34, scope: !330)
!336 = !DILocalVariable(name: "atds", arg: 3, scope: !330, file: !3, line: 74, type: !30)
!337 = !DILocation(line: 74, column: 47, scope: !330)
!338 = !DILocalVariable(name: "value", scope: !330, file: !3, line: 76, type: !26)
!339 = !DILocation(line: 76, column: 6, scope: !330)
!340 = !DILocation(line: 76, column: 20, scope: !330)
!341 = !DILocation(line: 76, column: 27, scope: !330)
!342 = !DILocation(line: 76, column: 14, scope: !330)
!343 = !DILocalVariable(name: "txpbl", scope: !330, file: !3, line: 77, type: !30)
!344 = !DILocation(line: 77, column: 6, scope: !330)
!345 = !DILocation(line: 77, column: 14, scope: !330)
!346 = !DILocation(line: 77, column: 23, scope: !330)
!347 = !DILocation(line: 77, column: 32, scope: !330)
!348 = !DILocation(line: 77, column: 41, scope: !330)
!349 = !DILocalVariable(name: "rxpbl", scope: !330, file: !3, line: 78, type: !30)
!350 = !DILocation(line: 78, column: 6, scope: !330)
!351 = !DILocation(line: 78, column: 14, scope: !330)
!352 = !DILocation(line: 78, column: 23, scope: !330)
!353 = !DILocation(line: 78, column: 32, scope: !330)
!354 = !DILocation(line: 78, column: 41, scope: !330)
!355 = !DILocation(line: 86, column: 6, scope: !356)
!356 = distinct !DILexicalBlock(scope: !330, file: !3, line: 86, column: 6)
!357 = !DILocation(line: 86, column: 15, scope: !356)
!358 = !DILocation(line: 86, column: 6, scope: !330)
!359 = !DILocation(line: 87, column: 9, scope: !356)
!360 = !DILocation(line: 87, column: 3, scope: !356)
!361 = !DILocation(line: 88, column: 8, scope: !330)
!362 = !DILocation(line: 89, column: 8, scope: !330)
!363 = !DILocation(line: 90, column: 12, scope: !330)
!364 = !DILocation(line: 90, column: 18, scope: !330)
!365 = !DILocation(line: 90, column: 8, scope: !330)
!366 = !DILocation(line: 91, column: 12, scope: !330)
!367 = !DILocation(line: 91, column: 18, scope: !330)
!368 = !DILocation(line: 91, column: 8, scope: !330)
!369 = !DILocation(line: 94, column: 6, scope: !370)
!370 = distinct !DILexicalBlock(scope: !330, file: !3, line: 94, column: 6)
!371 = !DILocation(line: 94, column: 15, scope: !370)
!372 = !DILocation(line: 94, column: 6, scope: !330)
!373 = !DILocation(line: 95, column: 9, scope: !370)
!374 = !DILocation(line: 95, column: 3, scope: !370)
!375 = !DILocation(line: 98, column: 6, scope: !376)
!376 = distinct !DILexicalBlock(scope: !330, file: !3, line: 98, column: 6)
!377 = !DILocation(line: 98, column: 15, scope: !376)
!378 = !DILocation(line: 98, column: 6, scope: !330)
!379 = !DILocation(line: 99, column: 9, scope: !376)
!380 = !DILocation(line: 99, column: 3, scope: !376)
!381 = !DILocation(line: 101, column: 6, scope: !382)
!382 = distinct !DILexicalBlock(scope: !330, file: !3, line: 101, column: 6)
!383 = !DILocation(line: 101, column: 6, scope: !330)
!384 = !DILocation(line: 102, column: 9, scope: !382)
!385 = !DILocation(line: 102, column: 3, scope: !382)
