; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/dwmac4_dma.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/dwmac4_dma.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_dma_ops = type { i32 (i8*)*, void (i8*, %struct.stmmac_dma_cfg*, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i64, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i64, i32)*, void (i8*, %struct.stmmac_axi*)*, void (i8*, i32*)*, void (i8*, i32, i32, i32, i8)*, void (i8*, i32, i32, i32, i8)*, void (i8*, %struct.stmmac_extra_stats*, i8*)*, void (i8*)*, void (i8*, i32, i1, i1)*, void (i8*, i32, i1, i1)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i32)*, i32 (i8*, %struct.stmmac_extra_stats*, i32)*, void (i8*, %struct.dma_features*)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i1, i32)*, void (i8*, i32, i8)*, void (i8*, i32, i32)*, void (i8*, i1, i32)*, i32 (i8*, i1, i32)* }
%struct.stmmac_dma_cfg = type { i32, i32, i32, i8, i32, i32, i8, i8 }
%struct.stmmac_axi = type { i8, i8, i32, i32, i8, [7 x i32], i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dwmac4_dma_ops", scope: !2, file: !3, line: 494, type: !17, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !14, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/dwmac4_dma.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !9, !13}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !10, line: 21, baseType: !11)
!10 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !12, line: 27, baseType: !8)
!12 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!0, !15}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "dwmac410_dma_ops", scope: !2, file: !3, line: 523, type: !17, isLocal: false, isDefinition: true)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_dma_ops", file: !19, line: 169, size: 1856, elements: !20)
!19 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!20 = !{!21, !26, !45, !49, !57, !58, !77, !82, !89, !90, !212, !216, !220, !221, !225, !226, !227, !228, !232, !285, !289, !290, !291, !292, !293, !297, !301, !305, !306}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !18, file: !19, line: 171, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{!13, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !18, file: !19, line: 172, baseType: !27, size: 64, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !25, !30, !13}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_dma_cfg", file: !32, line: 89, size: 224, elements: !33)
!32 = !DIFile(filename: "./include/linux/stmmac.h", directory: "/home/lizy2001/genbc/linux")
!33 = !{!34, !35, !36, !37, !41, !42, !43, !44}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "pbl", scope: !31, file: !32, line: 90, baseType: !13, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "txpbl", scope: !31, file: !32, line: 91, baseType: !13, size: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rxpbl", scope: !31, file: !32, line: 92, baseType: !13, size: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "pblx8", scope: !31, file: !32, line: 93, baseType: !38, size: 8, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !39, line: 30, baseType: !40)
!39 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!40 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_burst", scope: !31, file: !32, line: 94, baseType: !13, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mixed_burst", scope: !31, file: !32, line: 95, baseType: !13, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "aal", scope: !31, file: !32, line: 96, baseType: !38, size: 8, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "eame", scope: !31, file: !32, line: 97, baseType: !38, size: 8, offset: 200)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "init_chan", scope: !18, file: !19, line: 174, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !25, !30, !9}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "init_rx_chan", scope: !18, file: !19, line: 176, baseType: !50, size: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !25, !30, !53, !9}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !39, line: 143, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !10, line: 23, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !12, line: 31, baseType: !56)
!56 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "init_tx_chan", scope: !18, file: !19, line: 179, baseType: !50, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "axi", scope: !18, file: !19, line: 183, baseType: !59, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !25, !62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_axi", file: !32, line: 101, size: 384, elements: !64)
!64 = !{!65, !66, !67, !68, !69, !70, !74, !75, !76}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "axi_lpi_en", scope: !63, file: !32, line: 102, baseType: !38, size: 8)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "axi_xit_frm", scope: !63, file: !32, line: 103, baseType: !38, size: 8, offset: 8)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "axi_wr_osr_lmt", scope: !63, file: !32, line: 104, baseType: !9, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "axi_rd_osr_lmt", scope: !63, file: !32, line: 105, baseType: !9, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "axi_kbbe", scope: !63, file: !32, line: 106, baseType: !38, size: 8, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "axi_blen", scope: !63, file: !32, line: 107, baseType: !71, size: 224, offset: 128)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 224, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 7)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "axi_fb", scope: !63, file: !32, line: 108, baseType: !38, size: 8, offset: 352)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "axi_mb", scope: !63, file: !32, line: 109, baseType: !38, size: 8, offset: 360)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "axi_rb", scope: !63, file: !32, line: 110, baseType: !38, size: 8, offset: 368)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "dump_regs", scope: !18, file: !19, line: 185, baseType: !78, size: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !25, !81}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dma_rx_mode", scope: !18, file: !19, line: 186, baseType: !83, size: 64, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !25, !13, !9, !13, !86}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !10, line: 17, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !12, line: 21, baseType: !88)
!88 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dma_tx_mode", scope: !18, file: !19, line: 188, baseType: !83, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "dma_diagnostic_fr", scope: !18, file: !19, line: 191, baseType: !91, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !25, !94, !25}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !96, line: 61, size: 7680, elements: !97)
!96 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/common.h", directory: "/home/lizy2001/genbc/linux")
!97 = !{!98, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !95, file: !96, line: 63, baseType: !99, size: 64, align: 512)
!99 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !95, file: !96, line: 64, baseType: !99, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !95, file: !96, line: 65, baseType: !99, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !95, file: !96, line: 66, baseType: !99, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !95, file: !96, line: 67, baseType: !99, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !95, file: !96, line: 68, baseType: !99, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !95, file: !96, line: 69, baseType: !99, size: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !95, file: !96, line: 70, baseType: !99, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !95, file: !96, line: 71, baseType: !99, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !95, file: !96, line: 72, baseType: !99, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !95, file: !96, line: 74, baseType: !99, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !95, file: !96, line: 75, baseType: !99, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !95, file: !96, line: 76, baseType: !99, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !95, file: !96, line: 77, baseType: !99, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !95, file: !96, line: 78, baseType: !99, size: 64, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !95, file: !96, line: 79, baseType: !99, size: 64, offset: 960)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !95, file: !96, line: 80, baseType: !99, size: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !95, file: !96, line: 81, baseType: !99, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !95, file: !96, line: 82, baseType: !99, size: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !95, file: !96, line: 83, baseType: !99, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !95, file: !96, line: 84, baseType: !99, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !95, file: !96, line: 85, baseType: !99, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !95, file: !96, line: 86, baseType: !99, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !95, file: !96, line: 87, baseType: !99, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !95, file: !96, line: 88, baseType: !99, size: 64, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !95, file: !96, line: 89, baseType: !99, size: 64, offset: 1600)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !95, file: !96, line: 90, baseType: !99, size: 64, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !95, file: !96, line: 91, baseType: !99, size: 64, offset: 1728)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !95, file: !96, line: 93, baseType: !99, size: 64, offset: 1792)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !95, file: !96, line: 94, baseType: !99, size: 64, offset: 1856)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !95, file: !96, line: 95, baseType: !99, size: 64, offset: 1920)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !95, file: !96, line: 96, baseType: !99, size: 64, offset: 1984)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !95, file: !96, line: 97, baseType: !99, size: 64, offset: 2048)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !95, file: !96, line: 98, baseType: !99, size: 64, offset: 2112)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !95, file: !96, line: 99, baseType: !99, size: 64, offset: 2176)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !95, file: !96, line: 100, baseType: !99, size: 64, offset: 2240)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !95, file: !96, line: 101, baseType: !99, size: 64, offset: 2304)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !95, file: !96, line: 103, baseType: !99, size: 64, offset: 2368)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !95, file: !96, line: 104, baseType: !99, size: 64, offset: 2432)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !95, file: !96, line: 105, baseType: !99, size: 64, offset: 2496)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !95, file: !96, line: 106, baseType: !99, size: 64, offset: 2560)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !95, file: !96, line: 107, baseType: !99, size: 64, offset: 2624)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !95, file: !96, line: 108, baseType: !99, size: 64, offset: 2688)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !95, file: !96, line: 109, baseType: !99, size: 64, offset: 2752)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !95, file: !96, line: 110, baseType: !99, size: 64, offset: 2816)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !95, file: !96, line: 111, baseType: !99, size: 64, offset: 2880)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !95, file: !96, line: 112, baseType: !99, size: 64, offset: 2944)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !95, file: !96, line: 113, baseType: !99, size: 64, offset: 3008)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !95, file: !96, line: 115, baseType: !99, size: 64, offset: 3072)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !95, file: !96, line: 116, baseType: !99, size: 64, offset: 3136)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !95, file: !96, line: 117, baseType: !99, size: 64, offset: 3200)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !95, file: !96, line: 119, baseType: !99, size: 64, offset: 3264)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !95, file: !96, line: 120, baseType: !99, size: 64, offset: 3328)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !95, file: !96, line: 121, baseType: !99, size: 64, offset: 3392)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !95, file: !96, line: 122, baseType: !99, size: 64, offset: 3456)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !95, file: !96, line: 123, baseType: !99, size: 64, offset: 3520)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !95, file: !96, line: 125, baseType: !99, size: 64, offset: 3584)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !95, file: !96, line: 126, baseType: !99, size: 64, offset: 3648)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !95, file: !96, line: 127, baseType: !99, size: 64, offset: 3712)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !95, file: !96, line: 128, baseType: !99, size: 64, offset: 3776)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !95, file: !96, line: 129, baseType: !99, size: 64, offset: 3840)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !95, file: !96, line: 130, baseType: !99, size: 64, offset: 3904)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !95, file: !96, line: 131, baseType: !99, size: 64, offset: 3968)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !95, file: !96, line: 132, baseType: !99, size: 64, offset: 4032)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !95, file: !96, line: 133, baseType: !99, size: 64, offset: 4096)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !95, file: !96, line: 134, baseType: !99, size: 64, offset: 4160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !95, file: !96, line: 135, baseType: !99, size: 64, offset: 4224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !95, file: !96, line: 136, baseType: !99, size: 64, offset: 4288)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !95, file: !96, line: 137, baseType: !99, size: 64, offset: 4352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !95, file: !96, line: 138, baseType: !99, size: 64, offset: 4416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !95, file: !96, line: 139, baseType: !99, size: 64, offset: 4480)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !95, file: !96, line: 140, baseType: !99, size: 64, offset: 4544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !95, file: !96, line: 141, baseType: !99, size: 64, offset: 4608)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !95, file: !96, line: 142, baseType: !99, size: 64, offset: 4672)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !95, file: !96, line: 143, baseType: !99, size: 64, offset: 4736)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !95, file: !96, line: 144, baseType: !99, size: 64, offset: 4800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !95, file: !96, line: 145, baseType: !99, size: 64, offset: 4864)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !95, file: !96, line: 146, baseType: !99, size: 64, offset: 4928)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !95, file: !96, line: 147, baseType: !99, size: 64, offset: 4992)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !95, file: !96, line: 148, baseType: !99, size: 64, offset: 5056)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !95, file: !96, line: 149, baseType: !99, size: 64, offset: 5120)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !95, file: !96, line: 151, baseType: !99, size: 64, offset: 5184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !95, file: !96, line: 152, baseType: !99, size: 64, offset: 5248)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !95, file: !96, line: 153, baseType: !99, size: 64, offset: 5312)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !95, file: !96, line: 154, baseType: !99, size: 64, offset: 5376)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !95, file: !96, line: 155, baseType: !99, size: 64, offset: 5440)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !95, file: !96, line: 156, baseType: !99, size: 64, offset: 5504)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !95, file: !96, line: 158, baseType: !99, size: 64, offset: 5568)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !95, file: !96, line: 159, baseType: !99, size: 64, offset: 5632)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !95, file: !96, line: 160, baseType: !99, size: 64, offset: 5696)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !95, file: !96, line: 161, baseType: !99, size: 64, offset: 5760)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !95, file: !96, line: 162, baseType: !99, size: 64, offset: 5824)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !95, file: !96, line: 163, baseType: !99, size: 64, offset: 5888)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !95, file: !96, line: 164, baseType: !99, size: 64, offset: 5952)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !95, file: !96, line: 165, baseType: !99, size: 64, offset: 6016)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !95, file: !96, line: 166, baseType: !99, size: 64, offset: 6080)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !95, file: !96, line: 167, baseType: !99, size: 64, offset: 6144)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !95, file: !96, line: 168, baseType: !99, size: 64, offset: 6208)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !95, file: !96, line: 169, baseType: !99, size: 64, offset: 6272)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !95, file: !96, line: 170, baseType: !99, size: 64, offset: 6336)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !95, file: !96, line: 171, baseType: !99, size: 64, offset: 6400)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !95, file: !96, line: 172, baseType: !99, size: 64, offset: 6464)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !95, file: !96, line: 173, baseType: !99, size: 64, offset: 6528)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !95, file: !96, line: 174, baseType: !99, size: 64, offset: 6592)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !95, file: !96, line: 175, baseType: !99, size: 64, offset: 6656)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !95, file: !96, line: 176, baseType: !99, size: 64, offset: 6720)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !95, file: !96, line: 177, baseType: !99, size: 64, offset: 6784)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !95, file: !96, line: 178, baseType: !99, size: 64, offset: 6848)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !95, file: !96, line: 179, baseType: !99, size: 64, offset: 6912)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !95, file: !96, line: 180, baseType: !99, size: 64, offset: 6976)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !95, file: !96, line: 181, baseType: !99, size: 64, offset: 7040)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !95, file: !96, line: 183, baseType: !99, size: 64, offset: 7104)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !95, file: !96, line: 184, baseType: !99, size: 64, offset: 7168)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dma_transmission", scope: !18, file: !19, line: 193, baseType: !213, size: 64, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !25}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dma_irq", scope: !18, file: !19, line: 194, baseType: !217, size: 64, offset: 704)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !25, !9, !38, !38}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dma_irq", scope: !18, file: !19, line: 196, baseType: !217, size: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "start_tx", scope: !18, file: !19, line: 198, baseType: !222, size: 64, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DISubroutineType(types: !224)
!224 = !{null, !25, !9}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stop_tx", scope: !18, file: !19, line: 199, baseType: !222, size: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "start_rx", scope: !18, file: !19, line: 200, baseType: !222, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stop_rx", scope: !18, file: !19, line: 201, baseType: !222, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "dma_interrupt", scope: !18, file: !19, line: 202, baseType: !229, size: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!13, !25, !94, !9}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "get_hw_feature", scope: !18, file: !19, line: 205, baseType: !233, size: 64, offset: 1152)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !25, !236}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_features", file: !96, line: 326, size: 1472, elements: !238)
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mbps_10_100", scope: !237, file: !96, line: 327, baseType: !8, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mbps_1000", scope: !237, file: !96, line: 328, baseType: !8, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "half_duplex", scope: !237, file: !96, line: 329, baseType: !8, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "hash_filter", scope: !237, file: !96, line: 330, baseType: !8, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "multi_addr", scope: !237, file: !96, line: 331, baseType: !8, size: 32, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", scope: !237, file: !96, line: 332, baseType: !8, size: 32, offset: 160)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sma_mdio", scope: !237, file: !96, line: 333, baseType: !8, size: 32, offset: 192)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pmt_remote_wake_up", scope: !237, file: !96, line: 334, baseType: !8, size: 32, offset: 224)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pmt_magic_frame", scope: !237, file: !96, line: 335, baseType: !8, size: 32, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "rmon", scope: !237, file: !96, line: 336, baseType: !8, size: 32, offset: 288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "time_stamp", scope: !237, file: !96, line: 338, baseType: !8, size: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "atime_stamp", scope: !237, file: !96, line: 340, baseType: !8, size: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "eee", scope: !237, file: !96, line: 342, baseType: !8, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "av", scope: !237, file: !96, line: 343, baseType: !8, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_tb_sz", scope: !237, file: !96, line: 344, baseType: !8, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tsoen", scope: !237, file: !96, line: 345, baseType: !8, size: 32, offset: 480)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coe", scope: !237, file: !96, line: 347, baseType: !8, size: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe", scope: !237, file: !96, line: 348, baseType: !8, size: 32, offset: 544)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe_type1", scope: !237, file: !96, line: 349, baseType: !8, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe_type2", scope: !237, file: !96, line: 350, baseType: !8, size: 32, offset: 608)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "rxfifo_over_2048", scope: !237, file: !96, line: 351, baseType: !8, size: 32, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "number_rx_channel", scope: !237, file: !96, line: 353, baseType: !8, size: 32, offset: 672)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "number_tx_channel", scope: !237, file: !96, line: 354, baseType: !8, size: 32, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "number_rx_queues", scope: !237, file: !96, line: 356, baseType: !8, size: 32, offset: 736)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "number_tx_queues", scope: !237, file: !96, line: 357, baseType: !8, size: 32, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pps_out_num", scope: !237, file: !96, line: 359, baseType: !8, size: 32, offset: 800)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "enh_desc", scope: !237, file: !96, line: 361, baseType: !8, size: 32, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !237, file: !96, line: 363, baseType: !8, size: 32, offset: 864)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !237, file: !96, line: 364, baseType: !8, size: 32, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "asp", scope: !237, file: !96, line: 366, baseType: !8, size: 32, offset: 928)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "frpsel", scope: !237, file: !96, line: 368, baseType: !8, size: 32, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "frpbs", scope: !237, file: !96, line: 369, baseType: !8, size: 32, offset: 992)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "frpes", scope: !237, file: !96, line: 370, baseType: !8, size: 32, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "addr64", scope: !237, file: !96, line: 371, baseType: !8, size: 32, offset: 1056)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "rssen", scope: !237, file: !96, line: 372, baseType: !8, size: 32, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vlhash", scope: !237, file: !96, line: 373, baseType: !8, size: 32, offset: 1120)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sphen", scope: !237, file: !96, line: 374, baseType: !8, size: 32, offset: 1152)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "vlins", scope: !237, file: !96, line: 375, baseType: !8, size: 32, offset: 1184)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "dvlan", scope: !237, file: !96, line: 376, baseType: !8, size: 32, offset: 1216)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "l3l4fnum", scope: !237, file: !96, line: 377, baseType: !8, size: 32, offset: 1248)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "arpoffsel", scope: !237, file: !96, line: 378, baseType: !8, size: 32, offset: 1280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "estwid", scope: !237, file: !96, line: 380, baseType: !8, size: 32, offset: 1312)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "estdep", scope: !237, file: !96, line: 381, baseType: !8, size: 32, offset: 1344)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "estsel", scope: !237, file: !96, line: 382, baseType: !8, size: 32, offset: 1376)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "fpesel", scope: !237, file: !96, line: 383, baseType: !8, size: 32, offset: 1408)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "tbssel", scope: !237, file: !96, line: 384, baseType: !8, size: 32, offset: 1440)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !18, file: !19, line: 208, baseType: !286, size: 64, offset: 1216)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !25, !9, !9}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_ring_len", scope: !18, file: !19, line: 209, baseType: !286, size: 64, offset: 1280)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_ring_len", scope: !18, file: !19, line: 210, baseType: !286, size: 64, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_tail_ptr", scope: !18, file: !19, line: 211, baseType: !286, size: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_tail_ptr", scope: !18, file: !19, line: 212, baseType: !286, size: 64, offset: 1472)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tso", scope: !18, file: !19, line: 213, baseType: !294, size: 64, offset: 1536)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !25, !38, !9}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "qmode", scope: !18, file: !19, line: 214, baseType: !298, size: 64, offset: 1600)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !25, !9, !86}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "set_bfsize", scope: !18, file: !19, line: 215, baseType: !302, size: 64, offset: 1664)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !25, !13, !9}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "enable_sph", scope: !18, file: !19, line: 216, baseType: !294, size: 64, offset: 1728)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tbs", scope: !18, file: !19, line: 217, baseType: !307, size: 64, offset: 1792)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{!13, !25, !38, !9}
!310 = !{i32 7, !"Dwarf Version", i32 4}
!311 = !{i32 2, !"Debug Info Version", i32 3}
!312 = !{i32 1, !"wchar_size", i32 2}
!313 = !{i32 1, !"Code Model", i32 2}
!314 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!315 = distinct !DISubprogram(name: "dwmac4_dma_init", scope: !3, file: !3, line: 127, type: !28, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!316 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !315, file: !3, line: 127, type: !25)
!317 = !DILocation(line: 127, column: 43, scope: !315)
!318 = !DILocalVariable(name: "dma_cfg", arg: 2, scope: !315, file: !3, line: 128, type: !30)
!319 = !DILocation(line: 128, column: 31, scope: !315)
!320 = !DILocalVariable(name: "atds", arg: 3, scope: !315, file: !3, line: 128, type: !13)
!321 = !DILocation(line: 128, column: 44, scope: !315)
!322 = !DILocalVariable(name: "value", scope: !315, file: !3, line: 130, type: !9)
!323 = !DILocation(line: 130, column: 6, scope: !315)
!324 = !DILocation(line: 130, column: 20, scope: !315)
!325 = !DILocation(line: 130, column: 27, scope: !315)
!326 = !DILocation(line: 130, column: 14, scope: !315)
!327 = !DILocation(line: 133, column: 6, scope: !328)
!328 = distinct !DILexicalBlock(scope: !315, file: !3, line: 133, column: 6)
!329 = !DILocation(line: 133, column: 15, scope: !328)
!330 = !DILocation(line: 133, column: 6, scope: !315)
!331 = !DILocation(line: 134, column: 9, scope: !328)
!332 = !DILocation(line: 134, column: 3, scope: !328)
!333 = !DILocation(line: 137, column: 6, scope: !334)
!334 = distinct !DILexicalBlock(scope: !315, file: !3, line: 137, column: 6)
!335 = !DILocation(line: 137, column: 15, scope: !334)
!336 = !DILocation(line: 137, column: 6, scope: !315)
!337 = !DILocation(line: 138, column: 9, scope: !334)
!338 = !DILocation(line: 138, column: 3, scope: !334)
!339 = !DILocation(line: 140, column: 6, scope: !340)
!340 = distinct !DILexicalBlock(scope: !315, file: !3, line: 140, column: 6)
!341 = !DILocation(line: 140, column: 15, scope: !340)
!342 = !DILocation(line: 140, column: 6, scope: !315)
!343 = !DILocation(line: 141, column: 9, scope: !340)
!344 = !DILocation(line: 141, column: 3, scope: !340)
!345 = !DILocation(line: 143, column: 6, scope: !346)
!346 = distinct !DILexicalBlock(scope: !315, file: !3, line: 143, column: 6)
!347 = !DILocation(line: 143, column: 15, scope: !346)
!348 = !DILocation(line: 143, column: 6, scope: !315)
!349 = !DILocation(line: 144, column: 9, scope: !346)
!350 = !DILocation(line: 144, column: 3, scope: !346)
!351 = !DILocation(line: 146, column: 9, scope: !315)
!352 = !DILocation(line: 146, column: 16, scope: !315)
!353 = !DILocation(line: 146, column: 23, scope: !315)
!354 = !DILocation(line: 146, column: 2, scope: !315)
!355 = !DILocation(line: 147, column: 1, scope: !315)
!356 = distinct !DISubprogram(name: "dwmac4_dma_init_channel", scope: !3, file: !3, line: 111, type: !47, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!357 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !356, file: !3, line: 111, type: !25)
!358 = !DILocation(line: 111, column: 51, scope: !356)
!359 = !DILocalVariable(name: "dma_cfg", arg: 2, scope: !356, file: !3, line: 112, type: !30)
!360 = !DILocation(line: 112, column: 32, scope: !356)
!361 = !DILocalVariable(name: "chan", arg: 3, scope: !356, file: !3, line: 112, type: !9)
!362 = !DILocation(line: 112, column: 45, scope: !356)
!363 = !DILocalVariable(name: "value", scope: !356, file: !3, line: 114, type: !9)
!364 = !DILocation(line: 114, column: 6, scope: !356)
