; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/dwmac4_lib.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/dwmac4_lib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_extra_stats = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [56 x i8] }

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @dwmac4_dma_reset(i8* %ioaddr) #0 !dbg !19 {
entry:
  %ioaddr.addr = alloca i8*, align 8
  %value = alloca i32, align 4
  %__timeout_us = alloca i64, align 8
  %__sleep_us = alloca i64, align 8
  %__timeout = alloca i64, align 8
  %tmp = alloca i32, align 4
  store i8* %ioaddr, i8** %ioaddr.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %ioaddr.addr, metadata !25, metadata !DIExpression()), !dbg !26
  call void @llvm.dbg.declare(metadata i32* %value, metadata !27, metadata !DIExpression()), !dbg !32

!342 = distinct !DILexicalBlock(scope: !321, file: !1, line: 111, column: 6)
!343 = !DILocation(line: 111, column: 6, scope: !321)
!344 = !DILocation(line: 112, column: 9, scope: !342)
!345 = !DILocation(line: 112, column: 3, scope: !342)
!346 = !DILocation(line: 114, column: 9, scope: !321)
!347 = !DILocation(line: 114, column: 16, scope: !321)
!348 = !DILocation(line: 114, column: 25, scope: !321)
!349 = !DILocation(line: 114, column: 23, scope: !321)
!350 = !DILocation(line: 114, column: 2, scope: !321)
!351 = !DILocation(line: 115, column: 1, scope: !321)
!352 = distinct !DISubprogram(name: "dwmac4_disable_dma_irq", scope: !1, file: !1, line: 117, type: !286, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!353 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !352, file: !1, line: 117, type: !23)
!354 = !DILocation(line: 117, column: 43, scope: !352)
!355 = !DILocalVariable(name: "chan", arg: 2, scope: !352, file: !1, line: 117, type: !28)
!356 = !DILocation(line: 117, column: 55, scope: !352)
!357 = !DILocalVariable(name: "rx", arg: 3, scope: !352, file: !1, line: 117, type: !288)
!358 = !DILocation(line: 117, column: 66, scope: !352)
!359 = !DILocalVariable(name: "tx", arg: 4, scope: !352, file: !1, line: 117, type: !288)
!360 = !DILocation(line: 117, column: 75, scope: !352)
!361 = !DILocalVariable(name: "value", scope: !352, file: !1, line: 119, type: !28)
!362 = !DILocation(line: 119, column: 6, scope: !352)
!363 = !DILocation(line: 119, column: 20, scope: !352)
!364 = !DILocation(line: 119, column: 29, scope: !352)
!365 = !DILocation(line: 119, column: 27, scope: !352)
!366 = !DILocation(line: 119, column: 14, scope: !352)
!367 = !DILocation(line: 121, column: 6, scope: !368)
!368 = distinct !DILexicalBlock(scope: !352, file: !1, line: 121, column: 6)
!369 = !DILocation(line: 121, column: 6, scope: !352)
!370 = !DILocation(line: 122, column: 9, scope: !368)
!371 = !DILocation(line: 122, column: 3, scope: !368)
!372 = !DILocation(line: 123, column: 6, scope: !373)
!373 = distinct !DILexicalBlock(scope: !352, file: !1, line: 123, column: 6)
!374 = !DILocation(line: 123, column: 6, scope: !352)
!375 = !DILocation(line: 124, column: 9, scope: !373)
!376 = !DILocation(line: 124, column: 3, scope: !373)
!377 = !DILocation(line: 126, column: 9, scope: !352)
!378 = !DILocation(line: 126, column: 16, scope: !352)
!379 = !DILocation(line: 126, column: 25, scope: !352)
!380 = !DILocation(line: 126, column: 23, scope: !352)
!381 = !DILocation(line: 126, column: 2, scope: !352)
!382 = !DILocation(line: 127, column: 1, scope: !352)
!383 = distinct !DISubprogram(name: "dwmac410_disable_dma_irq", scope: !1, file: !1, line: 129, type: !286, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!384 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !383, file: !1, line: 129, type: !23)
!385 = !DILocation(line: 129, column: 45, scope: !383)
!386 = !DILocalVariable(name: "chan", arg: 2, scope: !383, file: !1, line: 129, type: !28)
!387 = !DILocation(line: 129, column: 57, scope: !383)
!388 = !DILocalVariable(name: "rx", arg: 3, scope: !383, file: !1, line: 129, type: !288)
!389 = !DILocation(line: 129, column: 68, scope: !383)
!390 = !DILocalVariable(name: "tx", arg: 4, scope: !383, file: !1, line: 129, type: !288)
!391 = !DILocation(line: 129, column: 77, scope: !383)
!392 = !DILocalVariable(name: "value", scope: !383, file: !1, line: 131, type: !28)
!393 = !DILocation(line: 131, column: 6, scope: !383)
!394 = !DILocation(line: 131, column: 20, scope: !383)
!395 = !DILocation(line: 131, column: 29, scope: !383)
!396 = !DILocation(line: 131, column: 27, scope: !383)
!397 = !DILocation(line: 131, column: 14, scope: !383)
!398 = !DILocation(line: 133, column: 6, scope: !399)
!399 = distinct !DILexicalBlock(scope: !383, file: !1, line: 133, column: 6)
!400 = !DILocation(line: 133, column: 6, scope: !383)
!401 = !DILocation(line: 134, column: 9, scope: !399)
!402 = !DILocation(line: 134, column: 3, scope: !399)
!403 = !DILocation(line: 135, column: 6, scope: !404)
!404 = distinct !DILexicalBlock(scope: !383, file: !1, line: 135, column: 6)
!405 = !DILocation(line: 135, column: 6, scope: !383)
!406 = !DILocation(line: 136, column: 9, scope: !404)
!407 = !DILocation(line: 136, column: 3, scope: !404)
!408 = !DILocation(line: 138, column: 9, scope: !383)
!409 = !DILocation(line: 138, column: 16, scope: !383)
!410 = !DILocation(line: 138, column: 25, scope: !383)
!411 = !DILocation(line: 138, column: 23, scope: !383)
!412 = !DILocation(line: 138, column: 2, scope: !383)
!413 = !DILocation(line: 139, column: 1, scope: !383)
!414 = distinct !DISubprogram(name: "dwmac4_dma_interrupt", scope: !1, file: !1, line: 141, type: !415, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!415 = !DISubroutineType(types: !416)
!416 = !{!22, !23, !417, !28}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !4, line: 61, size: 7680, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !418, file: !4, line: 63, baseType: !48, size: 64, align: 512)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !418, file: !4, line: 64, baseType: !48, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !418, file: !4, line: 65, baseType: !48, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !418, file: !4, line: 66, baseType: !48, size: 64, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !418, file: !4, line: 67, baseType: !48, size: 64, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !418, file: !4, line: 68, baseType: !48, size: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !418, file: !4, line: 69, baseType: !48, size: 64, offset: 384)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !418, file: !4, line: 70, baseType: !48, size: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !418, file: !4, line: 71, baseType: !48, size: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !418, file: !4, line: 72, baseType: !48, size: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !418, file: !4, line: 74, baseType: !48, size: 64, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !418, file: !4, line: 75, baseType: !48, size: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !418, file: !4, line: 76, baseType: !48, size: 64, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !418, file: !4, line: 77, baseType: !48, size: 64, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !418, file: !4, line: 78, baseType: !48, size: 64, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !418, file: !4, line: 79, baseType: !48, size: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !418, file: !4, line: 80, baseType: !48, size: 64, offset: 1024)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !418, file: !4, line: 81, baseType: !48, size: 64, offset: 1088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !418, file: !4, line: 82, baseType: !48, size: 64, offset: 1152)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !418, file: !4, line: 83, baseType: !48, size: 64, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !418, file: !4, line: 84, baseType: !48, size: 64, offset: 1280)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !418, file: !4, line: 85, baseType: !48, size: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !418, file: !4, line: 86, baseType: !48, size: 64, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !418, file: !4, line: 87, baseType: !48, size: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !418, file: !4, line: 88, baseType: !48, size: 64, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !418, file: !4, line: 89, baseType: !48, size: 64, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !418, file: !4, line: 90, baseType: !48, size: 64, offset: 1664)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !418, file: !4, line: 91, baseType: !48, size: 64, offset: 1728)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !418, file: !4, line: 93, baseType: !48, size: 64, offset: 1792)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !418, file: !4, line: 94, baseType: !48, size: 64, offset: 1856)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !418, file: !4, line: 95, baseType: !48, size: 64, offset: 1920)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !418, file: !4, line: 96, baseType: !48, size: 64, offset: 1984)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !418, file: !4, line: 97, baseType: !48, size: 64, offset: 2048)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !418, file: !4, line: 98, baseType: !48, size: 64, offset: 2112)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !418, file: !4, line: 99, baseType: !48, size: 64, offset: 2176)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !418, file: !4, line: 100, baseType: !48, size: 64, offset: 2240)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !418, file: !4, line: 101, baseType: !48, size: 64, offset: 2304)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !418, file: !4, line: 103, baseType: !48, size: 64, offset: 2368)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !418, file: !4, line: 104, baseType: !48, size: 64, offset: 2432)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !418, file: !4, line: 105, baseType: !48, size: 64, offset: 2496)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !418, file: !4, line: 106, baseType: !48, size: 64, offset: 2560)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !418, file: !4, line: 107, baseType: !48, size: 64, offset: 2624)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !418, file: !4, line: 108, baseType: !48, size: 64, offset: 2688)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !418, file: !4, line: 109, baseType: !48, size: 64, offset: 2752)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !418, file: !4, line: 110, baseType: !48, size: 64, offset: 2816)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !418, file: !4, line: 111, baseType: !48, size: 64, offset: 2880)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !418, file: !4, line: 112, baseType: !48, size: 64, offset: 2944)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !418, file: !4, line: 113, baseType: !48, size: 64, offset: 3008)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !418, file: !4, line: 115, baseType: !48, size: 64, offset: 3072)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !418, file: !4, line: 116, baseType: !48, size: 64, offset: 3136)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !418, file: !4, line: 117, baseType: !48, size: 64, offset: 3200)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !418, file: !4, line: 119, baseType: !48, size: 64, offset: 3264)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !418, file: !4, line: 120, baseType: !48, size: 64, offset: 3328)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !418, file: !4, line: 121, baseType: !48, size: 64, offset: 3392)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !418, file: !4, line: 122, baseType: !48, size: 64, offset: 3456)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !418, file: !4, line: 123, baseType: !48, size: 64, offset: 3520)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !418, file: !4, line: 125, baseType: !48, size: 64, offset: 3584)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !418, file: !4, line: 126, baseType: !48, size: 64, offset: 3648)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !418, file: !4, line: 127, baseType: !48, size: 64, offset: 3712)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !418, file: !4, line: 128, baseType: !48, size: 64, offset: 3776)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !418, file: !4, line: 129, baseType: !48, size: 64, offset: 3840)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !418, file: !4, line: 130, baseType: !48, size: 64, offset: 3904)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !418, file: !4, line: 131, baseType: !48, size: 64, offset: 3968)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !418, file: !4, line: 132, baseType: !48, size: 64, offset: 4032)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !418, file: !4, line: 133, baseType: !48, size: 64, offset: 4096)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !418, file: !4, line: 134, baseType: !48, size: 64, offset: 4160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !418, file: !4, line: 135, baseType: !48, size: 64, offset: 4224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !418, file: !4, line: 136, baseType: !48, size: 64, offset: 4288)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !418, file: !4, line: 137, baseType: !48, size: 64, offset: 4352)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !418, file: !4, line: 138, baseType: !48, size: 64, offset: 4416)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !418, file: !4, line: 139, baseType: !48, size: 64, offset: 4480)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !418, file: !4, line: 140, baseType: !48, size: 64, offset: 4544)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !418, file: !4, line: 141, baseType: !48, size: 64, offset: 4608)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !418, file: !4, line: 142, baseType: !48, size: 64, offset: 4672)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !418, file: !4, line: 143, baseType: !48, size: 64, offset: 4736)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !418, file: !4, line: 144, baseType: !48, size: 64, offset: 4800)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !418, file: !4, line: 145, baseType: !48, size: 64, offset: 4864)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !418, file: !4, line: 146, baseType: !48, size: 64, offset: 4928)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !418, file: !4, line: 147, baseType: !48, size: 64, offset: 4992)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !418, file: !4, line: 148, baseType: !48, size: 64, offset: 5056)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !418, file: !4, line: 149, baseType: !48, size: 64, offset: 5120)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !418, file: !4, line: 151, baseType: !48, size: 64, offset: 5184)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !418, file: !4, line: 152, baseType: !48, size: 64, offset: 5248)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !418, file: !4, line: 153, baseType: !48, size: 64, offset: 5312)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !418, file: !4, line: 154, baseType: !48, size: 64, offset: 5376)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !418, file: !4, line: 155, baseType: !48, size: 64, offset: 5440)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !418, file: !4, line: 156, baseType: !48, size: 64, offset: 5504)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !418, file: !4, line: 158, baseType: !48, size: 64, offset: 5568)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !418, file: !4, line: 159, baseType: !48, size: 64, offset: 5632)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !418, file: !4, line: 160, baseType: !48, size: 64, offset: 5696)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !418, file: !4, line: 161, baseType: !48, size: 64, offset: 5760)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !418, file: !4, line: 162, baseType: !48, size: 64, offset: 5824)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !418, file: !4, line: 163, baseType: !48, size: 64, offset: 5888)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !418, file: !4, line: 164, baseType: !48, size: 64, offset: 5952)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !418, file: !4, line: 165, baseType: !48, size: 64, offset: 6016)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !418, file: !4, line: 166, baseType: !48, size: 64, offset: 6080)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !418, file: !4, line: 167, baseType: !48, size: 64, offset: 6144)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !418, file: !4, line: 168, baseType: !48, size: 64, offset: 6208)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !418, file: !4, line: 169, baseType: !48, size: 64, offset: 6272)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !418, file: !4, line: 170, baseType: !48, size: 64, offset: 6336)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !418, file: !4, line: 171, baseType: !48, size: 64, offset: 6400)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !418, file: !4, line: 172, baseType: !48, size: 64, offset: 6464)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !418, file: !4, line: 173, baseType: !48, size: 64, offset: 6528)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !418, file: !4, line: 174, baseType: !48, size: 64, offset: 6592)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !418, file: !4, line: 175, baseType: !48, size: 64, offset: 6656)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !418, file: !4, line: 176, baseType: !48, size: 64, offset: 6720)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !418, file: !4, line: 177, baseType: !48, size: 64, offset: 6784)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !418, file: !4, line: 178, baseType: !48, size: 64, offset: 6848)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !418, file: !4, line: 179, baseType: !48, size: 64, offset: 6912)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !418, file: !4, line: 180, baseType: !48, size: 64, offset: 6976)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !418, file: !4, line: 181, baseType: !48, size: 64, offset: 7040)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !418, file: !4, line: 183, baseType: !48, size: 64, offset: 7104)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !418, file: !4, line: 184, baseType: !48, size: 64, offset: 7168)
!533 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !414, file: !1, line: 141, type: !23)
!534 = !DILocation(line: 141, column: 40, scope: !414)
!535 = !DILocalVariable(name: "x", arg: 2, scope: !414, file: !1, line: 142, type: !417)
!536 = !DILocation(line: 142, column: 32, scope: !414)
!537 = !DILocalVariable(name: "chan", arg: 3, scope: !414, file: !1, line: 142, type: !28)
!538 = !DILocation(line: 142, column: 39, scope: !414)
!539 = !DILocalVariable(name: "intr_status", scope: !414, file: !1, line: 144, type: !28)
!540 = !DILocation(line: 144, column: 6, scope: !414)
!541 = !DILocation(line: 144, column: 26, scope: !414)
!542 = !DILocation(line: 144, column: 35, scope: !414)
!543 = !DILocation(line: 144, column: 33, scope: !414)
!544 = !DILocation(line: 144, column: 20, scope: !414)
!545 = !DILocalVariable(name: "intr_en", scope: !414, file: !1, line: 145, type: !28)
!546 = !DILocation(line: 145, column: 6, scope: !414)
!547 = !DILocation(line: 145, column: 22, scope: !414)
!548 = !DILocation(line: 145, column: 31, scope: !414)
!549 = !DILocation(line: 145, column: 29, scope: !414)
!550 = !DILocation(line: 145, column: 16, scope: !414)
!551 = !DILocalVariable(name: "ret", scope: !414, file: !1, line: 146, type: !22)
!552 = !DILocation(line: 146, column: 6, scope: !414)
!553 = !DILocation(line: 149, column: 6, scope: !554)
!554 = distinct !DILexicalBlock(scope: !414, file: !1, line: 149, column: 6)
!555 = !DILocation(line: 149, column: 6, scope: !414)
!556 = !DILocation(line: 150, column: 7, scope: !557)
!557 = distinct !DILexicalBlock(scope: !558, file: !1, line: 150, column: 7)
!558 = distinct !DILexicalBlock(scope: !554, file: !1, line: 149, column: 51)
!559 = !DILocation(line: 150, column: 7, scope: !558)
!560 = !DILocation(line: 151, column: 4, scope: !557)
!561 = !DILocation(line: 151, column: 7, scope: !557)
!562 = !DILocation(line: 151, column: 22, scope: !557)
!563 = !DILocation(line: 152, column: 7, scope: !564)
!564 = distinct !DILexicalBlock(scope: !558, file: !1, line: 152, column: 7)
!565 = !DILocation(line: 152, column: 7, scope: !558)
!566 = !DILocation(line: 153, column: 4, scope: !564)
!567 = !DILocation(line: 153, column: 7, scope: !564)
!568 = !DILocation(line: 153, column: 29, scope: !564)
!569 = !DILocation(line: 154, column: 7, scope: !570)
!570 = distinct !DILexicalBlock(scope: !558, file: !1, line: 154, column: 7)
!571 = !DILocation(line: 154, column: 7, scope: !558)
!572 = !DILocation(line: 155, column: 4, scope: !570)
!573 = !DILocation(line: 155, column: 7, scope: !570)
!574 = !DILocation(line: 155, column: 22, scope: !570)
!575 = !DILocation(line: 156, column: 7, scope: !576)
!576 = distinct !DILexicalBlock(scope: !558, file: !1, line: 156, column: 7)
!577 = !DILocation(line: 156, column: 7, scope: !558)
!578 = !DILocation(line: 157, column: 4, scope: !576)
!579 = !DILocation(line: 157, column: 7, scope: !576)
!580 = !DILocation(line: 157, column: 19, scope: !576)
!581 = !DILocation(line: 158, column: 7, scope: !582)
!582 = distinct !DILexicalBlock(scope: !558, file: !1, line: 158, column: 7)
!583 = !DILocation(line: 158, column: 7, scope: !558)
!584 = !DILocation(line: 159, column: 4, scope: !585)
!585 = distinct !DILexicalBlock(scope: !582, file: !1, line: 158, column: 52)
!586 = !DILocation(line: 159, column: 7, scope: !585)
!587 = !DILocation(line: 159, column: 29, scope: !585)
!588 = !DILocation(line: 160, column: 8, scope: !585)
!589 = !DILocation(line: 161, column: 3, scope: !585)
!590 = !DILocation(line: 162, column: 7, scope: !591)
!591 = distinct !DILexicalBlock(scope: !558, file: !1, line: 162, column: 7)
!592 = !DILocation(line: 162, column: 7, scope: !558)
!593 = !DILocation(line: 163, column: 4, scope: !594)
!594 = distinct !DILexicalBlock(scope: !591, file: !1, line: 162, column: 52)
!595 = !DILocation(line: 163, column: 7, scope: !594)
