; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/dwmac_lib.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/dwmac_lib.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_extra_stats = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, [56 x i8] }

@.str = private unnamed_addr constant [30 x i8] c"\014%s: unexpected status %08x\0A\00", align 1
@__func__.dwmac_dma_interrupt = private unnamed_addr constant [20 x i8] c"dwmac_dma_interrupt\00", align 1

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define dso_local i32 @dwmac_dma_reset(i8* %ioaddr) #0 !dbg !19 {
entry:
  %ioaddr.addr = alloca i8*, align 8
  %value = alloca i32, align 4
  %__timeout_us = alloca i64, align 8
  %__sleep_us = alloca i64, align 8
  %__timeout = alloca i64, align 8
  %tmp = alloca i32, align 4
  store i8* %ioaddr, i8** %ioaddr.addr, align 8

!198 = !DILocation(line: 56, column: 16, scope: !173)
!199 = !DILocation(line: 56, column: 23, scope: !173)
!200 = !DILocation(line: 56, column: 2, scope: !173)
!201 = !DILocation(line: 57, column: 1, scope: !173)
!202 = distinct !DISubprogram(name: "dwmac_dma_start_tx", scope: !1, file: !1, line: 59, type: !203, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !23, !28}
!205 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !202, file: !1, line: 59, type: !23)
!206 = !DILocation(line: 59, column: 39, scope: !202)
!207 = !DILocalVariable(name: "chan", arg: 2, scope: !202, file: !1, line: 59, type: !28)
!208 = !DILocation(line: 59, column: 51, scope: !202)
!209 = !DILocalVariable(name: "value", scope: !202, file: !1, line: 61, type: !28)
!210 = !DILocation(line: 61, column: 6, scope: !202)
!211 = !DILocation(line: 61, column: 20, scope: !202)
!212 = !DILocation(line: 61, column: 27, scope: !202)
!213 = !DILocation(line: 61, column: 14, scope: !202)
!214 = !DILocation(line: 62, column: 8, scope: !202)
!215 = !DILocation(line: 63, column: 9, scope: !202)
!216 = !DILocation(line: 63, column: 16, scope: !202)
!217 = !DILocation(line: 63, column: 23, scope: !202)
!218 = !DILocation(line: 63, column: 2, scope: !202)
!219 = !DILocation(line: 64, column: 1, scope: !202)
!220 = distinct !DISubprogram(name: "dwmac_dma_stop_tx", scope: !1, file: !1, line: 66, type: !203, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!221 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !220, file: !1, line: 66, type: !23)
!222 = !DILocation(line: 66, column: 38, scope: !220)
!223 = !DILocalVariable(name: "chan", arg: 2, scope: !220, file: !1, line: 66, type: !28)
!224 = !DILocation(line: 66, column: 50, scope: !220)
!225 = !DILocalVariable(name: "value", scope: !220, file: !1, line: 68, type: !28)
!226 = !DILocation(line: 68, column: 6, scope: !220)
!227 = !DILocation(line: 68, column: 20, scope: !220)
!228 = !DILocation(line: 68, column: 27, scope: !220)
!229 = !DILocation(line: 68, column: 14, scope: !220)
!230 = !DILocation(line: 69, column: 8, scope: !220)
!231 = !DILocation(line: 70, column: 9, scope: !220)
!232 = !DILocation(line: 70, column: 16, scope: !220)
!233 = !DILocation(line: 70, column: 23, scope: !220)
!234 = !DILocation(line: 70, column: 2, scope: !220)
!235 = !DILocation(line: 71, column: 1, scope: !220)
!236 = distinct !DISubprogram(name: "dwmac_dma_start_rx", scope: !1, file: !1, line: 73, type: !203, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!237 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !236, file: !1, line: 73, type: !23)
!238 = !DILocation(line: 73, column: 39, scope: !236)
!239 = !DILocalVariable(name: "chan", arg: 2, scope: !236, file: !1, line: 73, type: !28)
!240 = !DILocation(line: 73, column: 51, scope: !236)
!241 = !DILocalVariable(name: "value", scope: !236, file: !1, line: 75, type: !28)
!242 = !DILocation(line: 75, column: 6, scope: !236)
!243 = !DILocation(line: 75, column: 20, scope: !236)
!244 = !DILocation(line: 75, column: 27, scope: !236)
!245 = !DILocation(line: 75, column: 14, scope: !236)
!246 = !DILocation(line: 76, column: 8, scope: !236)
!247 = !DILocation(line: 77, column: 9, scope: !236)
!248 = !DILocation(line: 77, column: 16, scope: !236)
!249 = !DILocation(line: 77, column: 23, scope: !236)
!250 = !DILocation(line: 77, column: 2, scope: !236)
!251 = !DILocation(line: 78, column: 1, scope: !236)
!252 = distinct !DISubprogram(name: "dwmac_dma_stop_rx", scope: !1, file: !1, line: 80, type: !203, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!253 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !252, file: !1, line: 80, type: !23)
!254 = !DILocation(line: 80, column: 38, scope: !252)
!255 = !DILocalVariable(name: "chan", arg: 2, scope: !252, file: !1, line: 80, type: !28)
!256 = !DILocation(line: 80, column: 50, scope: !252)
!257 = !DILocalVariable(name: "value", scope: !252, file: !1, line: 82, type: !28)
!258 = !DILocation(line: 82, column: 6, scope: !252)
!259 = !DILocation(line: 82, column: 20, scope: !252)
!260 = !DILocation(line: 82, column: 27, scope: !252)
!261 = !DILocation(line: 82, column: 14, scope: !252)
!262 = !DILocation(line: 83, column: 8, scope: !252)
!263 = !DILocation(line: 84, column: 9, scope: !252)
!264 = !DILocation(line: 84, column: 16, scope: !252)
!265 = !DILocation(line: 84, column: 23, scope: !252)
!266 = !DILocation(line: 84, column: 2, scope: !252)
!267 = !DILocation(line: 85, column: 1, scope: !252)
!268 = distinct !DISubprogram(name: "dwmac_dma_interrupt", scope: !1, file: !1, line: 157, type: !269, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !24)
!269 = !DISubroutineType(types: !270)
!270 = !{!22, !23, !271, !28}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !4, line: 61, size: 7680, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !272, file: !4, line: 63, baseType: !48, size: 64, align: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !272, file: !4, line: 64, baseType: !48, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !272, file: !4, line: 65, baseType: !48, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !272, file: !4, line: 66, baseType: !48, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !272, file: !4, line: 67, baseType: !48, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !272, file: !4, line: 68, baseType: !48, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !272, file: !4, line: 69, baseType: !48, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !272, file: !4, line: 70, baseType: !48, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !272, file: !4, line: 71, baseType: !48, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !272, file: !4, line: 72, baseType: !48, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !272, file: !4, line: 74, baseType: !48, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !272, file: !4, line: 75, baseType: !48, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !272, file: !4, line: 76, baseType: !48, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !272, file: !4, line: 77, baseType: !48, size: 64, offset: 832)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !272, file: !4, line: 78, baseType: !48, size: 64, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !272, file: !4, line: 79, baseType: !48, size: 64, offset: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !272, file: !4, line: 80, baseType: !48, size: 64, offset: 1024)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !272, file: !4, line: 81, baseType: !48, size: 64, offset: 1088)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !272, file: !4, line: 82, baseType: !48, size: 64, offset: 1152)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !272, file: !4, line: 83, baseType: !48, size: 64, offset: 1216)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !272, file: !4, line: 84, baseType: !48, size: 64, offset: 1280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !272, file: !4, line: 85, baseType: !48, size: 64, offset: 1344)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !272, file: !4, line: 86, baseType: !48, size: 64, offset: 1408)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !272, file: !4, line: 87, baseType: !48, size: 64, offset: 1472)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !272, file: !4, line: 88, baseType: !48, size: 64, offset: 1536)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !272, file: !4, line: 89, baseType: !48, size: 64, offset: 1600)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !272, file: !4, line: 90, baseType: !48, size: 64, offset: 1664)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !272, file: !4, line: 91, baseType: !48, size: 64, offset: 1728)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !272, file: !4, line: 93, baseType: !48, size: 64, offset: 1792)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !272, file: !4, line: 94, baseType: !48, size: 64, offset: 1856)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !272, file: !4, line: 95, baseType: !48, size: 64, offset: 1920)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !272, file: !4, line: 96, baseType: !48, size: 64, offset: 1984)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !272, file: !4, line: 97, baseType: !48, size: 64, offset: 2048)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !272, file: !4, line: 98, baseType: !48, size: 64, offset: 2112)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !272, file: !4, line: 99, baseType: !48, size: 64, offset: 2176)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !272, file: !4, line: 100, baseType: !48, size: 64, offset: 2240)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !272, file: !4, line: 101, baseType: !48, size: 64, offset: 2304)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !272, file: !4, line: 103, baseType: !48, size: 64, offset: 2368)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !272, file: !4, line: 104, baseType: !48, size: 64, offset: 2432)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !272, file: !4, line: 105, baseType: !48, size: 64, offset: 2496)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !272, file: !4, line: 106, baseType: !48, size: 64, offset: 2560)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !272, file: !4, line: 107, baseType: !48, size: 64, offset: 2624)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !272, file: !4, line: 108, baseType: !48, size: 64, offset: 2688)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !272, file: !4, line: 109, baseType: !48, size: 64, offset: 2752)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !272, file: !4, line: 110, baseType: !48, size: 64, offset: 2816)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !272, file: !4, line: 111, baseType: !48, size: 64, offset: 2880)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !272, file: !4, line: 112, baseType: !48, size: 64, offset: 2944)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !272, file: !4, line: 113, baseType: !48, size: 64, offset: 3008)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !272, file: !4, line: 115, baseType: !48, size: 64, offset: 3072)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !272, file: !4, line: 116, baseType: !48, size: 64, offset: 3136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !272, file: !4, line: 117, baseType: !48, size: 64, offset: 3200)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !272, file: !4, line: 119, baseType: !48, size: 64, offset: 3264)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !272, file: !4, line: 120, baseType: !48, size: 64, offset: 3328)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !272, file: !4, line: 121, baseType: !48, size: 64, offset: 3392)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !272, file: !4, line: 122, baseType: !48, size: 64, offset: 3456)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !272, file: !4, line: 123, baseType: !48, size: 64, offset: 3520)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !272, file: !4, line: 125, baseType: !48, size: 64, offset: 3584)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !272, file: !4, line: 126, baseType: !48, size: 64, offset: 3648)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !272, file: !4, line: 127, baseType: !48, size: 64, offset: 3712)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !272, file: !4, line: 128, baseType: !48, size: 64, offset: 3776)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !272, file: !4, line: 129, baseType: !48, size: 64, offset: 3840)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !272, file: !4, line: 130, baseType: !48, size: 64, offset: 3904)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !272, file: !4, line: 131, baseType: !48, size: 64, offset: 3968)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !272, file: !4, line: 132, baseType: !48, size: 64, offset: 4032)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !272, file: !4, line: 133, baseType: !48, size: 64, offset: 4096)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !272, file: !4, line: 134, baseType: !48, size: 64, offset: 4160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !272, file: !4, line: 135, baseType: !48, size: 64, offset: 4224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !272, file: !4, line: 136, baseType: !48, size: 64, offset: 4288)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !272, file: !4, line: 137, baseType: !48, size: 64, offset: 4352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !272, file: !4, line: 138, baseType: !48, size: 64, offset: 4416)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !272, file: !4, line: 139, baseType: !48, size: 64, offset: 4480)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !272, file: !4, line: 140, baseType: !48, size: 64, offset: 4544)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !272, file: !4, line: 141, baseType: !48, size: 64, offset: 4608)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !272, file: !4, line: 142, baseType: !48, size: 64, offset: 4672)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !272, file: !4, line: 143, baseType: !48, size: 64, offset: 4736)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !272, file: !4, line: 144, baseType: !48, size: 64, offset: 4800)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !272, file: !4, line: 145, baseType: !48, size: 64, offset: 4864)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !272, file: !4, line: 146, baseType: !48, size: 64, offset: 4928)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !272, file: !4, line: 147, baseType: !48, size: 64, offset: 4992)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !272, file: !4, line: 148, baseType: !48, size: 64, offset: 5056)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !272, file: !4, line: 149, baseType: !48, size: 64, offset: 5120)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !272, file: !4, line: 151, baseType: !48, size: 64, offset: 5184)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !272, file: !4, line: 152, baseType: !48, size: 64, offset: 5248)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !272, file: !4, line: 153, baseType: !48, size: 64, offset: 5312)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !272, file: !4, line: 154, baseType: !48, size: 64, offset: 5376)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !272, file: !4, line: 155, baseType: !48, size: 64, offset: 5440)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !272, file: !4, line: 156, baseType: !48, size: 64, offset: 5504)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !272, file: !4, line: 158, baseType: !48, size: 64, offset: 5568)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !272, file: !4, line: 159, baseType: !48, size: 64, offset: 5632)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !272, file: !4, line: 160, baseType: !48, size: 64, offset: 5696)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !272, file: !4, line: 161, baseType: !48, size: 64, offset: 5760)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !272, file: !4, line: 162, baseType: !48, size: 64, offset: 5824)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !272, file: !4, line: 163, baseType: !48, size: 64, offset: 5888)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !272, file: !4, line: 164, baseType: !48, size: 64, offset: 5952)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !272, file: !4, line: 165, baseType: !48, size: 64, offset: 6016)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !272, file: !4, line: 166, baseType: !48, size: 64, offset: 6080)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !272, file: !4, line: 167, baseType: !48, size: 64, offset: 6144)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !272, file: !4, line: 168, baseType: !48, size: 64, offset: 6208)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !272, file: !4, line: 169, baseType: !48, size: 64, offset: 6272)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !272, file: !4, line: 170, baseType: !48, size: 64, offset: 6336)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !272, file: !4, line: 171, baseType: !48, size: 64, offset: 6400)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !272, file: !4, line: 172, baseType: !48, size: 64, offset: 6464)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !272, file: !4, line: 173, baseType: !48, size: 64, offset: 6528)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !272, file: !4, line: 174, baseType: !48, size: 64, offset: 6592)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !272, file: !4, line: 175, baseType: !48, size: 64, offset: 6656)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !272, file: !4, line: 176, baseType: !48, size: 64, offset: 6720)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !272, file: !4, line: 177, baseType: !48, size: 64, offset: 6784)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !272, file: !4, line: 178, baseType: !48, size: 64, offset: 6848)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !272, file: !4, line: 179, baseType: !48, size: 64, offset: 6912)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !272, file: !4, line: 180, baseType: !48, size: 64, offset: 6976)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !272, file: !4, line: 181, baseType: !48, size: 64, offset: 7040)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !272, file: !4, line: 183, baseType: !48, size: 64, offset: 7104)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !272, file: !4, line: 184, baseType: !48, size: 64, offset: 7168)
!387 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !268, file: !1, line: 157, type: !23)
!388 = !DILocation(line: 157, column: 39, scope: !268)
!389 = !DILocalVariable(name: "x", arg: 2, scope: !268, file: !1, line: 158, type: !271)
!390 = !DILocation(line: 158, column: 31, scope: !268)
!391 = !DILocalVariable(name: "chan", arg: 3, scope: !268, file: !1, line: 158, type: !28)
!392 = !DILocation(line: 158, column: 38, scope: !268)
!393 = !DILocalVariable(name: "ret", scope: !268, file: !1, line: 160, type: !22)
!394 = !DILocation(line: 160, column: 6, scope: !268)
!395 = !DILocalVariable(name: "intr_status", scope: !268, file: !1, line: 162, type: !28)
!396 = !DILocation(line: 162, column: 6, scope: !268)
!397 = !DILocation(line: 162, column: 26, scope: !268)
!398 = !DILocation(line: 162, column: 33, scope: !268)
!399 = !DILocation(line: 162, column: 20, scope: !268)
!400 = !DILocation(line: 171, column: 6, scope: !401)
!401 = distinct !DILexicalBlock(scope: !268, file: !1, line: 171, column: 6)
!402 = !DILocation(line: 171, column: 6, scope: !268)
!403 = !DILocation(line: 172, column: 7, scope: !404)
!404 = distinct !DILexicalBlock(scope: !405, file: !1, line: 172, column: 7)
!405 = distinct !DILexicalBlock(scope: !401, file: !1, line: 171, column: 46)
!406 = !DILocation(line: 172, column: 7, scope: !405)
!407 = !DILocation(line: 173, column: 8, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !1, line: 172, column: 47)
!409 = !DILocation(line: 174, column: 4, scope: !408)
!410 = !DILocation(line: 174, column: 7, scope: !408)
!411 = !DILocation(line: 174, column: 22, scope: !408)
!412 = !DILocation(line: 175, column: 3, scope: !408)
!413 = !DILocation(line: 176, column: 7, scope: !414)
!414 = distinct !DILexicalBlock(scope: !405, file: !1, line: 176, column: 7)
!415 = !DILocation(line: 176, column: 7, scope: !405)
!416 = !DILocation(line: 177, column: 4, scope: !414)
!417 = !DILocation(line: 177, column: 7, scope: !414)
!418 = !DILocation(line: 177, column: 20, scope: !414)
!419 = !DILocation(line: 179, column: 7, scope: !420)
!420 = distinct !DILexicalBlock(scope: !405, file: !1, line: 179, column: 7)
!421 = !DILocation(line: 179, column: 7, scope: !405)
!422 = !DILocation(line: 180, column: 4, scope: !420)
!423 = !DILocation(line: 180, column: 7, scope: !420)
!424 = !DILocation(line: 180, column: 22, scope: !420)
!425 = !DILocation(line: 182, column: 7, scope: !426)
!426 = distinct !DILexicalBlock(scope: !405, file: !1, line: 182, column: 7)
!427 = !DILocation(line: 182, column: 7, scope: !405)
!428 = !DILocation(line: 183, column: 4, scope: !426)
!429 = !DILocation(line: 183, column: 7, scope: !426)
!430 = !DILocation(line: 183, column: 22, scope: !426)
!431 = !DILocation(line: 184, column: 7, scope: !432)
!432 = distinct !DILexicalBlock(scope: !405, file: !1, line: 184, column: 7)
!433 = !DILocation(line: 184, column: 7, scope: !405)
!434 = !DILocation(line: 185, column: 4, scope: !432)
!435 = !DILocation(line: 185, column: 7, scope: !432)
!436 = !DILocation(line: 185, column: 29, scope: !432)
!437 = !DILocation(line: 186, column: 7, scope: !438)
!438 = distinct !DILexicalBlock(scope: !405, file: !1, line: 186, column: 7)
!439 = !DILocation(line: 186, column: 7, scope: !405)
!440 = !DILocation(line: 187, column: 4, scope: !438)
!441 = !DILocation(line: 187, column: 7, scope: !438)
!442 = !DILocation(line: 187, column: 22, scope: !438)
!443 = !DILocation(line: 188, column: 7, scope: !444)
!444 = distinct !DILexicalBlock(scope: !405, file: !1, line: 188, column: 7)
!445 = !DILocation(line: 188, column: 7, scope: !405)
!446 = !DILocation(line: 189, column: 4, scope: !444)
!447 = !DILocation(line: 189, column: 7, scope: !444)
!448 = !DILocation(line: 189, column: 19, scope: !444)
!449 = !DILocation(line: 190, column: 7, scope: !450)
