; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/dwxgmac2_descs.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/dwxgmac2_descs.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_desc_ops = type { void (%struct.dma_desc*, i32, i32, i32, i32)*, void (%struct.dma_desc*, i32, i32)*, void (%struct.dma_desc*, i32, i32, i1, i32, i1, i1, i32)*, void (%struct.dma_desc*, i32, i32, i32, i1, i1, i32, i32)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, i32 (i8*, %struct.stmmac_extra_stats*, %struct.dma_desc*, i8*)*, i32 (%struct.dma_desc*)*, void (%struct.dma_desc*, i32)*, i32 (%struct.dma_desc*, i32)*, i32 (i8*, %struct.stmmac_extra_stats*, %struct.dma_desc*)*, void (i8*, %struct.stmmac_extra_stats*, %struct.dma_extended_desc*)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, void (i8*, i32, i64*)*, i32 (i8*, i8*, i32)*, void (i8*, i32, i1)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*, i32*)*, void (%struct.dma_desc*, i64)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*, i32*, i32*)*, void (%struct.dma_desc*, i32*)*, void (%struct.dma_desc*, i64)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*, i16, i16, i32)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_edesc*, i32, i32)* }
%struct.dma_desc = type { i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dwxgmac210_desc_ops", scope: !2, file: !3, line: 349, type: !45, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !44, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/dwxgmac2_descs.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkt_hash_types", file: !6, line: 1238, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "PKT_HASH_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PKT_HASH_TYPE_L2", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PKT_HASH_TYPE_L3", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PKT_HASH_TYPE_L4", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tx_frame_status", file: !14, line: 292, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/common.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "tx_done", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "tx_not_ls", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "tx_err", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "tx_dma_own", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_frame_status", file: !14, line: 282, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "good_frame", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "discard_frame", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "csum_none", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "llc_snap", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "dma_own", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "rx_not_ls", value: 16, isUnsigned: true)
!28 = !{!29, !31, !33, !34, !42}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !30, line: 27, baseType: !7)
!30 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !32, line: 31, baseType: !29)
!32 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_desc", file: !36, line: 158, size: 128, elements: !37)
!36 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/descs.h", directory: "/home/lizy2001/genbc/linux")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "des0", scope: !35, file: !36, line: 159, baseType: !31, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "des1", scope: !35, file: !36, line: 160, baseType: !31, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "des2", scope: !35, file: !36, line: 161, baseType: !31, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "des3", scope: !35, file: !36, line: 162, baseType: !31, size: 32, offset: 96)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !43, line: 21, baseType: !29)
!43 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!44 = !{!0}
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_desc_ops", file: !47, line: 35, size: 1984, elements: !48)
!47 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!48 = !{!49, !53, !57, !64, !68, !72, !76, !80, !81, !82, !204, !205, !206, !210, !214, !226, !227, !228, !236, !240, !244, !248, !253, !258, !259, !265, !266, !267, !271, !278, !279}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "init_rx_desc", scope: !46, file: !47, line: 37, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{null, !34, !33, !33, !33, !33}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "init_tx_desc", scope: !46, file: !47, line: 40, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !34, !33, !33}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_tx_desc", scope: !46, file: !47, line: 42, baseType: !58, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !34, !33, !33, !61, !33, !61, !61, !7}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !62, line: 30, baseType: !63)
!62 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!63 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_tso_tx_desc", scope: !46, file: !47, line: 45, baseType: !65, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !34, !33, !33, !33, !61, !61, !7, !7}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_owner", scope: !46, file: !47, line: 49, baseType: !69, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !34}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_owner", scope: !46, file: !47, line: 50, baseType: !73, size: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!33, !34}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "release_tx_desc", scope: !46, file: !47, line: 52, baseType: !77, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !34, !33}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_ic", scope: !46, file: !47, line: 55, baseType: !69, size: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_ls", scope: !46, file: !47, line: 57, baseType: !73, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tx_status", scope: !46, file: !47, line: 59, baseType: !83, size: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!33, !86, !87, !34, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !14, line: 61, size: 7680, elements: !89)
!89 = !{!90, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !88, file: !14, line: 63, baseType: !91, size: 64, align: 512)
!91 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !88, file: !14, line: 64, baseType: !91, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !88, file: !14, line: 65, baseType: !91, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !88, file: !14, line: 66, baseType: !91, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !88, file: !14, line: 67, baseType: !91, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !88, file: !14, line: 68, baseType: !91, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !88, file: !14, line: 69, baseType: !91, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !88, file: !14, line: 70, baseType: !91, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !88, file: !14, line: 71, baseType: !91, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !88, file: !14, line: 72, baseType: !91, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !88, file: !14, line: 74, baseType: !91, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !88, file: !14, line: 75, baseType: !91, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !88, file: !14, line: 76, baseType: !91, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !88, file: !14, line: 77, baseType: !91, size: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !88, file: !14, line: 78, baseType: !91, size: 64, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !88, file: !14, line: 79, baseType: !91, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !88, file: !14, line: 80, baseType: !91, size: 64, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !88, file: !14, line: 81, baseType: !91, size: 64, offset: 1088)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !88, file: !14, line: 82, baseType: !91, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !88, file: !14, line: 83, baseType: !91, size: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !88, file: !14, line: 84, baseType: !91, size: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !88, file: !14, line: 85, baseType: !91, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !88, file: !14, line: 86, baseType: !91, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !88, file: !14, line: 87, baseType: !91, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !88, file: !14, line: 88, baseType: !91, size: 64, offset: 1536)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !88, file: !14, line: 89, baseType: !91, size: 64, offset: 1600)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !88, file: !14, line: 90, baseType: !91, size: 64, offset: 1664)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !88, file: !14, line: 91, baseType: !91, size: 64, offset: 1728)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !88, file: !14, line: 93, baseType: !91, size: 64, offset: 1792)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !88, file: !14, line: 94, baseType: !91, size: 64, offset: 1856)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !88, file: !14, line: 95, baseType: !91, size: 64, offset: 1920)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !88, file: !14, line: 96, baseType: !91, size: 64, offset: 1984)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !88, file: !14, line: 97, baseType: !91, size: 64, offset: 2048)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !88, file: !14, line: 98, baseType: !91, size: 64, offset: 2112)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !88, file: !14, line: 99, baseType: !91, size: 64, offset: 2176)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !88, file: !14, line: 100, baseType: !91, size: 64, offset: 2240)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !88, file: !14, line: 101, baseType: !91, size: 64, offset: 2304)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !88, file: !14, line: 103, baseType: !91, size: 64, offset: 2368)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !88, file: !14, line: 104, baseType: !91, size: 64, offset: 2432)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !88, file: !14, line: 105, baseType: !91, size: 64, offset: 2496)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !88, file: !14, line: 106, baseType: !91, size: 64, offset: 2560)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !88, file: !14, line: 107, baseType: !91, size: 64, offset: 2624)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !88, file: !14, line: 108, baseType: !91, size: 64, offset: 2688)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !88, file: !14, line: 109, baseType: !91, size: 64, offset: 2752)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !88, file: !14, line: 110, baseType: !91, size: 64, offset: 2816)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !88, file: !14, line: 111, baseType: !91, size: 64, offset: 2880)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !88, file: !14, line: 112, baseType: !91, size: 64, offset: 2944)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !88, file: !14, line: 113, baseType: !91, size: 64, offset: 3008)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !88, file: !14, line: 115, baseType: !91, size: 64, offset: 3072)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !88, file: !14, line: 116, baseType: !91, size: 64, offset: 3136)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !88, file: !14, line: 117, baseType: !91, size: 64, offset: 3200)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !88, file: !14, line: 119, baseType: !91, size: 64, offset: 3264)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !88, file: !14, line: 120, baseType: !91, size: 64, offset: 3328)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !88, file: !14, line: 121, baseType: !91, size: 64, offset: 3392)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !88, file: !14, line: 122, baseType: !91, size: 64, offset: 3456)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !88, file: !14, line: 123, baseType: !91, size: 64, offset: 3520)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !88, file: !14, line: 125, baseType: !91, size: 64, offset: 3584)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !88, file: !14, line: 126, baseType: !91, size: 64, offset: 3648)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !88, file: !14, line: 127, baseType: !91, size: 64, offset: 3712)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !88, file: !14, line: 128, baseType: !91, size: 64, offset: 3776)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !88, file: !14, line: 129, baseType: !91, size: 64, offset: 3840)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !88, file: !14, line: 130, baseType: !91, size: 64, offset: 3904)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !88, file: !14, line: 131, baseType: !91, size: 64, offset: 3968)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !88, file: !14, line: 132, baseType: !91, size: 64, offset: 4032)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !88, file: !14, line: 133, baseType: !91, size: 64, offset: 4096)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !88, file: !14, line: 134, baseType: !91, size: 64, offset: 4160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !88, file: !14, line: 135, baseType: !91, size: 64, offset: 4224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !88, file: !14, line: 136, baseType: !91, size: 64, offset: 4288)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !88, file: !14, line: 137, baseType: !91, size: 64, offset: 4352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !88, file: !14, line: 138, baseType: !91, size: 64, offset: 4416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !88, file: !14, line: 139, baseType: !91, size: 64, offset: 4480)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !88, file: !14, line: 140, baseType: !91, size: 64, offset: 4544)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !88, file: !14, line: 141, baseType: !91, size: 64, offset: 4608)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !88, file: !14, line: 142, baseType: !91, size: 64, offset: 4672)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !88, file: !14, line: 143, baseType: !91, size: 64, offset: 4736)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !88, file: !14, line: 144, baseType: !91, size: 64, offset: 4800)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !88, file: !14, line: 145, baseType: !91, size: 64, offset: 4864)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !88, file: !14, line: 146, baseType: !91, size: 64, offset: 4928)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !88, file: !14, line: 147, baseType: !91, size: 64, offset: 4992)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !88, file: !14, line: 148, baseType: !91, size: 64, offset: 5056)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !88, file: !14, line: 149, baseType: !91, size: 64, offset: 5120)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !88, file: !14, line: 151, baseType: !91, size: 64, offset: 5184)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !88, file: !14, line: 152, baseType: !91, size: 64, offset: 5248)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !88, file: !14, line: 153, baseType: !91, size: 64, offset: 5312)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !88, file: !14, line: 154, baseType: !91, size: 64, offset: 5376)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !88, file: !14, line: 155, baseType: !91, size: 64, offset: 5440)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !88, file: !14, line: 156, baseType: !91, size: 64, offset: 5504)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !88, file: !14, line: 158, baseType: !91, size: 64, offset: 5568)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !88, file: !14, line: 159, baseType: !91, size: 64, offset: 5632)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !88, file: !14, line: 160, baseType: !91, size: 64, offset: 5696)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !88, file: !14, line: 161, baseType: !91, size: 64, offset: 5760)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !88, file: !14, line: 162, baseType: !91, size: 64, offset: 5824)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !88, file: !14, line: 163, baseType: !91, size: 64, offset: 5888)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !88, file: !14, line: 164, baseType: !91, size: 64, offset: 5952)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !88, file: !14, line: 165, baseType: !91, size: 64, offset: 6016)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !88, file: !14, line: 166, baseType: !91, size: 64, offset: 6080)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !88, file: !14, line: 167, baseType: !91, size: 64, offset: 6144)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !88, file: !14, line: 168, baseType: !91, size: 64, offset: 6208)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !88, file: !14, line: 169, baseType: !91, size: 64, offset: 6272)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !88, file: !14, line: 170, baseType: !91, size: 64, offset: 6336)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !88, file: !14, line: 171, baseType: !91, size: 64, offset: 6400)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !88, file: !14, line: 172, baseType: !91, size: 64, offset: 6464)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !88, file: !14, line: 173, baseType: !91, size: 64, offset: 6528)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !88, file: !14, line: 174, baseType: !91, size: 64, offset: 6592)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !88, file: !14, line: 175, baseType: !91, size: 64, offset: 6656)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !88, file: !14, line: 176, baseType: !91, size: 64, offset: 6720)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !88, file: !14, line: 177, baseType: !91, size: 64, offset: 6784)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !88, file: !14, line: 178, baseType: !91, size: 64, offset: 6848)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !88, file: !14, line: 179, baseType: !91, size: 64, offset: 6912)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !88, file: !14, line: 180, baseType: !91, size: 64, offset: 6976)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !88, file: !14, line: 181, baseType: !91, size: 64, offset: 7040)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !88, file: !14, line: 183, baseType: !91, size: 64, offset: 7104)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !88, file: !14, line: 184, baseType: !91, size: 64, offset: 7168)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_len", scope: !46, file: !47, line: 62, baseType: !73, size: 64, offset: 640)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_owner", scope: !46, file: !47, line: 64, baseType: !77, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_frame_len", scope: !46, file: !47, line: 66, baseType: !207, size: 64, offset: 768)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!33, !34, !33}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "rx_status", scope: !46, file: !47, line: 68, baseType: !211, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!33, !86, !87, !34}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "rx_extended_status", scope: !46, file: !47, line: 70, baseType: !215, size: 64, offset: 896)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !86, !87, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_extended_desc", file: !36, line: 166, size: 256, elements: !220)
!220 = !{!221, !222, !223, !224, !225}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !219, file: !36, line: 167, baseType: !35, size: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "des4", scope: !219, file: !36, line: 168, baseType: !31, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "des5", scope: !219, file: !36, line: 169, baseType: !31, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "des6", scope: !219, file: !36, line: 170, baseType: !31, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "des7", scope: !219, file: !36, line: 171, baseType: !31, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tx_timestamp", scope: !46, file: !47, line: 73, baseType: !69, size: 64, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_timestamp_status", scope: !46, file: !47, line: 75, baseType: !73, size: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "get_timestamp", scope: !46, file: !47, line: 77, baseType: !229, size: 64, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !86, !42, !232}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !43, line: 23, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !30, line: 31, baseType: !235)
!235 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_timestamp_status", scope: !46, file: !47, line: 79, baseType: !237, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!33, !86, !86, !42}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "display_ring", scope: !46, file: !47, line: 81, baseType: !241, size: 64, offset: 1216)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !86, !7, !61}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "set_mss", scope: !46, file: !47, line: 83, baseType: !245, size: 64, offset: 1280)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !34, !7}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "get_addr", scope: !46, file: !47, line: 85, baseType: !249, size: 64, offset: 1344)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !34, !252}
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "set_addr", scope: !46, file: !47, line: 87, baseType: !254, size: 64, offset: 1408)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !34, !257}
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !62, line: 143, baseType: !233)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !46, file: !47, line: 89, baseType: !69, size: 64, offset: 1472)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_hash", scope: !46, file: !47, line: 91, baseType: !260, size: 64, offset: 1536)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{!33, !34, !263, !264}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_header_len", scope: !46, file: !47, line: 93, baseType: !249, size: 64, offset: 1600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "set_sec_addr", scope: !46, file: !47, line: 94, baseType: !254, size: 64, offset: 1664)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "set_sarc", scope: !46, file: !47, line: 95, baseType: !268, size: 64, offset: 1728)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !34, !42}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set_vlan_tag", scope: !46, file: !47, line: 96, baseType: !272, size: 64, offset: 1792)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !34, !275, !275, !42}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !43, line: 19, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !30, line: 24, baseType: !277)
!277 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "set_vlan", scope: !46, file: !47, line: 98, baseType: !268, size: 64, offset: 1856)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "set_tbs", scope: !46, file: !47, line: 99, baseType: !280, size: 64, offset: 1920)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !283, !42, !42}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_edesc", file: !36, line: 175, size: 256, elements: !285)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "des4", scope: !284, file: !36, line: 176, baseType: !31, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "des5", scope: !284, file: !36, line: 177, baseType: !31, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "des6", scope: !284, file: !36, line: 178, baseType: !31, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "des7", scope: !284, file: !36, line: 179, baseType: !31, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !284, file: !36, line: 180, baseType: !35, size: 128, offset: 128)
!291 = !{i32 7, !"Dwarf Version", i32 4}
!292 = !{i32 2, !"Debug Info Version", i32 3}
!293 = !{i32 1, !"wchar_size", i32 2}
!294 = !{i32 1, !"Code Model", i32 2}
!295 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!296 = distinct !DISubprogram(name: "dwxgmac2_init_rx_desc", scope: !3, file: !3, line: 129, type: !51, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !297)
!297 = !{}
!298 = !DILocalVariable(name: "p", arg: 1, scope: !296, file: !3, line: 129, type: !34)
!299 = !DILocation(line: 129, column: 52, scope: !296)
!300 = !DILocalVariable(name: "disable_rx_ic", arg: 2, scope: !296, file: !3, line: 129, type: !33)
!301 = !DILocation(line: 129, column: 59, scope: !296)
!302 = !DILocalVariable(name: "mode", arg: 3, scope: !296, file: !3, line: 130, type: !33)
!303 = !DILocation(line: 130, column: 11, scope: !296)
!304 = !DILocalVariable(name: "end", arg: 4, scope: !296, file: !3, line: 130, type: !33)
!305 = !DILocation(line: 130, column: 21, scope: !296)
!306 = !DILocalVariable(name: "bfsize", arg: 5, scope: !296, file: !3, line: 130, type: !33)
!307 = !DILocation(line: 130, column: 30, scope: !296)
!308 = !DILocation(line: 132, column: 24, scope: !296)
!309 = !DILocation(line: 132, column: 27, scope: !296)
!310 = !DILocation(line: 132, column: 2, scope: !296)
!311 = !DILocation(line: 133, column: 1, scope: !296)
!312 = distinct !DISubprogram(name: "dwxgmac2_init_tx_desc", scope: !3, file: !3, line: 135, type: !55, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !297)
!313 = !DILocalVariable(name: "p", arg: 1, scope: !312, file: !3, line: 135, type: !34)
!314 = !DILocation(line: 135, column: 52, scope: !312)
!315 = !DILocalVariable(name: "mode", arg: 2, scope: !312, file: !3, line: 135, type: !33)
!316 = !DILocation(line: 135, column: 59, scope: !312)
!317 = !DILocalVariable(name: "end", arg: 3, scope: !312, file: !3, line: 135, type: !33)
!318 = !DILocation(line: 135, column: 69, scope: !312)
!319 = !DILocation(line: 137, column: 2, scope: !312)
!320 = !DILocation(line: 137, column: 5, scope: !312)
!321 = !DILocation(line: 137, column: 10, scope: !312)
!322 = !DILocation(line: 138, column: 2, scope: !312)
!323 = !DILocation(line: 138, column: 5, scope: !312)
!324 = !DILocation(line: 138, column: 10, scope: !312)
!325 = !DILocation(line: 139, column: 2, scope: !312)
!326 = !DILocation(line: 139, column: 5, scope: !312)
!327 = !DILocation(line: 139, column: 10, scope: !312)
!328 = !DILocation(line: 140, column: 2, scope: !312)
!329 = !DILocation(line: 140, column: 5, scope: !312)
!330 = !DILocation(line: 140, column: 10, scope: !312)
!331 = !DILocation(line: 141, column: 1, scope: !312)
!332 = distinct !DISubprogram(name: "dwxgmac2_prepare_tx_desc", scope: !3, file: !3, line: 143, type: !59, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !297)
!333 = !DILocalVariable(name: "p", arg: 1, scope: !332, file: !3, line: 143, type: !34)
!334 = !DILocation(line: 143, column: 55, scope: !332)
!335 = !DILocalVariable(name: "is_fs", arg: 2, scope: !332, file: !3, line: 143, type: !33)
!336 = !DILocation(line: 143, column: 62, scope: !332)
!337 = !DILocalVariable(name: "len", arg: 3, scope: !332, file: !3, line: 143, type: !33)
!338 = !DILocation(line: 143, column: 73, scope: !332)
!339 = !DILocalVariable(name: "csum_flag", arg: 4, scope: !332, file: !3, line: 144, type: !61)
!340 = !DILocation(line: 144, column: 15, scope: !332)
!341 = !DILocalVariable(name: "mode", arg: 5, scope: !332, file: !3, line: 144, type: !33)
!342 = !DILocation(line: 144, column: 30, scope: !332)
!343 = !DILocalVariable(name: "tx_own", arg: 6, scope: !332, file: !3, line: 144, type: !61)
