; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/dwxgmac2_dma.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/dwxgmac2_dma.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_dma_ops = type { i32 (i8*)*, void (i8*, %struct.stmmac_dma_cfg*, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i64, i32)*, void (i8*, %struct.stmmac_dma_cfg*, i64, i32)*, void (i8*, %struct.stmmac_axi*)*, void (i8*, i32*)*, void (i8*, i32, i32, i32, i8)*, void (i8*, i32, i32, i32, i8)*, void (i8*, %struct.stmmac_extra_stats*, i8*)*, void (i8*)*, void (i8*, i32, i1, i1)*, void (i8*, i32, i1, i1)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i32)*, void (i8*, i32)*, i32 (i8*, %struct.stmmac_extra_stats*, i32)*, void (i8*, %struct.dma_features*)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i32, i32)*, void (i8*, i1, i32)*, void (i8*, i32, i8)*, void (i8*, i32, i32)*, void (i8*, i1, i32)*, i32 (i8*, i1, i32)* }
%struct.stmmac_dma_cfg = type { i32, i32, i32, i8, i32, i32, i8, i8 }
%struct.stmmac_axi = type { i8, i8, i32, i32, i8, [7 x i32], i8, i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dwxgmac210_dma_ops", scope: !2, file: !3, line: 549, type: !22, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !21, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/dwxgmac2_dma.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dma_irq_status", file: !6, line: 299, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/common.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "tx_hard_error", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "tx_hard_error_bump_tc", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "handle_rx", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "handle_tx", value: 8, isUnsigned: true)
!13 = !{!14, !16, !17}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !18, line: 21, baseType: !19)
!18 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !20, line: 27, baseType: !7)
!20 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!0}
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_dma_ops", file: !24, line: 169, size: 1856, elements: !25)
!24 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!25 = !{!26, !31, !50, !54, !62, !63, !82, !87, !94, !95, !216, !220, !224, !225, !229, !230, !231, !232, !236, !289, !293, !294, !295, !296, !297, !301, !305, !309, !310}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !23, file: !24, line: 171, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{!16, !30}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !23, file: !24, line: 172, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !30, !35, !16}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_dma_cfg", file: !37, line: 89, size: 224, elements: !38)
!37 = !DIFile(filename: "./include/linux/stmmac.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !46, !47, !48, !49}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pbl", scope: !36, file: !37, line: 90, baseType: !16, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "txpbl", scope: !36, file: !37, line: 91, baseType: !16, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "rxpbl", scope: !36, file: !37, line: 92, baseType: !16, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pblx8", scope: !36, file: !37, line: 93, baseType: !43, size: 8, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !44, line: 30, baseType: !45)
!44 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!45 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_burst", scope: !36, file: !37, line: 94, baseType: !16, size: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mixed_burst", scope: !36, file: !37, line: 95, baseType: !16, size: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "aal", scope: !36, file: !37, line: 96, baseType: !43, size: 8, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "eame", scope: !36, file: !37, line: 97, baseType: !43, size: 8, offset: 200)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "init_chan", scope: !23, file: !24, line: 174, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !30, !35, !17}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "init_rx_chan", scope: !23, file: !24, line: 176, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !30, !35, !58, !17}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !44, line: 143, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !18, line: 23, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !20, line: 31, baseType: !61)
!61 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "init_tx_chan", scope: !23, file: !24, line: 179, baseType: !55, size: 64, offset: 256)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "axi", scope: !23, file: !24, line: 183, baseType: !64, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !30, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_axi", file: !37, line: 101, size: 384, elements: !69)
!69 = !{!70, !71, !72, !73, !74, !75, !79, !80, !81}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "axi_lpi_en", scope: !68, file: !37, line: 102, baseType: !43, size: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "axi_xit_frm", scope: !68, file: !37, line: 103, baseType: !43, size: 8, offset: 8)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "axi_wr_osr_lmt", scope: !68, file: !37, line: 104, baseType: !17, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "axi_rd_osr_lmt", scope: !68, file: !37, line: 105, baseType: !17, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "axi_kbbe", scope: !68, file: !37, line: 106, baseType: !43, size: 8, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "axi_blen", scope: !68, file: !37, line: 107, baseType: !76, size: 224, offset: 128)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 224, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 7)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "axi_fb", scope: !68, file: !37, line: 108, baseType: !43, size: 8, offset: 352)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "axi_mb", scope: !68, file: !37, line: 109, baseType: !43, size: 8, offset: 360)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "axi_rb", scope: !68, file: !37, line: 110, baseType: !43, size: 8, offset: 368)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "dump_regs", scope: !23, file: !24, line: 185, baseType: !83, size: 64, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{null, !30, !86}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dma_rx_mode", scope: !23, file: !24, line: 186, baseType: !88, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !30, !16, !17, !16, !91}
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !18, line: 17, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !20, line: 21, baseType: !93)
!93 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dma_tx_mode", scope: !23, file: !24, line: 188, baseType: !88, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dma_diagnostic_fr", scope: !23, file: !24, line: 191, baseType: !96, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !30, !99, !30}
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !6, line: 61, size: 7680, elements: !101)
!101 = !{!102, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !100, file: !6, line: 63, baseType: !103, size: 64, align: 512)
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !100, file: !6, line: 64, baseType: !103, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !100, file: !6, line: 65, baseType: !103, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !100, file: !6, line: 66, baseType: !103, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !100, file: !6, line: 67, baseType: !103, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !100, file: !6, line: 68, baseType: !103, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !100, file: !6, line: 69, baseType: !103, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !100, file: !6, line: 70, baseType: !103, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !100, file: !6, line: 71, baseType: !103, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !100, file: !6, line: 72, baseType: !103, size: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !100, file: !6, line: 74, baseType: !103, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !100, file: !6, line: 75, baseType: !103, size: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !100, file: !6, line: 76, baseType: !103, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !100, file: !6, line: 77, baseType: !103, size: 64, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !100, file: !6, line: 78, baseType: !103, size: 64, offset: 896)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !100, file: !6, line: 79, baseType: !103, size: 64, offset: 960)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !100, file: !6, line: 80, baseType: !103, size: 64, offset: 1024)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !100, file: !6, line: 81, baseType: !103, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !100, file: !6, line: 82, baseType: !103, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !100, file: !6, line: 83, baseType: !103, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !100, file: !6, line: 84, baseType: !103, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !100, file: !6, line: 85, baseType: !103, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !100, file: !6, line: 86, baseType: !103, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !100, file: !6, line: 87, baseType: !103, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !100, file: !6, line: 88, baseType: !103, size: 64, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !100, file: !6, line: 89, baseType: !103, size: 64, offset: 1600)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !100, file: !6, line: 90, baseType: !103, size: 64, offset: 1664)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !100, file: !6, line: 91, baseType: !103, size: 64, offset: 1728)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !100, file: !6, line: 93, baseType: !103, size: 64, offset: 1792)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !100, file: !6, line: 94, baseType: !103, size: 64, offset: 1856)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !100, file: !6, line: 95, baseType: !103, size: 64, offset: 1920)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !100, file: !6, line: 96, baseType: !103, size: 64, offset: 1984)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !100, file: !6, line: 97, baseType: !103, size: 64, offset: 2048)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !100, file: !6, line: 98, baseType: !103, size: 64, offset: 2112)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !100, file: !6, line: 99, baseType: !103, size: 64, offset: 2176)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !100, file: !6, line: 100, baseType: !103, size: 64, offset: 2240)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !100, file: !6, line: 101, baseType: !103, size: 64, offset: 2304)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !100, file: !6, line: 103, baseType: !103, size: 64, offset: 2368)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !100, file: !6, line: 104, baseType: !103, size: 64, offset: 2432)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !100, file: !6, line: 105, baseType: !103, size: 64, offset: 2496)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !100, file: !6, line: 106, baseType: !103, size: 64, offset: 2560)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !100, file: !6, line: 107, baseType: !103, size: 64, offset: 2624)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !100, file: !6, line: 108, baseType: !103, size: 64, offset: 2688)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !100, file: !6, line: 109, baseType: !103, size: 64, offset: 2752)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !100, file: !6, line: 110, baseType: !103, size: 64, offset: 2816)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !100, file: !6, line: 111, baseType: !103, size: 64, offset: 2880)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !100, file: !6, line: 112, baseType: !103, size: 64, offset: 2944)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !100, file: !6, line: 113, baseType: !103, size: 64, offset: 3008)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !100, file: !6, line: 115, baseType: !103, size: 64, offset: 3072)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !100, file: !6, line: 116, baseType: !103, size: 64, offset: 3136)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !100, file: !6, line: 117, baseType: !103, size: 64, offset: 3200)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !100, file: !6, line: 119, baseType: !103, size: 64, offset: 3264)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !100, file: !6, line: 120, baseType: !103, size: 64, offset: 3328)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !100, file: !6, line: 121, baseType: !103, size: 64, offset: 3392)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !100, file: !6, line: 122, baseType: !103, size: 64, offset: 3456)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !100, file: !6, line: 123, baseType: !103, size: 64, offset: 3520)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !100, file: !6, line: 125, baseType: !103, size: 64, offset: 3584)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !100, file: !6, line: 126, baseType: !103, size: 64, offset: 3648)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !100, file: !6, line: 127, baseType: !103, size: 64, offset: 3712)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !100, file: !6, line: 128, baseType: !103, size: 64, offset: 3776)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !100, file: !6, line: 129, baseType: !103, size: 64, offset: 3840)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !100, file: !6, line: 130, baseType: !103, size: 64, offset: 3904)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !100, file: !6, line: 131, baseType: !103, size: 64, offset: 3968)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !100, file: !6, line: 132, baseType: !103, size: 64, offset: 4032)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !100, file: !6, line: 133, baseType: !103, size: 64, offset: 4096)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !100, file: !6, line: 134, baseType: !103, size: 64, offset: 4160)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !100, file: !6, line: 135, baseType: !103, size: 64, offset: 4224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !100, file: !6, line: 136, baseType: !103, size: 64, offset: 4288)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !100, file: !6, line: 137, baseType: !103, size: 64, offset: 4352)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !100, file: !6, line: 138, baseType: !103, size: 64, offset: 4416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !100, file: !6, line: 139, baseType: !103, size: 64, offset: 4480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !100, file: !6, line: 140, baseType: !103, size: 64, offset: 4544)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !100, file: !6, line: 141, baseType: !103, size: 64, offset: 4608)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !100, file: !6, line: 142, baseType: !103, size: 64, offset: 4672)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !100, file: !6, line: 143, baseType: !103, size: 64, offset: 4736)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !100, file: !6, line: 144, baseType: !103, size: 64, offset: 4800)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !100, file: !6, line: 145, baseType: !103, size: 64, offset: 4864)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !100, file: !6, line: 146, baseType: !103, size: 64, offset: 4928)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !100, file: !6, line: 147, baseType: !103, size: 64, offset: 4992)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !100, file: !6, line: 148, baseType: !103, size: 64, offset: 5056)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !100, file: !6, line: 149, baseType: !103, size: 64, offset: 5120)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !100, file: !6, line: 151, baseType: !103, size: 64, offset: 5184)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !100, file: !6, line: 152, baseType: !103, size: 64, offset: 5248)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !100, file: !6, line: 153, baseType: !103, size: 64, offset: 5312)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !100, file: !6, line: 154, baseType: !103, size: 64, offset: 5376)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !100, file: !6, line: 155, baseType: !103, size: 64, offset: 5440)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !100, file: !6, line: 156, baseType: !103, size: 64, offset: 5504)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !100, file: !6, line: 158, baseType: !103, size: 64, offset: 5568)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !100, file: !6, line: 159, baseType: !103, size: 64, offset: 5632)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !100, file: !6, line: 160, baseType: !103, size: 64, offset: 5696)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !100, file: !6, line: 161, baseType: !103, size: 64, offset: 5760)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !100, file: !6, line: 162, baseType: !103, size: 64, offset: 5824)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !100, file: !6, line: 163, baseType: !103, size: 64, offset: 5888)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !100, file: !6, line: 164, baseType: !103, size: 64, offset: 5952)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !100, file: !6, line: 165, baseType: !103, size: 64, offset: 6016)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !100, file: !6, line: 166, baseType: !103, size: 64, offset: 6080)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !100, file: !6, line: 167, baseType: !103, size: 64, offset: 6144)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !100, file: !6, line: 168, baseType: !103, size: 64, offset: 6208)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !100, file: !6, line: 169, baseType: !103, size: 64, offset: 6272)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !100, file: !6, line: 170, baseType: !103, size: 64, offset: 6336)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !100, file: !6, line: 171, baseType: !103, size: 64, offset: 6400)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !100, file: !6, line: 172, baseType: !103, size: 64, offset: 6464)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !100, file: !6, line: 173, baseType: !103, size: 64, offset: 6528)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !100, file: !6, line: 174, baseType: !103, size: 64, offset: 6592)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !100, file: !6, line: 175, baseType: !103, size: 64, offset: 6656)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !100, file: !6, line: 176, baseType: !103, size: 64, offset: 6720)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !100, file: !6, line: 177, baseType: !103, size: 64, offset: 6784)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !100, file: !6, line: 178, baseType: !103, size: 64, offset: 6848)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !100, file: !6, line: 179, baseType: !103, size: 64, offset: 6912)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !100, file: !6, line: 180, baseType: !103, size: 64, offset: 6976)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !100, file: !6, line: 181, baseType: !103, size: 64, offset: 7040)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !100, file: !6, line: 183, baseType: !103, size: 64, offset: 7104)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !100, file: !6, line: 184, baseType: !103, size: 64, offset: 7168)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dma_transmission", scope: !23, file: !24, line: 193, baseType: !217, size: 64, offset: 640)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !30}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "enable_dma_irq", scope: !23, file: !24, line: 194, baseType: !221, size: 64, offset: 704)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{null, !30, !17, !43, !43}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dma_irq", scope: !23, file: !24, line: 196, baseType: !221, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "start_tx", scope: !23, file: !24, line: 198, baseType: !226, size: 64, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !30, !17}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "stop_tx", scope: !23, file: !24, line: 199, baseType: !226, size: 64, offset: 896)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start_rx", scope: !23, file: !24, line: 200, baseType: !226, size: 64, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "stop_rx", scope: !23, file: !24, line: 201, baseType: !226, size: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dma_interrupt", scope: !23, file: !24, line: 202, baseType: !233, size: 64, offset: 1088)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!16, !30, !99, !17}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "get_hw_feature", scope: !23, file: !24, line: 205, baseType: !237, size: 64, offset: 1152)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !30, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_features", file: !6, line: 326, size: 1472, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mbps_10_100", scope: !241, file: !6, line: 327, baseType: !7, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mbps_1000", scope: !241, file: !6, line: 328, baseType: !7, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "half_duplex", scope: !241, file: !6, line: 329, baseType: !7, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "hash_filter", scope: !241, file: !6, line: 330, baseType: !7, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "multi_addr", scope: !241, file: !6, line: 331, baseType: !7, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pcs", scope: !241, file: !6, line: 332, baseType: !7, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sma_mdio", scope: !241, file: !6, line: 333, baseType: !7, size: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pmt_remote_wake_up", scope: !241, file: !6, line: 334, baseType: !7, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pmt_magic_frame", scope: !241, file: !6, line: 335, baseType: !7, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "rmon", scope: !241, file: !6, line: 336, baseType: !7, size: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "time_stamp", scope: !241, file: !6, line: 338, baseType: !7, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "atime_stamp", scope: !241, file: !6, line: 340, baseType: !7, size: 32, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "eee", scope: !241, file: !6, line: 342, baseType: !7, size: 32, offset: 384)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "av", scope: !241, file: !6, line: 343, baseType: !7, size: 32, offset: 416)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hash_tb_sz", scope: !241, file: !6, line: 344, baseType: !7, size: 32, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tsoen", scope: !241, file: !6, line: 345, baseType: !7, size: 32, offset: 480)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "tx_coe", scope: !241, file: !6, line: 347, baseType: !7, size: 32, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe", scope: !241, file: !6, line: 348, baseType: !7, size: 32, offset: 544)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe_type1", scope: !241, file: !6, line: 349, baseType: !7, size: 32, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rx_coe_type2", scope: !241, file: !6, line: 350, baseType: !7, size: 32, offset: 608)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rxfifo_over_2048", scope: !241, file: !6, line: 351, baseType: !7, size: 32, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "number_rx_channel", scope: !241, file: !6, line: 353, baseType: !7, size: 32, offset: 672)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "number_tx_channel", scope: !241, file: !6, line: 354, baseType: !7, size: 32, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "number_rx_queues", scope: !241, file: !6, line: 356, baseType: !7, size: 32, offset: 736)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "number_tx_queues", scope: !241, file: !6, line: 357, baseType: !7, size: 32, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pps_out_num", scope: !241, file: !6, line: 359, baseType: !7, size: 32, offset: 800)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "enh_desc", scope: !241, file: !6, line: 361, baseType: !7, size: 32, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_size", scope: !241, file: !6, line: 363, baseType: !7, size: 32, offset: 864)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_size", scope: !241, file: !6, line: 364, baseType: !7, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "asp", scope: !241, file: !6, line: 366, baseType: !7, size: 32, offset: 928)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "frpsel", scope: !241, file: !6, line: 368, baseType: !7, size: 32, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "frpbs", scope: !241, file: !6, line: 369, baseType: !7, size: 32, offset: 992)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "frpes", scope: !241, file: !6, line: 370, baseType: !7, size: 32, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "addr64", scope: !241, file: !6, line: 371, baseType: !7, size: 32, offset: 1056)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rssen", scope: !241, file: !6, line: 372, baseType: !7, size: 32, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vlhash", scope: !241, file: !6, line: 373, baseType: !7, size: 32, offset: 1120)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sphen", scope: !241, file: !6, line: 374, baseType: !7, size: 32, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vlins", scope: !241, file: !6, line: 375, baseType: !7, size: 32, offset: 1184)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "dvlan", scope: !241, file: !6, line: 376, baseType: !7, size: 32, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "l3l4fnum", scope: !241, file: !6, line: 377, baseType: !7, size: 32, offset: 1248)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "arpoffsel", scope: !241, file: !6, line: 378, baseType: !7, size: 32, offset: 1280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "estwid", scope: !241, file: !6, line: 380, baseType: !7, size: 32, offset: 1312)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "estdep", scope: !241, file: !6, line: 381, baseType: !7, size: 32, offset: 1344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "estsel", scope: !241, file: !6, line: 382, baseType: !7, size: 32, offset: 1376)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fpesel", scope: !241, file: !6, line: 383, baseType: !7, size: 32, offset: 1408)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tbssel", scope: !241, file: !6, line: 384, baseType: !7, size: 32, offset: 1440)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !23, file: !24, line: 208, baseType: !290, size: 64, offset: 1216)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !30, !17, !17}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_ring_len", scope: !23, file: !24, line: 209, baseType: !290, size: 64, offset: 1280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_ring_len", scope: !23, file: !24, line: 210, baseType: !290, size: 64, offset: 1344)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_tail_ptr", scope: !23, file: !24, line: 211, baseType: !290, size: 64, offset: 1408)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_tail_ptr", scope: !23, file: !24, line: 212, baseType: !290, size: 64, offset: 1472)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tso", scope: !23, file: !24, line: 213, baseType: !298, size: 64, offset: 1536)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !30, !43, !17}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "qmode", scope: !23, file: !24, line: 214, baseType: !302, size: 64, offset: 1600)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !30, !17, !91}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "set_bfsize", scope: !23, file: !24, line: 215, baseType: !306, size: 64, offset: 1664)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !30, !16, !17}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "enable_sph", scope: !23, file: !24, line: 216, baseType: !298, size: 64, offset: 1728)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tbs", scope: !23, file: !24, line: 217, baseType: !311, size: 64, offset: 1792)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!16, !30, !43, !17}
!314 = !{i32 7, !"Dwarf Version", i32 4}
!315 = !{i32 2, !"Debug Info Version", i32 3}
!316 = !{i32 1, !"wchar_size", i32 2}
!317 = !{i32 1, !"Code Model", i32 2}
!318 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!319 = distinct !DISubprogram(name: "dwxgmac2_dma_reset", scope: !3, file: !3, line: 11, type: !28, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !320)
!320 = !{}
!321 = !DILocalVariable(name: "ioaddr", arg: 1, scope: !319, file: !3, line: 11, type: !30)
!322 = !DILocation(line: 11, column: 45, scope: !319)
!323 = !DILocalVariable(name: "value", scope: !319, file: !3, line: 13, type: !17)
!324 = !DILocation(line: 13, column: 6, scope: !319)
!325 = !DILocation(line: 13, column: 20, scope: !319)
!326 = !DILocation(line: 13, column: 27, scope: !319)
!327 = !DILocation(line: 13, column: 14, scope: !319)
!328 = !DILocation(line: 16, column: 9, scope: !319)
!329 = !DILocation(line: 16, column: 15, scope: !319)
!330 = !DILocation(line: 16, column: 28, scope: !319)
!331 = !DILocation(line: 16, column: 35, scope: !319)
!332 = !DILocation(line: 16, column: 2, scope: !319)
!333 = !DILocalVariable(name: "__timeout_us", scope: !334, file: !3, line: 18, type: !59)
!334 = distinct !DILexicalBlock(scope: !319, file: !3, line: 18, column: 9)
!335 = !DILocation(line: 18, column: 9, scope: !334)
!336 = !DILocalVariable(name: "__sleep_us", scope: !334, file: !3, line: 18, type: !103)
!337 = !DILocalVariable(name: "__timeout", scope: !334, file: !3, line: 18, type: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !339, line: 29, baseType: !340)
!339 = !DIFile(filename: "./include/linux/ktime.h", directory: "/home/lizy2001/genbc/linux")
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !18, line: 22, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !20, line: 30, baseType: !342)
!342 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!343 = !DILocation(line: 18, column: 9, scope: !344)
!344 = distinct !DILexicalBlock(scope: !345, file: !3, line: 18, column: 9)
!345 = distinct !DILexicalBlock(scope: !334, file: !3, line: 18, column: 9)
!346 = !DILocation(line: 18, column: 9, scope: !345)
!347 = !DILocation(line: 18, column: 9, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 18, column: 9)
!349 = !DILocation(line: 18, column: 9, scope: !350)
!350 = distinct !DILexicalBlock(scope: !348, file: !3, line: 18, column: 9)
!351 = !DILocation(line: 18, column: 9, scope: !352)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 18, column: 9)
!353 = distinct !DILexicalBlock(scope: !354, file: !3, line: 18, column: 9)
!354 = distinct !DILexicalBlock(scope: !334, file: !3, line: 18, column: 9)
!355 = !DILocation(line: 18, column: 9, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 18, column: 9)
!357 = !DILocation(line: 18, column: 9, scope: !358)
!358 = distinct !DILexicalBlock(scope: !352, file: !3, line: 18, column: 9)
!359 = !DILocation(line: 18, column: 9, scope: !360)
!360 = distinct !DILexicalBlock(scope: !358, file: !3, line: 18, column: 9)
!361 = !DILocation(line: 18, column: 9, scope: !362)
!362 = distinct !DILexicalBlock(scope: !352, file: !3, line: 18, column: 9)
!363 = !DILocation(line: 18, column: 9, scope: !353)
!364 = distinct !{!364, !365, !365}
!365 = !DILocation(line: 18, column: 9, scope: !354)
!366 = !DILocation(line: 18, column: 2, scope: !319)
