; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/enh_desc.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/enh_desc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_desc_ops = type { void (%struct.dma_desc*, i32, i32, i32, i32)*, void (%struct.dma_desc*, i32, i32)*, void (%struct.dma_desc*, i32, i32, i1, i32, i1, i1, i32)*, void (%struct.dma_desc*, i32, i32, i32, i1, i1, i32, i32)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, i32 (i8*, %struct.stmmac_extra_stats*, %struct.dma_desc*, i8*)*, i32 (%struct.dma_desc*)*, void (%struct.dma_desc*, i32)*, i32 (%struct.dma_desc*, i32)*, i32 (i8*, %struct.stmmac_extra_stats*, %struct.dma_desc*)*, void (i8*, %struct.stmmac_extra_stats*, %struct.dma_extended_desc*)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, void (i8*, i32, i64*)*, i32 (i8*, i8*, i32)*, void (i8*, i32, i1)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*, i32*)*, void (%struct.dma_desc*, i64)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*, i32*, i32*)*, void (%struct.dma_desc*, i32*)*, void (%struct.dma_desc*, i64)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*, i16, i16, i32)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_edesc*, i32, i32)* }
%struct.dma_desc = type { i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "enh_desc_ops", scope: !2, file: !3, line: 455, type: !85, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !84, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/enh_desc.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkt_hash_types", file: !6, line: 1238, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "PKT_HASH_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PKT_HASH_TYPE_L2", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PKT_HASH_TYPE_L3", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PKT_HASH_TYPE_L4", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tx_frame_status", file: !14, line: 292, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/common.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "tx_done", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "tx_not_ls", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "tx_err", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "tx_dma_own", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_frame_status", file: !14, line: 282, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "good_frame", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "discard_frame", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "csum_none", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "llc_snap", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "dma_own", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "rx_not_ls", value: 16, isUnsigned: true)
!28 = !{!29, !31, !33, !34, !36, !64, !79, !80, !7, !41}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !30, line: 31, baseType: !31)
!30 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !32, line: 27, baseType: !7)
!32 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !35, line: 21, baseType: !31)
!35 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !38, line: 169, size: 1472, elements: !39)
!38 = !DIFile(filename: "./include/linux/netdevice.h", directory: "/home/lizy2001/genbc/linux")
!39 = !{!40, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !37, file: !38, line: 170, baseType: !41, size: 64)
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !37, file: !38, line: 171, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !37, file: !38, line: 172, baseType: !41, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !37, file: !38, line: 173, baseType: !41, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !37, file: !38, line: 174, baseType: !41, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !37, file: !38, line: 175, baseType: !41, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !37, file: !38, line: 176, baseType: !41, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !37, file: !38, line: 177, baseType: !41, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !37, file: !38, line: 178, baseType: !41, size: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !37, file: !38, line: 179, baseType: !41, size: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !37, file: !38, line: 180, baseType: !41, size: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !37, file: !38, line: 181, baseType: !41, size: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !37, file: !38, line: 182, baseType: !41, size: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !37, file: !38, line: 183, baseType: !41, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !37, file: !38, line: 184, baseType: !41, size: 64, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !37, file: !38, line: 185, baseType: !41, size: 64, offset: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !37, file: !38, line: 186, baseType: !41, size: 64, offset: 1024)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !37, file: !38, line: 187, baseType: !41, size: 64, offset: 1088)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !37, file: !38, line: 188, baseType: !41, size: 64, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !37, file: !38, line: 189, baseType: !41, size: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !37, file: !38, line: 190, baseType: !41, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !37, file: !38, line: 191, baseType: !41, size: 64, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !37, file: !38, line: 192, baseType: !41, size: 64, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_extended_desc", file: !66, line: 166, size: 256, elements: !67)
!66 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/descs.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !75, !76, !77, !78}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !65, file: !66, line: 167, baseType: !69, size: 128)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_desc", file: !66, line: 158, size: 128, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "des0", scope: !69, file: !66, line: 159, baseType: !29, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "des1", scope: !69, file: !66, line: 160, baseType: !29, size: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "des2", scope: !69, file: !66, line: 161, baseType: !29, size: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "des3", scope: !69, file: !66, line: 162, baseType: !29, size: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "des4", scope: !65, file: !66, line: 168, baseType: !29, size: 32, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "des5", scope: !65, file: !66, line: 169, baseType: !29, size: 32, offset: 160)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "des6", scope: !65, file: !66, line: 170, baseType: !29, size: 32, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "des7", scope: !65, file: !66, line: 171, baseType: !29, size: 32, offset: 224)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !35, line: 23, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !32, line: 31, baseType: !83)
!83 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!84 = !{!0}
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_desc_ops", file: !87, line: 35, size: 1984, elements: !88)
!87 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!88 = !{!89, !93, !97, !104, !108, !112, !116, !120, !121, !122, !243, !244, !245, !249, !253, !257, !258, !259, !263, !267, !271, !275, !280, !285, !286, !292, !293, !294, !298, !305, !306}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "init_rx_desc", scope: !86, file: !87, line: 37, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !79, !33, !33, !33, !33}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "init_tx_desc", scope: !86, file: !87, line: 40, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !79, !33, !33}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_tx_desc", scope: !86, file: !87, line: 42, baseType: !98, size: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !79, !33, !33, !101, !33, !101, !101, !7}
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !102, line: 30, baseType: !103)
!102 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!103 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_tso_tx_desc", scope: !86, file: !87, line: 45, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !79, !33, !33, !33, !101, !101, !7, !7}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_owner", scope: !86, file: !87, line: 49, baseType: !109, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !79}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_owner", scope: !86, file: !87, line: 50, baseType: !113, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!33, !79}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "release_tx_desc", scope: !86, file: !87, line: 52, baseType: !117, size: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{null, !79, !33}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_ic", scope: !86, file: !87, line: 55, baseType: !109, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_ls", scope: !86, file: !87, line: 57, baseType: !113, size: 64, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tx_status", scope: !86, file: !87, line: 59, baseType: !123, size: 64, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!33, !126, !127, !79, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !14, line: 61, size: 7680, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !128, file: !14, line: 63, baseType: !41, size: 64, align: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !128, file: !14, line: 64, baseType: !41, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !128, file: !14, line: 65, baseType: !41, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !128, file: !14, line: 66, baseType: !41, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !128, file: !14, line: 67, baseType: !41, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !128, file: !14, line: 68, baseType: !41, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !128, file: !14, line: 69, baseType: !41, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !128, file: !14, line: 70, baseType: !41, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !128, file: !14, line: 71, baseType: !41, size: 64, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !128, file: !14, line: 72, baseType: !41, size: 64, offset: 576)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !128, file: !14, line: 74, baseType: !41, size: 64, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !128, file: !14, line: 75, baseType: !41, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !128, file: !14, line: 76, baseType: !41, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !128, file: !14, line: 77, baseType: !41, size: 64, offset: 832)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !128, file: !14, line: 78, baseType: !41, size: 64, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !128, file: !14, line: 79, baseType: !41, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !128, file: !14, line: 80, baseType: !41, size: 64, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !128, file: !14, line: 81, baseType: !41, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !128, file: !14, line: 82, baseType: !41, size: 64, offset: 1152)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !128, file: !14, line: 83, baseType: !41, size: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !128, file: !14, line: 84, baseType: !41, size: 64, offset: 1280)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !128, file: !14, line: 85, baseType: !41, size: 64, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !128, file: !14, line: 86, baseType: !41, size: 64, offset: 1408)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !128, file: !14, line: 87, baseType: !41, size: 64, offset: 1472)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !128, file: !14, line: 88, baseType: !41, size: 64, offset: 1536)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !128, file: !14, line: 89, baseType: !41, size: 64, offset: 1600)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !128, file: !14, line: 90, baseType: !41, size: 64, offset: 1664)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !128, file: !14, line: 91, baseType: !41, size: 64, offset: 1728)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !128, file: !14, line: 93, baseType: !41, size: 64, offset: 1792)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !128, file: !14, line: 94, baseType: !41, size: 64, offset: 1856)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !128, file: !14, line: 95, baseType: !41, size: 64, offset: 1920)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !128, file: !14, line: 96, baseType: !41, size: 64, offset: 1984)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !128, file: !14, line: 97, baseType: !41, size: 64, offset: 2048)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !128, file: !14, line: 98, baseType: !41, size: 64, offset: 2112)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !128, file: !14, line: 99, baseType: !41, size: 64, offset: 2176)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !128, file: !14, line: 100, baseType: !41, size: 64, offset: 2240)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !128, file: !14, line: 101, baseType: !41, size: 64, offset: 2304)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !128, file: !14, line: 103, baseType: !41, size: 64, offset: 2368)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !128, file: !14, line: 104, baseType: !41, size: 64, offset: 2432)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !128, file: !14, line: 105, baseType: !41, size: 64, offset: 2496)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !128, file: !14, line: 106, baseType: !41, size: 64, offset: 2560)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !128, file: !14, line: 107, baseType: !41, size: 64, offset: 2624)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !128, file: !14, line: 108, baseType: !41, size: 64, offset: 2688)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !128, file: !14, line: 109, baseType: !41, size: 64, offset: 2752)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !128, file: !14, line: 110, baseType: !41, size: 64, offset: 2816)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !128, file: !14, line: 111, baseType: !41, size: 64, offset: 2880)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !128, file: !14, line: 112, baseType: !41, size: 64, offset: 2944)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !128, file: !14, line: 113, baseType: !41, size: 64, offset: 3008)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !128, file: !14, line: 115, baseType: !41, size: 64, offset: 3072)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !128, file: !14, line: 116, baseType: !41, size: 64, offset: 3136)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !128, file: !14, line: 117, baseType: !41, size: 64, offset: 3200)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !128, file: !14, line: 119, baseType: !41, size: 64, offset: 3264)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !128, file: !14, line: 120, baseType: !41, size: 64, offset: 3328)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !128, file: !14, line: 121, baseType: !41, size: 64, offset: 3392)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !128, file: !14, line: 122, baseType: !41, size: 64, offset: 3456)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !128, file: !14, line: 123, baseType: !41, size: 64, offset: 3520)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !128, file: !14, line: 125, baseType: !41, size: 64, offset: 3584)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !128, file: !14, line: 126, baseType: !41, size: 64, offset: 3648)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !128, file: !14, line: 127, baseType: !41, size: 64, offset: 3712)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !128, file: !14, line: 128, baseType: !41, size: 64, offset: 3776)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !128, file: !14, line: 129, baseType: !41, size: 64, offset: 3840)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !128, file: !14, line: 130, baseType: !41, size: 64, offset: 3904)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !128, file: !14, line: 131, baseType: !41, size: 64, offset: 3968)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !128, file: !14, line: 132, baseType: !41, size: 64, offset: 4032)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !128, file: !14, line: 133, baseType: !41, size: 64, offset: 4096)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !128, file: !14, line: 134, baseType: !41, size: 64, offset: 4160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !128, file: !14, line: 135, baseType: !41, size: 64, offset: 4224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !128, file: !14, line: 136, baseType: !41, size: 64, offset: 4288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !128, file: !14, line: 137, baseType: !41, size: 64, offset: 4352)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !128, file: !14, line: 138, baseType: !41, size: 64, offset: 4416)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !128, file: !14, line: 139, baseType: !41, size: 64, offset: 4480)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !128, file: !14, line: 140, baseType: !41, size: 64, offset: 4544)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !128, file: !14, line: 141, baseType: !41, size: 64, offset: 4608)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !128, file: !14, line: 142, baseType: !41, size: 64, offset: 4672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !128, file: !14, line: 143, baseType: !41, size: 64, offset: 4736)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !128, file: !14, line: 144, baseType: !41, size: 64, offset: 4800)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !128, file: !14, line: 145, baseType: !41, size: 64, offset: 4864)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !128, file: !14, line: 146, baseType: !41, size: 64, offset: 4928)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !128, file: !14, line: 147, baseType: !41, size: 64, offset: 4992)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !128, file: !14, line: 148, baseType: !41, size: 64, offset: 5056)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !128, file: !14, line: 149, baseType: !41, size: 64, offset: 5120)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !128, file: !14, line: 151, baseType: !41, size: 64, offset: 5184)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !128, file: !14, line: 152, baseType: !41, size: 64, offset: 5248)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !128, file: !14, line: 153, baseType: !41, size: 64, offset: 5312)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !128, file: !14, line: 154, baseType: !41, size: 64, offset: 5376)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !128, file: !14, line: 155, baseType: !41, size: 64, offset: 5440)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !128, file: !14, line: 156, baseType: !41, size: 64, offset: 5504)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !128, file: !14, line: 158, baseType: !41, size: 64, offset: 5568)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !128, file: !14, line: 159, baseType: !41, size: 64, offset: 5632)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !128, file: !14, line: 160, baseType: !41, size: 64, offset: 5696)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !128, file: !14, line: 161, baseType: !41, size: 64, offset: 5760)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !128, file: !14, line: 162, baseType: !41, size: 64, offset: 5824)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !128, file: !14, line: 163, baseType: !41, size: 64, offset: 5888)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !128, file: !14, line: 164, baseType: !41, size: 64, offset: 5952)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !128, file: !14, line: 165, baseType: !41, size: 64, offset: 6016)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !128, file: !14, line: 166, baseType: !41, size: 64, offset: 6080)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !128, file: !14, line: 167, baseType: !41, size: 64, offset: 6144)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !128, file: !14, line: 168, baseType: !41, size: 64, offset: 6208)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !128, file: !14, line: 169, baseType: !41, size: 64, offset: 6272)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !128, file: !14, line: 170, baseType: !41, size: 64, offset: 6336)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !128, file: !14, line: 171, baseType: !41, size: 64, offset: 6400)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !128, file: !14, line: 172, baseType: !41, size: 64, offset: 6464)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !128, file: !14, line: 173, baseType: !41, size: 64, offset: 6528)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !128, file: !14, line: 174, baseType: !41, size: 64, offset: 6592)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !128, file: !14, line: 175, baseType: !41, size: 64, offset: 6656)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !128, file: !14, line: 176, baseType: !41, size: 64, offset: 6720)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !128, file: !14, line: 177, baseType: !41, size: 64, offset: 6784)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !128, file: !14, line: 178, baseType: !41, size: 64, offset: 6848)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !128, file: !14, line: 179, baseType: !41, size: 64, offset: 6912)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !128, file: !14, line: 180, baseType: !41, size: 64, offset: 6976)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !128, file: !14, line: 181, baseType: !41, size: 64, offset: 7040)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !128, file: !14, line: 183, baseType: !41, size: 64, offset: 7104)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !128, file: !14, line: 184, baseType: !41, size: 64, offset: 7168)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_len", scope: !86, file: !87, line: 62, baseType: !113, size: 64, offset: 640)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_owner", scope: !86, file: !87, line: 64, baseType: !117, size: 64, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_frame_len", scope: !86, file: !87, line: 66, baseType: !246, size: 64, offset: 768)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!33, !79, !33}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "rx_status", scope: !86, file: !87, line: 68, baseType: !250, size: 64, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DISubroutineType(types: !252)
!252 = !{!33, !126, !127, !79}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rx_extended_status", scope: !86, file: !87, line: 70, baseType: !254, size: 64, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DISubroutineType(types: !256)
!256 = !{null, !126, !127, !64}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tx_timestamp", scope: !86, file: !87, line: 73, baseType: !109, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_timestamp_status", scope: !86, file: !87, line: 75, baseType: !113, size: 64, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "get_timestamp", scope: !86, file: !87, line: 77, baseType: !260, size: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !126, !34, !80}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_timestamp_status", scope: !86, file: !87, line: 79, baseType: !264, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!33, !126, !126, !34}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "display_ring", scope: !86, file: !87, line: 81, baseType: !268, size: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !126, !7, !101}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set_mss", scope: !86, file: !87, line: 83, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !79, !7}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "get_addr", scope: !86, file: !87, line: 85, baseType: !276, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !79, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "set_addr", scope: !86, file: !87, line: 87, baseType: !281, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !79, !284}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !102, line: 143, baseType: !81)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !86, file: !87, line: 89, baseType: !109, size: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_hash", scope: !86, file: !87, line: 91, baseType: !287, size: 64, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!33, !79, !290, !291}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_header_len", scope: !86, file: !87, line: 93, baseType: !276, size: 64, offset: 1600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "set_sec_addr", scope: !86, file: !87, line: 94, baseType: !281, size: 64, offset: 1664)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set_sarc", scope: !86, file: !87, line: 95, baseType: !295, size: 64, offset: 1728)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !79, !34}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set_vlan_tag", scope: !86, file: !87, line: 96, baseType: !299, size: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !79, !302, !302, !34}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !35, line: 19, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !32, line: 24, baseType: !304)
!304 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "set_vlan", scope: !86, file: !87, line: 98, baseType: !295, size: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "set_tbs", scope: !86, file: !87, line: 99, baseType: !307, size: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !310, !34, !34}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_edesc", file: !66, line: 175, size: 256, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "des4", scope: !311, file: !66, line: 176, baseType: !29, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "des5", scope: !311, file: !66, line: 177, baseType: !29, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "des6", scope: !311, file: !66, line: 178, baseType: !29, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "des7", scope: !311, file: !66, line: 179, baseType: !29, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !311, file: !66, line: 180, baseType: !69, size: 128, offset: 128)
!318 = !{i32 7, !"Dwarf Version", i32 4}
!319 = !{i32 2, !"Debug Info Version", i32 3}
!320 = !{i32 1, !"wchar_size", i32 2}
!321 = !{i32 1, !"Code Model", i32 2}
!322 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!323 = distinct !DISubprogram(name: "enh_desc_init_rx_desc", scope: !3, file: !3, line: 257, type: !91, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !324)
!324 = !{}
!325 = !DILocalVariable(name: "p", arg: 1, scope: !323, file: !3, line: 257, type: !79)
!326 = !DILocation(line: 257, column: 52, scope: !323)
!327 = !DILocalVariable(name: "disable_rx_ic", arg: 2, scope: !323, file: !3, line: 257, type: !33)
!328 = !DILocation(line: 257, column: 59, scope: !323)
!329 = !DILocalVariable(name: "mode", arg: 3, scope: !323, file: !3, line: 258, type: !33)
!330 = !DILocation(line: 258, column: 11, scope: !323)
!331 = !DILocalVariable(name: "end", arg: 4, scope: !323, file: !3, line: 258, type: !33)
!332 = !DILocation(line: 258, column: 21, scope: !323)
!333 = !DILocalVariable(name: "bfsize", arg: 5, scope: !323, file: !3, line: 258, type: !33)
!334 = !DILocation(line: 258, column: 30, scope: !323)
!335 = !DILocalVariable(name: "bfsize1", scope: !323, file: !3, line: 260, type: !33)
!336 = !DILocation(line: 260, column: 6, scope: !323)
!337 = !DILocation(line: 262, column: 2, scope: !323)
!338 = !DILocation(line: 262, column: 5, scope: !323)
!339 = !DILocation(line: 262, column: 10, scope: !323)
!340 = !DILocalVariable(name: "__UNIQUE_ID___x324", scope: !341, file: !3, line: 264, type: !33)
!341 = distinct !DILexicalBlock(scope: !323, file: !3, line: 264, column: 12)
!342 = !DILocation(line: 264, column: 12, scope: !341)
!343 = !DILocalVariable(name: "__UNIQUE_ID___y325", scope: !341, file: !3, line: 264, type: !33)
!344 = !DILocation(line: 264, column: 10, scope: !323)
!345 = !DILocation(line: 265, column: 13, scope: !323)
!346 = !DILocation(line: 265, column: 2, scope: !323)
!347 = !DILocation(line: 265, column: 5, scope: !323)
!348 = !DILocation(line: 265, column: 10, scope: !323)
!349 = !DILocation(line: 267, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !323, file: !3, line: 267, column: 6)
!351 = !DILocation(line: 267, column: 11, scope: !350)
!352 = !DILocation(line: 267, column: 6, scope: !323)
!353 = !DILocation(line: 268, column: 28, scope: !350)
!354 = !DILocation(line: 268, column: 3, scope: !350)
!355 = !DILocation(line: 270, column: 27, scope: !350)
!356 = !DILocation(line: 270, column: 30, scope: !350)
!357 = !DILocation(line: 270, column: 35, scope: !350)
!358 = !DILocation(line: 270, column: 3, scope: !350)
!359 = !DILocation(line: 272, column: 6, scope: !360)
!360 = distinct !DILexicalBlock(scope: !323, file: !3, line: 272, column: 6)
!361 = !DILocation(line: 272, column: 6, scope: !323)
!362 = !DILocation(line: 273, column: 3, scope: !360)
!363 = !DILocation(line: 273, column: 6, scope: !360)
!364 = !DILocation(line: 273, column: 11, scope: !360)
!365 = !DILocation(line: 274, column: 1, scope: !323)
!366 = distinct !DISubprogram(name: "enh_desc_init_tx_desc", scope: !3, file: !3, line: 276, type: !95, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !324)
!367 = !DILocalVariable(name: "p", arg: 1, scope: !366, file: !3, line: 276, type: !79)
!368 = !DILocation(line: 276, column: 52, scope: !366)
!369 = !DILocalVariable(name: "mode", arg: 2, scope: !366, file: !3, line: 276, type: !33)
!370 = !DILocation(line: 276, column: 59, scope: !366)
!371 = !DILocalVariable(name: "end", arg: 3, scope: !366, file: !3, line: 276, type: !33)
!372 = !DILocation(line: 276, column: 69, scope: !366)
!373 = !DILocation(line: 278, column: 2, scope: !366)
