; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/mmc_core.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/mmc_core.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_mmc_ops = type { void (i8*, i32)*, void (i8*)*, void (i8*, %struct.stmmac_counters*)* }
%struct.stmmac_counters = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

@dwmac_mmc_ops = dso_local constant %struct.stmmac_mmc_ops { void (i8*, i32)* @dwmac_mmc_ctrl, void (i8*)* @dwmac_mmc_intr_all_mask, void (i8*, %struct.stmmac_counters*)* @dwmac_mmc_read }, align 8, !dbg !0
@dwxgmac_mmc_ops = dso_local constant %struct.stmmac_mmc_ops { void (i8*, i32)* @dwxgmac_mmc_ctrl, void (i8*)* @dwxgmac_mmc_intr_all_mask, void (i8*, %struct.stmmac_counters*)* @dwxgmac_mmc_read }, align 8, !dbg !16

; Function Attrs: noinline noredzone nounwind optnone sspstrong
define internal void @dwmac_mmc_ctrl(i8* %mmcaddr, i32 %mode) #0 !dbg !129 {
entry:
  %mmcaddr.addr = alloca i8*, align 8
  %mode.addr = alloca i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dwmac_mmc_ops", scope: !2, file: !3, line: 336, type: !18, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/mmc_core.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{}
!5 = !{!6, !9, !14}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !8)
!8 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !10, line: 23, baseType: !11)
!10 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !12, line: 31, baseType: !13)
!12 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!13 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !{!0, !16}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dwxgmac_mmc_ops", scope: !2, file: !3, line: 471, type: !18, isLocal: false, isDefinition: true)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_mmc_ops", file: !20, line: 581, size: 192, elements: !21)
!20 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!21 = !{!22, !27, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !19, file: !20, line: 582, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26, !8}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "intr_all_mask", scope: !19, file: !20, line: 583, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !26}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !19, file: !20, line: 584, baseType: !32, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !26, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_counters", file: !37, line: 29, size: 2720, elements: !38)
!37 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/mmc.h", directory: "/home/lizy2001/genbc/linux")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_octetcount_gb", scope: !36, file: !37, line: 30, baseType: !8, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_framecount_gb", scope: !36, file: !37, line: 31, baseType: !8, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_broadcastframe_g", scope: !36, file: !37, line: 32, baseType: !8, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_multicastframe_g", scope: !36, file: !37, line: 33, baseType: !8, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_64_octets_gb", scope: !36, file: !37, line: 34, baseType: !8, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_65_to_127_octets_gb", scope: !36, file: !37, line: 35, baseType: !8, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_128_to_255_octets_gb", scope: !36, file: !37, line: 36, baseType: !8, size: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_256_to_511_octets_gb", scope: !36, file: !37, line: 37, baseType: !8, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_512_to_1023_octets_gb", scope: !36, file: !37, line: 38, baseType: !8, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_1024_to_max_octets_gb", scope: !36, file: !37, line: 39, baseType: !8, size: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_unicast_gb", scope: !36, file: !37, line: 40, baseType: !8, size: 32, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_multicast_gb", scope: !36, file: !37, line: 41, baseType: !8, size: 32, offset: 352)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_broadcast_gb", scope: !36, file: !37, line: 42, baseType: !8, size: 32, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_underflow_error", scope: !36, file: !37, line: 43, baseType: !8, size: 32, offset: 416)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_singlecol_g", scope: !36, file: !37, line: 44, baseType: !8, size: 32, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_multicol_g", scope: !36, file: !37, line: 45, baseType: !8, size: 32, offset: 480)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_deferred", scope: !36, file: !37, line: 46, baseType: !8, size: 32, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_latecol", scope: !36, file: !37, line: 47, baseType: !8, size: 32, offset: 544)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_exesscol", scope: !36, file: !37, line: 48, baseType: !8, size: 32, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_carrier_error", scope: !36, file: !37, line: 49, baseType: !8, size: 32, offset: 608)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_octetcount_g", scope: !36, file: !37, line: 50, baseType: !8, size: 32, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_framecount_g", scope: !36, file: !37, line: 51, baseType: !8, size: 32, offset: 672)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_excessdef", scope: !36, file: !37, line: 52, baseType: !8, size: 32, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_pause_frame", scope: !36, file: !37, line: 53, baseType: !8, size: 32, offset: 736)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_vlan_frame_g", scope: !36, file: !37, line: 54, baseType: !8, size: 32, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_framecount_gb", scope: !36, file: !37, line: 57, baseType: !8, size: 32, offset: 800)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_octetcount_gb", scope: !36, file: !37, line: 58, baseType: !8, size: 32, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_octetcount_g", scope: !36, file: !37, line: 59, baseType: !8, size: 32, offset: 864)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_broadcastframe_g", scope: !36, file: !37, line: 60, baseType: !8, size: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_multicastframe_g", scope: !36, file: !37, line: 61, baseType: !8, size: 32, offset: 928)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_crc_error", scope: !36, file: !37, line: 62, baseType: !8, size: 32, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_align_error", scope: !36, file: !37, line: 63, baseType: !8, size: 32, offset: 992)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_run_error", scope: !36, file: !37, line: 64, baseType: !8, size: 32, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_jabber_error", scope: !36, file: !37, line: 65, baseType: !8, size: 32, offset: 1056)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_undersize_g", scope: !36, file: !37, line: 66, baseType: !8, size: 32, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_oversize_g", scope: !36, file: !37, line: 67, baseType: !8, size: 32, offset: 1120)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_64_octets_gb", scope: !36, file: !37, line: 68, baseType: !8, size: 32, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_65_to_127_octets_gb", scope: !36, file: !37, line: 69, baseType: !8, size: 32, offset: 1184)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_128_to_255_octets_gb", scope: !36, file: !37, line: 70, baseType: !8, size: 32, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_256_to_511_octets_gb", scope: !36, file: !37, line: 71, baseType: !8, size: 32, offset: 1248)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_512_to_1023_octets_gb", scope: !36, file: !37, line: 72, baseType: !8, size: 32, offset: 1280)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_1024_to_max_octets_gb", scope: !36, file: !37, line: 73, baseType: !8, size: 32, offset: 1312)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_unicast_g", scope: !36, file: !37, line: 74, baseType: !8, size: 32, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_length_error", scope: !36, file: !37, line: 75, baseType: !8, size: 32, offset: 1376)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_autofrangetype", scope: !36, file: !37, line: 76, baseType: !8, size: 32, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_pause_frames", scope: !36, file: !37, line: 77, baseType: !8, size: 32, offset: 1440)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_fifo_overflow", scope: !36, file: !37, line: 78, baseType: !8, size: 32, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_vlan_frames_gb", scope: !36, file: !37, line: 79, baseType: !8, size: 32, offset: 1504)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_watchdog_error", scope: !36, file: !37, line: 80, baseType: !8, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipc_intr_mask", scope: !36, file: !37, line: 82, baseType: !8, size: 32, offset: 1568)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipc_intr", scope: !36, file: !37, line: 83, baseType: !8, size: 32, offset: 1600)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_gd", scope: !36, file: !37, line: 85, baseType: !8, size: 32, offset: 1632)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_hderr", scope: !36, file: !37, line: 86, baseType: !8, size: 32, offset: 1664)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_nopay", scope: !36, file: !37, line: 87, baseType: !8, size: 32, offset: 1696)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_frag", scope: !36, file: !37, line: 88, baseType: !8, size: 32, offset: 1728)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_udsbl", scope: !36, file: !37, line: 89, baseType: !8, size: 32, offset: 1760)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_gd_octets", scope: !36, file: !37, line: 91, baseType: !8, size: 32, offset: 1792)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_hderr_octets", scope: !36, file: !37, line: 92, baseType: !8, size: 32, offset: 1824)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_nopay_octets", scope: !36, file: !37, line: 93, baseType: !8, size: 32, offset: 1856)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_frag_octets", scope: !36, file: !37, line: 94, baseType: !8, size: 32, offset: 1888)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv4_udsbl_octets", scope: !36, file: !37, line: 95, baseType: !8, size: 32, offset: 1920)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv6_gd_octets", scope: !36, file: !37, line: 98, baseType: !8, size: 32, offset: 1952)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv6_hderr_octets", scope: !36, file: !37, line: 99, baseType: !8, size: 32, offset: 1984)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv6_nopay_octets", scope: !36, file: !37, line: 100, baseType: !8, size: 32, offset: 2016)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv6_gd", scope: !36, file: !37, line: 102, baseType: !8, size: 32, offset: 2048)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv6_hderr", scope: !36, file: !37, line: 103, baseType: !8, size: 32, offset: 2080)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_ipv6_nopay", scope: !36, file: !37, line: 104, baseType: !8, size: 32, offset: 2112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_udp_gd", scope: !36, file: !37, line: 107, baseType: !8, size: 32, offset: 2144)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_udp_err", scope: !36, file: !37, line: 108, baseType: !8, size: 32, offset: 2176)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_tcp_gd", scope: !36, file: !37, line: 109, baseType: !8, size: 32, offset: 2208)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_tcp_err", scope: !36, file: !37, line: 110, baseType: !8, size: 32, offset: 2240)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_icmp_gd", scope: !36, file: !37, line: 111, baseType: !8, size: 32, offset: 2272)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_icmp_err", scope: !36, file: !37, line: 112, baseType: !8, size: 32, offset: 2304)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_udp_gd_octets", scope: !36, file: !37, line: 114, baseType: !8, size: 32, offset: 2336)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_udp_err_octets", scope: !36, file: !37, line: 115, baseType: !8, size: 32, offset: 2368)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_tcp_gd_octets", scope: !36, file: !37, line: 116, baseType: !8, size: 32, offset: 2400)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_tcp_err_octets", scope: !36, file: !37, line: 117, baseType: !8, size: 32, offset: 2432)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_icmp_gd_octets", scope: !36, file: !37, line: 118, baseType: !8, size: 32, offset: 2464)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_icmp_err_octets", scope: !36, file: !37, line: 119, baseType: !8, size: 32, offset: 2496)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_fpe_fragment_cntr", scope: !36, file: !37, line: 122, baseType: !8, size: 32, offset: 2528)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_hold_req_cntr", scope: !36, file: !37, line: 123, baseType: !8, size: 32, offset: 2560)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_packet_assembly_err_cntr", scope: !36, file: !37, line: 124, baseType: !8, size: 32, offset: 2592)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_packet_smd_err_cntr", scope: !36, file: !37, line: 125, baseType: !8, size: 32, offset: 2624)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_packet_assembly_ok_cntr", scope: !36, file: !37, line: 126, baseType: !8, size: 32, offset: 2656)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_fpe_fragment_cntr", scope: !36, file: !37, line: 127, baseType: !8, size: 32, offset: 2688)
!124 = !{i32 7, !"Dwarf Version", i32 4}
!125 = !{i32 2, !"Debug Info Version", i32 3}
!126 = !{i32 1, !"wchar_size", i32 2}
!127 = !{i32 1, !"Code Model", i32 2}
!128 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!129 = distinct !DISubprogram(name: "dwmac_mmc_ctrl", scope: !3, file: !3, line: 188, type: !24, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!130 = !DILocalVariable(name: "mmcaddr", arg: 1, scope: !129, file: !3, line: 188, type: !26)
!131 = !DILocation(line: 188, column: 42, scope: !129)
!132 = !DILocalVariable(name: "mode", arg: 2, scope: !129, file: !3, line: 188, type: !8)
!133 = !DILocation(line: 188, column: 64, scope: !129)
!134 = !DILocalVariable(name: "value", scope: !129, file: !3, line: 190, type: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !10, line: 21, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !12, line: 27, baseType: !8)
!137 = !DILocation(line: 190, column: 6, scope: !129)
!138 = !DILocation(line: 190, column: 20, scope: !129)
!139 = !DILocation(line: 190, column: 28, scope: !129)
!140 = !DILocation(line: 190, column: 14, scope: !129)
!141 = !DILocation(line: 192, column: 12, scope: !129)
!142 = !DILocation(line: 192, column: 17, scope: !129)
!143 = !DILocation(line: 192, column: 8, scope: !129)
!144 = !DILocation(line: 194, column: 9, scope: !129)
!145 = !DILocation(line: 194, column: 16, scope: !129)
!146 = !DILocation(line: 194, column: 24, scope: !129)
!147 = !DILocation(line: 194, column: 2, scope: !129)
!148 = !DILocation(line: 196, column: 2, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !3, line: 196, column: 2)
!150 = distinct !DILexicalBlock(scope: !129, file: !3, line: 196, column: 2)
!151 = !DILocation(line: 196, column: 2, scope: !150)
!152 = !DILocation(line: 198, column: 1, scope: !129)
!153 = distinct !DISubprogram(name: "dwmac_mmc_intr_all_mask", scope: !3, file: !3, line: 201, type: !29, scopeLine: 202, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!154 = !DILocalVariable(name: "mmcaddr", arg: 1, scope: !153, file: !3, line: 201, type: !26)
!155 = !DILocation(line: 201, column: 51, scope: !153)
!156 = !DILocation(line: 203, column: 27, scope: !153)
!157 = !DILocation(line: 203, column: 35, scope: !153)
!158 = !DILocation(line: 203, column: 2, scope: !153)
!159 = !DILocation(line: 204, column: 27, scope: !153)
!160 = !DILocation(line: 204, column: 35, scope: !153)
!161 = !DILocation(line: 204, column: 2, scope: !153)
!162 = !DILocation(line: 205, column: 27, scope: !153)
!163 = !DILocation(line: 205, column: 35, scope: !153)
!164 = !DILocation(line: 205, column: 2, scope: !153)
!165 = !DILocation(line: 206, column: 1, scope: !153)
!166 = distinct !DISubprogram(name: "dwmac_mmc_read", scope: !3, file: !3, line: 213, type: !33, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!167 = !DILocalVariable(name: "mmcaddr", arg: 1, scope: !166, file: !3, line: 213, type: !26)
!168 = !DILocation(line: 213, column: 42, scope: !166)
!169 = !DILocalVariable(name: "mmc", arg: 2, scope: !166, file: !3, line: 213, type: !35)
!170 = !DILocation(line: 213, column: 75, scope: !166)
!171 = !DILocation(line: 215, column: 37, scope: !166)
!172 = !DILocation(line: 215, column: 45, scope: !166)
!173 = !DILocation(line: 215, column: 31, scope: !166)
!174 = !DILocation(line: 215, column: 2, scope: !166)
!175 = !DILocation(line: 215, column: 7, scope: !166)
!176 = !DILocation(line: 215, column: 28, scope: !166)
!177 = !DILocation(line: 216, column: 37, scope: !166)
!178 = !DILocation(line: 216, column: 45, scope: !166)
