; ModuleID = '../bcout/drivers/net/ethernet/stmicro/stmmac/norm_desc.llvm.bc'
source_filename = "drivers/net/ethernet/stmicro/stmmac/norm_desc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64"

%struct.stmmac_desc_ops = type { void (%struct.dma_desc*, i32, i32, i32, i32)*, void (%struct.dma_desc*, i32, i32)*, void (%struct.dma_desc*, i32, i32, i1, i32, i1, i1, i32)*, void (%struct.dma_desc*, i32, i32, i32, i1, i1, i32, i32)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, i32 (i8*, %struct.stmmac_extra_stats*, %struct.dma_desc*, i8*)*, i32 (%struct.dma_desc*)*, void (%struct.dma_desc*, i32)*, i32 (%struct.dma_desc*, i32)*, i32 (i8*, %struct.stmmac_extra_stats*, %struct.dma_desc*)*, void (i8*, %struct.stmmac_extra_stats*, %struct.dma_extended_desc*)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*)*, void (i8*, i32, i64*)*, i32 (i8*, i8*, i32)*, void (i8*, i32, i1)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*, i32*)*, void (%struct.dma_desc*, i64)*, void (%struct.dma_desc*)*, i32 (%struct.dma_desc*, i32*, i32*)*, void (%struct.dma_desc*, i32*)*, void (%struct.dma_desc*, i64)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_desc*, i16, i16, i32)*, void (%struct.dma_desc*, i32)*, void (%struct.dma_edesc*, i32, i32)* }
%struct.dma_desc = type { i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ndesc_ops", scope: !2, file: !3, line: 307, type: !77, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C89, file: !3, producer: "clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !28, globals: !76, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/norm_desc.c", directory: "/home/lizy2001/genbc/linux")
!4 = !{!5, !13, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkt_hash_types", file: !6, line: 1238, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./include/linux/skbuff.h", directory: "/home/lizy2001/genbc/linux")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "PKT_HASH_TYPE_NONE", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PKT_HASH_TYPE_L2", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PKT_HASH_TYPE_L3", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PKT_HASH_TYPE_L4", value: 3, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tx_frame_status", file: !14, line: 292, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/common.h", directory: "/home/lizy2001/genbc/linux")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "tx_done", value: 0, isUnsigned: true)
!17 = !DIEnumerator(name: "tx_not_ls", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "tx_err", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "tx_dma_own", value: 4, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rx_frame_status", file: !14, line: 282, baseType: !7, size: 32, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27}
!22 = !DIEnumerator(name: "good_frame", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "discard_frame", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "csum_none", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "llc_snap", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "dma_own", value: 8, isUnsigned: true)
!27 = !DIEnumerator(name: "rx_not_ls", value: 16, isUnsigned: true)
!28 = !{!29, !31, !33, !34, !36, !64, !72, !7, !41}
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__le32", file: !30, line: 31, baseType: !31)
!30 = !DIFile(filename: "./include/uapi/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !32, line: 27, baseType: !7)
!32 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!33 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !35, line: 21, baseType: !31)
!35 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/lizy2001/genbc/linux")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_device_stats", file: !38, line: 169, size: 1472, elements: !39)
!38 = !DIFile(filename: "./include/linux/netdevice.h", directory: "/home/lizy2001/genbc/linux")
!39 = !{!40, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !37, file: !38, line: 170, baseType: !41, size: 64)
!41 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tx_packets", scope: !37, file: !38, line: 171, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !37, file: !38, line: 172, baseType: !41, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "tx_bytes", scope: !37, file: !38, line: 173, baseType: !41, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "rx_errors", scope: !37, file: !38, line: 174, baseType: !41, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tx_errors", scope: !37, file: !38, line: 175, baseType: !41, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rx_dropped", scope: !37, file: !38, line: 176, baseType: !41, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tx_dropped", scope: !37, file: !38, line: 177, baseType: !41, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "multicast", scope: !37, file: !38, line: 178, baseType: !41, size: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !37, file: !38, line: 179, baseType: !41, size: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length_errors", scope: !37, file: !38, line: 180, baseType: !41, size: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rx_over_errors", scope: !37, file: !38, line: 181, baseType: !41, size: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !37, file: !38, line: 182, baseType: !41, size: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "rx_frame_errors", scope: !37, file: !38, line: 183, baseType: !41, size: 64, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo_errors", scope: !37, file: !38, line: 184, baseType: !41, size: 64, offset: 896)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_errors", scope: !37, file: !38, line: 185, baseType: !41, size: 64, offset: 960)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tx_aborted_errors", scope: !37, file: !38, line: 186, baseType: !41, size: 64, offset: 1024)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier_errors", scope: !37, file: !38, line: 187, baseType: !41, size: 64, offset: 1088)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo_errors", scope: !37, file: !38, line: 188, baseType: !41, size: 64, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "tx_heartbeat_errors", scope: !37, file: !38, line: 189, baseType: !41, size: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tx_window_errors", scope: !37, file: !38, line: 190, baseType: !41, size: 64, offset: 1280)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "rx_compressed", scope: !37, file: !38, line: 191, baseType: !41, size: 64, offset: 1344)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "tx_compressed", scope: !37, file: !38, line: 192, baseType: !41, size: 64, offset: 1408)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_desc", file: !66, line: 158, size: 128, elements: !67)
!66 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/descs.h", directory: "/home/lizy2001/genbc/linux")
!67 = !{!68, !69, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "des0", scope: !65, file: !66, line: 159, baseType: !29, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "des1", scope: !65, file: !66, line: 160, baseType: !29, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "des2", scope: !65, file: !66, line: 161, baseType: !29, size: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "des3", scope: !65, file: !66, line: 162, baseType: !29, size: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !35, line: 23, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !32, line: 31, baseType: !75)
!75 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !{!0}
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_desc_ops", file: !79, line: 35, size: 1984, elements: !80)
!79 = !DIFile(filename: "drivers/net/ethernet/stmicro/stmmac/hwif.h", directory: "/home/lizy2001/genbc/linux")
!80 = !{!81, !85, !89, !96, !100, !104, !108, !112, !113, !114, !235, !236, !237, !241, !245, !257, !258, !259, !263, !267, !271, !275, !280, !285, !286, !292, !293, !294, !298, !305, !306}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "init_rx_desc", scope: !78, file: !79, line: 37, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !64, !33, !33, !33, !33}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "init_tx_desc", scope: !78, file: !79, line: 40, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !64, !33, !33}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_tx_desc", scope: !78, file: !79, line: 42, baseType: !90, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !64, !33, !33, !93, !33, !93, !93, !7}
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !94, line: 30, baseType: !95)
!94 = !DIFile(filename: "./include/linux/types.h", directory: "/home/lizy2001/genbc/linux")
!95 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "prepare_tso_tx_desc", scope: !78, file: !79, line: 45, baseType: !97, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !64, !33, !33, !33, !93, !93, !7, !7}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_owner", scope: !78, file: !79, line: 49, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !64}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_owner", scope: !78, file: !79, line: 50, baseType: !105, size: 64, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!33, !64}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "release_tx_desc", scope: !78, file: !79, line: 52, baseType: !109, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !64, !33}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "set_tx_ic", scope: !78, file: !79, line: 55, baseType: !101, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_ls", scope: !78, file: !79, line: 57, baseType: !105, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tx_status", scope: !78, file: !79, line: 59, baseType: !115, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!33, !118, !119, !64, !118}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stmmac_extra_stats", file: !14, line: 61, size: 7680, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tx_underflow", scope: !120, file: !14, line: 63, baseType: !41, size: 64, align: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tx_carrier", scope: !120, file: !14, line: 64, baseType: !41, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "tx_losscarrier", scope: !120, file: !14, line: 65, baseType: !41, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag", scope: !120, file: !14, line: 66, baseType: !41, size: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "tx_deferred", scope: !120, file: !14, line: 67, baseType: !41, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tx_vlan", scope: !120, file: !14, line: 68, baseType: !41, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber", scope: !120, file: !14, line: 69, baseType: !41, size: 64, offset: 384)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tx_frame_flushed", scope: !120, file: !14, line: 70, baseType: !41, size: 64, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "tx_payload_error", scope: !120, file: !14, line: 71, baseType: !41, size: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ip_header_error", scope: !120, file: !14, line: 72, baseType: !41, size: 64, offset: 576)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "rx_desc", scope: !120, file: !14, line: 74, baseType: !41, size: 64, offset: 640)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "sa_filter_fail", scope: !120, file: !14, line: 75, baseType: !41, size: 64, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_error", scope: !120, file: !14, line: 76, baseType: !41, size: 64, offset: 768)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ipc_csum_error", scope: !120, file: !14, line: 77, baseType: !41, size: 64, offset: 832)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rx_collision", scope: !120, file: !14, line: 78, baseType: !41, size: 64, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rx_crc_errors", scope: !120, file: !14, line: 79, baseType: !41, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dribbling_bit", scope: !120, file: !14, line: 80, baseType: !41, size: 64, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "rx_length", scope: !120, file: !14, line: 81, baseType: !41, size: 64, offset: 1088)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mii", scope: !120, file: !14, line: 82, baseType: !41, size: 64, offset: 1152)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rx_multicast", scope: !120, file: !14, line: 83, baseType: !41, size: 64, offset: 1216)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "rx_gmac_overflow", scope: !120, file: !14, line: 84, baseType: !41, size: 64, offset: 1280)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog", scope: !120, file: !14, line: 85, baseType: !41, size: 64, offset: 1344)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "da_rx_filter_fail", scope: !120, file: !14, line: 86, baseType: !41, size: 64, offset: 1408)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sa_rx_filter_fail", scope: !120, file: !14, line: 87, baseType: !41, size: 64, offset: 1472)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "rx_missed_cntr", scope: !120, file: !14, line: 88, baseType: !41, size: 64, offset: 1536)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_cntr", scope: !120, file: !14, line: 89, baseType: !41, size: 64, offset: 1600)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rx_vlan", scope: !120, file: !14, line: 90, baseType: !41, size: 64, offset: 1664)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "rx_split_hdr_pkt_n", scope: !120, file: !14, line: 91, baseType: !41, size: 64, offset: 1728)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "tx_undeflow_irq", scope: !120, file: !14, line: 93, baseType: !41, size: 64, offset: 1792)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tx_process_stopped_irq", scope: !120, file: !14, line: 94, baseType: !41, size: 64, offset: 1856)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tx_jabber_irq", scope: !120, file: !14, line: 95, baseType: !41, size: 64, offset: 1920)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rx_overflow_irq", scope: !120, file: !14, line: 96, baseType: !41, size: 64, offset: 1984)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "rx_buf_unav_irq", scope: !120, file: !14, line: 97, baseType: !41, size: 64, offset: 2048)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "rx_process_stopped_irq", scope: !120, file: !14, line: 98, baseType: !41, size: 64, offset: 2112)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "rx_watchdog_irq", scope: !120, file: !14, line: 99, baseType: !41, size: 64, offset: 2176)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "tx_early_irq", scope: !120, file: !14, line: 100, baseType: !41, size: 64, offset: 2240)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "fatal_bus_error_irq", scope: !120, file: !14, line: 101, baseType: !41, size: 64, offset: 2304)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "rx_early_irq", scope: !120, file: !14, line: 103, baseType: !41, size: 64, offset: 2368)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !120, file: !14, line: 104, baseType: !41, size: 64, offset: 2432)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tx_pkt_n", scope: !120, file: !14, line: 105, baseType: !41, size: 64, offset: 2496)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "rx_pkt_n", scope: !120, file: !14, line: 106, baseType: !41, size: 64, offset: 2560)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "normal_irq_n", scope: !120, file: !14, line: 107, baseType: !41, size: 64, offset: 2624)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "rx_normal_irq_n", scope: !120, file: !14, line: 108, baseType: !41, size: 64, offset: 2688)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "napi_poll", scope: !120, file: !14, line: 109, baseType: !41, size: 64, offset: 2752)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tx_normal_irq_n", scope: !120, file: !14, line: 110, baseType: !41, size: 64, offset: 2816)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "tx_clean", scope: !120, file: !14, line: 111, baseType: !41, size: 64, offset: 2880)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tx_set_ic_bit", scope: !120, file: !14, line: 112, baseType: !41, size: 64, offset: 2944)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "irq_receive_pmt_irq_n", scope: !120, file: !14, line: 113, baseType: !41, size: 64, offset: 3008)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_tx_irq_n", scope: !120, file: !14, line: 115, baseType: !41, size: 64, offset: 3072)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_irq_n", scope: !120, file: !14, line: 116, baseType: !41, size: 64, offset: 3136)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mmc_rx_csum_offload_irq_n", scope: !120, file: !14, line: 117, baseType: !41, size: 64, offset: 3200)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_in_lpi_mode_n", scope: !120, file: !14, line: 119, baseType: !41, size: 64, offset: 3264)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_path_exit_lpi_mode_n", scope: !120, file: !14, line: 120, baseType: !41, size: 64, offset: 3328)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_in_lpi_mode_n", scope: !120, file: !14, line: 121, baseType: !41, size: 64, offset: 3392)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_path_exit_lpi_mode_n", scope: !120, file: !14, line: 122, baseType: !41, size: 64, offset: 3456)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "phy_eee_wakeup_error_n", scope: !120, file: !14, line: 123, baseType: !41, size: 64, offset: 3520)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ip_hdr_err", scope: !120, file: !14, line: 125, baseType: !41, size: 64, offset: 3584)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ip_payload_err", scope: !120, file: !14, line: 126, baseType: !41, size: 64, offset: 3648)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ip_csum_bypassed", scope: !120, file: !14, line: 127, baseType: !41, size: 64, offset: 3712)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_pkt_rcvd", scope: !120, file: !14, line: 128, baseType: !41, size: 64, offset: 3776)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_pkt_rcvd", scope: !120, file: !14, line: 129, baseType: !41, size: 64, offset: 3840)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "no_ptp_rx_msg_type_ext", scope: !120, file: !14, line: 130, baseType: !41, size: 64, offset: 3904)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_sync", scope: !120, file: !14, line: 131, baseType: !41, size: 64, offset: 3968)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_follow_up", scope: !120, file: !14, line: 132, baseType: !41, size: 64, offset: 4032)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_req", scope: !120, file: !14, line: 133, baseType: !41, size: 64, offset: 4096)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_delay_resp", scope: !120, file: !14, line: 134, baseType: !41, size: 64, offset: 4160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_req", scope: !120, file: !14, line: 135, baseType: !41, size: 64, offset: 4224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_resp", scope: !120, file: !14, line: 136, baseType: !41, size: 64, offset: 4288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_pdelay_follow_up", scope: !120, file: !14, line: 137, baseType: !41, size: 64, offset: 4352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_announce", scope: !120, file: !14, line: 138, baseType: !41, size: 64, offset: 4416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_type_management", scope: !120, file: !14, line: 139, baseType: !41, size: 64, offset: 4480)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_rx_msg_pkt_reserved_type", scope: !120, file: !14, line: 140, baseType: !41, size: 64, offset: 4544)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_frame_type", scope: !120, file: !14, line: 141, baseType: !41, size: 64, offset: 4608)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ptp_ver", scope: !120, file: !14, line: 142, baseType: !41, size: 64, offset: 4672)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp_dropped", scope: !120, file: !14, line: 143, baseType: !41, size: 64, offset: 4736)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "av_pkt_rcvd", scope: !120, file: !14, line: 144, baseType: !41, size: 64, offset: 4800)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "av_tagged_pkt_rcvd", scope: !120, file: !14, line: 145, baseType: !41, size: 64, offset: 4864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tag_priority_val", scope: !120, file: !14, line: 146, baseType: !41, size: 64, offset: 4928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "l3_filter_match", scope: !120, file: !14, line: 147, baseType: !41, size: 64, offset: 4992)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "l4_filter_match", scope: !120, file: !14, line: 148, baseType: !41, size: 64, offset: 5056)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "l3_l4_filter_no_match", scope: !120, file: !14, line: 149, baseType: !41, size: 64, offset: 5120)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_ane_n", scope: !120, file: !14, line: 151, baseType: !41, size: 64, offset: 5184)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pcs_link_n", scope: !120, file: !14, line: 152, baseType: !41, size: 64, offset: 5248)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rgmii_n", scope: !120, file: !14, line: 153, baseType: !41, size: 64, offset: 5312)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_link", scope: !120, file: !14, line: 154, baseType: !41, size: 64, offset: 5376)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_duplex", scope: !120, file: !14, line: 155, baseType: !41, size: 64, offset: 5440)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pcs_speed", scope: !120, file: !14, line: 156, baseType: !41, size: 64, offset: 5504)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_status_fifo_full", scope: !120, file: !14, line: 158, baseType: !41, size: 64, offset: 5568)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_not_empty", scope: !120, file: !14, line: 159, baseType: !41, size: 64, offset: 5632)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mmtl_fifo_ctrl", scope: !120, file: !14, line: 160, baseType: !41, size: 64, offset: 5696)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_write", scope: !120, file: !14, line: 161, baseType: !41, size: 64, offset: 5760)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_wait", scope: !120, file: !14, line: 162, baseType: !41, size: 64, offset: 5824)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_read", scope: !120, file: !14, line: 163, baseType: !41, size: 64, offset: 5888)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_tx_fifo_read_ctrl_idle", scope: !120, file: !14, line: 164, baseType: !41, size: 64, offset: 5952)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_in_pause", scope: !120, file: !14, line: 165, baseType: !41, size: 64, offset: 6016)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_xfer", scope: !120, file: !14, line: 166, baseType: !41, size: 64, offset: 6080)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_idle", scope: !120, file: !14, line: 167, baseType: !41, size: 64, offset: 6144)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_wait", scope: !120, file: !14, line: 168, baseType: !41, size: 64, offset: 6208)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mac_tx_frame_ctrl_pause", scope: !120, file: !14, line: 169, baseType: !41, size: 64, offset: 6272)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_tx_proto_engine", scope: !120, file: !14, line: 170, baseType: !41, size: 64, offset: 6336)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_full", scope: !120, file: !14, line: 171, baseType: !41, size: 64, offset: 6400)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_above_thresh", scope: !120, file: !14, line: 172, baseType: !41, size: 64, offset: 6464)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_below_thresh", scope: !120, file: !14, line: 173, baseType: !41, size: 64, offset: 6528)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_fill_level_empty", scope: !120, file: !14, line: 174, baseType: !41, size: 64, offset: 6592)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_flush", scope: !120, file: !14, line: 175, baseType: !41, size: 64, offset: 6656)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_read_data", scope: !120, file: !14, line: 176, baseType: !41, size: 64, offset: 6720)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_status", scope: !120, file: !14, line: 177, baseType: !41, size: 64, offset: 6784)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_read_ctrl_idle", scope: !120, file: !14, line: 178, baseType: !41, size: 64, offset: 6848)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mtl_rx_fifo_ctrl_active", scope: !120, file: !14, line: 179, baseType: !41, size: 64, offset: 6912)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mac_rx_frame_ctrl_fifo", scope: !120, file: !14, line: 180, baseType: !41, size: 64, offset: 6976)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "mac_gmii_rx_proto_engine", scope: !120, file: !14, line: 181, baseType: !41, size: 64, offset: 7040)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_frames", scope: !120, file: !14, line: 183, baseType: !41, size: 64, offset: 7104)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tx_tso_nfrags", scope: !120, file: !14, line: 184, baseType: !41, size: 64, offset: 7168)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_len", scope: !78, file: !79, line: 62, baseType: !105, size: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "set_rx_owner", scope: !78, file: !79, line: 64, baseType: !109, size: 64, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_frame_len", scope: !78, file: !79, line: 66, baseType: !238, size: 64, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DISubroutineType(types: !240)
!240 = !{!33, !64, !33}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rx_status", scope: !78, file: !79, line: 68, baseType: !242, size: 64, offset: 832)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{!33, !118, !119, !64}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rx_extended_status", scope: !78, file: !79, line: 70, baseType: !246, size: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !118, !119, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_extended_desc", file: !66, line: 166, size: 256, elements: !251)
!251 = !{!252, !253, !254, !255, !256}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !250, file: !66, line: 167, baseType: !65, size: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "des4", scope: !250, file: !66, line: 168, baseType: !29, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "des5", scope: !250, file: !66, line: 169, baseType: !29, size: 32, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "des6", scope: !250, file: !66, line: 170, baseType: !29, size: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "des7", scope: !250, file: !66, line: 171, baseType: !29, size: 32, offset: 224)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "enable_tx_timestamp", scope: !78, file: !79, line: 73, baseType: !101, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "get_tx_timestamp_status", scope: !78, file: !79, line: 75, baseType: !105, size: 64, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "get_timestamp", scope: !78, file: !79, line: 77, baseType: !260, size: 64, offset: 1088)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !118, !34, !72}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_timestamp_status", scope: !78, file: !79, line: 79, baseType: !264, size: 64, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!33, !118, !118, !34}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "display_ring", scope: !78, file: !79, line: 81, baseType: !268, size: 64, offset: 1216)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !118, !7, !93}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set_mss", scope: !78, file: !79, line: 83, baseType: !272, size: 64, offset: 1280)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !64, !7}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "get_addr", scope: !78, file: !79, line: 85, baseType: !276, size: 64, offset: 1344)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !64, !279}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "set_addr", scope: !78, file: !79, line: 87, baseType: !281, size: 64, offset: 1408)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DISubroutineType(types: !283)
!283 = !{null, !64, !284}
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "dma_addr_t", file: !94, line: 143, baseType: !73)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "clear", scope: !78, file: !79, line: 89, baseType: !101, size: 64, offset: 1472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_hash", scope: !78, file: !79, line: 91, baseType: !287, size: 64, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DISubroutineType(types: !289)
!289 = !{!33, !64, !290, !291}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "get_rx_header_len", scope: !78, file: !79, line: 93, baseType: !276, size: 64, offset: 1600)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "set_sec_addr", scope: !78, file: !79, line: 94, baseType: !281, size: 64, offset: 1664)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "set_sarc", scope: !78, file: !79, line: 95, baseType: !295, size: 64, offset: 1728)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !64, !34}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "set_vlan_tag", scope: !78, file: !79, line: 96, baseType: !299, size: 64, offset: 1792)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !64, !302, !302, !34}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !35, line: 19, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !32, line: 24, baseType: !304)
!304 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "set_vlan", scope: !78, file: !79, line: 98, baseType: !295, size: 64, offset: 1856)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "set_tbs", scope: !78, file: !79, line: 99, baseType: !307, size: 64, offset: 1920)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !310, !34, !34}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dma_edesc", file: !66, line: 175, size: 256, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "des4", scope: !311, file: !66, line: 176, baseType: !29, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "des5", scope: !311, file: !66, line: 177, baseType: !29, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "des6", scope: !311, file: !66, line: 178, baseType: !29, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "des7", scope: !311, file: !66, line: 179, baseType: !29, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "basic", scope: !311, file: !66, line: 180, baseType: !65, size: 128, offset: 128)
!318 = !{i32 7, !"Dwarf Version", i32 4}
!319 = !{i32 2, !"Debug Info Version", i32 3}
!320 = !{i32 1, !"wchar_size", i32 2}
!321 = !{i32 1, !"Code Model", i32 2}
!322 = !{!"clang version 10.0.1 (https://github.com/llvm/llvm-project.git ef32c611aa214dea855364efd7ba451ec5ec3f74)"}
!323 = distinct !DISubprogram(name: "ndesc_init_rx_desc", scope: !3, file: !3, line: 125, type: !83, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !324)
!324 = !{}
!325 = !DILocalVariable(name: "p", arg: 1, scope: !323, file: !3, line: 125, type: !64)
!326 = !DILocation(line: 125, column: 49, scope: !323)
!327 = !DILocalVariable(name: "disable_rx_ic", arg: 2, scope: !323, file: !3, line: 125, type: !33)
!328 = !DILocation(line: 125, column: 56, scope: !323)
!329 = !DILocalVariable(name: "mode", arg: 3, scope: !323, file: !3, line: 125, type: !33)
!330 = !DILocation(line: 125, column: 75, scope: !323)
!331 = !DILocalVariable(name: "end", arg: 4, scope: !323, file: !3, line: 126, type: !33)
!332 = !DILocation(line: 126, column: 15, scope: !323)
!333 = !DILocalVariable(name: "bfsize", arg: 5, scope: !323, file: !3, line: 126, type: !33)
!334 = !DILocation(line: 126, column: 24, scope: !323)
!335 = !DILocalVariable(name: "bfsize1", scope: !323, file: !3, line: 128, type: !33)
!336 = !DILocation(line: 128, column: 6, scope: !323)
!337 = !DILocation(line: 130, column: 2, scope: !323)
!338 = !DILocation(line: 130, column: 5, scope: !323)
!339 = !DILocation(line: 130, column: 10, scope: !323)
!340 = !DILocalVariable(name: "__UNIQUE_ID___x324", scope: !341, file: !3, line: 132, type: !33)
!341 = distinct !DILexicalBlock(scope: !323, file: !3, line: 132, column: 12)
!342 = !DILocation(line: 132, column: 12, scope: !341)
!343 = !DILocalVariable(name: "__UNIQUE_ID___y325", scope: !341, file: !3, line: 132, type: !33)
!344 = !DILocation(line: 132, column: 10, scope: !323)
!345 = !DILocation(line: 133, column: 13, scope: !323)
!346 = !DILocation(line: 133, column: 2, scope: !323)
!347 = !DILocation(line: 133, column: 5, scope: !323)
!348 = !DILocation(line: 133, column: 10, scope: !323)
!349 = !DILocation(line: 135, column: 6, scope: !350)
!350 = distinct !DILexicalBlock(scope: !323, file: !3, line: 135, column: 6)
!351 = !DILocation(line: 135, column: 11, scope: !350)
!352 = !DILocation(line: 135, column: 6, scope: !323)
!353 = !DILocation(line: 136, column: 25, scope: !350)
!354 = !DILocation(line: 136, column: 28, scope: !350)
!355 = !DILocation(line: 136, column: 3, scope: !350)
!356 = !DILocation(line: 138, column: 24, scope: !350)
!357 = !DILocation(line: 138, column: 27, scope: !350)
!358 = !DILocation(line: 138, column: 32, scope: !350)
!359 = !DILocation(line: 138, column: 3, scope: !350)
!360 = !DILocation(line: 140, column: 6, scope: !361)
!361 = distinct !DILexicalBlock(scope: !323, file: !3, line: 140, column: 6)
!362 = !DILocation(line: 140, column: 6, scope: !323)
!363 = !DILocation(line: 141, column: 3, scope: !361)
!364 = !DILocation(line: 141, column: 6, scope: !361)
!365 = !DILocation(line: 141, column: 11, scope: !361)
!366 = !DILocation(line: 142, column: 1, scope: !323)
!367 = distinct !DISubprogram(name: "ndesc_init_tx_desc", scope: !3, file: !3, line: 144, type: !87, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !324)
!368 = !DILocalVariable(name: "p", arg: 1, scope: !367, file: !3, line: 144, type: !64)
!369 = !DILocation(line: 144, column: 49, scope: !367)
!370 = !DILocalVariable(name: "mode", arg: 2, scope: !367, file: !3, line: 144, type: !33)
!371 = !DILocation(line: 144, column: 56, scope: !367)
!372 = !DILocalVariable(name: "end", arg: 3, scope: !367, file: !3, line: 144, type: !33)
!373 = !DILocation(line: 144, column: 66, scope: !367)
!374 = !DILocation(line: 146, column: 2, scope: !367)
